[{"title":"Manga Furusato Mukashibanashi","synopsis":"Folktales from Japan. Each episode was composed of two stories. The focus of the anime was to showcase folktales from different prefectures. \n\nThe original airing only reached 18 episodes (36 stories) before stopping, the show was rebroadcast at a later date and the final 8 episodes (16 stories) were shown. The anime was family oriented and funded by the Seibu Department Store chain with a \"Seibu Family Gekijou\" subtitle on each ep, perhaps to mirror the highly successful \"Calpis Family Gekijou\" adoring the World Masterpiece Theater anime program. ","img":"https://cdn.myanimelist.net/images/anime/1770/98596.webp","source":"Other","numberOfEpisode":"26","studio":null,"type":"TV","score":null,"genres":["Adventure","Historical","Kids","Magic","Samurai","Fantasy"]},{"title":"Asience: Kami wa Onna no Inochi","synopsis":"A short revolving around the Japanese proverb: \"Hair is the heart of a woman\". Beautiful animation directed by Kazuto Nakazawa!","img":"https://cdn.myanimelist.net/images/anime/5/10308.webp","source":"-","numberOfEpisode":"1","studio":"Production I.G","type":"Special","score":6.27,"genres":["Historical","Samurai"]},{"title":"Ninja Batman x Poputepipikku Kindan no Collab CM","synopsis":"At Anime Japan 2018, Warner Bros. announced a collaboration between Ninja Batman and Poputepipikku. PVC figurines will be sold of the collaboration and a commercial was aired at the convention's booth, on television, and posted online--where Popuko and Pipimi dress as Batman and Joker respectively in order to promote the Ninja Batman's theatrical release. ","img":"https://cdn.myanimelist.net/images/anime/1948/91454.webp","source":"Other","numberOfEpisode":"1","studio":null,"type":"Special","score":6.1,"genres":["Parody","Samurai"]},{"title":"Gibiate","synopsis":"In 2030, Japan. A virus has infected humans throughout the world. Infected people turn into different forms of monsters based on their ages, sexes, and races. The virus is named \"Gibia\"—after being rich in variety like gibia.\n\nJust then, a pair of samurai and ninja appeared in such a blighted wasteland of Japan. They both traveled from the early Edo period, fighting together with help from a doctor who tries to find cure for Gibia. Facing ceaseless attacks from Gibias and outlaws that attack travelers for food, they start the dangerous journey with enemies all around.\n\n(Source: Official Website)","img":"https://cdn.myanimelist.net/images/anime/1359/101974.webp","source":"Original","numberOfEpisode":"?","studio":null,"type":"TV","score":null,"genres":["Action","Fantasy","Horror","Martial Arts","Samurai"]},{"title":"Sengoku☆Paradise Kiwami","synopsis":"Based on the online mobile phone otome game \"Sengoku☆Paradise\".\n\nThe first 3 minutes of the 10 minute spot for Sengoku☆Paradise Kiwami is the anime. The rest of the 7 minutes is of Sengoku☆Paradise Kiwami cast members Daisuke Namikawa and others (first time with Tetsuya Kakihara, second time with Rei Mochizuki) going on missions, plus an informative short.","img":"https://cdn.myanimelist.net/images/anime/11/39031.webp","source":"-","numberOfEpisode":"26","studio":"LMD","type":"TV","score":6.11,"genres":["Action","Comedy","Drama","Historical","Romance","Samurai","Shoujo"]},{"title":"Muramasa","synopsis":"\"A man with arms which can kill people like puppets is not aware that he himself has already become a puppet.\" In this short hand-drawn silent animation, a wandering samurai learns this lesson firsthand.\n\nAlong his travels, the samurai comes across a straw dummy at the base of a tree, with a sword lodged in its body. Upon drawing it out, the samurai learns that the blade is imbued with magic, and immensely powerful. The power comes at a price, though, and wielding the blade begins to slowly drive the warrior mad. He now has a choice to make: remain himself, or sacrifice his sanity for ultimate power?","img":"https://cdn.myanimelist.net/images/anime/2/66111.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":6.24,"genres":["Historical","Horror","Martial Arts","Samurai"]},{"title":"Sengoku Kitan Youtouden Movie","synopsis":"The year a comet races across the sky, splitting the heavens, from the depths of the Earth the dark god shall arise once again. Then, the dark evil lurking in the shadows shall come out of the depths of Hell and show itself in the present world. The emotions of the blade of the wind shall collect at the source of the blue light. And the three blades shall become one, vanquishing evil.\n\nThe year is 1580, and the unholy armies of Lord Nobunaga Oda steadily spread across Japan. Narrowly escaping the slaughter of her clan, a young ninja steals into the shadows. She is Ayame, the last of the Kasumi clan, and the dagger she wields is one of three, mystical blades. She is joined by Sakon and Ryoma, renegade ninja and the possessors of the sacred sword and spear. Now, these shadow warriors must unite their weapons and skills to fulfill `The Prophesy of the Enchanted Swords` or die trying..\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1/1378.webp","source":"-","numberOfEpisode":"1","studio":"J.C.Staff","type":"Movie","score":5.98,"genres":["Action","Martial Arts","Samurai"]},{"title":"Fuyu no Semi Special","synopsis":"Summary of the Fuyu no Semi OVA with revised animation and some extra scenes.","img":"https://cdn.myanimelist.net/images/anime/9/27755.webp","source":"Manga","numberOfEpisode":"1","studio":"Venet","type":"OVA","score":7.1,"genres":["Action","Military","Historical","Drama","Samurai","Yaoi"]},{"title":"Examurai Sengoku","synopsis":"The Examurai Sengoku anime production depicts the members of the EXILE group as futuristic samurai that are transported back in time to Japan’s sengoku (warring states) period. The anime character renditions of the EXILE members were designed by manga creator Hiroshi Takahashi (Crows, Worst). \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/13/33643.webp","source":"Other","numberOfEpisode":"24","studio":"TMS Entertainment","type":"TV","score":6.41,"genres":["Action","Sci-Fi","Martial Arts","Samurai"]},{"title":"Tono to Issho","synopsis":"Comedy parodying famous samurai generals and historical events.","img":"https://cdn.myanimelist.net/images/anime/5/18878.webp","source":"4-koma manga","numberOfEpisode":"1","studio":"Gathering","type":"OVA","score":6.61,"genres":["Comedy","Historical","Parody","Samurai","Seinen"]},{"title":"Gintama (Shinsaku)","synopsis":"New anime project of Gintama franchise.","img":"https://cdn.myanimelist.net/images/anime/1631/104925.webp","source":"Manga","numberOfEpisode":"?","studio":null,"type":"Movie","score":null,"genres":["Action","Sci-Fi","Comedy","Historical","Parody","Drama","Samurai","Shounen"]},{"title":"Masamune Datenicle","synopsis":"The coming-of-age battle story will center on the famous 17th-century Japanese warlord Date Masamune when he was young. The Date clan took its name from the Date region of the former Mutsu province, which comprises part of the modern-day city of Date.\n\nThe anime will be the first in the city's \"Kirari na Wonder Project\" (Twinkling Wonder Project), which aims to highlight tourist attractions and the appeal of the region.\n\nGainax's newly founded Fukushima studio will work on the anime, and will complete it at the end of March. The anime will have a private screening in April and will also screen in anime events and be posted online.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/83821.webp","source":"Original","numberOfEpisode":"6","studio":"Gaina","type":"ONA","score":6.04,"genres":["Action","Historical","Super Power","Samurai"]},{"title":"Tono to Issho: Ippunkan Gekijou","synopsis":"Comedy parodying famous samurai generals and historical events.","img":"https://cdn.myanimelist.net/images/anime/9/24947.webp","source":"4-koma manga","numberOfEpisode":"12","studio":"Gathering","type":"TV","score":6.25,"genres":["Comedy","Samurai","Seinen"]},{"title":"Samurai Spirits: Haten Gouma no Shou","synopsis":"One hundred years after their deaths, six legendary holy warriors are reborn to seek justice against the former comrade who betrayed them into the hands of an evil god! The six warriors search the feudal province of Edo questing for the last Saint Soldier, Haohmaru, and their sworn nemesis Shirou Amakusa. Will the followers of the divine light triumph over the forces of darkness, or is history destined to repeat itself? Before their hundred-year journey has ended, six samurai will prove that the only thing stronger than their holy blades is the steel of their wills!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/6/49963.webp","source":"Game","numberOfEpisode":"1","studio":null,"type":"Special","score":5.43,"genres":["Adventure","Historical","Samurai","Shounen"]},{"title":"Crayon Shin-chan Movie 10: Arashi wo Yobu Appare! Sengoku Daikassen","synopsis":"A full-scale historical drama set in the last days (the year 1574) of the Sengoku Era of feudal Japan. It is the story of the Nohara family, who has been transferred into the Sengoku Era by time warp, and a tragic love between a princess Ren Kasuga (a daughter of the feudal lord Kasuga at the Province of Musashi) and a samurai warrior Matabei Ijiri (a retainer of the Lord Kasuga).\n\n(Source: Manabu Tsuribe)","img":"https://cdn.myanimelist.net/images/anime/11/22026.webp","source":"Manga","numberOfEpisode":"1","studio":null,"type":"Movie","score":7.33,"genres":["Historical","Drama","Romance","Samurai","Seinen"]},{"title":"To Heart: Remember My Memories Specials","synopsis":"This is a special to To Heart: Remember My Memories, which includes fighting scenes between all the female characters.","img":"https://cdn.myanimelist.net/images/anime/1/686.webp","source":"-","numberOfEpisode":"7","studio":"AIC A.S.T.A.","type":"Special","score":6.15,"genres":["Parody","Martial Arts","Comedy","Super Power","Samurai","Sci-Fi"]},{"title":"Hijikata Toshizou: Shiro no Kiseki","synopsis":"A biographical sketch of the life and ideals of Hijikata Toshizou, Vice Commander of the Shinsengumi, fighting to uphold the Shogunate during the Meiji revolution. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/2252.webp","source":"-","numberOfEpisode":"1","studio":"Studio 4°C","type":"OVA","score":6.22,"genres":["Action","Historical","Drama","Samurai"]},{"title":"Tono to Issho: Gantai no Yabou","synopsis":"Comedy parodying famous samurai generals and historical events.","img":"https://cdn.myanimelist.net/images/anime/10/28398.webp","source":"4-koma manga","numberOfEpisode":"12","studio":"Gathering","type":"TV","score":6.49,"genres":["Comedy","Historical","Parody","Samurai","Seinen"]},{"title":"Hakuouki Shinkai: Kaze no Shou","synopsis":"A special bonus OVA that was bundled with the Limited Edition version of the Hakuouki Shinkai: Kaze no Shou video game. It's a collection of various moments from the beginning of the game animated by Idea Factory. ","img":"https://cdn.myanimelist.net/images/anime/2/77471.webp","source":"Game","numberOfEpisode":"1","studio":"Idea Factory","type":"OVA","score":6.39,"genres":["Action","Drama","Historical","Romance","Samurai","Supernatural"]},{"title":"Watashi no Coffee Samurai: Jihanki-teki na Kareshi","synopsis":"After falling in battle, the samurai Jin wishes to be reincarnated with an \"invincible metal body\"; thus he is reborn as a coffee vending machine in present-day Seoul. Each night, he continues his eternal battle with other samurai who have been reincarnated as otherwise mundane objects. But, one day, he meets Hemi, a girl who buys a drink from Jin's vending machine body. After many similar encounters, Jin realizes he has fallen in love with her. Will his love be able to reach Hemi?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/35497.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Special","score":6.07,"genres":["Action","Romance","Samurai","Sci-Fi"]},{"title":"Sengoku Choujuu Giga: Otsu","synopsis":"Second season of Sengoku Choujuu Giga.","img":"https://cdn.myanimelist.net/images/anime/7/83737.webp","source":"Original","numberOfEpisode":"13","studio":"ILCA","type":"TV","score":5.92,"genres":["Historical","Demons","Supernatural","Samurai"]},{"title":"Peace Maker Kurogane Movie 2: Yuumei","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1274/99215.webp","source":"Manga","numberOfEpisode":"1","studio":"White Fox","type":"Movie","score":6.6,"genres":["Action","Comedy","Historical","Samurai","Shounen"]},{"title":"Yoroiden Samurai Troopers Gaiden","synopsis":"Although Talpa has been defeated, the Warriors don't get much of a break. As they celebrate Ryo's birthday party, the news tells them of a strange killer in samurai armor wreaking havoc in New York. And the armor looks very familiar. Now, they will have to battle the ancient sorcerer Shikaisen for Sage's life!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1484/92210.webp","source":"-","numberOfEpisode":"2","studio":"Sunrise","type":"OVA","score":6.64,"genres":["Adventure","Fantasy","Samurai","Shounen"]},{"title":"Peace Maker Kurogane Special","synopsis":"Peace Maker Kurogane special.","img":"https://cdn.myanimelist.net/images/anime/7/26485.webp","source":"Manga","numberOfEpisode":"1","studio":"Gonzo","type":"Special","score":6.68,"genres":["Action","Comedy","Samurai","Historical","Drama","Shounen"]},{"title":"Yoroiden Samurai Troopers Kikoutei Densetsu","synopsis":"A strange, silent warrior appears. When the Inferno armor is summoned to battle him, the mysterious warrior calls forth his own armor—a black copy of the Inferno armor! Now, the warriors will find themselves half a world away fighting once more to save humanity, but this time, from their own armor!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1504/92211.webp","source":"-","numberOfEpisode":"4","studio":"Sunrise","type":"OVA","score":6.59,"genres":["Adventure","Samurai","Fantasy","Shounen"]},{"title":"Kaitouranma The Animation","synopsis":"Shinjuro may be a little young to be the master of a swordsmanship school, but fate didn't give him a choice. Now his position and martial arts skill land him in the middle of serious trouble when the rogue samurai Mikage faces off against the Tokugawa government, and Shinjuro and the small group of swordsmen who train at the school must now protect the town from harm. However, the group won't be challenged until the Tokugawa house calls in a favor, and the young swordsman is forced to duel Mikage himself. \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/5/61785.webp","source":"-","numberOfEpisode":"2","studio":null,"type":"OVA","score":6.03,"genres":["Action","Adventure","Martial Arts","Samurai"]},{"title":"The Hakkenden: Shin Shou","synopsis":"Second part of The Hakkenden.","img":"https://cdn.myanimelist.net/images/anime/1592/92509.webp","source":"Novel","numberOfEpisode":"7","studio":"AIC","type":"OVA","score":6.53,"genres":["Action","Adventure","Historical","Demons","Martial Arts","Samurai","Shounen"]},{"title":"Samurai Spirits 2: Asura Zanmaden","synopsis":"One hundred years after their deaths at the hands of a former colleage, six legendary holy warriors are reborn to seek justice against the teammate who betrayed them into the hands of an evil god. Based upon one of the most popular video games of all time, Samurai Shodown is a sprawling feature-length saga of reincarnation and revenge, featuring some of the most spectacular battle sequences ever animated! Join Charlotte, Wan Fu, Nakoruru, Galford and Tamtam as they search the feudal province of Edo questing for their lost comrade, Haohmaru, and their sworn nemesis Shirou Amakusa. Will the followers of the divine light triumph over the forces of the dark, or is the course of history destined to repeat itself? Before their hundred-year journey has ended, six samurai will prove that the only thing stronger than their holy blades is the steel of their wills! \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/2/2959.webp","source":"Game","numberOfEpisode":"2","studio":"Ajia-Do","type":"OVA","score":6.21,"genres":["Action","Fantasy","Martial Arts","Samurai","Super Power"]},{"title":"Yoroiden Samurai Troopers Message","synopsis":"A 300-year-old book is discovered which chronicles the adventures of the legendary Samurai Troopers… centuries before they happen! But what does this mean? Are the Troopers merely puppets in some cosmic play, acting out parts? \n\nWho is this mysterious Suzunagi, a mysterious girl who entices each of the warriors with their hearts’ desire - salvation, new armors, freedom from a life of fighting. Why is she so interested in the troopers and their armors?\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1754/94191.webp","source":"-","numberOfEpisode":"5","studio":"Sunrise","type":"OVA","score":6.02,"genres":["Adventure","Fantasy","Samurai","Shounen"]},{"title":"Neko Neko Nihonshi","synopsis":"The story imagines if Japanese historical figures such as Queen Himiko, the warlord Oda Nobunaga, and samurai Sakamoto Ryouma were cats.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/89585.webp","source":"Web manga","numberOfEpisode":"32","studio":"Joker Films","type":"TV","score":6.26,"genres":["Historical","Parody","Kids","Samurai"]},{"title":"Hidamari no Ki","synopsis":"A story set in the mid-1800's about a young doctor who has been trained in Western-style medicine and a young samurai who is trying to live up to the old traditions of his class and culture. The story is actually based upon real people - the doctor, Ryo-an, was Tezuka's great grandfather.\n\nDuring the Second Year of Ansei (1855) in Edo's Koishigawa are two young men, Manjiro Ibutani and Ryoan Tezuka. Ibutani is a low-ranking samurai who is a gifted swordsman and has a straightforward and strong sense of justice. Tezuka has a more carefree attitude. He has an eye for the ladies, but he is passionate about becoming a doctor. The two opposite characters come of age during the backdrop of the turbulent end of the Tokugawa Period (1600-1868 CE).\n\n(Source: AnimeNfo) ","img":"https://cdn.myanimelist.net/images/anime/7/3633.webp","source":"Manga","numberOfEpisode":"25","studio":"Madhouse","type":"TV","score":6.76,"genres":["Historical","Drama","Samurai"]},{"title":"Shinshaku Sengoku Eiyuu Densetsu: Sanada Juu Yuushi The Animation","synopsis":"In the Fifth Year of the Keicho era, the Tokugawa clan sought to solidify their control of Japan. Hidetada Tokugawa has come to the doorsteps of Ueda Castle with the intentions of having the Sanada clan open its doors to him. But the Sanada and their retainers have other plans...\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/78564.webp","source":"-","numberOfEpisode":"12","studio":"G&amp;G Entertainment","type":"TV","score":6.16,"genres":["Action","Comedy","Historical","Military","Samurai"]},{"title":"Sabu to Ichi Torimono Hikae","synopsis":"The series follows the adventures of Sabu, a young Edo bakufu investigator traveling with the blind master swordsman Ichi. In their travels, they assist the common people in solving mysteries and righting wrongs (usually committed by bandits or corrupt officials). Sabu is engaged to Midori, the daughter of his boss, who works as a police officer for the Tokugawa shogunate.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/9/84054.webp","source":"Manga","numberOfEpisode":"52","studio":"Toei Animation","type":"TV","score":6.3,"genres":["Action","Slice of Life","Adventure","Police","Martial Arts","Samurai","Historical","Drama","Shounen"]},{"title":"Sengoku Musou: Sengoku Musou High School","synopsis":"Unaired Sengoku Musou High School segments bundled with the third through sixth Blu-ray volumes of Sengoku Musou.","img":"https://cdn.myanimelist.net/images/anime/6/72789.webp","source":"Game","numberOfEpisode":"8","studio":"TYO Animations","type":"Special","score":6.19,"genres":["Comedy","Samurai","School"]},{"title":"Ninpuu Kamui Gaiden","synopsis":"Kamui is a ninja from the Edo period who has decided to leave his clan. After doing so he is pursued relentlessly by the members of his former clan; who consider him to be a traitor and therefore wish to kill him. Kamui then wanders around Japan to escape from them by using his intelligence and great abilities to survive. In the course of the series Kamui begins to suffer from paranoia because of his status as a persecuted man. Kamui then started to believe that everybody wished to murder him and became distrusting of everyone he came across.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/3/22957.webp","source":"Manga","numberOfEpisode":"26","studio":"Tele-Cartoon Japan","type":"TV","score":6.6,"genres":["Action","Adventure","Historical","Martial Arts","Samurai"]},{"title":"Hakuouki: Otogisoushi Special","synopsis":"A Hakuouki: Otogisoushi special episode that aired between episode 11 and episode 12, it was not included in the normal episode count of the main show. It had a TV and web release on the same day and is included on the DVD and BD release.","img":"https://cdn.myanimelist.net/images/anime/2/84387.webp","source":"Visual novel","numberOfEpisode":"1","studio":"DLE","type":"Special","score":6.22,"genres":["Historical","Samurai","Fantasy","Josei"]},{"title":"Haguregumo","synopsis":"Haguregumo is set in the Bakumatsu, the turbulent period at the end of the Tokugawa Shogunate, after the \"opening\" of Japan in 1854. The country was being torn apart by competing factions - modernizers trying to apply Western technology and ideas to Japanese society; Imperial loyalists, trying to reassert to the ascendancy of the Emperor; and the forces of the Shogunate, trying to defend the military bureaucracy (bakufu) against all comers. The bakufu organized special police squads, notably the Shinsengumi and the Mimawarigumi, to \"defend public order\" and assassinate opponents. (In popular culture, they are all lumped together as the Shinsengumi.) Covert violence and even open warfare were commonplace.\n\nThe movie covers 1866 and 1867. It tells the story of a retired samurai, Kumosuke (or Kumo, for short), who is living quietly, not to say idly, in Edo (old Tokyo) with his wife and two children, a young boy named Shinnosuke and an infant girl, Ohana. While he nominally runs a courier business to earn a living, he seems to spend most of his time smoking his pipe, drinking sake, and chasing women. The arrival of a Shinsengumi squad led by a young swordswman, Ichimonji Hyougo, disrupts this peaceful routine. Kumo is forced to use his still-sharp sword skills to defend himself, but he'd basically prefer to stay out of the treacherous political currents. Nonetheless, he ends up saving Ryouma Sakamoto (a famous Westernizer) from the Shinsengumi and teaching Ichimonji the futility of the warrior way.\n\n(Source: Soldado-Subs and Saizen)","img":"https://cdn.myanimelist.net/images/anime/1827/94766.webp","source":"Manga","numberOfEpisode":"1","studio":"Madhouse","type":"Movie","score":6.11,"genres":["Comedy","Historical","Samurai","Seinen"]},{"title":"Kaumori","synopsis":"Once upon a time, the birds and the beasts fought each other in a war. It was a terrible conflict, and the clever bats would side with the birds when the birds were looking victorious, and then they would become allies of the beasts when that side was winning battles. At last the war came to an end, the two parties reached an amicable settlement, and a great party of friendship was held. But when it came to the turn of the bats to perform in the program, their fence-straddling tactics were exposed, and everyone refused to associate with them. Since that time, the bats have been too ashamed to show their faces during the day, coming out only at night to flit silently around.","img":"https://cdn.myanimelist.net/images/anime/5/11634.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.54,"genres":["Drama","Samurai"]},{"title":"Last Orders","synopsis":"The 60-second film features six fierce samurai who rush through a post-futuristic megalopolis using the most unpredictable means of transport (including a kite!) as to make it on time for the last order at their favorite pub.\n\n(Source: Production I.G)","img":"https://cdn.myanimelist.net/images/anime/9/60623.webp","source":"Original","numberOfEpisode":"1","studio":"Production I.G","type":"Special","score":5.78,"genres":["Action","Samurai","Sci-Fi"]},{"title":"Keroro Gunsou: Mushakero Ohirome Sengoku Ranstar Dai Battle","synopsis":"This was the 14-minute movie that was screened in theaters with Keroro Gunsou Movie 3. It became the prequel to the Mushakero in season 5 of the main Keroro Gunsou anime series. It takes place in Ranstar where the Keroro platoon are up against the Vipers. The whole setting of Ranstar is based on the Sengoku Era of Japan, and all characters are dressed in that fashion.","img":"https://cdn.myanimelist.net/images/anime/8/31327.webp","source":"-","numberOfEpisode":"1","studio":"Sunrise","type":"Special","score":6.68,"genres":["Action","Comedy","Mecha","Parody","Samurai","Shounen"]},{"title":"Umi no Momotarou","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/9/85234.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":4.79,"genres":["Samurai"]},{"title":"Samurai Noodles: The Originator","synopsis":"A commercial for Nissin brand ramen noodles. It tells the story of how instant ramen first came to be, as told through rap verse.","img":"https://cdn.myanimelist.net/images/anime/3/81123.webp","source":"Original","numberOfEpisode":"1","studio":"HOTZIPANG","type":"ONA","score":6.27,"genres":["Historical","Samurai"]},{"title":"Shin Onimusha: Dawn of Dreams the Story","synopsis":"Set fifteen years after the fall of Oda Nobunaga. After the fall of this evil warlord, in the late sixteenth century, it appears as though evil times are ahead as his successor, Hideyoshi Toyotomi, has decided to call upon the Genma forces and once again place Japan under their demonic shadow. A strong warrior Soki who possesses the dark power of the Oni. Having learned about Hideyoshi's insidious scheme, he sets out on a journey to burn the Genma trees and defeat the Genma running rampant across the land.\n\nShin Onimusha: Dawn of Dreams the Story is a compilation of cut-scenes from the game by the same title. It has been released on DVD separately from the game.","img":"https://cdn.myanimelist.net/images/anime/9/5816.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"OVA","score":6,"genres":["Action","Historical","Demons","Martial Arts","Samurai"]},{"title":"Crayon Shin-chan Gaiden: Kazokuzure Ookami","synopsis":"Master butt-swordsman Hiroshinosuke Nohara (Lone Wolf) travels with his family seeking employment. The family encounters a mysterious girl Hazumi and a wild dog Shiro, and decides to travel together. The group is attacked by various assassins, eventually their lives are threatened by the butt-swordsmen's enemy, the armpit-swordsmen of the Demon Bull Clan. Who will win: butts or armpits? Against an array of idiosyncratic enemies, Hiroshinosuke Nohara and his son Shinnosuke have the chance to display their swashbuckling skills.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/84069.webp","source":"Manga","numberOfEpisode":"13","studio":null,"type":"ONA","score":6.59,"genres":["Action","Comedy","Ecchi","Samurai","Seinen"]},{"title":"Kinnikuman II Sei: Muscle Ninjin Soudatsu sen! Choujin Daisensou","synopsis":"In order to save a princess, Mantarou (Kid Muscle) and the gang must find a special ginseng. They are later joined by Kevin Mask. \n\n(Source: Wikipedia) ","img":"https://cdn.myanimelist.net/images/anime/1994/97587.webp","source":"-","numberOfEpisode":"1","studio":"Toei Animation","type":"Movie","score":6.64,"genres":["Action","Comedy","Drama","Romance","Martial Arts","Samurai"]},{"title":"Maabou no Kinoshita Toukichirou","synopsis":"A boy works hard to please his lord and gain advancement.  Short film from 1938.","img":"https://cdn.myanimelist.net/images/anime/2/15845.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.12,"genres":["Samurai"]},{"title":"Sound &amp; Fury","synopsis":"In this anime visual album, a mysterious driver heads deep into a post-apocalyptic hellscape toward a ferocious showdown with two monstrous opponents. Various studios participated in creating 10 'episodes' for the visual album. Ranging from 3D animation, to 2D animation, to live-action.\n\n(Source: Netflix)","img":"https://cdn.myanimelist.net/images/anime/1823/103360.webp","source":"Music","numberOfEpisode":"1","studio":null,"type":"Music","score":6.05,"genres":["Sci-Fi","Music","Samurai"]},{"title":"Issunboushi: Chibisuke Monogatari","synopsis":"Dreaming of rising up in the world, Chibisuke the little bonze travels to the city, where he becomes a retainer to a Cabinet minister, who takes a liking to Chibisuke who dances for him in his palm. One day, Chibisuke is accompanying a princess to Shimizu when a mountain devil attacks her. Chibisuke makes numerous surprise attacks on the devil before finally overcoming him, and using a horn of plenty left behind by the devil, he ends up a strapping young man.\n\n(Source: Digital Meme)","img":"https://cdn.myanimelist.net/images/anime/6/15840.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.12,"genres":["Action","Samurai"]},{"title":"Fusha no Sha","synopsis":"Ji Chang is an excellent archer that strives to be the best in the world. He looks for a certain man that is capable of shooting a leaf from a distance. He decides to make this man his master. He visits his master occasionally over the years for training. He eventually masters the techniques of the bow and decides to head out for the mountains in search of an old man with supernatural abilities. ","img":"https://cdn.myanimelist.net/images/anime/11/17915.webp","source":"Other","numberOfEpisode":"1","studio":null,"type":"Movie","score":6.5,"genres":["Adventure","Martial Arts","Samurai","Supernatural","Historical"]},{"title":"Hinomaru Hatanosuke: Inazuma-gumi Tobatsu no Maki","synopsis":"Short film where the hero Hatanosuke battles with an evil gang of thieves.","img":"https://cdn.myanimelist.net/images/anime/5/15833.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":4.76,"genres":["Action","Historical","Samurai"]},{"title":"Kyomu Senshi Miroku","synopsis":"A psychic ninja fantasy suggesting that the assassins did not die out during the Sengoku era but burrowed under Japan, where they fought a new war against the alien occupants of a crashed spaceship that has lain undisturbed for several millennia. \n\n(Source: The Anime Encyclopedia)","img":"https://cdn.myanimelist.net/images/anime/9/71239.webp","source":"Manga","numberOfEpisode":"6","studio":null,"type":"OVA","score":5.94,"genres":["Action","Sci-Fi","Historical","Demons","Supernatural","Samurai","Fantasy"]},{"title":"Hinomaru Tarou: Musha Shugyou no Maki","synopsis":"The hero Taro attempts to rescue a kidnapped girl from a bandit.  Short film from 1936.","img":"https://cdn.myanimelist.net/images/anime/5/15843.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":4.88,"genres":["Action","Samurai"]},{"title":"Tono to Issho 1.5","synopsis":"Tono to Issho OVA.","img":"https://cdn.myanimelist.net/images/anime/10/27152.webp","source":"4-koma manga","numberOfEpisode":"1","studio":"Gathering","type":"OVA","score":5.99,"genres":["Comedy","Historical","Parody","Samurai","Seinen"]},{"title":"Shounen Ninja Kaze no Fujimaru","synopsis":"Kidnapped and rescued by a Ninja, Fujimaru has mastered martial arts over the years. Now he sets off on a journey to find his mother and also locate an old tome containing secret martial arts techniques.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/13/56385.webp","source":"-","numberOfEpisode":"65","studio":"Toei Animation","type":"TV","score":null,"genres":["Action","Adventure","Samurai","Shounen"]},{"title":"Namakura Gatana: Kunoichi-hen","synopsis":"Namakura Gatana's 100th anniversary has now been honored with a \"Kunoichi Chapter\" sequel from noted anime shorts director Akitarou Daichi.\n\nLike a lot of his personal pieces, it's a bit crude...\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/1788/93248.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"ONA","score":5.12,"genres":["Ecchi","Samurai"]},{"title":"Shinshuu Sudama-hen","synopsis":"Based on a novel by Tani Kousei.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/3/49703.webp","source":"-","numberOfEpisode":"4","studio":null,"type":"OVA","score":null,"genres":["Action","Martial Arts","Samurai","Historical","Seinen"]},{"title":"Nakanaori","synopsis":"Short animation by Rapparu.","img":"https://cdn.myanimelist.net/images/anime/7/77497.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"ONA","score":4.91,"genres":["Action","Samurai"]},{"title":"Samuraider: Nazo no Tenkousei","synopsis":"In a combination of samurai movies and Bomber Bikers of Shonan, Tokyo street punk Masao buys a treasured FZR \"katana\" motorcycle and becomes a knight of the road, attacking criminals with a genuine katana sword.\n\nBased on the manga by Shinichi Sugimura published in Young Magazine.","img":"https://cdn.myanimelist.net/images/anime/12/27645.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"OVA","score":null,"genres":["Action","Drama","Samurai"]},{"title":"Zhong Hua Xiao Zi","synopsis":"Set in the Henan Province of China during the 17th century, three teenagers are sent to a Shaolin Temple to learn the style of Kung Fu against a ruthless Demon, not seen since the Sui Dynasty, who terrorizes the province in order to search for two magic books to create more power and being stronger in world domination.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/6/68273.webp","source":"-","numberOfEpisode":"26","studio":null,"type":"TV","score":null,"genres":["Action","Historical","Demons","Supernatural","Martial Arts","Samurai"]},{"title":"Fruity Samurai","synopsis":"Short anime about fruity samurai.","img":"https://cdn.myanimelist.net/images/anime/5/72213.webp","source":"-","numberOfEpisode":"13","studio":null,"type":"TV","score":null,"genres":["Action","Comedy","Samurai","Historical"]},{"title":"Kitakaze Kozou no Kantarou","synopsis":"This music video had an original 1974 version and a 1981 version. Both versions used the exact same animated footage, the only difference were the singers. The original 1974 version was sung by Maasaki Sakai and the NHK Tokyo Children's Choir. The 1981 version was sung by Saburou Kitajima and the Hibari Children Chorus.","img":"https://cdn.myanimelist.net/images/anime/5/23902.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Music","score":5.34,"genres":["Music","Kids","Samurai"]},{"title":"Gun-dou Musashi Recap","synopsis":"Recap of episodes 1-9.","img":"https://cdn.myanimelist.net/images/anime/3/28267.webp","source":"Original","numberOfEpisode":"1","studio":"ACC Production","type":"Special","score":null,"genres":["Adventure","Samurai","Fantasy"]},{"title":"Neko Neko Nihonshi 2nd Season","synopsis":"Second season of Neko Neko Nihonshi.","img":"https://cdn.myanimelist.net/images/anime/10/89586.webp","source":"Web manga","numberOfEpisode":"32","studio":"Joker Films","type":"TV","score":null,"genres":["Historical","Parody","Kids","Samurai"]},{"title":"Go! Samurai","synopsis":"Animated short by Keiichiro Kimura about a single samurai that fights for his life against 100 of his vicious enemies.","img":"https://cdn.myanimelist.net/images/anime/11/76308.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"ONA","score":5.89,"genres":["Action","Samurai"]},{"title":"Onikiri Musume Saisen","synopsis":"A girl and demon battle out on a field as they have their pride on the line.","img":"https://cdn.myanimelist.net/images/anime/1663/91255.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"ONA","score":6.31,"genres":["Action","Samurai"]},{"title":"Indie Anibox: Selma Danbaekjil Coffee","synopsis":"The 2008 animated omnibus Indie Anibox: Selma's Protein Coffee consists of three inventive short films from up-and-coming directors. Kim Woon Ki's kooky mystery thriller \"Wanted\" is set in a peaceful village suddenly disrupted by heavy rainfall and the appearance of a strange old woman named Selma. Yeon Sang Ho's 3-D animation \"Love is Protein\" is an inventive black comedy about three poor roommates who break their piggy banks to order fried chicken - only to discover their prospective meal is the son of a weeping chicken. Jang Hyung Yoon's surreal \"A Coffee Vending Machine and Its Sword\" follows a swordsman who reincarnates as a coffee vending machine and falls in love at first sight with the maintenance girl.\n\n(Source: YesAsia)","img":"https://cdn.myanimelist.net/images/anime/5/68279.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"Movie","score":null,"genres":["Comedy","Drama","Romance","Samurai","Sci-Fi"]},{"title":"Tenka Touitsu Koi no Ran: Shutsujin! Saika 4-nin Shuu","synopsis":"15th Century Japan is ravaged by constant wars, as the lords of the realm seek to rule the land. Having lost your father in battle, you are working in the restaurant he left your mother and little brother...when an evil magistrate sends your little brother away...to become a poison taster! To save his life, you disguise yourself as a boy and go to the castle in his place...but what awaits you there is so much more!\n\n\"I'll show you all...my divine rule!\"\n\nIn the Sengoku era...love is the most dangerous battle of all! \n\n(Source: Voltage)","img":"https://cdn.myanimelist.net/images/anime/1740/90472.webp","source":"Game","numberOfEpisode":"4","studio":"UWAN Pictures","type":"ONA","score":null,"genres":["Historical","Drama","Romance","Samurai"]},{"title":"Ninpen Manmaru","synopsis":"Manmaru goes to ninja school at Nenga, where foxes and raccoons study the art of assassination under a bear ninja master. He is soon thrown in to local rivalry between the Nenga school, the Koga (monkeys), and the Iga (dogs), as well as facing temptations from the Dobe, a group of dropouts from the Nenga.\n\n(Source: The Anime Encyclopedia)","img":"https://cdn.myanimelist.net/images/anime/4/66675.webp","source":"Manga","numberOfEpisode":"30","studio":"Shin-Ei Animation","type":"TV","score":null,"genres":["Comedy","Samurai","Shounen"]},{"title":"Samuroid Zero","synopsis":"This is a pilot movie for a Polygon Picutres Inc. original project, a full CG SF action samurai drama movie originally announced at the 2005 Tokyo International Anime Fair. The project was scrapped and only the pilot remains. ","img":"https://cdn.myanimelist.net/images/anime/1633/90869.webp","source":"Original","numberOfEpisode":"1","studio":"Polygon Pictures","type":"Special","score":5.17,"genres":["Action","Samurai"]},{"title":"Ninpuu Kamui Gaiden: Tsukihigai no Maki","synopsis":"A theatrical edited release of episode 21-26.","img":"https://cdn.myanimelist.net/images/anime/10/74504.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"Movie","score":null,"genres":["Action","Adventure","Historical","Martial Arts","Samurai"]},{"title":"Neko Neko Nihonshi 3rd Season","synopsis":"Third season of Neko Neko Nihonshi.","img":"https://cdn.myanimelist.net/images/anime/1689/90730.webp","source":"Web manga","numberOfEpisode":"32","studio":"Joker Films","type":"TV","score":null,"genres":["Historical","Parody","Kids","Samurai"]},{"title":"Shounen Ninja Kaze no Fujimaru: Nazo no Arabiya Ningyou","synopsis":"Kidnapped and rescued by a Ninja, Fujimaru has mastered martial arts over the years. Now he sets off on a journey to find his mother and also locate an old tome containing secret martial arts techniques.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/6/53291.webp","source":"-","numberOfEpisode":"1","studio":"Toei Animation","type":"Movie","score":null,"genres":["Action","Adventure","Samurai","Shounen"]},{"title":"Examurai Sengoku Recap","synopsis":"A recap episode that starts out with the main character reminiscing of the story thus far over various card and board games.","img":"https://cdn.myanimelist.net/images/anime/9/66141.webp","source":"-","numberOfEpisode":"1","studio":"TMS Entertainment","type":"Special","score":null,"genres":["Action","Samurai"]},{"title":"Kagee Mukashibanashi","synopsis":"The 1st arc of the Chiyotarou Kodomo Gekijou program that aired on TBS. Every episode is a different Japanese fairy tale told with shadow puppet animation. ","img":"https://cdn.myanimelist.net/images/anime/3/70973.webp","source":"-","numberOfEpisode":"65","studio":null,"type":"TV","score":null,"genres":["Adventure","Demons","Drama","Fantasy","Historical","Kids","Magic","Romance","Samurai","Supernatural"]},{"title":"Futari Zamurai Homare no Kawakiri","synopsis":"Independent animation by Yanagihara Ryouhei, member of the Animation Sannin no Kai pioneer group of independent animation.","img":"https://cdn.myanimelist.net/images/anime/6/71307.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":null,"genres":["Samurai","Historical","Drama"]},{"title":"Kangetsu Ittou: Akuryou Kiri","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/6/66757.webp","source":"-","numberOfEpisode":"2","studio":null,"type":"OVA","score":null,"genres":["Action","Martial Arts","Samurai"]},{"title":"Kushimitama Samurai","synopsis":"The blind samurai Haku can perceive that which cannot be seen by the eye. But he does not try to see the world that the eye can see. 'This world is the full of darkness' Attacked by thief in the dead of night, he lost both his parents and his sight. From that day on his faith in the world was gone. \n\n(Source: IMDb)","img":"https://cdn.myanimelist.net/images/anime/9/80122.webp","source":"-","numberOfEpisode":"1","studio":"Asahi Production","type":"Special","score":null,"genres":["Action","Adventure","Drama","Historical","Samurai"]},{"title":"Ikedaya Soudou","synopsis":"Independent film by Yanagihara Ryouhei, member of the Animation Sannin no Kai pioneer group of independent animation. It tells the story of the Ikedaya raid by the Shinsengumi from the point of view of the neighbors of the Ikedaya.","img":"https://cdn.myanimelist.net/images/anime/7/71305.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":null,"genres":["Samurai","Historical","Drama"]},{"title":"Ao no Doumon","synopsis":"Legend has it that before the tunnel (Ao no Doumon) was built, people had to climb over the cliffs through which the tunnel is built to reach an important local shrine. The path was very dangerous and people regularly fell to their deaths. During the Edo period, a Buddhist monk named Zenkai, who had committed a murder in his earlier life, decided to build a safe passage for worshipers in order to atone for his crime. Beginning at the age of 49, he dedicated 30 years of his life to digging the 185 metre tunnel by hand, using only a hammer and chisel.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/7/66223.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"OVA","score":null,"genres":["Kids","Samurai","Historical","Drama"]},{"title":"Samurai (2011)","synopsis":"A music video for the Sakamoto Kyouju (サカモト教授) song \"Samurai\". ","img":"https://cdn.myanimelist.net/images/anime/2/78755.webp","source":"Music","numberOfEpisode":"1","studio":null,"type":"Music","score":null,"genres":["Music","Samurai"]},{"title":"Sabiiro no Armor","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1733/101309.webp","source":"Other","numberOfEpisode":"?","studio":null,"type":"","score":null,"genres":["Action","Historical","Samurai"]},{"title":"DJ Nobunaga","synopsis":"A promotional short for DJ Nobunaga's YYY event held on August 25th. The music event will feature 4 DJs (Nakata Yasutaka, Kz (livetune +), Tofubeats, and Banvox) and starts at 11pm. The anime short has the four DJs rap about Oda Nobunaga, the historical character, as a tongue-in-cheek nod to DJ Nobunaga presenting this event.","img":"https://cdn.myanimelist.net/images/anime/3/87299.webp","source":"Original","numberOfEpisode":"6","studio":null,"type":"ONA","score":null,"genres":["Music","Historical","Samurai"]},{"title":"Onikiri Shoujo","synopsis":"A rough earlier rendition of Onikiri Musume Saisen.\n","img":"https://cdn.myanimelist.net/images/anime/1909/91251.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"ONA","score":null,"genres":["Action","Samurai"]},{"title":"Taka no Tsume-dan Yoshida Presents \"Sengoku Taiga\" no Susume","synopsis":"A collaboration between Eagle Talon and the mobile game Sengoku Taiga. Yoshida is playing the game and suddenly becomes Yukimura while the Chancellor becomes Ieyasu. Yoshida explains the game mechanics and Chancellor is ecstatic that Yoshida's advice for battle tactics help him defeat Deluxe Fighter's character in the game. Yoshida continues to talk about a special event running from April 24, 2019 - May 8, 2019.","img":"https://cdn.myanimelist.net/images/anime/1927/100771.webp","source":"Other","numberOfEpisode":"1","studio":null,"type":"ONA","score":null,"genres":["Comedy","Game","Parody","Samurai"]},{"title":"Nihon no Otogibanashi","synopsis":"Various classic Japanese fairy tales told for child aged audiences.","img":"https://cdn.myanimelist.net/images/anime/11/79601.webp","source":"Other","numberOfEpisode":"29","studio":null,"type":"OVA","score":null,"genres":["Demons","Fantasy","Historical","Kids","Magic","Samurai","Supernatural"]},{"title":"Jidou Bungaku Library","synopsis":"A series of children's OVAs covering various stories from old folk tales, books, and historical events. Each OVA has a various amount of stories featured.","img":"https://cdn.myanimelist.net/images/anime/10/74512.webp","source":"-","numberOfEpisode":"6","studio":null,"type":"OVA","score":null,"genres":["Demons","Drama","Fantasy","Historical","Kids","Magic","Romance","Samurai","Supernatural"]},{"title":"Watashitachi no Kurashi to Doboku","synopsis":"The 3-part series commissioned by Japan Construction Training Center for educational purposes (to elementary schools originally) shows how civil engineering has developed Japan into the country it is now.\n\n \nPart 1: Takes place in the Nara period and covers Chinese Buddhist monks which came to Japan and taught the people Buddhism and how to construct and fix bridges and pods to improve the lives of farmers suffering from drought and taxes in what is currently the Hyoujo Prefecture.\n\nPart 2: Takes place in the Sengoku period and covers Takeda Shingen and how the Kai Province was always plagued by the violent river rains dues to the mountain region surrounding them to them causing the Kofu Basin to flood. He funneled man-power into developing a system of flood control using stone embankments and planting tree lines. The civil engineering project is also the foundation for the Roushigumi which later became the Shinsengumi in the Edo period.\n\nPart 3: Takes place in the Edo period and covers the Meiji government wantin to catch up with the rest of the world's technology and hired many foreigners to implement the success of the Western world's industrial revolution. \"Contract foreigners\" (oyatoi gaikokujin) brought knowledge of: lighthouses, railways, ports, water supplies, improved flood control, and education. The railways specifically were handled by the British railway engineer Edmund Morel who was a mere 28 year old. The project was completed in 2 years connecting Tokyo to Yokohama in 1872 as Japan's first railroad and first two railroad stations. \n\nUnfortunately Morel had tuberculosis and died in right before the projected completed but he advised many Japanese scholars and engineers on railway production in his own home til his dead which lead to the boom of ever-so-famous-and-successful Japanese railway system. \n","img":"https://cdn.myanimelist.net/images/anime/11/58385.webp","source":"Original","numberOfEpisode":"3","studio":null,"type":"OVA","score":null,"genres":["Historical","Kids","Samurai"]},{"title":"Taka no Tsume x Megane Super","synopsis":"A collaboration anime between Taka no Tsume and Megane Super, an eyeglasses company in Japan.","img":"https://cdn.myanimelist.net/images/anime/11/81662.webp","source":"Original","numberOfEpisode":"2","studio":"DLE","type":"ONA","score":null,"genres":["Samurai"]},{"title":"Ishinomori Shoutarou no Rekishi Adventure","synopsis":"A two-part video series in which Dr. Teng (a researcher at the Time Institute) and his faithful kappa assistant Pasuke travel through time, first to the Battle of Sekigahara (1600) and then to the fourth Battle of Kawanakajima (1561). In the second installment, they then look in on the last stand of the Japanese underdog hero Yoshitsune in Hiraizu mi (1189) and then, after spending so much time on the Genpei War, suddenly leap several centuries into the future, to cover the first time Nobunaga Oda used firearms in battle, at Nagashino (1575) . A mixture of live-action and anime, described by Japanese sources as a \"documentary with a touch of story,\" and presumably related in some way to Shotaro Ishinomori's multivolume manga history of Japan.\n\n(Source: The Anime Encyclopedia)","img":"https://cdn.myanimelist.net/images/anime/5/64945.webp","source":"-","numberOfEpisode":"5","studio":null,"type":"OVA","score":null,"genres":["Samurai","Historical"]},{"title":"Yoshichirou no Keirei","synopsis":"We should never forget our manners no matter how much we may excel in martial arts. Learn lessons from Yoshichiro's failure.\n\n(Source: Japanese Animated Film Classics)","img":"https://cdn.myanimelist.net/images/anime/1766/92230.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":null,"genres":["Historical","Samurai"]},{"title":"Ichiendama no Tabigarasu","synopsis":"A one-yen coin becomes a samurai in search of adventure and love.","img":"https://cdn.myanimelist.net/images/anime/12/87819.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Music","score":null,"genres":["Adventure","Music","Samurai"]},{"title":"Mushinin","synopsis":"Bandai's new toy line for boys: Mushinin. It combines bugs (mushi) and ninja (nin). The anime follows the various characters as they train in their ninja arts at a local playground.","img":"https://cdn.myanimelist.net/images/anime/12/87848.webp","source":"Game","numberOfEpisode":"?","studio":null,"type":"ONA","score":null,"genres":["Samurai","Shounen"]},{"title":"Tenka wo Mezashita Sannin no Bushou","synopsis":"An educational anime about the 3 major warlords in the Sengoku era. Oda Nobunaga, Toyotomi Hideyoshi, and Tokugawa Ieyasu.","img":"https://cdn.myanimelist.net/images/anime/10/66211.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"OVA","score":null,"genres":["Drama","Historical","Kids","Samurai"]},{"title":"Minamoto no Yoritomo to Bushi no Yononaka","synopsis":"An educational film about Minamoto no Yoritomo. He founded the Kamakura shogunate which reigned from 1192 to 1333.","img":"https://cdn.myanimelist.net/images/anime/3/66215.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"OVA","score":null,"genres":["Kids","Samurai","Historical","Drama"]},{"title":"Tokugawa Iemitsu to Edo Bakufu","synopsis":"An educational film about Tokugawa Iemitsu. He was the grandson of Tokugawa Ieyasa (who founded the Tokugawa shogunate and ended the Sengoku era with his victory). Iemitsu is mostly known for his xenophobia and tried to close Japan to the world, this is known as Sakoku. The policies he put into place blocked out Japan for nearly 200 years which eventually caused internal strife and internal war in the Meiji era when Japan opened its borders again only to find it was economically, politically, industrially, scientifically, and culturally behind the rest of the world.","img":"https://cdn.myanimelist.net/images/anime/7/66213.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"OVA","score":null,"genres":["Kids","Samurai","Historical","Drama"]},{"title":"Ninja Bugei-chou Pilot Film","synopsis":"An animated pilot film for Ninja Bugei-chou released to the public over three decades later on Ninpuu Kamui Gaiden DVD volume 7.\n\nThe pilot film was created in 1969 as director Nagisa Ooshima was wanting to make a TV animation to build off his controversial film from 1967. The pilot was rejected by Shirato himself (the original comic creator the film was based on) and the plan was changed to animate Ninpuu Kamui Gaiden instead, a side story to the Kamui Den manga also created by Shirato. Though with this change, Ooshima did not partake in Ninpuu Kamui Gaiden's production.","img":"https://cdn.myanimelist.net/images/anime/1629/102770.webp","source":"Manga","numberOfEpisode":"1","studio":null,"type":"Special","score":null,"genres":["Action","Historical","Samurai","Seinen"]},{"title":"Meiji Ishin wo Tsukuriageta Hitobito","synopsis":"An educational film about Yukichi Fukuzawa who helped head the Meiji Restoration after Japan's 200 year isolation.","img":"https://cdn.myanimelist.net/images/anime/8/66209.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"OVA","score":null,"genres":["Kids","Samurai","Historical","Drama"]},{"title":"Neko Neko Nihonshi 4th Season","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1757/106368.webp","source":"Web manga","numberOfEpisode":"32","studio":null,"type":"TV","score":null,"genres":["Historical","Parody","Kids","Samurai"]},{"title":"Capsule Samurai","synopsis":"A series of shorts shown on the NHK's channel Eigo-rian, which taught children English.","img":"https://cdn.myanimelist.net/images/anime/11/88830.webp","source":"Original","numberOfEpisode":"40","studio":null,"type":"TV","score":null,"genres":["Comedy","Music","Samurai"]},{"title":"Nishio no Yatsuzou","synopsis":"A CGI commercial for Honke Yatsuhashi Nishio which aired on TV. Yatsuhashi in general are a traditional Japanese confection made from rice, sugar, and cinnamon and a common souvenir from Kyoto. The ninja mascots have gone on receive a mobile manga, character goods, and stickers on LINE. ","img":"https://cdn.myanimelist.net/images/anime/5/88415.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Special","score":null,"genres":["Samurai"]},{"title":"Neko Neko Nihonshi 5th Season","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1112/106363.webp","source":"Web manga","numberOfEpisode":"?","studio":null,"type":"TV","score":null,"genres":["Historical","Parody","Kids","Samurai"]},{"title":"Samurai Champloo","synopsis":"Fuu Kasumi is a young and clumsy waitress who spends her days peacefully working in a small teahouse. That is, until she accidentally spills a drink all over one of her customers! With a group of samurai now incessantly harassing her, Fuu desperately calls upon another samurai in the shop, Mugen, who quickly defeats them with his wild fighting technique, utilizing movements reminiscent to that of breakdancing. Unfortunately, Mugen decides to pick a fight with the unwilling ronin Jin, who wields a more precise and traditional style of swordfighting, and the latter proves to be a formidable opponent. The only problem is, they end up destroying the entire shop as well as accidentally killing the local magistrate's son.\n\nFor their crime, the two samurai are captured and set to be executed. However, they are rescued by Fuu, who hires the duo as her bodyguards. Though she no longer has a place to return to, the former waitress wishes to find a certain samurai who smells of sunflowers and enlists the help of the now exonerated pair to do so. Despite initially disapproving of this idea, the two eventually agree to assist the girl in her quest; thus, the trio embark upon an adventure to find this mysterious warrior—that is, if Fuu can keep Mugen and Jin from killing each other.\n\nSet in an alternate Edo Period of Japan, Samurai Champloo follows the journey of these three eccentric individuals in an epic quest full of action, comedy, and dynamic sword fighting, all set to the beat of a unique hip-hop infused soundtrack.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/29134.webp","source":"Original","numberOfEpisode":"26","studio":"Manglobe","type":"TV","score":8.5,"genres":["Action","Adventure","Comedy","Historical","Samurai","Shounen"]},{"title":"Gintama","synopsis":"The Amanto, aliens from outer space, have invaded Earth and taken over feudal Japan. As a result, a prohibition on swords has been established, and the samurai of Japan are treated with disregard as a consequence.\n\nHowever one man, Gintoki Sakata, still possesses the heart of the samurai, although from his love of sweets and work as a yorozuya, one might not expect it. Accompanying him in his jack-of-all-trades line of work are Shinpachi Shimura, a boy with glasses and a strong heart, Kagura with her umbrella and seemingly bottomless stomach, as well as Sadaharu, their oversized pet dog. Of course, these odd jobs are not always simple, as they frequently have run-ins with the police, ragtag rebels, and assassins, oftentimes leading to humorous but unfortunate consequences.\n\nWho said life as an errand boy was easy?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/73274.webp","source":"Manga","numberOfEpisode":"201","studio":"Sunrise","type":"TV","score":8.98,"genres":["Action","Comedy","Historical","Parody","Samurai","Sci-Fi","Shounen"]},{"title":"Dororo","synopsis":"The greedy samurai lord Daigo Kagemitsu’s land is dying, and he would do anything for power, even renounce Buddha and make a pact with demons. His prayers are answered by 12 demons who grant him the power he desires by aiding his prefecture's growth, but at a price. When Kagemitsu's first son is born, the boy has no limbs, no nose, no eyes, no ears, nor even skin—yet still, he lives.\n\nThis child is disposed of in a river and forgotten. But as luck would have it, he is saved by a medicine man who provides him with prosthetics and weapons, allowing for him to survive and fend for himself. The boy lives and grows, and although he cannot see, hear, or feel anything, he must defeat the demons that took him as sacrifice. With the death of each one, he regains a part of himself that is rightfully his. For many years he wanders alone, until one day an orphan boy, Dororo, befriends him. The unlikely pair of castaways now fight for their survival and humanity in an unforgiving, demon-infested world.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1879/100467.webp","source":"Manga","numberOfEpisode":"24","studio":"MAPPA","type":"TV","score":8.19,"genres":["Action","Adventure","Historical","Demons","Supernatural","Samurai","Shounen"]},{"title":"Drifters","synopsis":"At the Battle of Sekigahara in 1600, Toyohisa Shimazu is the rearguard for his retreating troops, and is critically wounded when he suddenly finds himself in a modern, gleaming white hallway. Faced with only a stoic man named Murasaki and hundreds of doors on both sides, Toyohisa is pulled into the nearest door and into a world completely unlike his own.\n\nThe strange land is populated by all manner of fantastical creatures, as well as warriors from different eras of Toyohisa's world who were thought to be dead. Quickly befriending the infamous warlord Nobunaga Oda and the ancient archer Yoichi Suketaka Nasu, Toyohisa learns of the political unrest tearing through the continent. Furthermore, they have been summoned as \"Drifters\" to fight against the \"Ends,\" people who are responsible for the creation of the Orte Empire and are trying to annihilate the Drifters. As the Ends grow more powerful, so does the Empire's persecution of elves and other demihumans. It is up to Toyohisa and his group of unconventional heroes to battle in a brand-new world war to help the Empire's subjects, while protecting the land to claim for themselves and challenging the Ends.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/80271.webp","source":"Manga","numberOfEpisode":"12","studio":"Hoods Drifters Studio","type":"TV","score":7.98,"genres":["Action","Adventure","Comedy","Historical","Samurai","Fantasy","Seinen"]},{"title":"Rurouni Kenshin: Meiji Kenkaku Romantan","synopsis":"In the final years of the Bakumatsu era lived a legendary assassin known as Hitokiri Battousai. Feared as a merciless killer, he was unmatched throughout the country, but mysteriously disappeared at the peak of the Japanese Revolution. It has been ten peaceful years since then, but the very mention of Battousai still strikes terror into the hearts of war veterans.\n\nUnbeknownst to them, Battousai has abandoned his bloodstained lifestyle in an effort to repent for his sins, now living as Kenshin Himura, a wandering swordsman with a cheerful attitude and a strong will. Vowing never to kill again, Kenshin dedicates himself to protecting the weak. One day, he stumbles across Kaoru Kamiya at her kendo dojo, which is being threatened by an impostor claiming to be Battousai. After receiving help from Kenshin, Kaoru allows him to stay at the dojo, and so the former assassin temporarily ceases his travels.\n\nRurouni Kenshin: Meiji Kenkaku Romantan tells the story of Kenshin as he strives to save those in need of saving. However, as enemies from both past and present begin to emerge, will the reformed killer be able to uphold his new ideals?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/6803.webp","source":"Manga","numberOfEpisode":"94","studio":"Gallop","type":"TV","score":8.34,"genres":["Action","Adventure","Comedy","Historical","Romance","Samurai","Shounen"]},{"title":"Gintama°","synopsis":"Gintoki, Shinpachi, and Kagura return as the fun-loving but broke members of the Yorozuya team! Living in an alternate-reality Edo, where swords are prohibited and alien overlords have conquered Japan, they try to thrive on doing whatever work they can get their hands on. However, Shinpachi and Kagura still haven't been paid... Does Gin-chan really spend all that cash playing pachinko?\n\nMeanwhile, when Gintoki drunkenly staggers home one night, an alien spaceship crashes nearby. A fatally injured crew member emerges from the ship and gives Gintoki a strange, clock-shaped device, warning him that it is incredibly powerful and must be safeguarded. Mistaking it for his alarm clock, Gintoki proceeds to smash the device the next morning and suddenly discovers that the world outside his apartment has come to a standstill. With Kagura and Shinpachi at his side, he sets off to get the device fixed; though, as usual, nothing is ever that simple for the Yorozuya team.\n\nFilled with tongue-in-cheek humor and moments of heartfelt emotion, Gintama's fourth season finds Gintoki and his friends facing both their most hilarious misadventures and most dangerous crises yet.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/72078.webp","source":"Manga","numberOfEpisode":"51","studio":"Bandai Namco Pictures","type":"TV","score":9.12,"genres":["Action","Comedy","Historical","Parody","Samurai","Sci-Fi","Shounen"]},{"title":"Gintama'","synopsis":"After a one-year hiatus, Shinpachi Shimura returns to Edo, only to stumble upon a shocking surprise: Gintoki and Kagura, his fellow Yorozuya members, have become completely different characters! Fleeing from the Yorozuya headquarters in confusion, Shinpachi finds that all the denizens of Edo have undergone impossibly extreme changes, in both appearance and personality. Most unbelievably, his sister Otae has married the Shinsengumi chief and shameless stalker Isao Kondou and is pregnant with their first child.\n\nBewildered, Shinpachi agrees to join the Shinsengumi at Otae and Kondou's request and finds even more startling transformations afoot both in and out of the ranks of the the organization. However, discovering that Vice Chief Toushirou Hijikata has remained unchanged, Shinpachi and his unlikely Shinsengumi ally set out to return the city of Edo to how they remember it.\n\nWith even more dirty jokes, tongue-in-cheek parodies, and shameless references, Gintama' follows the Yorozuya team through more of their misadventures in the vibrant, alien-filled world of Edo.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/4/50361.webp","source":"Manga","numberOfEpisode":"51","studio":"Sunrise","type":"TV","score":9.09,"genres":["Action","Sci-Fi","Comedy","Historical","Parody","Samurai","Shounen"]},{"title":"Afro Samurai","synopsis":"When he was a young boy, Afro witnessed his father be cut down in a duel at the hands of a man known only as Justice. After taking the life of Afro's father, Justice cast aside his Number Two headband and took the Number One to claim its godly powers as his own.\n\nYears later, having obtained the Number Two headband which grants him the right to challenge the Number One, Afro moves forward in his hunt for revenge on the man who murdered his father. There is just one thing that stands in his way—everyone else in the world! Though the Number One can only be challenged by the Number Two, the Number Two can be challenged by anyone. As his enemies gather to try and take the title of Number Two, Afro must fight through a myriad of foes and obstacles if he hopes to reach the Number One and claim vengeance once and for all.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/15874.webp","source":"Original","numberOfEpisode":"5","studio":"Gonzo","type":"TV","score":7.37,"genres":["Action","Adventure","Samurai"]},{"title":"Stranger: Mukou Hadan","synopsis":"In the Sengoku period of Japan, a young orphan named Kotarou and his dog Tobimaru steal from unsuspecting villagers in order to make ends meet. However, Kotarou is forced to remain on the run when he finds himself being hunted down by assassins sent by China's Ming Dynasty for mysterious reasons not involving his petty crimes. \n\nFortunately, the duo run into Nanashi, a ronin who has taken refuge in a small temple, when Kotarou is attacked and Tobimaru poisoned. Although the samurai  saves the helpless pair from their pursuers, he feels that there is no need to help them further; but when offered a gem in exchange for his services as a bodyguard, he reluctantly accepts Kotarou's offer of employment—just until Tobimaru is healed and the two reach their destination. As the three set out on a perilous journey, it soon becomes evident that their path is riddled with danger, as the Ming Dynasty has now sent a terrifying swordsman after them to capture Kotarou and fulfill a certain prophecy.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/87066.webp","source":"Original","numberOfEpisode":"1","studio":"Bones","type":"Movie","score":8.34,"genres":["Action","Adventure","Historical","Samurai"]},{"title":"Rurouni Kenshin: Meiji Kenkaku Romantan - Tsuioku-hen","synopsis":"When mankind's savagery surpasses his fear of death, there is little hope for those who wish to live honest lives. Beneath a full moon, a young boy witnesses the murder of the bandits who had enslaved him, and is then christened with a new name by the man who rescued him. This boy is Shinta, now known as Kenshin Himura, and he is destined to become a swordsman. The softness of his heart does not befit the occupation, but his desire to protect the innocent is absolute.\n\nRurouni Kenshin: Meiji Kenkaku Romantan - Tsuioku-hen details the origins of the man who would bear the name of Hitokiri Battousai long before he swore his oath not to kill and before he earned his reputation as an assassin. The young man’s heart is divided between justice and corruption, while the fate of a nation rests on his actions.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1807/102419.webp","source":"Manga","numberOfEpisode":"4","studio":"Studio Deen","type":"OVA","score":8.74,"genres":["Action","Historical","Drama","Romance","Martial Arts","Samurai","Shounen"]},{"title":"Gintama': Enchousen","synopsis":"While Gintoki Sakata was away, the Yorozuya found themselves a new leader: Kintoki, Gintoki's golden-haired doppelganger. In order to regain his former position, Gintoki will need the help of those around him, a troubling feat when no one can remember him! Between Kintoki and Gintoki, who will claim the throne as the main character?\n\nIn addition, Yorozuya make a trip back down to red-light district of Yoshiwara to aid an elderly courtesan in her search for her long-lost lover. Although the district is no longer in chains beneath the earth's surface, the trio soon learn of the tragic backstories of Yoshiwara's inhabitants that still haunt them. With flashback after flashback, this quest has Yorozuya witnessing everlasting love and protecting it as best they can with their hearts and souls.\n\nGintama': Enchousen includes moments of action-packed intensity along with their usual lighthearted, slapstick humor for Gintoki and his friends.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/75172.webp","source":"Manga","numberOfEpisode":"13","studio":"Sunrise","type":"TV","score":9.05,"genres":["Action","Comedy","Historical","Parody","Samurai","Sci-Fi","Shounen"]},{"title":"Gintama.","synopsis":"After joining the resistance against the bakufu, Gintoki and the gang are in hiding, along with Katsura and his Joui rebels. The Yorozuya is soon approached by Nobume Imai and two members of the Kiheitai, who explain that the Harusame pirates have turned against 7th Division Captain Kamui and their former ally Takasugi. The Kiheitai present Gintoki with a job: find Takasugi, who has been missing since his ship was ambushed in a Harusame raid. Nobume also makes a stunning revelation regarding the Tendoushuu, a secret organization pulling the strings of numerous factions, and their leader Utsuro, the shadowy figure with an uncanny resemblance to Gintoki's former teacher.\n\nHitching a ride on Sakamoto's space ship, the Yorozuya and Katsura set out for Rakuyou, Kagura's home planet, where the various factions have gathered and tensions are brewing. Long-held grudges, political infighting, and the Tendoushuu's sinister overarching plan finally culminate into a massive, decisive battle on Rakuyou.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/83528.webp","source":"Manga","numberOfEpisode":"12","studio":"Bandai Namco Pictures","type":"TV","score":8.99,"genres":["Action","Comedy","Historical","Parody","Samurai","Sci-Fi","Shounen"]},{"title":"Basilisk: Kouga Ninpou Chou","synopsis":"For centuries, the Iga and Kouga ninja clans have engaged in a bitter war. But when a ceasefire is ordered by the powerful warlord Ieyasu Tokugawa, the two clans are forced to put down their arms.\n\nYears later, Gennosuke Kouga, heir of the Kouga clan, and Oboro Iga, heir of the Iga clan, have fallen in love. Through marriage, both heirs aim to bring peace to the clans. But their hopes are dashed when flames of rivalry between their clans are reignited, and they are dragged into another war.\n\nIeyasu's two grandsons have both claimed to be the next heir to the shogunate. To resolve this dispute, both the Kouga and Iga are ordered to send their 10 best warriors to fight in a bloody battle royale, with each clan representing one of the potential shogunate heirs. Two scrolls with the names of the fighters are given and are to be marked in blood upon the given fighter's death. The prize for winning is the favor of the Tokugawa shogunate for a thousand years. Torn between their love for each other and duty to their clans, Gennosuke and Oboro must ultimately decide the fate of their clans.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/6793.webp","source":"Manga","numberOfEpisode":"24","studio":"Gonzo","type":"TV","score":7.6,"genres":["Action","Adventure","Historical","Supernatural","Romance","Samurai","Fantasy"]},{"title":"Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare","synopsis":"When Gintoki apprehends a movie pirate at a premiere, he checks the camera's footage and finds himself transported to a bleak, post-apocalyptic version of Edo, where a mysterious epidemic called the \"White Plague\" has ravished the world's population. It turns out that the movie pirate wasn't a pirate after all—it was an android time machine, and Gintoki has been hurtled five years into the future! Shinpachi and Kagura, his Yorozuya cohorts, have had a falling out and are now battle-hardened solo vigilantes and he himself has been missing for years, disappearing without a trace after scribbling a strange message in his journal.\n\nSetting out in the disguise given to him by the android time machine, Gintoki haphazardly reunites the Yorozuya team to investigate the White Plague, and soon discovers that the key to saving the future lies in the darkness of his own past. Determined to confront a powerful foe, he makes an important discovery—with a ragtag band of friends and allies at his side, he doesn't have to fight alone.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/51723.webp","source":"Manga","numberOfEpisode":"1","studio":"Sunrise","type":"Movie","score":8.98,"genres":["Action","Sci-Fi","Comedy","Historical","Parody","Samurai","Shounen"]},{"title":"Hyakka Ryouran: Samurai Girls","synopsis":"With its gorgeous landscape and prosperous people, Great Japan is the envy of all other nations. But a serious threat hovers over the country.  Mysterious guardians known as Master Samurai are Great Japan's only defense.\n\nAt the behest of the student council, young samurai Muneakira Yagyuu arrives at Buou Academic School. Run by the Tokugawa Shogunate, here children of warriors are given aristocratic education required to run the country. The school is led by the student council president Yoshihiko Tokugawa and his sister Sen, who also happens to be Muneakira's childhood friend.\n\nUpon arriving at the academy, Muneakira finds himself in the midst of a terrible fight. During the chaos, the sky fills with a peculiar white light and a mysterious girl named Juubei Yagyuu appears and suddenly kisses Muneakira. With his kiss, she awakens an unknown power that protects them.\n\nJust who is this girl, and where did she come from? Muneakira finds himself entangled in the fate of the country and a threat that will shake Great Japan to its core. He must learn the secret behind the Master Samurai and the kiss that awakened Juubei's power in order to protect his country.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/27705.webp","source":"Light novel","numberOfEpisode":"12","studio":"Arms","type":"TV","score":6.87,"genres":["Action","Harem","Comedy","Ecchi","Samurai","School"]},{"title":"Sengoku Basara","synopsis":"During Japan's Sengoku period, several powerful warlords fought in politics and in arms with hopes of unifying the country under a central government. Nobunaga Oda had asserted himself as being the most powerful of these rulers by possessing the strength and military resource necessary to conquer all of Japan.\n\nShingen Takeda and his trusted warrior Yukimura Sanada led one of the main clans standing in Nobunaga’s way. One night, Sanada had been ordered to lead a sneak attack against General Kenshin Uesugi, which was then thwarted by Masamune Date and his army. Sanada and Date fought to a draw, which forged a heated rivalry out of their newfound admiration for one another.\n\nNobunaga continues to exert his forces in Sengoku Basara by doubling down on his influence across the country. Sanada and Date find themselves having to put their differences aside in order to quell the rise of Nobunaga and save feudal Japan from his tyrannical reign. Magical, militant, and political powers fly forth as these warriors and leaders clash amongst themselves and the armies of Nobunaga.","img":"https://cdn.myanimelist.net/images/anime/4/21849.webp","source":"Game","numberOfEpisode":"12","studio":"Production I.G","type":"TV","score":7.43,"genres":["Action","Historical","Martial Arts","Samurai","Super Power"]},{"title":"Hakuouki","synopsis":"In 1864 Japan, a young woman named Chizuru Yukimura is searching for her missing father, Koudou, a doctor by trade whose work often takes him far from home. But with no word from him in months, Chizuru disguises herself as a man and heads to Kyoto in search of him. Attracting the attention of ronin, she tries to hide and ends up witnessing a horrifying sight: the ronin being brutally murdered by crazed white-haired men. In a startling turn of events, members of the Shinsengumi arrive to dispatch the creatures. But Chizuru's safety doesn't last long, as this group of men tie her up and take her back to their headquarters, unsure of whether to let her live or silence her permanently.\n\nHowever, once she reveals the name of her father, the Shinsengumi decide to keep her safe, as they too have been searching for him. But Koudou is more connected to the Shinsengumi than they let on, and soon Chizuru finds herself embroiled in a conflict between the Shinsengumi and their enemies, as well as political tension in Kyoto.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/71800.webp","source":"Visual novel","numberOfEpisode":"12","studio":"Studio Deen","type":"TV","score":7.45,"genres":["Action","Historical","Supernatural","Drama","Samurai","Josei"]},{"title":"Brave 10","synopsis":"Isanami, a young priestess of Izumo, is forced to watch as a group of evil ninja burn her temple to the ground and slaughter the people within, leaving her no choice but to flee into the forest to escape the same fate. By chance, she stumbles upon Saizou Kirigakure, a masterless ninja from the Iga school. The two travel to Ueda Castle to ask Yukimura Sanada for help. Isanami's possession of a strange and devastating power is revealed, and Sanada readily agrees to help her, gathering ten brave warriors to Isanami's side.\n\nThus begins Brave 10, a story set in the Warring States period. It follows Saizou and Isanami's journey throughout the war-laden lands in search of brave warriors to serve under Yukimura's banner, each possessing powerful skills of their own. They'll have to travel far and wide, all while trying to fend off those who would chase after the dark power that she possesses to make it their own.","img":"https://cdn.myanimelist.net/images/anime/13/34043.webp","source":"Manga","numberOfEpisode":"12","studio":"TMS Entertainment","type":"TV","score":6.84,"genres":["Action","Adventure","Historical","Super Power","Samurai","Seinen"]},{"title":"Samurai 7","synopsis":"In the far distant future, on a planet that might have been called \"earth\", there was a war between samurai who mechanized their bodies. After the long war, people enjoyed a modest peace.\n\nFacing starvation and abductions at the hands of fearsome mechanized bandits (Nobuseri), the farmers of Kanna Village make the dangerous choice to hire samurai for protection. The village's water priestess, Kirara, her younger sister, Komachi, and a heartbroken villager, Rikichi, set off to hire willing samurai with nothing to offer but rice from their meager harvests. Through dangerous encounters and a bit of luck, seven samurai of varying specialties and experience are gathered for an epic battle against the bandits and the merchants that influence them.\n\nSamurai 7 is based loosely upon Kurosawa Akira's famous movie \"Seven Samurai\"/\"Shichinin no Samurai\"","img":"https://cdn.myanimelist.net/images/anime/1190/95421.webp","source":"Other","numberOfEpisode":"26","studio":"Gonzo","type":"TV","score":7.51,"genres":["Historical","Mecha","Samurai","Sci-Fi"]},{"title":"Gintama Movie 1: Shinyaku Benizakura-hen","synopsis":"Gintoki and his Yorozuya friends (or rather, employees suffering under labor violations), Shinpachi and Kagura, continue to scrape by in the futuristic, alien-infested city of Edo. They take on whatever work they can find while trying not to get involved in anything too dangerous. But when Katsura, the leader of the Joui rebels and Gintoki's long-time acquaintance, disappears after being brutally attacked by an unknown assassin, Shinpachi and Kagura begin an investigation into his whereabouts and the identity of the assailant. Meanwhile, Gintoki takes on a seemingly unrelated job: the blacksmith Tetsuya requests that Gin recover a strange and powerful sword called the Benizakura which was recently stolen.\n\nAs the two investigations gradually intersect, the Yorozuya crew find themselves in the midst of a major conspiracy that hinges on the sinister nature of the Benizakura sword. Gintoki resolves to take the fight directly to the enemy headquarters, and together with a few unexpected allies, sets out on one of his most perilous jobs yet.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/28803.webp","source":"Manga","numberOfEpisode":"1","studio":"Sunrise","type":"Movie","score":8.53,"genres":["Action","Sci-Fi","Comedy","Historical","Parody","Samurai","Shounen"]},{"title":"Gintama.: Porori-hen","synopsis":"Sixth season of Gintama.","img":"https://cdn.myanimelist.net/images/anime/11/88325.webp","source":"Manga","numberOfEpisode":"13","studio":"Bandai Namco Pictures","type":"TV","score":8.54,"genres":["Action","Sci-Fi","Comedy","Historical","Parody","Samurai","Shounen"]},{"title":"Gintama.: Shirogane no Tamashii-hen","synopsis":"First Season of the final arc of Gintama.","img":"https://cdn.myanimelist.net/images/anime/12/89603.webp","source":"Manga","numberOfEpisode":"12","studio":"Bandai Namco Pictures","type":"TV","score":8.79,"genres":["Action","Sci-Fi","Comedy","Historical","Parody","Samurai","Shounen"]},{"title":"Juubee Ninpuuchou","synopsis":"Jubei Kibagami wanders feudal Japan as an itinerant swordsman-for-hire. After a past betrayal left him masterless, he has no more patience for warring political factions and their schemes. Unfortunately, both past and political intrigue collide when he meets and saves a female ninja named Kagero from a man with the ability to make his body as hard as stone.\n\nThe sole survivor of a ninja clan, Kagero continues her team's last mission: investigate a mysterious plague that wiped out an entire village. Jubei wants nothing to do with this, but the stone-like man's allies, a group of ninja with supernatural powers known as the Devils of Kimon, make that option difficult. To make matters worse, a government spy poisons Jubei, promising him an antidote if he can unravel the true intentions of the Devils of Kimon and their connection to the plague. The trail leads to shadow leaders, a plot to overthrow the government, and a man that Jubei thought he would never see again.","img":"https://cdn.myanimelist.net/images/anime/6/66727.webp","source":"Original","numberOfEpisode":"1","studio":"Madhouse","type":"Movie","score":7.62,"genres":["Adventure","Historical","Horror","Supernatural","Romance","Samurai","Fantasy","Shounen"]},{"title":"Katsugeki/Touken Ranbu","synopsis":"In 1863, Izuminokami Kanesada and his partner, Horikawa Kunihiro, arrive in the streets of Edo from the future to investigate their master's reports of an upcoming enemy invasion. As humanoid manifestations of the famous Toshizou Hijikata's swords, they have been tasked with protecting history from the Retrograde Army that seeks to alter it. Soon enlisting the help of other sword warriors, they continuously battle the mysterious army throughout the Bakumatsu period.\n\nHowever, their journey will not be an easy one. Fraught with blood and betrayal in the chaotic era closest to their hearts, the duo will be forced to make difficult decisions with everything they care about on the line. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/87984.webp","source":"Game","numberOfEpisode":"13","studio":"ufotable","type":"TV","score":6.76,"genres":["Action","Historical","Samurai","Fantasy"]},{"title":"Shigurui","synopsis":"At the beginning of the Edo Era, when people enjoyed a time of peace, Lord Tokugawa Tadanaga holds a fighting tournament. In the past, matches were fought with wooden swords. This time, real swords will be used.\n\nOne-armed Fujiki Gennosuke and blind Irako Seigen will fight each other in this match. Both are disciples of Iwamoto Kogan, who is known as Japan's greatest swordsman. Each of them are determined to prove himself the successor of Iwamoto's school. However, there can only be one champion.\n\nSo begins a story of intertwining fates, conflict, and strange destinies.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/10282.webp","source":"Manga","numberOfEpisode":"12","studio":"Madhouse","type":"TV","score":7.43,"genres":["Action","Historical","Psychological","Drama","Martial Arts","Samurai","Seinen"]},{"title":"Gintama.: Shirogane no Tamashii-hen - Kouhan-sen","synopsis":"Second Season of the final arc of Gintama.","img":"https://cdn.myanimelist.net/images/anime/1776/96566.webp","source":"Manga","numberOfEpisode":"14","studio":"Bandai Namco Pictures","type":"TV","score":8.83,"genres":["Action","Comedy","Historical","Parody","Samurai","Sci-Fi","Shounen"]},{"title":"Hyakka Ryouran: Samurai Bride","synopsis":"Second season of Hyakka Ryoran: Samurai Girls. ","img":"https://cdn.myanimelist.net/images/anime/5/45248.webp","source":"Light novel","numberOfEpisode":"12","studio":"Arms","type":"TV","score":6.81,"genres":["Action","Ecchi","Comedy","Harem","Samurai","School"]},{"title":"Afro Samurai: Resurrection","synopsis":"After obtaining the Number One headband, which proclaims him to be the best of all warriors, Afro spends most of his days in peace, though his nightmare-filled nights are not so tranquil. His life crescendos into chaos once again when Jinno and Sio, his former friends from long ago, take the headband from him, as well as the remains of his father. Challenged by Sio to don the Number Two headband again and exact revenge on them for their actions, Afro embarks on another journey as the wearer of said headband—an item for which anyone would kill him.\n\nAfro Samurai: Resurrection follows Afro as he fights a second series of battles against all manner of foes, wading through the sea of corpses in his wake so that he may once again quench his never-ending thirst for revenge.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/77929.webp","source":"Original","numberOfEpisode":"1","studio":"Gonzo","type":"Movie","score":7.38,"genres":["Action","Adventure","Samurai"]},{"title":"Hakuouki Hekketsuroku","synopsis":"After the conclusion of Hakuouki, Chizuru Yukimura and the Shinsengumi are forced to flee Kyoto and set sail for Edo. In their commander Isami Kondou's absence, vice-commander Toshizou Hijikata steps in as acting commander. However, Hijikata is not only struggling with the extra leadership duties—which worries everyone around him—but also a newfound uncontrollable bloodlust. To make matters worse, the urge does not affect him alone, and it is even beginning to drive some of his subordinates mad.\n\nFinally, Kondou returns with orders from the emperor to defend the castle, and a new name for their squad: the Kouyou Chinbutai. But in war, the balance of power can shift suddenly and allegiances can waver. In Hakuouki Hekketsuroku, Chizuru follows the Shinsengumi into the heart of war and continues the search for her missing father, all while the bond between her and Hijikata grows ever stronger.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/71797.webp","source":"Visual novel","numberOfEpisode":"10","studio":"Studio Deen","type":"TV","score":7.65,"genres":["Action","Drama","Historical","Josei","Samurai","Supernatural"]},{"title":"Rurouni Kenshin: Meiji Kenkaku Romantan - Seisou-hen","synopsis":"Kaoru goes to the harbor every day to see if Kenshin has returned. After a while, she starts looking back at her life with Kenshin and all the things that have happened.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1971/90877.webp","source":"Manga","numberOfEpisode":"2","studio":"Studio Deen","type":"OVA","score":8.01,"genres":["Romance","Samurai","Historical","Drama","Shounen"]},{"title":"Mushibugyou","synopsis":"In Feudal Japan, the people of Edo are under siege by giant insects that ravage the land. The people desperately beg the government to do something about it. Thus the Insect Magistrate Office is established, gathering strong warriors to defend against the onset of pests.\n\nMushibugyou follows Jinbee Tsukishima, a young man striving to be a master swordsman like his father. To atone for a horrific incident that occurred at his fault, Jinbee seeks to take his father's place as a member of the Insect Magistrate Office. On his journey there, he meets the lovely Haru, a young woman who helps manage her family’s tea house, and is forced to put his sword to good use in saving her from a grisly fate. This act of bravery that earns him a spot in the Insect Magistrate. Will this rookie exterminator be able to rid the land of the horde of insects swarming in?","img":"https://cdn.myanimelist.net/images/anime/12/48827.webp","source":"Manga","numberOfEpisode":"26","studio":"Seven Arcs Pictures","type":"TV","score":7.39,"genres":["Action","Historical","Super Power","Ecchi","Martial Arts","Samurai","Fantasy","Shounen"]},{"title":"Saraiya Goyou","synopsis":"Masterless samurai Akitsu Masanosuke is a skilled and loyal swordsman, but his naïve, diffident nature has time and again caused him to be let go by the lords who have employed him. Hungry and desperate, he becomes a bodyguard for Yaichi, the charismatic leader of a gang called \"Five Leaves.\" Although disturbed by the gang's sinister activities, Masa begins to suspect that Yaichi's motivations are not what they seem. And despite his misgivings, the deeper he's drawn into the world of the Five Leaves, the more he finds himself fascinated by these devious, mysterious outlaws.\n\n(Source: MU)","img":"https://cdn.myanimelist.net/images/anime/4/75203.webp","source":"Manga","numberOfEpisode":"12","studio":"Manglobe","type":"TV","score":7.84,"genres":["Mystery","Historical","Drama","Samurai","Seinen"]},{"title":"Sengoku Basara Two","synopsis":"The deadly confrontation with the Devil King, Oda Nobunaga is over, but the struggle for supremacy continues in Warring Countries-era Japan, as the armies of Takeda Shingen and Uesugi Kenshin repeatedly engage battle at Kawanakajima.\n\nMeanwhile, on the easternmost side of the battlefield, two outstanding characters bound by destiny—one clad in azure and the other in crimson—are about to clash in a long-awaited, decisive duel.\n\nThen a sudden dispatch informs that a huge army has surrounded the forces of Takeda, Uesugi and Date at Kakanakajima. Their leader is Toyotomi Hideyoshi, the man who inherited Nobunaga's dreams and ambitions, and who is now going to bring havoc over Japan once again!\n\n(Source: Production I.G)","img":"https://cdn.myanimelist.net/images/anime/6/80999.webp","source":"Game","numberOfEpisode":"12","studio":"Production I.G","type":"TV","score":7.6,"genres":["Action","Historical","Martial Arts","Samurai","Super Power"]},{"title":"Drifters (OVA)","synopsis":"Despite the Ends’ attack on Verlina being successfully repelled, the war has not yet ended. With the monster armies regrouping, the Black King tightens his grasp on the already conquered territory. New conflicts erupt all across Orte, as its remaining forces struggle to retain control over long-oppressed demi-human races.\n\nWhile Ends grow more potent each day, Toyohisa Shimazu remains unconscious after heavy injuries suffered during the Battle of Verlina. Facing enemies on every side, humanity’s fate is still on a knife's edge.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1027/97819.webp","source":"Manga","numberOfEpisode":"2","studio":"Hoods Drifters Studio","type":"OVA","score":7.59,"genres":["Action","Adventure","Comedy","Fantasy","Historical","Samurai","Seinen"]},{"title":"Manyuu Hikenchou","synopsis":"The Edo period of Japan gave rise to a clan of warriors with a very specialized, magical skill. The clan was known as the Manyuu, and the skill was the ability to administer a sword strike that could shrink the size of a woman's breasts. This might not seem like an ability that could exert power over a land, but in Manyuu Hikenchou, large breasts denote status, wealth, fame, and influence.\n\nGrave concern has arisen in the Manyuu clan due to the actions of their chosen successor, Chifusa. Disgusted with the breast obsessed society that the Manyuu have created and perpetuated, Chifusa has not only deserted the clan, but also stolen the sacred scroll that details their techniques to growing and severing breasts.\n\nFortunately, Chifusa is not completely alone. Her fellow warrior Kaede is sympathetic to her cause; a sympathy that could place her in considerable danger. Now wanted by the very clan that raised her, Chifusa must defend her life and Kaede's while seeking to undo the damage their brethren have done to the land. Along the way, Chifusa will discover that she harbors a power that goes far beyond the scope of her training, one that could help shape and change the land that she seeks to bring equality to.","img":"https://cdn.myanimelist.net/images/anime/9/75184.webp","source":"Manga","numberOfEpisode":"12","studio":"Hoods Entertainment","type":"TV","score":6.25,"genres":["Action","Comedy","Historical","Ecchi","Samurai","Seinen"]},{"title":"Blade of the Immortal","synopsis":"Manji is an amoral swordsman, who has been cursed with eternal life. He has grown tired of living with all the death he has created. He has no skills other then those of killing, thus he forms a plan to regain his mortality: he shall kill one hundred evil men for each good one he has killed. The old witch who afflicted Manji with immortality agrees to Manji's proposition and Manji is set on his path to kill one thousand evil men. On his journey he meets a young girl, Rin, who has her own vengeance to seek against the sword school whose members slaughtered Rin's family. Rin and Manji journey together, each hoping to find some kind of peace. In their way are many varied enemies. Rin and Manji are almost constantly under attack and must learn to live their lives, avoiding being consumed by revenge.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/74074.webp","source":"Manga","numberOfEpisode":"13","studio":"Bee Train","type":"TV","score":6.83,"genres":["Action","Adventure","Historical","Samurai","Supernatural"]},{"title":"Peace Maker Kurogane","synopsis":"Although traumatized by witnessing the murder of his parents by one of the Choushuu, Ichimura Tetsunosuke's thirst for revenge lead him to desire strength. At the age of 15, Tetsunosuke approached the Shinsengumi, wanting to become one of its members. However, Tetsunosuke lacked the skill, mind and will to emotionlessly cut down whoever threatened peace and the Shinsengumi. Even with the support of his brother Tatsunosuke and his newfound friends of the Shinsengumi, little did Tetsunosuke know the blood and pain he would have to face being part of this historical group.","img":"https://cdn.myanimelist.net/images/anime/10/77408.webp","source":"Manga","numberOfEpisode":"24","studio":"Gonzo","type":"TV","score":7.35,"genres":["Action","Comedy","Historical","Samurai","Shounen"]},{"title":"Samurai Deeper Kyou","synopsis":"In the year 1600, at the fog-covered battlefield of Sekigahara, a fierce battle was waged by two exemplary swordsmen. One was Kyoushirou Mibu, a skilled and noble warrior in possession of the unique powers of the Mibu Clan. The other was the thousand-man slayer, with eyes and hair the color of blood, \"Demon Eyes\" Kyou. Their legendary clash was cut short when a meteor from the heavens fell down upon that battlefield, leaving both to vanish in its wake.\n\nSamurai Deeper Kyou begins four years after that battle, when a gun-wielding bounty hunter by the name of Yuya Shiina hunts down Kyoushirou—now a perverted, traveling medicine-man who has built up a large debt. On her way to claim his bounty, they are attacked by an inhuman monster that seeks to devour Kyoushirou. This encounter awakens \"Demon Eyes\" Kyou, whose mind has been trapped inside of Kyoushirou's body ever since that fateful battle. Thus begins a grand tale of legendary two swordsmen and the discovery of their secrets.","img":"https://cdn.myanimelist.net/images/anime/4/23744.webp","source":"Manga","numberOfEpisode":"26","studio":"Studio Deen","type":"TV","score":6.94,"genres":["Adventure","Comedy","Historical","Supernatural","Samurai","Shounen"]},{"title":"Hakuouki Reimeiroku","synopsis":"The year is 1863 and as Japan's long festering wounds of political discord erupt into violent waves of street clashes and murder, the Tokugawa Shogunate sends a new force of masterless samurai called the Roshigumi to the aid of the Aizu forces in Kyoto. However the new \"police\" are anything but a cohesive force and assassination has already split them into two opposing factions. The stronger is led by the brutal Serizawa Kamo and the lesser by the more honorable but less assertive Isami Kondo. It is into this pack of wolves that Ryunosuke Ibuki is dragged by the rabid Serizawa. Forced to be a virtual slave by blood debt, he hates the samurai and everything they stand for. But as he sees how the other half of the samurai live, he begins to believe that there may still be a chance, for both himself and Japan, if only Kondo will step up and take down the mad dog Serizawa! \n\n(Source: Sentai Filmworks) ","img":"https://cdn.myanimelist.net/images/anime/11/71798.webp","source":"Visual novel","numberOfEpisode":"12","studio":"Studio Deen","type":"TV","score":7.52,"genres":["Action","Historical","Supernatural","Drama","Samurai","Josei"]},{"title":"Lupin the Third: Mine Fujiko to Iu Onna","synopsis":"Many people are falling prey to a suspicious new religion. Lupin III infiltrates this group, hoping to steal the treasure their leader keeps hidden. There he lays eyes on the beautiful, bewitching woman who has the leader enthralled. This is the story of how fashionable female thief Fujiko Mine first met Lupin III, the greatest thief of his generation.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/73347.webp","source":"Manga","numberOfEpisode":"13","studio":"TMS Entertainment","type":"TV","score":7.79,"genres":["Action","Adventure","Comedy","Ecchi","Samurai","Seinen"]},{"title":"Rurouni Kenshin: Meiji Kenkaku Romantan - Ishinshishi e no Chinkonka","synopsis":"The war against the Tokugawa Shogunate ended years ago. But there are some who are not happy with the outcome. Shigure Takimi watched his friends and family get slashed down in the name of freedom and prosperity. Now he and a band of desperate rebels have sworn to settle one final score. Only one man stands in their way: Kenshin Himura. But when Shigure discovers Kenshin's true identity as the Hitokiri Battousai, his fight becomes a personal vendetta.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/47845.webp","source":"Manga","numberOfEpisode":"1","studio":"Gallop","type":"Movie","score":7.58,"genres":["Samurai","Historical","Drama","Shounen"]},{"title":"Mugen no Juunin: Immortal","synopsis":"Manji is an immortal swordsman, who has been cursed with eternal life. He has grown tired of living with all the death he has created. He has no skills other than those of killing, thus he forms a plan to regain his mortality: he shall kill one hundred evil men for each good one he has killed. The old witch who afflicted Manji with immortality agrees to Manji’s proposition and Manji is set on his path to kill one thousand evil men. On his journey he meets a young girl, Rin, who has her own vengeance to seek against the sword school whose members slaughtered Rin’s family. Rin and Manji journey together, each hoping to find some kind of peace. In their way are many varied enemies. Rin and Manji are almost constantly under attack and must learn to live their lives, avoiding being consumed by revenge.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1263/102516.webp","source":"Manga","numberOfEpisode":"24","studio":"LIDENFILMS","type":"ONA","score":7.33,"genres":["Action","Adventure","Historical","Supernatural","Drama","Martial Arts","Samurai","Seinen"]},{"title":"Afro Samurai Movie","synopsis":"A movie adaptation of the TV series.","img":"https://cdn.myanimelist.net/images/anime/8/38065.webp","source":"Original","numberOfEpisode":"1","studio":"Gonzo","type":"Movie","score":7.55,"genres":["Action","Adventure","Samurai"]},{"title":"Angolmois: Genkou Kassenki","synopsis":"The scary great king comes from the other side of the sea... The big incident \"Genkou\" that shook medieval Japan is being drawn in an original way in this historical anime, along with the beginning of the Samurai!\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/1469/95052.webp","source":"Manga","numberOfEpisode":"12","studio":"NAZ","type":"TV","score":7.17,"genres":["Action","Drama","Historical","Military","Samurai"]},{"title":"Gintama: Nanigoto mo Saiyo ga Kanjin nano de Tasho Senobisuru Kurai ga Choudoyoi","synopsis":"This special is a set of short comedy stories involving Gintoki and his equally-broke sidekicks Shinpachi and Kagura. One day, Gintoki and his comrades are out viewing the spring flowers when suddenly the Shinsengumi appear, arguing that Gintoki has taken their flower-viewing spot. Gintoki's team and the Shinsengumi must then battle for the right to sit in that spot by using a violent version of rock paper scissors.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/8522.webp","source":"Manga","numberOfEpisode":"1","studio":"Sunrise","type":"Special","score":8.09,"genres":["Action","Sci-Fi","Comedy","Historical","Parody","Samurai","Mecha","Shounen"]},{"title":"Sengoku Otome: Momoiro Paradox","synopsis":"Yoshino Hide is an average girl who always seems to find trouble wherever she goes. One day Yoshino visits a local shrine to pray in order to pass her upcoming test. However, Yoshino sees a blue light coming from inside the Shrine and looks inside to find a mysterious person performing a magic spell. In a stroke of bad luck, Yoshino trips on a small bell and crashes into the shrine, prompting the stranger to catch her. Upon Yoshino's capture, the magic spell spirals out of control and sends Yoshino back in time to the Sengoku Era.\n\nYoshino then encounters Akechi Mitsuhide and Oda Nobunaga. But unlike what really happened during the era, Hideyoshino realizes that everyone in the world is female. She then decides to help Oda Nobunaga find the Crimson Armor which is said to allow the person wearing the armor to conquer all of Japan.","img":"https://cdn.myanimelist.net/images/anime/12/75231.webp","source":"Game","numberOfEpisode":"13","studio":"TMS Entertainment","type":"TV","score":6.62,"genres":["Action","Comedy","Historical","Samurai","Sci-Fi","Super Power"]},{"title":"Bakumatsu Kikansetsu Irohanihoheto","synopsis":"In the final years of the Bakumatsu, wandering mercenary Yojiro Akizuki travels the length and breadth of Japan. And while he employs his sword in the usual fashion, he also uses it to help him locate supernatural items which he pursues with single-minded determination, often with bloody results. In the course of his quest, he crosses paths with a traveling theater group whose members have their own dark agenda. Is it a chance meeting or the result of some, as yet, undiscovered conspiracy? \n\n(Source: Sentai Filmworks) ","img":"https://cdn.myanimelist.net/images/anime/4/56037.webp","source":"Original","numberOfEpisode":"26","studio":"Sunrise","type":"ONA","score":7.14,"genres":["Action","Drama","Historical","Samurai"]},{"title":"Ninja Batman","synopsis":"Batman Ninja takes a journey across the ages as Gorilla Grodd's time displacement machine transports many of Batman's worst enemies to feudal Japan—along with the Dark Knight and a few of his allies. The villains take over the forms of the feudal lords that rule the divided land, with the Joker taking the lead among the warring factions. As his traditional high-tech weaponry is exhausted almost immediately, Batman must rely on his intellect and his allies—including Catwoman and the extended Bat-family—to restore order to the land, and return to present-day Gotham City.\n\n(Source: Warner Bros.)","img":"https://cdn.myanimelist.net/images/anime/1351/95947.webp","source":"Other","numberOfEpisode":"1","studio":"Kamikaze Douga","type":"Movie","score":6.2,"genres":["Action","Martial Arts","Samurai"]},{"title":"Juubee Ninpuuchou: Ryuuhougyoku-hen","synopsis":"Fourteen years after defeating the immortal warrior Himuro Genma and thwarting the Shogun of the Dark's evil plans, Kibagami Jubei continues to roam all over Japan as a masterless swordsman. During his journey, he meets Shigure, a priestess who has never seen the world outside her village. But when a group of demons destroys the village and kills everyone, Jubei becomes a prime target after acquiring the Dragon Jewel—a stone with an unknown origin. Meanwhile, Shigure—along with the monk Dakuan and a young thief named Tsubute—travels to the village of Yagyu. And with two demon clans now hunting down Shigure, Dakuan must once again acquire the services of Jubei to protect the Priestess of Light.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1898/103439.webp","source":"Original","numberOfEpisode":"13","studio":"Madhouse","type":"TV","score":6.71,"genres":["Adventure","Horror","Magic","Martial Arts","Samurai","Shounen","Supernatural"]},{"title":"Gintama: Shinyaku Benizakura-hen","synopsis":"According to Tsutaya Online, the DVD of Gintama: Shinyaku Benizakura-hen will be released on December 15th. A new special will be bundled with the limited edition.\n\n\nIt's the running gag of Ben Johnson episode where animation staff reuse the New Years footage; Yorozuya would sit around the kotatsu eating a bowl of tangerines. They discuss elaborate subjects, Shinpachi complains about reusing animation footage, and then Gin-chan always ending the gag with a pointless announcement.","img":"https://cdn.myanimelist.net/images/anime/12/26966.webp","source":"Manga","numberOfEpisode":"1","studio":"Sunrise","type":"Special","score":8.27,"genres":["Action","Comedy","Historical","Parody","Samurai","Sci-Fi","Shounen"]},{"title":"Gintama: Yorinuki Gintama-san on Theater 2D","synopsis":"Demonic Vice-Commander of the Shinsengumi, Toushirou Hijikata, acquires a cursed sword—one which completely rewrites his personality, morphing him from a hard-boiled, no-nonsense cop into a hopeless otaku. As he struggles to break the curse, an ambitious new member of the police force, Itou Kamotarou, seizes the opportunity to depose Hijikata in his bid for power within the organization. However, Itou's scheme is revealed to be more devious than anyone imagined, and the very existence of the Shinsengumi is thrown into peril.\n\nIn another time and place, the Yorozuya squad is suddenly greeted by a potential new recruit. Before them is a mysterious young woman named Pirako Doromizu who hides a penchant for extreme violence behind her smiling, enthusiastic exterior. However, unbeknownst to Gintoki and the others, Pirako has strong ties to one of the ruling figures of the Kabuki district of Edo, and her arrival sets off a chain reaction that throws the inhabitants of the district into a civil war.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1172/90571.webp","source":"Manga","numberOfEpisode":"2","studio":"Sunrise","type":"Movie","score":8.45,"genres":["Action","Sci-Fi","Comedy","Historical","Parody","Samurai","Shounen"]},{"title":"Gintama': Futon ni Haitte kara Buki Nokoshi ni Kizuite Neru ni Nerenai Toki mo Aru","synopsis":"Bundled with limited edition of the 58th Gintama manga volume.\n\nThe tagline for the bundled anime reads, \"It's time for all the Yorozuya members ...to wake up just one more time.\"\n\n(Source: MAL News, edited)","img":"https://cdn.myanimelist.net/images/anime/12/64865.webp","source":"Manga","numberOfEpisode":"1","studio":"Sunrise","type":"Special","score":8.11,"genres":["Action","Sci-Fi","Comedy","Historical","Parody","Samurai","Shounen"]},{"title":"Gintama: Dai Hanseikai","synopsis":"Some of the characters get together and talk about \"regrets\" they have after 4 years of anime Gintama. Soon they fight over who gets more screen time. Special animation shown at the Gintama Haru Matsuri 2010 live event.","img":"https://cdn.myanimelist.net/images/anime/7/29295.webp","source":"Manga","numberOfEpisode":"1","studio":"Sunrise","type":"Special","score":8.07,"genres":["Action","Comedy","Parody","Samurai"]},{"title":"Drifters: Special Edition","synopsis":"Bundled with the fifth manga volume.","img":"https://cdn.myanimelist.net/images/anime/1141/97770.webp","source":"Manga","numberOfEpisode":"1","studio":"Hoods Drifters Studio","type":"OVA","score":7.73,"genres":["Action","Adventure","Comedy","Fantasy","Historical","Samurai","Seinen"]},{"title":"Sengoku Basara Movie: The Last Party","synopsis":"The story of the film is set after the conflict instigated by Toyotomi Hideyoshi ended, but not before the Battle of Sekigahara determines who shall be the Shogun of Japan.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/50871.webp","source":"Game","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.64,"genres":["Action","Historical","Martial Arts","Samurai","Super Power"]},{"title":"Sengoku Basara: Judge End","synopsis":"Based on CAPCOM's 2010 game Sengoku Basara 3 (Sengoku Basara: Samurai Heroes), Sengoku Basara: Judge End will depict the epic Battle of Sekigahara.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/62511.webp","source":"Game","numberOfEpisode":"12","studio":"Telecom Animation Film","type":"TV","score":6.89,"genres":["Action","Super Power","Martial Arts","Samurai","Historical"]},{"title":"Hakuouki Movie 1: Kyoto Ranbu","synopsis":"Chizuru Yukimura has come to Kyoto looking for her father, a doctor who has gone missing. While there, she witnesses a fight between an Oni and the Shinsengumi. Taking her into custody, the Shinsengumi debates on what to do with Chizuru, when they discover that she is the daughter of the doctor for whom they are also looking. The Shinsengumi then take Chizuru along on their search after the missing doctor, from adventure to adventure.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/49399.webp","source":"Visual novel","numberOfEpisode":"1","studio":"Studio Deen","type":"Movie","score":7.72,"genres":["Action","Historical","Supernatural","Drama","Samurai","Josei"]},{"title":"Sengoku Collection","synopsis":"Sengoku Collection revolves around many samurai who are accidentally removed from a parallel universe inhabited by well-known historic characters. Unlike the historical war period known to us, all inhabitants in this unique world look like high school girls. Coming from the medieval era and finding themselves totally amazed by everything they encounter in modern day Tokyo, the girls become best friends through their adventures. \n\n(Source: Crunchyroll) ","img":"https://cdn.myanimelist.net/images/anime/12/35329.webp","source":"Game","numberOfEpisode":"26","studio":"Brain's Base","type":"TV","score":6.47,"genres":["Fantasy","Parody","Samurai"]},{"title":"Gintama°: Umai-mono wa Atomawashi ni Suru to Yokodorisareru kara Yappari Saki ni Kue","synopsis":"The Gintama crew gets together to present a preview for the upcoming arc, the biggest ever in the anime's history, and also discuss the difficulties involved in producing one mid-season. \n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/9/77240.webp","source":"Manga","numberOfEpisode":"1","studio":"Bandai Namco Pictures","type":"Special","score":8.1,"genres":["Action","Comedy","Historical","Parody","Samurai","Shounen"]},{"title":"Rurouni Kenshin: Meiji Kenkaku Romantan - Shin Kyoto-hen","synopsis":"A large scale remake of the time after Kenshin leaves Tokyo up until before the inferno of Kyoto.","img":"https://cdn.myanimelist.net/images/anime/2/39663.webp","source":"Manga","numberOfEpisode":"2","studio":"Studio Deen","type":"OVA","score":7.12,"genres":["Action","Samurai","Historical","Drama","Shounen"]},{"title":"Mutsu Enmei Ryuu Gaiden: Shura no Toki","synopsis":"Legends tell of an invincible martial art known as Mutsu Enmei-Ryu, an unarmed style that allows the user to defeat any number of armed opponents using incredible speed and strength. This is the story of three generations of those who bear the name Mutsu, and their encounters and battles with the strongest fighters of their era. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/56847.webp","source":"Manga","numberOfEpisode":"26","studio":"Studio Comet","type":"TV","score":7.6,"genres":["Action","Historical","Martial Arts","Samurai","Shounen"]},{"title":"Hyouge Mono","synopsis":"The story is set during Japan's Sengoku Jidai (Era of the Warring States) and centers on Furuta Sasuke, a vassal of the great warlord Oda Nobunaga and a man obsessed with tea ceremony and material desires in his pursuit of a fortuitous life. Having learned from Oda and the legendary tea master Sen no Soueki, Furuta walks the way of the Hyouge Mono.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/77282.webp","source":"Manga","numberOfEpisode":"39","studio":"Bee Train","type":"TV","score":8,"genres":["Historical","Samurai","Seinen"]},{"title":"Kochouki: Wakaki Nobunaga","synopsis":"The series is a historical drama aesthetically and boldly adapting the life of Oda Nobunaga in his teens up to his time as a warlord against his brother, Nobuyuki.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1444/101157.webp","source":"Original","numberOfEpisode":"12","studio":"Studio Deen","type":"TV","score":6.56,"genres":["Action","Historical","Drama","Samurai"]},{"title":"Soul Buster","synopsis":"Keishuu, China.\n\nThe history books say that in the era of the Three Kingdoms, this land was a place of never-ending war. A young high school boy, Sonshin, who hates his city's history, is troubled by a certain dream. When he wakes up from the dream, strange things begin to happen one after another, and without understanding what's going on, he suddenly finds himself facing Gien, one of the generals from the Romance of the Three Kingdoms, who's trying to kill him! Just before Gien's blade strikes home, a mysterious beautiful woman appears in front of Sonshin. What trials await Sonshin, as he witnesses this terrible battle between two generals of the Three Kingdoms?\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/3/82256.webp","source":"Manga","numberOfEpisode":"12","studio":"Studio Pierrot","type":"TV","score":5.85,"genres":["Action","Samurai"]},{"title":"Sengoku Musou","synopsis":"Toyotomi Hideyoshi is on the verge of unifying the realm, and all that remains is the Odawara Castle protected by the \"Lion of Sagami\" Ujiyasu Houjou. Hideyoshi's personally trained generals—Ishida Mitsunari, Katou Kiyomasa, and Fukushima Masanori—as well as Ootani Yoshitsugu, Shima Sakon, and Naoe Kanetsugu are all on the frontline of the battle. Amidst the battle formation are the two young warriors of the Sanada household: older brother Nobuyuki and younger brother Yukimura. As the stalemate begins to break down, Sanada Yukimura rides on a lone horse into the fray. His brother follows him right after.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/71770.webp","source":"Game","numberOfEpisode":"12","studio":"TYO Animations","type":"TV","score":6.59,"genres":["Action","Historical","Samurai"]},{"title":"Fuyu no Semi","synopsis":"If time did not allow ordinary things to be ordinary. How would you have lived?\n\nIt is the Bakumatsu and early Meiji Period. Akizuki Keiichirou and Kusaka Touma stand of opposite sides of the political scale of the time but still, something as fragile as the shell of a cicada binds these two men together in a tragic and cruel fate. A story of friendship, love and seperation as well as reunion and sacrifice.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1/2443.webp","source":"Manga","numberOfEpisode":"3","studio":"Venet","type":"OVA","score":7.59,"genres":["Drama","Historical","Romance","Samurai","Yaoi"]},{"title":"Hakuouki Movie 2: Shikon Soukyuu","synopsis":"Second part of two Hakuouki movies.","img":"https://cdn.myanimelist.net/images/anime/12/71796.webp","source":"Visual novel","numberOfEpisode":"1","studio":"Studio Deen","type":"Movie","score":7.82,"genres":["Action","Historical","Supernatural","Drama","Samurai","Josei"]},{"title":"Bakumatsu","synopsis":"The Bakumatsu was an era in which the souls of young men burned with anxiety for their country's future. Takasugi Shinsaku, a soldier of fortune from Choshu, sneaks aboard a government ship with his comrade Katsura Kogorou in search of a mysterious \"timepiece\" with the power to manipulate time that he fears the government wishes to keep for themselves. Rather than allow such power to fall into the wrong hands, Takasugi plans to destroy the artifact, but having obtained it, the artifact is quickly stolen, forcing the pair to follow the mysterious thief to the seat of government in Kyoto. However, when they arrive in the capital, they discover that the government has been overthrown and the deity Susanoo now reigns in its place. The streets of the city and the people in them are much different than Takasugi and Katsura remembered. The times may have changed but their mission hasn't - Takasugi and Katsura resolve to reset time and save their nation from the nefarious forces trying to hijack it.\n\n(Source: Tokyo Otaku Mode)","img":"https://cdn.myanimelist.net/images/anime/1764/95110.webp","source":"Game","numberOfEpisode":"12","studio":"Studio Deen","type":"TV","score":5.81,"genres":["Action","Historical","Samurai"]},{"title":"Yoroiden Samurai Troopers","synopsis":"Thousands of years ago, the evil emperor Talpa attempted to conquer the Earth. Defeated, he was banished to the Nether Realm and his armor was divided into 9 separate suits. Now, he has returned to conquer Earth, having reclaimed 4 of the suits. The other 5 are in the possesion of those who are the only hope of stopping him: The Ronin Warriors. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1855/92738.webp","source":"-","numberOfEpisode":"39","studio":"Sunrise","type":"TV","score":7.09,"genres":["Adventure","Samurai","Sci-Fi","Shounen"]},{"title":"Rurouni Kenshin Special","synopsis":"A VHS only special episode. Also known as Episode 95.","img":"https://cdn.myanimelist.net/images/anime/1581/104187.webp","source":"Manga","numberOfEpisode":"1","studio":"Studio Deen","type":"Special","score":7.36,"genres":["Action","Historical","Romance","Samurai","Shounen"]},{"title":"Kazemakase Tsukikage Ran","synopsis":"In the Edo or Tokugawa period (1600–1868), Ran, a female wandering samurai whose skill with the katana is only matched by her taste for sake (rice wine), is joined by a chinese martial artist who calls herself Lady Meow of the Iron Cat Fist. Tsukikage Ran has individual episodes that are just short stories of their adventures.","img":"https://cdn.myanimelist.net/images/anime/5/16745.webp","source":"Original","numberOfEpisode":"13","studio":"Madhouse","type":"TV","score":7.13,"genres":["Adventure","Comedy","Historical","Martial Arts","Samurai"]},{"title":"Drifters: The Outlandish Knight","synopsis":"Episode 15 of Drifters shipped with the special version of the manga's sixth volume.","img":"https://cdn.myanimelist.net/images/anime/1987/97778.webp","source":"Manga","numberOfEpisode":"1","studio":"Hoods Drifters Studio","type":"OVA","score":7.28,"genres":["Action","Adventure","Comedy","Historical","Samurai","Fantasy","Seinen"]},{"title":"Sengoku Basara: Setonai no Gekitotsu! Hi wo Fuku Umi no Daiyousai - Fugaku!!","synopsis":"Maeda Toshiie and Matsu visit Chousokabe Motochika, who governs Shikoku. They tell Motochika unreasonable demands from Nobunaga. Motochika rejects them and urges Maeda to betray Nobunaga. Meanwhile Keiji tries to convince Mouri Motonari to join the fight against Nobunaga, and is imprisoned as a result. Motochika and Motonari move against each other.","img":"https://cdn.myanimelist.net/images/anime/6/25451.webp","source":"Game","numberOfEpisode":"1","studio":"Production I.G","type":"Special","score":7.21,"genres":["Action","Historical","Martial Arts","Samurai"]},{"title":"Hakuouki Hekketsuroku Episode 0","synopsis":"Summary of the first season of Hakuouki Shinsengumi Kitan. Aired the week before the second season began. ","img":"https://cdn.myanimelist.net/images/anime/9/26949.webp","source":"Visual novel","numberOfEpisode":"1","studio":"Studio Deen","type":"Special","score":7.13,"genres":["Action","Harem","Historical","Supernatural","Drama","Samurai","Vampire","Josei"]},{"title":"Ryo","synopsis":"Ryo is about the son of a samurai who lost his parents during the attack of English ships on a Japanese town who is given the name Ryo and becomes the bodyguard of Ryoma Sakamoto, a man who has his own plan to fight for the country.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/42991.webp","source":"Original","numberOfEpisode":"1","studio":"Gonzo","type":"Movie","score":5.91,"genres":["Action","Samurai","Historical","Drama"]},{"title":"Hakuouki OVA","synopsis":"Two short OVA of Hakuouki distributed to those who purchased all six volumes of the DVD. A fandisc game \"Hakuoki Zuisouroku\" and an official parody \"Hakuoki SSL (a high school parody)\" were animated.","img":"https://cdn.myanimelist.net/images/anime/9/32507.webp","source":"Visual novel","numberOfEpisode":"2","studio":"Studio Deen","type":"OVA","score":7.48,"genres":["Action","Historical","Supernatural","Drama","Samurai"]},{"title":"Rurouni Kenshin: Special Techniques","synopsis":"Similiar to the \"Himura Kenshin's Greatest Hits\" from the first special, this episode goes through every technique of the Hiten Mitsurugi Ryuu and explains how it works.","img":"https://cdn.myanimelist.net/images/anime/4/8997.webp","source":"Manga","numberOfEpisode":"1","studio":"Gallop","type":"Special","score":7.28,"genres":["Action","Comedy","Samurai"]},{"title":"Bakumatsu: Crisis","synopsis":"The Bakumatsu was an era in which the souls of young men burned with anxiety for their country's future. Takasugi Shinsaku, a soldier of fortune from Choshu, sneaks aboard a government ship with his comrade Katsura Kogorou in search of a mysterious \"timepiece\" with the power to manipulate time that he fears the government wishes to keep for themselves. Rather than allow such power to fall into the wrong hands, Takasugi plans to destroy the artifact, but having obtained it, the artifact is quickly stolen, forcing the pair to follow the mysterious thief to the seat of government in Kyoto. However, when they arrive in the capital, they discover that the government has been overthrown and the deity Susanoo now reigns in its place. The streets of the city and the people in them are much different than Takasugi and Katsura remembered. The times may have changed but their mission hasn't - Takasugi and Katsura resolve to reset time and save their nation from the nefarious forces trying to hijack it.\n\n(Source: Tokyo Otaku Mode)","img":"https://cdn.myanimelist.net/images/anime/1979/100451.webp","source":"Game","numberOfEpisode":"12","studio":"Studio Deen","type":"TV","score":5.71,"genres":["Action","Historical","Samurai"]},{"title":"Juubee-chan 2: Siberia Yagyuu no Gyakushuu","synopsis":"Three hundred years ago, in the frigid land of Siberia, Jubei Yagyu engaged in a fierce battle with Kitaretsusai of the Northern Yagyu clan. The duel was costly, as his daughter Freesia was frozen in suspended animation. As a result of global warming in the present day, Freesia breaks free from her icy grave and moves to Japan as a middle school transfer student, where she befriends Jiyuu Nanohana. Little does Jiyuu know that Freesia is targeting her to acquire the coveted Lovely Eye Patch, which Freesia believes is rightfully hers.\n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/7/20768.webp","source":"Original","numberOfEpisode":"13","studio":"Madhouse","type":"TV","score":6.89,"genres":["Adventure","Comedy","Drama","Martial Arts","Samurai","Shounen"]},{"title":"Stranger: Mukou Hadan Pilot","synopsis":"In the Sengoku period, a rounin called Nanashi (meaning nameless) saves a young boy Kotarou and his dog Tobimaru at an abandoned temple. Kotarou has no family, is pursued by a mysterious militia organization from China, and hires Nanashi as his bodyguard. Among the pursuers is a man called Rarou, a very skilled warrior with blond hair and blue eyes. He obeys an old man called Byakuran and is a member of the Chinese militia. Unlike his companions in the militia, he is not serving any Emperor and just wants to fight with the strong.\n\n(Source: Iwa ni Hana via AniDB)","img":"https://cdn.myanimelist.net/images/anime/2/40079.webp","source":"Original","numberOfEpisode":"1","studio":"Bones","type":"Special","score":7.06,"genres":["Action","Adventure","Historical","Samurai","Seinen"]},{"title":"Honoo no Labyrinth","synopsis":"Meet Galan, a Russian spastic geek who`d do anything to be a real, live samurai. But that`s just an impossible dream... or is it? When his friend Natsu, who is a successor of Japanese emigrants family, gives him the gift of an ancient sword, strange events unfold, and even stranger people drop out of the sky to attack. Now Galan must overcome his ineptitude and join a bunch of beautiful women in a wacky romp through a kingdom that time forgot. Hey, what could be better?\n\n(Source: AniDB, edited)","img":"https://cdn.myanimelist.net/images/anime/3/20329.webp","source":"Original","numberOfEpisode":"2","studio":"Studio Fantasia","type":"OVA","score":6.28,"genres":["Adventure","Comedy","Ecchi","Samurai"]},{"title":"Afro Samurai Pilot","synopsis":"Original pilot for the \"Afro Samurai\" TV Show, directed and animated by Takeshi Koike.","img":"https://cdn.myanimelist.net/images/anime/3/67723.webp","source":"Original","numberOfEpisode":"1","studio":"Madhouse","type":"Special","score":6.75,"genres":["Action","Martial Arts","Samurai","Seinen"]},{"title":"Gintama: Monster Strike-hen","synopsis":"Collaboration anime between Gintama and Monster Strike.","img":"https://cdn.myanimelist.net/images/anime/1781/102825.webp","source":"Manga","numberOfEpisode":"2","studio":"Bandai Namco Pictures","type":"ONA","score":7.32,"genres":["Action","Comedy","Parody","Samurai"]},{"title":"Rurouni Kenshin Recap","synopsis":"This is a summary of episodes 34-56.","img":"https://cdn.myanimelist.net/images/anime/13/28413.webp","source":"Manga","numberOfEpisode":"1","studio":"Gallop","type":"Special","score":7.25,"genres":["Action","Adventure","Comedy","Historical","Romance","Samurai"]},{"title":"Gifuu Doudou!!: Kanetsugu to Keiji","synopsis":"The Sengoku era gave birth to many historical legends. One of them is Naoe Kanetsugu, the brilliant military general of the Uesugi family. Together with Maeda Keiji, a legendary warrior on the battlefield, who become lifelong friends with each other, they carve out a piece of history in the most dangerous and volatile time in Japan's history. The two men recall their beginnings and the journey they took to get to the accomplished position they now sit at.","img":"https://cdn.myanimelist.net/images/anime/5/51427.webp","source":"Manga","numberOfEpisode":"25","studio":"Studio Deen","type":"TV","score":6.49,"genres":["Action","Historical","Martial Arts","Samurai","Seinen"]},{"title":"The Hakkenden","synopsis":"\"During the blood-soaked feudal wars of Japan, the Awa clan faced certain extinction from a rival clan backed by demonic forces. Their clan's salvation becomes a curse when the family dog brings back the head of the enemy warlord but insists upon marrying the lord's daughter! This unnatural union bears fruit, but they are killed; and their eight unborn pups reincarnate as the eight Dog Warriors - The Hakkenden. The eight reincarnated souls travel their separate paths of violence and retribution, but slowly they come together as a formidable group representing the eight virtues of the bushido to slay the demons and redeem their clan!\"\n\n(Source: DVD Complete Series Back Cover)","img":"https://cdn.myanimelist.net/images/anime/5/23958.webp","source":"Novel","numberOfEpisode":"6","studio":"Artmic","type":"OVA","score":6.65,"genres":["Action","Adventure","Historical","Demons","Martial Arts","Samurai","Shounen"]},{"title":"Sengoku Basara Two: Ryuko, Itadaki no Chikai! Atsuki Mirai e Kakeru Tamashii!!","synopsis":"An extra episode included on the 7th DVD.","img":"https://cdn.myanimelist.net/images/anime/7/28823.webp","source":"-","numberOfEpisode":"1","studio":"Production I.G","type":"Special","score":7.29,"genres":["Action","Historical","Samurai"]},{"title":"Mushibugyou OVA","synopsis":"OVAs bundled with the 15-17th volumes of the Mushibugyou manga.","img":"https://cdn.myanimelist.net/images/anime/7/67127.webp","source":"Manga","numberOfEpisode":"3","studio":"Seven Arcs Pictures","type":"OVA","score":7.09,"genres":["Action","Historical","Super Power","Ecchi","Martial Arts","Samurai","Fantasy","Shounen"]},{"title":"Peace Maker Kurogane Movie 1: Omou Michi","synopsis":"Although traumatized by witnessing the murder of his parents by one of the Choushuu, Ichimura Tetsunosuke's thirst for revenge leads him to desire strength. At the age of 15, Tetsunosuke approached the Shinsengumi, wanting to become one of its members. However, Tetsunosuke lacked the skill, mind, and will to emotionlessly cut down whoever threatened peace and the Shinsengumi. Even with the support of his brother Tatsunosuke and his newfound friends of the Shinsengumi, little did Tetsunosuke know the blood and pain he would have to face being part of this historical group.","img":"https://cdn.myanimelist.net/images/anime/1379/91338.webp","source":"Manga","numberOfEpisode":"1","studio":"White Fox","type":"Movie","score":6.7,"genres":["Action","Comedy","Historical","Samurai","Shounen"]},{"title":"Gun-dou Musashi","synopsis":"The adventures of a whiny teenage Miyamoto Musashi, his electro-sword and demon-sealing revolvers, and his quest to win the love of the beautiful Kaguyahime.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/28268.webp","source":"Original","numberOfEpisode":"26","studio":"ACC Production","type":"TV","score":5.64,"genres":["Adventure","Samurai","Fantasy"]},{"title":"Katsugeki/Touken Ranbu Movie","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/4/87874.webp","source":"Game","numberOfEpisode":"1","studio":null,"type":"Movie","score":null,"genres":["Action","Samurai","Fantasy"]},{"title":"Makai Tenshou","synopsis":"Get ready for a nightmarish journey through faith and betrayal as the infamous Jubei Yagyu wields his deadly blades against the forces of good and evil alike. In an orgy of unbelievable savagery, the armies of the Shogun give no quarter as they ruthlessly slaughter their enemies. Trapped on the rocky isthmus of Amakusa, the faithful await divine aid as the demon stirs in their midst. Desperate for vengeance, a Child of Heaven becomes the emissary of Hell.\n\nTortured by visions of Amakusa's final hour, legendary swordsman Jubei Yagyu returns to his ancestral home seeking respite from the bloody duties of a feudal retainer. Life in the village of Yagyu possesses a serenity ill-befitting days of armed rebellion and unholy alliance. For Jubei the tranquility is far too transparent, and soon, chilling rumors reach him. Four dead heroes renew their claim to life, feeding on the fear and violence of the age. Forced to take up the sword once more, Jubei returns to the path of vengeance and damnation in Ninja Resurrection!\n\n(Source: DVD cover)","img":"https://cdn.myanimelist.net/images/anime/1285/94142.webp","source":"Novel","numberOfEpisode":"2","studio":"Phoenix Entertainment","type":"OVA","score":5.23,"genres":["Action","Supernatural","Samurai","Historical"]},{"title":"Sengoku Choujuu Giga: Kou","synopsis":"The history, either daily life or life stories of Sengoku warriors, is described using animals. We invite popular young actors and unique casts to voice out those Sengoku warriors while joking about them. An anime that teases Japan's history and Sengoku warriors; that's \"Sengoku Choujuu Giga.\"\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/6/82326.webp","source":"Original","numberOfEpisode":"13","studio":"ILCA","type":"TV","score":5.9,"genres":["Historical","Demons","Supernatural","Samurai"]},{"title":"Miyamoto Musashi: Souken ni Haseru Yume","synopsis":"The film's story centers on Musashi Miyamoto, one of the most famous swordsmen in Japanese history. He pioneered the Hyouhou Niten Ichi-ryuu style of two-sword fighting and wrote The Book of Five Rings, a book that has been compared to Sun Tzu's The Art of War for its insight on tactics and strategy.","img":"https://cdn.myanimelist.net/images/anime/6/15118.webp","source":"-","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":6.39,"genres":["Action","Historical","Martial Arts","Samurai"]},{"title":"Sengoku Musou SP: Sanada no Shou","synopsis":"The story of the special revolves around the Sanada brothers in their youth. Nobuyuki and Yukimura swear to each other to protect the influential Sanada clan. However, thinking of how to best continue the Sanada clan, Yukimura makes a decision, and meets with Mitsunari Ishida and Naoe Kanetsugu at the location he arrived at. On the other hand, his elder brother Nobuyuki must worry about the selfish demands made by the Tokugawa clan.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/56703.webp","source":"Game","numberOfEpisode":"1","studio":"TYO Animations","type":"Special","score":6.62,"genres":["Action","Historical","Samurai"]},{"title":"Karakuri no Kimi","synopsis":"Princess Rangiku lost her entire family to Lord Karimata, who invaded her home seeking her father's life work, puppets with unique capabilities. As her duty, Rangiku sets out with three of her father's greatest puppet warriors to seek revenge. She can manipulate these to battle the strongest of warriors, however manipulating the puppets leaves her own self vulnerable to direct attacks, so she seeks a ninja warrior named Manajiri to aid and protect her in her quest.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/1658.webp","source":"Manga","numberOfEpisode":"1","studio":"TMS Entertainment","type":"OVA","score":6.52,"genres":["Action","Comedy","Fantasy","Historical","Horror","Martial Arts","Samurai","Shounen","Supernatural"]},{"title":"Hakuouki: Otogisoushi","synopsis":"Features the characters from the games in chibi form with a completely new story with the theme: \"A normal everyday that might have existed.\"","img":"https://cdn.myanimelist.net/images/anime/9/78600.webp","source":"Visual novel","numberOfEpisode":"12","studio":"DLE","type":"TV","score":6.61,"genres":["Fantasy","Historical","Josei","Samurai"]},{"title":"Yakusoku no Nanaya Matsuri","synopsis":"Mihara Shouma is a first-year high school student. Shouma hasn't seen his good friend Atsushi in 3.5 years, ever since they lost contact with each other after elementary school. One day, Atsushi gets in contact with Shouma to invite him to a rare festival, so they can meet up and talk. Shouma goes to the \"Tanabata Seven Night Festival\" deep in the mountains, but Atsushi is not there. Instead, a girl named Shiori who also has a person she wants to meet is there. The festival's program manager Kanna suggests that he stay until the festival is over, and so Shouma and Shiori help Kanna prepare for the festival. Shouma and Shiori then get wrapped up in some strange events happening in the town.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1473/94594.webp","source":"Original","numberOfEpisode":"1","studio":"Yokohama Animation Lab","type":"ONA","score":6.79,"genres":["Drama","Samurai","Sci-Fi"]},{"title":"Namakura Gatana","synopsis":"Namakura Gatana, meaning \"dull-edged sword,\" is a two-minute comedy about a samurai who, thanks to his dull instrument, loses every time he attacks a weak opponent. In order to examine the sword, he tries to attack passers-by, but lower-class townspeople fight back and knock him down.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/4/15280.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.6,"genres":["Comedy","Samurai"]},{"title":"Rurouni Kenshin: Review Special","synopsis":"Summary of various fighting scenes of the first half of the series and a brief overview of the Kyoto arc.","img":"https://cdn.myanimelist.net/images/anime/3/26996.webp","source":"Manga","numberOfEpisode":"1","studio":"Gallop","type":"Special","score":6.88,"genres":["Action","Comedy","Samurai","Shounen"]}]