[{"title":"Junjou Romantica","synopsis":"Misaki Takahashi is a regular high school student who is preparing for his university entrance exams. In order to reduce the stress of studying, or so he hopes, he accepts the help of his older brother's best friend, and famous author, Akihiko Usami. However, Masaki is about to find out that Usami's books are of a very naughty genre, and that there may be something naughty waking up inside Masaki as well.\n\nJunjou Romantica also follows the story of two other couples loosely connected to Masaki and Usami's \"Romantica.\"\n\nEgoist shows the very passionate, but often complicated, relationship between university professor Hiroki Kamijou (whose life has reached an all time low) and paediatrician Nowaki Kusama, who falls for Hiroki at first sight and would do anything to make him happy.\n\nThe third story, \"Terrorist,\" shows just how obsessive love can become when rich eighteen-year-old Shinobu Takatsuki finally discovers something that he cannot have so easily—the literature professor You Miyagi.\n\nThere is passion abound as these three couples try to achieve their goals in life while also falling into temptation and anguish with their partners. ","img":"https://cdn.myanimelist.net/images/anime/7/8811.webp","source":"Manga","numberOfEpisode":"12","studio":"Studio Deen","type":"TV","score":7.79,"genres":["Comedy","Drama","Romance","Shounen Ai"]},{"title":"Love Stage!!","synopsis":"With an actress mother, producer father, and rockstar brother, anyone would expect Izumi Sena to eventually enter showbiz himself. However, aside from a commercial for a wedding magazine when he was a child, Izumi has never been in the spotlight; instead, he aims to become a manga artist. \n\nBut a decade after the shoot, the magazine calls for a 10th anniversary ad, requesting the original child actors for the project. This reunites Izumi with Ryouma Ichijou, now a popular actor who, much to Izumi's shock, has been in love with him ever since their first meeting! However, due to Izumi's feminine appearance and unisex name, Ryouma believed the boy was a girl and continues to do so to this day. Izumi's troubles are just beginning, because even after discovering the truth, Ryouma can't seem to shake off his feelings...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/76599.webp","source":"Manga","numberOfEpisode":"10","studio":"J.C.Staff","type":"TV","score":7.45,"genres":["Comedy","Romance","Shounen Ai"]},{"title":"Sekaiichi Hatsukoi","synopsis":"After having to deal with jealousy from his co-workers for working under his father's name, prideful literary editor Ritsu Onodera is determined to establish himself in the industry. To accomplish this, he quits his job at his father's publishing company and transfers to Marukawa Publishing. But instead of being placed in their literary division, Ritsu finds himself working as the rookie manga editor for the Emerald editing department, a team that operates under extremely tight schedules in order to meet deadlines. There, Ritsu is introduced to the infamous editor-in-chief Masamune Takano, a persistent man who strives for results.\n\nAs it turns out, Takano is actually Ritsu's high school love, and it is the aftermath of that heartbreak has caused Ritsu's reluctance to fall in love again. Now with the two reunited after several years of separation, the reestablishment of their relationship is marked by Takano's vow to make Ritsu say that he loves him again.\n\nSekaiichi Hatsukoi follows three couples that are interconnected within the manga industry, with each being subject to the budding of first love. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/29763.webp","source":"Manga","numberOfEpisode":"12","studio":"Studio Deen","type":"TV","score":7.9,"genres":["Comedy","Drama","Romance","Shounen Ai"]},{"title":"Junjou Romantica 2","synopsis":"The second part of Junjou Romantica continuing the story.","img":"https://cdn.myanimelist.net/images/anime/6/38417.webp","source":"Manga","numberOfEpisode":"12","studio":"Studio Deen","type":"TV","score":7.97,"genres":["Comedy","Drama","Romance","Shounen Ai"]},{"title":"Given","synopsis":"Tightly clutching his Gibson guitar, Mafuyu Satou steps out of his dark apartment to begin another day of his high school life. While taking a nap in a quiet spot on the gymnasium staircase, he has a chance encounter with fellow student Ritsuka Uenoyama, who berates him for letting his guitar's strings rust and break. Noticing Uenoyama's knowledge of the instrument, Satou pleads for him to fix it and to teach him how to play. Uenoyama eventually agrees and invites him to sit in on a jam session with his two band mates: bassist Haruki Nakayama and drummer Akihiko Kaji.\n    \nSatou's voice is strikingly beautiful, filling Uenoyama with the determination to make Satou the lead singer of the band. Though reticent at first, Satou takes the offer after an emotional meeting with an old friend. With the support of his new friends, Satou must not only learn how to play guitar, but also come to terms with the mysterious circumstances that led him to be its owner.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1666/102238.webp","source":"Manga","numberOfEpisode":"11","studio":"Lerche","type":"TV","score":8.24,"genres":["Drama","Music","Romance","Shounen Ai","Slice of Life"]},{"title":"Loveless","synopsis":"In the world of Loveless, each person is born with cat ears and a tail, which disappear only if that person engages in a sexual intercourse. Because of this, they have come to symbolize virginity and innocence. Additionally, fighting is only done by \"fighting pairs\" or couples, where one is known as the Sacrifice and the other as the Fighter. The first receives the damage while the latter attacks.\n\nRitsuka Aoyagi is a 12-year-old boy, who for some unknown reason suffers from amnesia. His brother got killed recently, and as if his life has not been hard enough lately, on his first day at the new school he gets approached by a stranger called Agatsuma Soubi, who claims to have known his late brother. Ritsuka finds out that Agatsuma and his brother used to be a fighting pair, and that Agatsuma has inherited Ritsuga now that his brother is gone. Together, they try to find the truth behind his brother's death and the organization known as the \"Seven Moons,\" which may have been responsible for it. All the while, it seems that Ritsuka and Agatsuma are becoming closer than they intended to be…","img":"https://cdn.myanimelist.net/images/anime/2/22947.webp","source":"Manga","numberOfEpisode":"12","studio":"J.C.Staff","type":"TV","score":6.95,"genres":["Action","Mystery","Supernatural","Drama","Romance","Fantasy","Josei","Shounen Ai"]},{"title":"Sekaiichi Hatsukoi 2","synopsis":"Second season of Sekaiichi Hatsukoi.","img":"https://cdn.myanimelist.net/images/anime/8/34871.webp","source":"Manga","numberOfEpisode":"12","studio":"Studio Deen","type":"TV","score":8.08,"genres":["Comedy","Drama","Romance","Shounen Ai"]},{"title":"Doukyuusei (Movie)","synopsis":"Rihito Sajou is an honor student who got perfect scores in every subject on his high school entrance exam. Hikaru Kusakabe plays guitar in his band that performs at live events and is popular among the girls. These boys would have never crossed paths. But one day Hikaru offers to help Rihito prepare for their upcoming chorus festival and the two begin to talk. As the two meet after school, they feel one another's sound, listen to each other's voice, and begin to harmonize as their hearts beat together.\n\nIt starts out slow but soon their feelings for one another grow and in just one moment they both realize that it is love. Hikaru's emotions are frivolous, pure, and direct causing Rihito to hesitate at first, but he gradually opens his heart. The boys are learning about each other as they also learn about themselves and support one another during this difficult time typical to youth. As the time to start thinking about their futures approaches, what do these young men find as they try to move forward...\n\n(Source: Aniplex USA)","img":"https://cdn.myanimelist.net/images/anime/3/78606.webp","source":"Manga","numberOfEpisode":"1","studio":"A-1 Pictures","type":"Movie","score":8.32,"genres":["Slice of Life","Romance","School","Shounen Ai"]},{"title":"Gravitation","synopsis":"All Shuichi ever dreamed about was following in the footsteps of his pop idol, Ryuichi Sakuma and the band Nittle Grasper. Together with his best friend Hiro, Shuichi's formed a band called Bad Luck and they've even managed to get signed to a major recording label! Unfortunately, the studio deadlines are looming and Shuichi still hasn't finished the lyrics for any of the songs. What he needs is a little inspiration... but he's been running a little low in that department lately. While Hiro recommends finding a girlfriend, fate has other things in store for him...\n\nWalking through the park late one night, Shuichi's latest lyrics flutter away and land at the feet of a stunning stranger that takes his breath away. Unfortunately, that mysterious stranger happens to be the famous novelist Eiri Yuki, who completely crushes the young singer by telling him he has \"zero talent\". Now, Shuichi's so annoyed that he's managed to finish his song just so he can find and confront Yuki once again. But, are his actions really motivated by anger, or has he actually fallen in love? \n\n(Source: RightStuf)","img":"https://cdn.myanimelist.net/images/anime/4/21856.webp","source":"Manga","numberOfEpisode":"13","studio":"Studio Deen","type":"TV","score":7.08,"genres":["Comedy","Music","Romance","Shoujo","Shounen Ai"]},{"title":"Super Lovers","synopsis":"Upon hearing news that his mother was on verge of death, Haru Kaidou—the eldest son of the family—flies all the way to Canada. The moment he arrives, he learns that not only did his mother fool him, but he is also supposed to take care of his adoptive brother, Ren Kaidou, an antisocial kid who feels more comfortable around dogs than people.\n\nDue to his new brother's distrustful nature, Haru initially has a hard time reaching out to Ren but their relationship eventually grows. He makes a promise to Ren: they will live together in Japan after Haru graduates from high school. However, due to an unfortunate accident, Haru loses all memories of the summer they spent together, including the promise he made. Five years later, expecting Haru to keep his promise, Ren arrives in Tokyo; but to Haru, Ren is just a random boy claiming to be his brother.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/78450.webp","source":"Manga","numberOfEpisode":"10","studio":"Studio Deen","type":"TV","score":7.28,"genres":["Slice of Life","Comedy","Drama","Romance","Shounen Ai"]},{"title":"Junjou Romantica 3","synopsis":"After living together for three years, Misaki Takahashi and Akihiko \"Usagi\" Usami's relationship has been progressing smoothly. However, all great relationships have problems, and theirs is just beginning. With a new rival on the horizon, Usagi worries about Misaki's feelings towards him. \n\nMeanwhile, Ryuuichirou Isaka has always loved to intrude on Misaki and Usagi's love life, but his own love life hasn't been all smooth sailing—Isaka and his secretary Kaoru Asahina have been dating for a few years; however, Asahina prefers to keep their professional and private lives separate, often leading to troubled waters between them.\n\nAs for Nowaki Kusama and Hiroki Kamijou, now that their careers are finally taking off, they hardly see each other anymore. With the time they spend together lessening, doubts and insecurities threaten to creep in between them. On the other hand, the 17-year age gap between Shinobu Takatsuki and You Miyagi has been a constant barrier in their relationship, but as they learn more about each other, their self-consciousness continues to fade.\n\nThe beloved couples of Junjou Romantica, Junjou Egoist, and Junjou Terrorist are back again, this time with a new addition: Junjou Mistake!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/74170.webp","source":"Manga","numberOfEpisode":"12","studio":"Studio Deen","type":"TV","score":7.91,"genres":["Comedy","Drama","Romance","Shounen Ai"]},{"title":"Uragiri wa Boku no Namae wo Shitteiru","synopsis":"Growing up as an orphan, Yuki Sakurai questions his reason for living and ability to see a person's painful memory by simply touching them. After receiving anonymous notes telling him to die, Yuki is unable to shake off the nagging feeling forming inside of him. Unbeknownst to him, he is being watched, both by people who want to harm him and those who want to protect him.\n\nOne foggy night, Yuki's life is saved by a beautiful man with silver eyes and jet black hair—a man he has never met before yet seems familiar. With the arrival of this mysterious stranger, Yuki's forgotten past has been awakened and the purpose of his existence has appeared before him.\n\nUragiri wa Boku no Namae wo Shitteiru tells the story of a teenage boy as he discovers who he is and where he comes from—all while making friends, experiencing betrayal, and slowly piecing together the puzzle of his past.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/26525.webp","source":"Manga","numberOfEpisode":"24","studio":"J.C.Staff","type":"TV","score":7.3,"genres":["Adventure","Drama","Fantasy","Shoujo","Shounen Ai"]},{"title":"Hitorijime My Hero","synopsis":"Masahiro Setagawa is a hopeless teenager who is often used by the neighborhood bullies as an errand boy. Defenseless, Masahiro knows that nobody will ever save him. However, his life drastically changes when he meets Kousuke Ooshiba, a man known as the \"Bear Killer,\" who takes down neighborhood gangs.\n\nA year later, Masahiro and his former friend, Kensuke Ooshiba, attend high school, only to find that Kousuke is their math teacher. While the three grow closer, Masahiro starts to view Kousuke as his \"hero,\" and Kousuke develops an urging desire to protect Masahiro. However, their normal lives take a turn when Kensuke's childhood friend, Asaya Hasekura, returns, seeing Kensuke as more than just a friend, much to his surprise. Will the three boys be able to live a regular high school life? Or will forbidden love keep them apart forever?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/86825.webp","source":"Manga","numberOfEpisode":"12","studio":"Encourage Films","type":"TV","score":7.51,"genres":["Drama","Romance","School","Shounen Ai","Slice of Life"]},{"title":"Togainu no Chi","synopsis":"In the wake of a third world war which left Japan in ruins, an organization known as Vischio seized control of Tokyo and renamed it Toshima. Taking place in its back alleys are battle games known as Igura, overseen by the Vischio, in which contestants battle and bathe in each other's blood to earn the chance to go up against its tournament's king, Il-re.\n\nIgura is not the only fighting tournament around; Bl@ster is a similar yet vastly different game since it prohibits murder and the use of weapons. The only way to win is by knocking out the opponent. Akira, a young man isolated from his family, is known to be undefeatable at Bl@ster. However, his life on the top is shattered when he is accused of murder. Unable to prove his own innocence, all hope is seemingly lost... that is until a mysterious woman named Emma appears and offers him a chance. Now, to regain his freedom, Akira must participate in Igura and ultimately defeat Il-re.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/75187.webp","source":"Visual novel","numberOfEpisode":"12","studio":"A-1 Pictures","type":"TV","score":6.31,"genres":["Action","Sci-Fi","Shounen Ai"]},{"title":"Sekaiichi Hatsukoi OVA","synopsis":"Two OVA episodes featuring additional stories. \n\nEpisode 0: Ritsu and Takano used to date back in high school, but broke up due to a misunderstanding. This is that story. \n\nEpisode 12.5: Hatori and Chiaki go to visit the latter's family. It's really awkward in many, many ways. ","img":"https://cdn.myanimelist.net/images/anime/11/35863.webp","source":"Manga","numberOfEpisode":"2","studio":"Studio Deen","type":"OVA","score":8.02,"genres":["Comedy","Drama","Romance","Shounen Ai"]},{"title":"Ling Qi","synopsis":"Low on luck after a series of unfortunate events, You Keika works part-time to try bringing himself out of a life of poverty. After a strange encounter with a white-haired man in a junkyard, You wakes up to discover that he was killed in a sudden accident and has become a spirit. The man he had encountered, Tanmoku Ki, is revealed as the 13th Youmeshi of the Tanmoki, the highest-ranking exorcist family of China. Noticing the wandering spirit, he offers You the opportunity to form a pact: he will offer You protection from humans and in return, You will have to become his spirit shadow, keeping him safe and guarded at all times.\n\nFrom then on, the two face untold challenges in the spiritual world, striving to keep those around them safe from harmful spirits. Along the way, the pact they formed grows into something more; a bond that neither of the two ever expected. Behind their roles as master and servant, a lingering admiration begins to emerge.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/81045.webp","source":"Web manga","numberOfEpisode":"20","studio":"Haoliners Animation League","type":"ONA","score":7.15,"genres":["Action","Comedy","Magic","Shounen Ai","Supernatural"]},{"title":"Hybrid Child","synopsis":"The skilled craftsman Kuroda created artificial humans called Hybrid Child—creatures who are neither machines nor dolls, but rather a reflection of the love shown to them. While they can feel human emotions and have their own consciousness, they are not real humans and require love to grow.\n\nKotarou Izumi is the young heir to the noble Izumi family, so it is frowned upon when he brings an abandoned Hybrid Child he found in the garbage into their household. His family even attempts to throw away Hazuki—Kotarou's name for the Hybrid Child—multiple times when he is not paying attention. But through overcoming these obstacles, their love and the bond connecting them grow stronger. However, ten years pass before a horrifying realization dawns on them: a Hybrid Child might not have an endless life span.\n\nHybrid Child is a collection of three short love stories, depicting the relationship between the artificial humans and their owners.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/65605.webp","source":"Manga","numberOfEpisode":"4","studio":"Studio Deen","type":"OVA","score":7.82,"genres":["Drama","Historical","Romance","Sci-Fi","Shounen Ai"]},{"title":"Super Lovers 2","synopsis":"Second season of Super Lovers.","img":"https://cdn.myanimelist.net/images/anime/9/83807.webp","source":"Manga","numberOfEpisode":"10","studio":"Studio Deen","type":"TV","score":7.49,"genres":["Slice of Life","Comedy","Drama","Romance","Shounen Ai"]},{"title":"Monochrome Factor","synopsis":"The story revolves around high school student Akira Nikaido, a typical slacker living a normal life. That is, until he meets the mysterious Shirogane, a man who suddenly appears and tells him that they have a destiny together. When Akira hears this, he is shocked and doesn't believe a word of it. Aya, a friend of Akira, forgets something in the school one night, and asks Akira to help her and go find it. He agrees, and while there, he gets attacked by a shadow monster. Shirogane convinces him that the balance between the human world and the shadow world has been distorted and that Akira must become a \"shin\"- a creature of the shadow world- in order to help restore the balance. The anime has shonen-ai themes which are completely absent from the manga.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/3/22552.webp","source":"Manga","numberOfEpisode":"24","studio":"A.C.G.T.","type":"TV","score":7.02,"genres":["Action","Shounen Ai","Supernatural"]},{"title":"Gakuen Heaven","synopsis":"Itou Keita, an average guy, is shocked when he's invited to attend the elite institution, \"Bell Liberty Academy.\" Unnerved by the mystery, he's further distracted by the school's social dynamics. In a sea of amazing young men, Keita struggles to find out what makes him unique, and how he can possibly deserve to be treated as an equal by the boys of BL. Lacking any particular ability, just why has Itou been welcomed into the privileged world of the talented and the beautiful? \n\nAlong the way, he develops intense relationships with the almost everyone at school but he is terribly drawn to the friendly, over-caring but very mysterious classmate, Kazuki Endou.","img":"https://cdn.myanimelist.net/images/anime/12/70143.webp","source":"Visual novel","numberOfEpisode":"13","studio":"Tokyo Kids","type":"TV","score":6.63,"genres":["Harem","Comedy","Drama","Romance","School","Shounen Ai"]},{"title":"Dakaretai Otoko 1-i ni Odosarete Imasu.","synopsis":"\"I'll make it so your body's unable to forget mine.\"\n \nSaijou Takato's five year reign as the \"Most Huggable No. 1\" has been snatched. Stealing his thunder is the newbie actor with a three-year debut, Azumaya! Toward the stuffy hostile Takato, Azumaya's sincere sparkling smile starts to become effective. Even as Takato sets his alert level on MAX, Azumaya catches Takato in his shameful drunken state and uses it to blackmail him! In exchange for Azumaya's silence, Azumaya states, \"Please let me hold you...?! Embrace me, who was the Most Huggable No.1?\" What the heck is he saying?! This series also includes a large quantity of other high suspense erotic stories.\n\n(Source: Starry Sky Scans)","img":"https://cdn.myanimelist.net/images/anime/1402/95620.webp","source":"Manga","numberOfEpisode":"13","studio":"CloverWorks","type":"TV","score":7.42,"genres":["Comedy","Drama","Romance","Shounen Ai"]},{"title":"Yami no Matsuei","synopsis":"Even after death, life is full of paperwork and criminals. Tsuzuki Asato is a 26 year old, happy-go-lucky, and dorky shinigami (god of death) whose job is to makes sure that those who are dead remain dead and stay in their proper realms. Even though he's had this job for over 70 years, he is in the worst division with horrible pay. He also has a knack for not keeping partners (since shinigami work in pairs), but now he seems to have one that will stick around; stubborn, smart-mouthed, serious and defensive 16 year old, Kurosaki Hisoka. With each case they investigate, they come closer to the conspiracies of the serial killer Dr. Muraki Kazutaka. Tsuzuki's relationship with Hisoka is growing stronger and closer...but there is a dark past to how Tsuzuki died that will not give him peace. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/6726.webp","source":"Manga","numberOfEpisode":"13","studio":"J.C.Staff","type":"TV","score":7.1,"genres":["Comedy","Drama","Fantasy","Horror","Magic","Shoujo","Shounen Ai","Vampire"]},{"title":"Sekaiichi Hatsukoi Movie: Yokozawa Takafumi no Baai","synopsis":"Movie adaptation of the Sekaiichi Hatsukoi: Yokozawa Takafumi no Baai BL light novel.","img":"https://cdn.myanimelist.net/images/anime/11/65927.webp","source":"Light novel","numberOfEpisode":"1","studio":"Studio Deen","type":"Movie","score":8.03,"genres":["Comedy","Drama","Romance","Shounen Ai"]},{"title":"Love Stage!!: Chotto ja Nakutte","synopsis":"Bundled with volume five of manga.","img":"https://cdn.myanimelist.net/images/anime/2/72350.webp","source":"Manga","numberOfEpisode":"1","studio":"J.C.Staff","type":"OVA","score":7.55,"genres":["Comedy","Romance","Shounen Ai"]},{"title":"Suki na Mono wa Suki Dakara Shou ga Nai!!","synopsis":"Hashiba Sora has fallen from a 4th story window and has lost all of his memories. When Fujimori Sunao comes to his school as his new room mate, Fujimori tells Hashiba that he is called Ran. Fujimori and Hashiba both have a split personality which they developed in their youth. Their split personalities, Yoru and Ran, are deeply in love. Even though it creeps Fujimori and Hashiba out what their other selves do with each other at night, they also start to fall for each other. Because of their relationship, Hashiba Sora finds out a lot of shocking facts about their youth.","img":"https://cdn.myanimelist.net/images/anime/7/85449.webp","source":"Visual novel","numberOfEpisode":"12","studio":"Zexcs","type":"TV","score":6.77,"genres":["Comedy","Drama","Romance","Shoujo","Shounen Ai","Slice of Life"]},{"title":"Junjou Romantica OVA","synopsis":"OVAs that come with the limited premium edition of volumes 16 and 20 of the manga series.","img":"https://cdn.myanimelist.net/images/anime/6/60389.webp","source":"Manga","numberOfEpisode":"2","studio":"Studio Deen","type":"OVA","score":7.89,"genres":["Comedy","Drama","Romance","Shounen Ai"]},{"title":"Tight-rope","synopsis":"Tightrope tells the tale of the reluctant heir of a yakuza family and his childhood friend, and follows their love relationship that started budding in their school days and keeps developing slowly but surely.\n\n(Source: Simona's BL Research Lab)","img":"https://cdn.myanimelist.net/images/anime/2/38305.webp","source":"Manga","numberOfEpisode":"2","studio":"PrimeTime","type":"OVA","score":7.14,"genres":["Romance","Shounen Ai"]},{"title":"Seiyou Kottou Yougashiten: Antique","synopsis":"A high school crush, a world-class pastry chef, a former middle-weight boxing champion... and a whole lot of cake!\nOno has come a long way since the agonizing day in high school when he confessed his love to handsome Tachibana. Now, some 14 years later Ono, a world-class pastry chef and gay playboy has it all. No man can resist Ono's charms (or his cooking skills!) but he has just found a new position under a man named Tachibana. Can this be the only man who resisted his charms, and if so, will the man who once snubbed the \"magically gay\" Ono get his just deserts? And how in the heck did a former middleweight boxing champion wind up as Ono's cake boy? \n\n(Source: DMP)","img":"https://cdn.myanimelist.net/images/anime/7/22538.webp","source":"Manga","numberOfEpisode":"12","studio":"Nippon Animation","type":"TV","score":7.09,"genres":["Comedy","Shoujo","Shounen Ai"]},{"title":"Gravitation: Lyrics of Love","synopsis":"Bad Luck's lead singer and lyricist, Shindou Shuichi, is a total wreck. With deadlines for the band's next album looming, the pressure is on, but the normally energetic Shuichi has become listless and fallen into a writing slump. It's all because Yuki - the great love of his life - has suddenly become cold and distant. Depressed and anxious, Shuichi doesn't want to think about lyrics - he just wants to know how to get Yuki to talk to him!\n\nNow, thanks to Shuichi's big mouth bragging to the press about how talented he is, the band can't even hire someone else to write the lyrics for them. If they don't manage to break Shuichi out of his slump soon, it could mean the end of Bad Luck for good! \n\n(Source: RightStuf) ","img":"https://cdn.myanimelist.net/images/anime/1656/94257.webp","source":"Manga","numberOfEpisode":"2","studio":"Plum","type":"OVA","score":6.99,"genres":["Comedy","Romance","Shoujo","Shounen Ai"]},{"title":"Sekaiichi Hatsukoi: Valentine-hen","synopsis":"Animated short with an original story that was screened alongside \"Sekaiichi Hatsukoi Movie: Yokozawa Takafumi no Baai.\"","img":"https://cdn.myanimelist.net/images/anime/5/55723.webp","source":"-","numberOfEpisode":"1","studio":"Studio Deen","type":"Movie","score":7.94,"genres":["Romance","Comedy","Shounen Ai"]},{"title":"Kono Danshi, Ningyo Hiroimashita.","synopsis":"*The Second OVA of Kono Dan series.\n\nThey say look before you leap and make sure you can swim before you go in the deep water, but when a picture of his late grandfather falls into the ocean, Shima jumps in after it without thinking. Nearly drowning as a result, he is instead saved by a very perfect stranger... one whose strangeness extends to only being human from the waist up!\n\nFor Shima, who's always felt like a fish out of water himself, it's more than just a revelation, and the young man and merman quickly begin to bond in ways neither anticipated. And yet, it's going to be far from easy sailing. After all, Shima and Isaki aren't just from opposite sides of the tracks, they're from entirely divergent species, and swimming in separate gene pools may make maintaining a long term relationship a whole different kettle of fish!\n\n(Source: Sentai Filmworks)\n","img":"https://cdn.myanimelist.net/images/anime/7/43465.webp","source":"Original","numberOfEpisode":"1","studio":"CoMix Wave Films","type":"OVA","score":7.51,"genres":["Fantasy","Shounen Ai"]},{"title":"Junjou Romantica Special","synopsis":"Voice actors comment various scenes from the anime.","img":"https://cdn.myanimelist.net/images/anime/11/14958.webp","source":"Manga","numberOfEpisode":"1","studio":"Studio Deen","type":"Special","score":7.52,"genres":["Comedy","Romance","Shounen Ai"]},{"title":"Given Movie","synopsis":" ","img":"https://cdn.myanimelist.net/images/anime/1706/106042.webp","source":"Manga","numberOfEpisode":"1","studio":"Lerche","type":"Movie","score":null,"genres":["Music","Slice of Life","Drama","Romance","Shounen Ai"]},{"title":"Vassalord.","synopsis":"Charley, a cyborg vampire who does the Vatican's dirty work, is the thrall of the local vampire playboy Johnny Rayflo. As the two fight crime—and each other—hilarity, violence and sacrilege ensue! But can Charley resist his own desperate cravings for blood? Find out as the devilish duo go up against a childlike vampire princess, a mysterious branch of the Unitarian Church...and one another. \n\n(Source: Tokyopop) ","img":"https://cdn.myanimelist.net/images/anime/3/43213.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"OVA","score":6.91,"genres":["Action","Comedy","Fantasy","Mystery","Shounen Ai","Supernatural","Vampire"]},{"title":"Gakuen Handsome","synopsis":"The school love story is set at Baramon High School, a private boys' school for the prefecture's most elite. The protagonist is a seventeen year old boy who transfers into the school and meets various major players on campus, such as the outlaw teacher, the soccer captain, and a childhood friend whom the protagonist has not seen for seven years. The school presents opportunities for friendship, love and conflict, and changes are now bound to happen in the main character's life.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/81425.webp","source":"Game","numberOfEpisode":"12","studio":"Team YokkyuFuman","type":"TV","score":6.5,"genres":["Comedy","Parody","School","Shounen Ai"]},{"title":"DRAMAtical Murder: Data_xx_Transitory","synopsis":"Data xx Transitory is the thirteenth and bonus episode of the DRAMAtical Murder animation. It features all of the bad endings from the original game.\n\n(Source: DRAMAtical Murder Wiki)","img":"https://cdn.myanimelist.net/images/anime/12/65081.webp","source":"Visual novel","numberOfEpisode":"1","studio":"NAZ","type":"Special","score":6.12,"genres":["Sci-Fi","Psychological","Drama","Shounen Ai"]},{"title":"Ling Qi 2","synopsis":"In this new season, we will discover the backstory of Tanmoki and who will learn through his memories who was his ancestor Rakugetsu.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1328/90485.webp","source":"Web manga","numberOfEpisode":"12","studio":"Haoliners Animation League","type":"TV","score":7.53,"genres":["Action","Comedy","Magic","Shounen Ai","Supernatural"]},{"title":"Kono Danshi, Uchuujin to Tatakaemasu.","synopsis":"When aliens suddenly invade the world, Earth seems to be fighting a losing battle until Arikawa, one of the defense command staff, accidentally discovers a young man lying on a hill. Tests soon prove the impossible: this one teenager, Kakashi, has the power to defeat the attackers! Unfortunately, Kakashi has also lost his memory, and with it the knowledge of how to actually use his power. Moving Kakashi in with himself and his own commander, Shiro, Arikawa accidentally starts a strange triangle of emotions and relationships. A triangle that threatens the fate of the planet as Kakashi begins to question his own motivations! \n\n(Source: Sentai Filmworks) ","img":"https://cdn.myanimelist.net/images/anime/9/75588.webp","source":"Original","numberOfEpisode":"1","studio":"CoMix Wave Films","type":"OVA","score":6.92,"genres":["Action","Fantasy","Shounen Ai","Super Power","Supernatural"]},{"title":"Kono Danshi, Mahou ga Oshigoto Desu.","synopsis":"Chiharu Kashima, captain of the Wizard Bureau's Crisis Countermeasures Division, is among a handful of people who can use magic. While frequenting his favorite bar, he is approached by a friendly man named Toyohi Utsumi. Having always dreamt of being a wizard, Toyohi is enthralled by the idea of meeting one. Much to the young Captain's surprise, Toyohi confesses that he has fallen in love with Kashima. While little time as passed, the two begin to spend more time together. Not all is well, however, as Kashima fears that magic is all that he has and Toyohi is only in love with Kashima the Wizard.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/78220.webp","source":"Original","numberOfEpisode":"4","studio":"CoMix Wave Films","type":"TV","score":7.1,"genres":["Magic","Fantasy","Shounen Ai"]},{"title":"Super Lovers OVA","synopsis":"Bundled with manga's tenth and eleventh volume.","img":"https://cdn.myanimelist.net/images/anime/9/87516.webp","source":"Manga","numberOfEpisode":"2","studio":"Studio Deen","type":"OVA","score":7.54,"genres":["Slice of Life","Comedy","Drama","Romance","Shounen Ai"]},{"title":"Honoo no Mirage","synopsis":"Takaya Ougi is just a typical high school guy who wants nothing more than to protect his best friend and live a normal life. Enter Nobutsuna Naoe, an older man who informs Takaya that he is in fact the reincarnation of Lord Kagetora. Naoe, himself a possessor, awakens Takaya's abilities to exorcise evil spirits and fight the Fuedal Underworld. While most possessors remember their former lives before being reincarnated, Takaya does not. Naoe is thankful for this, considering his passionate and abusive past with his Lord Kagetora. As Takaya improves his abilities, he also begins to remember what Naoe did because of his love for him. Meanwhile the dark forces of the Hojo and Fuma clans begin their attack as the Fuedal Underworld descends upon the living world.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/22614.webp","source":"Light novel","numberOfEpisode":"13","studio":"Madhouse","type":"TV","score":6.62,"genres":["Action","Historical","Supernatural","Drama","Romance","School","Shounen Ai"]},{"title":"Angel's Feather","synopsis":"In the Binfield Kingdom Chronicle, it is said that there was once a small, peaceful country called the Kingdom of Winfield, whose king and royal family possessed great white wings.\n\nHamura Shou is newly enrolled at Yuusei Academy. After hearing about a student named Misonou Kai from the headmaster, Shou comes to believe that Kai is his younger twin brother, who he was separated from when he was younger. However, after a mysterious earthquake, Shou is suddenly carried into another world with two other students. It is in this new world that, after being attacked by a monster, Shou suddenly unleashes great, white wings.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1/1640.webp","source":"Visual novel","numberOfEpisode":"2","studio":"Venet","type":"OVA","score":5.52,"genres":["Sci-Fi","Supernatural","Drama","Romance","Fantasy","Shounen Ai"]},{"title":"Kono Danshi, Sekika ni Nayandemasu.","synopsis":"The story revolves around high school boy Ayumu Tamari, who has an illness that makes him start to turn to crystal when he's stressed. Since he couldn't fit in with his class, after repeating a year, he declared that he wanted to have a \"Sparkly youth\" as well. To do this, he changed his hair and clothes to be more fashionable, and constantly checked for popular topics to stay in the know. In the midst of Ayumu's life of making a facade, his homeroom teacher and stone-loving geology teacher Kouya Onihara says that Ayumu's stone transformation is beautiful. Ayumu begins to become attracted to Kouya, who starts to give him advice.\n\n(Source: ANN, edited)","img":"https://cdn.myanimelist.net/images/anime/5/67151.webp","source":"Original","numberOfEpisode":"1","studio":"CoMix Wave Films","type":"OVA","score":7.06,"genres":["Drama","School","Shounen Ai"]},{"title":"Fake","synopsis":"Dee Laytner and Randy \"Ryo\" Maclane are two New York cops taking a needed vacation in England. Dee has very strong feelings for Ryo and wants to take this chance to advance their relationship (and if he's lucky, maybe seduce Ryo). Ryo doesn't understand his own feelings for Dee, and doesn't know if he wants to (or should) acknowledge them. Their vacation and relationship is suddenly disturbed when murders and missing person reports keep surfacing around their hotel. The only common tie the cases have is that all of the victims were Japanese or Japanese descent. Dee and Ryo have to solve the case before Ryo, who is half Japanese, becomes the next victim.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/25196.webp","source":"Manga","numberOfEpisode":"1","studio":"J.C.Staff","type":"OVA","score":6.57,"genres":["Police","Comedy","Romance","Mystery","Shounen Ai"]},{"title":"Loveless Specials","synopsis":"DVD specials.","img":"https://cdn.myanimelist.net/images/anime/10/22681.webp","source":"Manga","numberOfEpisode":"6","studio":"J.C.Staff","type":"Special","score":6.6,"genres":["Comedy","Supernatural","Romance","Fantasy","Josei","Shounen Ai"]},{"title":"Ten Count","synopsis":"Corporate secretary Shirotani suffers from obsessive-compulsive disorder. One day he meets Kurose, a therapist who offers to take him through a ten-step program to cure him of his compulsion. As the two go through each of the ten steps, Shirotani 's attraction to his counselor grows. \n\n(Source: SuBLime)","img":"https://cdn.myanimelist.net/images/anime/1464/99977.webp","source":"Manga","numberOfEpisode":"?","studio":null,"type":"TV","score":null,"genres":["Drama","Romance","Shounen Ai"]},{"title":"Papa datte, Shitai","synopsis":"\"There are Times I Cannot Hold It, Even If I'm a Father\"\n\nUniversity student Asumi came to Naruse household to be a housekeeper for his part-time job. The family consists of a single-father and a son Ichika. Among them, the father Naruse is too sexy for Asumi!! Even if he is not gay, Asumi gets conscious of Keiichi, and when he noticed that Keiichi is sexually unsatisfied by noticing him watching adult video in his room, he would unconsciously get tempted to attack him…! \"Naruse-san, you're too sexy for a father with a child...!\"\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1273/97100.webp","source":"Manga","numberOfEpisode":"8","studio":"Magic Bus","type":"TV","score":6.03,"genres":["Shounen Ai","Yaoi"]},{"title":"Marginal Prince: Gekkeiju no Ouji-tachi","synopsis":"\"Marginal Prince\" based off of the hit love simulation game series for girls! Yuta studies abroad in a tiny, far away island in the pacific ocean name Alphonso where he enters the all-dorm, all-male Alphonso Gakuen. However, the school is really a place for the children of the famous . . . and the school specializes in classes on empires and alchemy! And one day, after studying enough at the school, the students become known as \"Marginal Princes\"! Learn about the stories of fate and trial as each of the students studies to become kings!\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/6/27476.webp","source":"Visual novel","numberOfEpisode":"13","studio":null,"type":"TV","score":5.96,"genres":["Romance","School","Shounen Ai"]},{"title":"Robotica*Robotics","synopsis":"What is love? Two robots abandoned by their previous owner are with a new owner, a scientist. A story about the meaning of love.","img":"https://cdn.myanimelist.net/images/anime/7/89081.webp","source":"-","numberOfEpisode":"1","studio":"CoMix Wave Films","type":"OVA","score":6.91,"genres":["Slice of Life","Psychological","Sci-Fi","Shounen Ai"]},{"title":"Sekaiichi Hatsukoi: Propose-hen","synopsis":"When Ritsu Onodera changes jobs, looking for a fresh start, he's not exactly thrilled when his new boss turns out to be his old flame. Ritsu's determined to leave all that in the past—but how can he when his boss is just as determined that they have a future?\n\nTired of accusations that family connections got him his current position, Ritsu Onodera quits his job as an editor at his father's company and transfers to Marukawa Publishing. Once there, he is assigned to the shojo manga editorial department—something he has no interest in and no experience with! Having sworn he'd never fall in love again, the last thing he wants to do is work on love stories. To make matters worse, it turns out that his overbearing boss, Masamune Takano, is actually his first love from high school! \n\n(Source: SuBLime)","img":"https://cdn.myanimelist.net/images/anime/1896/102829.webp","source":"Manga","numberOfEpisode":"?","studio":null,"type":"Movie","score":null,"genres":["Comedy","Drama","Romance","Shounen Ai"]},{"title":"Kaze to Ki no Uta Sanctus: Sei Naru Kana","synopsis":"1887, at a remote, elite boarding school in France: Serge Battour returns after his graduation, and remembers the days of his youth...\n\n1880, at the same school: Son of a viscount and a Roma prostitute (both deceased), Serge is intelligent, sweet, talented, and alienated by his family due to his heritage. Upon being sent to his new school, he rooms with Gilbert Cocteau, a gorgeous loner of a boy who sells his body for reasons unknown. Serge's attempts to reach out to Gilbert fail spectacularly, and yet there is something in both of them that attracts them to each other.","img":"https://cdn.myanimelist.net/images/anime/5/33835.webp","source":"Manga","numberOfEpisode":"1","studio":null,"type":"OVA","score":6.9,"genres":["Drama","Historical","Romance","Shoujo","Shounen Ai"]},{"title":"Legend of Duo","synopsis":"The fate of mankind is doomed in the early 21st century due to losing \"purana,\" an essence of living force supporting all life forms. Not willing to witness the extinction of mankind, a vampire named Duo disclosed the secret of purana to humans, saving the latter from destruction. However, just like Prometheus in Greek mythology got punished for bringing fire to mankind, Duo is punished for breaking the taboo. The vampire sent to punish him is Zieg, Duo's best friend, or, more than the best friend.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/23556.webp","source":"Original","numberOfEpisode":"12","studio":"Marine Entertainment","type":"TV","score":4.97,"genres":["Supernatural","Drama","Vampire","Shounen Ai"]},{"title":"6 Lovers","synopsis":"The July issue of Dear+ has announced that a series of manga serialized in the magazine will get anime adaptations in celebration of the magazine's 20th anniversary. These anime will be collected into an \"in motion\" animation series titled 6 Lovers.","img":"https://cdn.myanimelist.net/images/anime/9/86278.webp","source":"Manga","numberOfEpisode":"?","studio":null,"type":"OVA","score":null,"genres":["Comedy","Drama","Romance","School","Shounen Ai","Slice of Life","Supernatural","Yaoi"]},{"title":"Wei, Kanjian Erduo La!","synopsis":"The cute story of the daily life between a guy and his cat-boy roommate.","img":"https://cdn.myanimelist.net/images/anime/1654/93825.webp","source":"Web manga","numberOfEpisode":"12","studio":"monofilmo","type":"ONA","score":7.23,"genres":["Slice of Life","Comedy","Shounen Ai"]},{"title":"Honoo no Mirage: Minagiwa no Hangyakusha","synopsis":"Takaya was sent to Kyoto to investigate the re-awakening of Ikko sect and Araki Murashige, a member of the Ikko sect who deserted the clan.With the help of his vassal Haruie, Takaya is finally successful in tracing Araki who hunts down a 400-years-old mandala (Buddhist artifact for meditating) that was made of the hair of the deceased Araki clansmen. Unfortunately, by the time they meet, Haruie recognizes Araki as Shintarou, her lover in her past-life. Takaya orders her to eliminate Araki, who is a threat, but will she be able to do it. Furthermore Takaya finally meets Naoe... \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/24778.webp","source":"Light novel","numberOfEpisode":"3","studio":"Madhouse","type":"OVA","score":6.94,"genres":["Action","Romance","Supernatural","Historical","Drama","Shoujo","Shounen Ai"]},{"title":"Boku wa Konomama Kaeranai","synopsis":"It is about Amafuji Ken, who longs to tell his best friend Youshinari Ritsurou how he really feels. In the way of that admission is Ritsurou's girlfriend, Moeko. After dropping out of high school, Ken gets Ritsurou to live with him. The angst begins when Ken sleeps with Moeko to get to Ritsurou.","img":"https://cdn.myanimelist.net/images/anime/1/1216.webp","source":"Manga","numberOfEpisode":"1","studio":"J.C.Staff","type":"OVA","score":5.53,"genres":["Drama","Romance","Shounen Ai"]},{"title":"Earthian","synopsis":"Angels from the planet Eden have been watching Earthians, the inhabitants of Earth, for 5 billion years. Chihaya, an angel with unlucky black hair and wings, is a plus checker who travels to Earth with Kagetsuya, a minus checker. Each team of plus and minus checkers keep track of Earth events and, if the score ever reaches minus 10,000, the Earth will be destroyed. The story follows Chihaya and Kagetsuya and the different people and events they observe on Earth.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/62449.webp","source":"Manga","numberOfEpisode":"4","studio":"J.C.Staff","type":"OVA","score":6.13,"genres":["Drama","Shoujo","Shounen Ai"]},{"title":"Osakana wa Ami no Naka","synopsis":"Osakana wa Ami no Naka is a story based on manga by Nekokichi Ranma about Tsukamoto Yuuji, a young businessman and great swimmer, and Matsui Takahiro, who is still attending school and is also a beginner in swimming.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/2/33631.webp","source":"Manga","numberOfEpisode":"1","studio":"J.C.Staff","type":"OVA","score":5.02,"genres":["Drama","Shounen Ai"]},{"title":"Be-Boy Kidnapp'n Idol","synopsis":"Kazuya is a 16-year-old, popular idol singer who has loads of female fans. Other than rehearse or sign autographs, he plays video games with his friend Akihiko. Akihiko is more violent than sweet toward Kazuya, but he is protective of him despite the many arguments they may get into. Akihiko later on confesses his love to Kazuya.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/2413.webp","source":"Original","numberOfEpisode":"1","studio":"AIC","type":"OVA","score":5.59,"genres":["Drama","Shounen Ai"]},{"title":"Lesson XX","synopsis":"The story of Lesson XX has a sweet feel to it. It revolves around two boys, Shizuka and Sakura who are friends at a coed boarding school. One day, Shizuka happens to notice Sakura’s sheer beauty when he dives in to take a hit from a baseball. After some mixed up thoughts of who Sakura likes, Shizuka tells him he wishes to kiss him as a joke. But Sakura doesn’t care; he still insists that the two kiss under the starry sky. After this incident, Shizuka thinks it’s best for the two to be away from each other, so as to sort out their thoughts and real feelings. A classic shounen ai/yaoi, incorporating love, misunderstanding, violence and somewhat angst with a sweet end to it. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/25994.webp","source":"Novel","numberOfEpisode":"1","studio":null,"type":"OVA","score":6.04,"genres":["Romance","Shounen Ai"]},{"title":"Seikimatsu★Darling","synopsis":"Ogata, a nice and hardworking man, has only one problem... His love for Takasugi, another man. But by telling Takasugi about his feelings, the problem should be gone. Yet another problem arises: Takasugi believes their feelings are too alike and that they therefore can't be together. But who knows what can happen when two men in love go away on a vacation together—both determined to win the seducing game.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/72910.webp","source":"Manga","numberOfEpisode":"1","studio":null,"type":"OVA","score":6.39,"genres":["Comedy","Romance","Drama","Shounen Ai"]},{"title":"Umibe no Étranger","synopsis":"\"There's nothing wrong with liking another guy.\"\nTo be in the arms of the person I love... I thought that was an unattainable dream...\n\nOn an island off the coast of Okinawa, two young men meet on a beach. Shun Hashimoto is gay and aspires to be a novelist. He is interested in Mio Chibana, a somber high school student, and starts to flirt with him. Day by day, the two of them grow closer, but then, suddenly, Mio decides to leave the island.\n\nThree years later, Mio returns and approaches Shun with the words, \"I've thought about it for the past three years. I like you, Shun, even if you're a guy.\" However, when faced with the prospect of finally becoming lovers with Mio, Shun cannot take the first step towards commitment. This is a tantalizing love story about a gay novelist and a younger part-time worker. \n\n(Source: Renta!, edited)","img":"https://cdn.myanimelist.net/images/anime/1611/106774.webp","source":"Manga","numberOfEpisode":"1","studio":"Studio Hibari","type":"Movie","score":null,"genres":["Slice of Life","Romance","Shounen Ai"]},{"title":"Gakuen Heaven: Hamu Hamu Heaven","synopsis":"Specials from the Gakuen Heaven DVDs.","img":"https://cdn.myanimelist.net/images/anime/6/8415.webp","source":"Visual novel","numberOfEpisode":"12","studio":null,"type":"Special","score":6.73,"genres":["Comedy","Drama","Romance","School","Shounen Ai"]},{"title":"Houkago no Shokuinshitsu","synopsis":"Two teachers and their ups and downs of being in love with each other.","img":"https://cdn.myanimelist.net/images/anime/9/89936.webp","source":"Manga","numberOfEpisode":"2","studio":null,"type":"OVA","score":5.16,"genres":["Drama","Romance","Shounen Ai"]},{"title":"Nakedyouth","synopsis":"In Naked Youth Shishido takes us on a journey through the uncertainty and excitement of young love and homoerotic love. These gentle films quiver with sexual tension, which is linked to the natural world: trees reflecting on the surface of a pond, butterflies fluttering in the breeze. ","img":"https://cdn.myanimelist.net/images/anime/6/55301.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"ONA","score":5.94,"genres":["Slice of Life","Sports","Romance","Shounen Ai"]},{"title":"Shiritsu Araiso Koutougakkou Seitokai Shikkoubu","synopsis":"Kubota Makoto and Tokitoh Minoru (characters from Kazuya Minekura's manga Wild Adaptor—though no reference is made to the darker storyline of WA in this light-hearted anime)—are the muscle of their high school's all-powerful student council. They defend the student body from disorder—generated by both humans and demons—while avoiding their classes.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/31701.webp","source":"Manga","numberOfEpisode":"2","studio":"Nippon Animation","type":"OVA","score":6.47,"genres":["Comedy","Sports","Shounen Ai"]},{"title":"Kimera","synopsis":"Strange \"lifepods\" have crashed in the western mountains, bringing with them supernatural beings previously found only in the realm of folk-lore and fantasy. Vampires walk the Earth, at war with Humanity and each other, driven by the most terrifying of genetic imperatives. Like wasps seeking a spider, they have come to this planet for only one purpose: to perpetuate their species.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/3460.webp","source":"Manga","numberOfEpisode":"1","studio":null,"type":"OVA","score":5.17,"genres":["Action","Sci-Fi","Horror","Supernatural","Vampire","Shounen Ai"]},{"title":"Caramel Honey","synopsis":"Ayato transfers into a new school hoping for a fresh start.\nSadly for him, the school turns up to be filled with delinquents, and the most feared of them all has his eye set on him.\nAnd it doesn't help, that whenever Ayato accidentally takes off his glasses, everyone around him suddenly becomes completely smitten by him.\n\n(Source: MU)\n","img":"https://cdn.myanimelist.net/images/anime/1593/93166.webp","source":"Manga","numberOfEpisode":"30","studio":null,"type":"ONA","score":6.84,"genres":["Comedy","School","Shounen Ai"]},{"title":"Patalliro!","synopsis":"Patarillo! is set in a society much like ours in most ways, with one decided twist. The manga on which it is based is one of the much-read works produced for adolescent Japanese girls that features a healthy proportion of gay men and beautiful teenagers aka bishounen (beautiful boys). Most of the action takes place in Marinera, the land of eternal spring, located somewhere in the South Seas. The country is a major producer of diamonds; they provide much of the basis of conflict in the anime series. They come from one of the most prolific mines in the world, owned by the king of Marinera, the vertically challenged but horizontally endowed boy-king Patarillo himself. The International Diamond Syndicate - a huge semi- criminal organization/ secret society dedicated to taking over the world`s entire diamond supply- wants that mine and will stop at nothing to get it. In the early episodes they send off a number of bishounen assassins to do in Patarillo, which necessitates his having a bodyguard, the English MI6 agent, Major Jack (`Bishounen-Killer`) Bancoran. Bancoran`s nickname doesn`t mean he shoots bishounen in cold blood. The soubriquet comes from the fact that no male under the age of 17 can resist his sexual fascination. This, to Bancoran`s eternal disgust, includes Patarillo himself. The action switches often from Marinera to MI6 headquarters in London (London seems to be an easy two hour`s flight from the South Seas) or Bancoran`s palatial condo in the suburbs of same. (MI6, be it noted, looks a lot like Fritz Lang`s Metropolis, while Jack`s `apartment` bears a passing resemblance to Randolph Hearst`s spread.) The action also goes into the past and future and out into space. Patarillo evidently gets around.\n\n(Source: aestheticism.com)","img":"https://cdn.myanimelist.net/images/anime/2/56443.webp","source":"Manga","numberOfEpisode":"49","studio":"Toei Animation","type":"TV","score":7.33,"genres":["Adventure","Comedy","Romance","Shoujo","Shounen Ai"]},{"title":"Di Wang Gong Lue","synopsis":"Chu Yuan is at the palace courtroom while Duan Baiyue is at the Southwest. Everyone believes they’re in opposition to each other, but turns out that may not be the case. Chu Yuan needs to become a good Emperor, and Duan Baiyue will be his best assistant.\n\n(Source: Frozen Fruit Subs)","img":"https://cdn.myanimelist.net/images/anime/1695/91321.webp","source":"Novel","numberOfEpisode":"20","studio":null,"type":"ONA","score":6.48,"genres":["Adventure","Mystery","Historical","Drama","Martial Arts","Shounen Ai"]},{"title":"Koisuru Shirokuma","synopsis":"A polar bear falls in love with an earless seal, and he wants nothing else except to protect him, even though the seal constantly thinks the bear will eat him.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/84270.webp","source":"Manga","numberOfEpisode":"?","studio":"Gathering","type":"Movie","score":6.85,"genres":["Comedy","Josei","Shounen Ai"]},{"title":"Bronze: Kouji Nanjo Cathexis","synopsis":"A 30-minute OVA composed of five Koji Nanjo music videos, featuring never-seen scenes between Takuto and him, with an original art gallery by Minami Ozaki at the end.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/73228.webp","source":"Manga","numberOfEpisode":"1","studio":"Madhouse","type":"OVA","score":6.31,"genres":["Music","Shounen Ai"]},{"title":"Wei, Kanjian Erduo La! 2","synopsis":"Second season of Wei, Kanjian Erduo La!.","img":"https://cdn.myanimelist.net/images/anime/1309/99419.webp","source":"Web manga","numberOfEpisode":"12","studio":"monofilmo","type":"ONA","score":7.33,"genres":["Slice of Life","Comedy","Shounen Ai"]},{"title":"Natsu e no Tobira","synopsis":"Marion is a young schoolboy who prides himself on his adherence to a philosophy he calls \"rationalism\". Because of his disdain for emotional display, he ignores anything remotely akin to affection. But when he's entangled in a romantic affair with an older courtesan, his rationalism is revealed to be little more than a cover for his own emotional immaturity. Learning to love, Marion blossoms under his older lover's care but unfortunately, Marion has yet to learn the true price of the affair.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/3592.webp","source":"Manga","numberOfEpisode":"1","studio":"Madhouse","type":"Movie","score":6.11,"genres":["Drama","Romance","Shoujo","Shounen Ai"]},{"title":"Kusatta Kyoushi no Houteishiki","synopsis":"Atsushi Arisawa enrolls at Jougaouka High School to be near Masami Shibata (Ma-chan) who was his childhood crush. Unbeknownst to Atsushi, however, Masami no longer works at the school and his brother, Masayoshi is now the nurse. Atsushi mistakes Masayoshi for Masami and is horrified because to him, it appears that Masami's personality has done a complete 180. Add to the fact that Atsushi's friend, Kouji Inagaki is totally in love and constantly trying to make-out with him, Atsushi's life at Jougaoka is hell..until he starts thinking that maybe the new Ma-chan isn't so bad afterall and that, maybe he actually likes the way Ma-chan is now. Until of course, he finds out that Masayoshi isn't Masami. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/49929.webp","source":"Manga","numberOfEpisode":"2","studio":"J.C.Staff","type":"OVA","score":6.14,"genres":["Comedy","Romance","Shounen Ai"]},{"title":"Gakuen Handsome The Animation","synopsis":"The school love story is set at Baramon High School, a private boys' school for the prefecture's most elite. The protagonist is a seventeen year old boy who transfers into the school and meets various major players on campus, such as the outlaw teacher, the soccer captain, and a childhood friend whom the protagonist has not seen for seven years. The school presents opportunities for friendship, love and conflict, and changes are now bound to happen in the main character's life.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/76861.webp","source":"Visual novel","numberOfEpisode":"1","studio":null,"type":"OVA","score":6.42,"genres":["Comedy","Parody","School","Shounen Ai"]},{"title":"Ryokunohara Meikyuu","synopsis":"Hiroki and Kanata have been together since they were children. One day Hiroki is caught up in an accident while trying to save a little girl. The next thing he knows, he is looking down on his own body. Seperated from his body, Kanata, and everything else, he tries to figure out just what is going on.\n\nWhy is he outside his body which is living on as if nothing has changed, how can he convince Kanata that he is there, and who is the strange girl, Fhalei, who keeps appearing for him?\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/73807.webp","source":"Manga","numberOfEpisode":"1","studio":"AIC","type":"OVA","score":5.17,"genres":["Dementia","Psychological","Drama","Romance","Shoujo","Shounen Ai"]},{"title":"Patalliro Saiyuuki!","synopsis":"Genjou Sanzou is a Buddhist monk who has been sent by the Emperor on a journey to find the sacred Buddhist scriptures. One day, Sanzou meets an Earth Deity who tells him that Buddha has sent him a disciple: the mischievous Monkey Deity Son Goku, who was sealed inside of a mountain for five hundred years after wreaking havoc in Heaven! Together with the alcohol-loving playboy Cho Hakkai; the heavenly army General Sagojyou; and their horse, the Dragon Crown Prince Ryuuba; there are plenty of adventures to be had from fighting off monsters to bishounen contests.\n\n(Source: ANN and AniDB)","img":"https://cdn.myanimelist.net/images/anime/6/3887.webp","source":"-","numberOfEpisode":"26","studio":"Magic Bus","type":"TV","score":6.68,"genres":["Adventure","Comedy","Fantasy","Shoujo","Shounen Ai"]},{"title":"Mo Ri Shu Guang","synopsis":"In the year of 2013, the tide of zombies outbreak exploded in everyone's homeland, humanity launches a large-scale battle in the endless nights awaiting for the arrival of the dawn.\n\nThe end is approaching, is there going to be a way out for them? \nTheir faiths were shattered into pieces and buried in ashes in the raging fire. But within the blazing fire, a newborn hope arise once again.\n\n(Source: polarbearadise)","img":"https://cdn.myanimelist.net/images/anime/1939/90507.webp","source":"Novel","numberOfEpisode":"20","studio":null,"type":"ONA","score":6.31,"genres":["Action","Horror","Psychological","Supernatural","Thriller","Shounen Ai"]},{"title":"Xiao Lu He Xiao Lan","synopsis":"\"I've been holding a few words back for a long time — I like you!\"\n\"Beryl and Sapphire\" is a popular manhua created by artist Ocarina. Here includes protagonists with the most random names in history  — the mild-mannered Beryl (Green) and the easily-embarrassed Sapphire (Blue). At times the closest of friends, at others the worst of enemies… In this donghua where each episode is set in a different world, how would they encounter each other time and again?? Only angst? Too painful! Nothing but fluff? Too sugary! Come watch B&amp;S, the show where you'll never guess the ending…\n\n(Source: Guodong Subs)","img":"https://cdn.myanimelist.net/images/anime/1670/93590.webp","source":"-","numberOfEpisode":"72","studio":"Haoliners Animation League","type":"ONA","score":7.65,"genres":["Game","Sci-Fi","Slice of Life","Comedy","Drama","Magic","School","Shounen Ai"]},{"title":"Jie Yao","synopsis":"Cheng Ke quit his original job in pursuit of art, and did not know Jiang Yu. He also became his tenant and started a new life. The strangers in these two different fields of work started to conflict, from mutual rejection to mutual understanding. Through hard work and struggle, they each achieved success and moved towards a better future.\n\n(Source: bilibili.com)","img":"https://cdn.myanimelist.net/images/anime/1579/105384.webp","source":"Light novel","numberOfEpisode":"13","studio":"Seven Stone Entertainment","type":"ONA","score":6.89,"genres":["Slice of Life","Comedy","Shounen Ai"]},{"title":"Suki na Mono wa Suki Dakara Shou ga Nai!!: Onsen ni Ikou!","synopsis":"A bonus DVD only episode where the boys go to a hot spring.","img":"https://cdn.myanimelist.net/images/anime/8/78436.webp","source":"Visual novel","numberOfEpisode":"1","studio":"Zexcs","type":"Special","score":6.41,"genres":["Comedy","School","Shoujo","Shounen Ai","Slice of Life"]},{"title":"Yes ka No ka Hanbun ka","synopsis":"Kunieda Kei is a popular, young TV announcer whose public and private personas are so different, they might be called extreme. On the outside, he is the picture of perfection, affectionately nicknamed \"The Prince,\" while on the inside he is constantly cursing at all of the incompetence around him. Of course, no one knows this secret of his.\n\nOne day, Kei meets animation artist Tsuzuki Ushio for a work assignment. While Kei is in \"inside mode,\" he later runs into Tsuzuki, who doesn't recognize him in his worn-out sweats and a facemask, but as compensation for injuring Tsuzuki's arm, Kei gets roped into helping out with his work.\n\n(Source: Novel Updates, edited)","img":"https://cdn.myanimelist.net/images/anime/1530/103927.webp","source":"Light novel","numberOfEpisode":"1","studio":"Lesprit","type":"Movie","score":null,"genres":["Drama","Shounen Ai"]},{"title":"Taishou Mebiusline: Chicchai-san - You and I","synopsis":"Special episode of Taishou Mebiusline: Chicchai-san.","img":"https://cdn.myanimelist.net/images/anime/1405/90826.webp","source":"Visual novel","numberOfEpisode":"1","studio":"Studio A-CAT","type":"Special","score":5.01,"genres":["Historical","Shounen Ai"]},{"title":"Xian Yue Meng Ying","synopsis":"An OVA currently in production, planned to be released on DVD in China. On August 28, 2010, a promotional video was released advertising the project. In April 2015, the script was announced as complete, and the early stages of animation had begun.","img":"https://cdn.myanimelist.net/images/anime/11/80015.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"OVA","score":null,"genres":["Action","Shounen Ai","Supernatural"]},{"title":"Saezuru Tori wa Habatakanai: Don't Stay Gold","synopsis":"Anime adaptation of the short story Don't Stay Gold, to be included in volume 7 of the manga.","img":"https://cdn.myanimelist.net/images/anime/1087/106064.webp","source":"Manga","numberOfEpisode":"1","studio":"GRIZZLY","type":"OVA","score":null,"genres":["Drama","Shounen Ai"]},{"title":"Gakuen Handsome Special","synopsis":"Unaired episode 12.5 included with the Blu-ray Disc/DVD release. ","img":"https://cdn.myanimelist.net/images/anime/2/80453.webp","source":"Game","numberOfEpisode":"1","studio":"Team YokkyuFuman","type":"Special","score":5.76,"genres":["Comedy","Parody","School","Shounen Ai"]},{"title":"Marginal Prince: Gekkeiju no Ouji-tachi - Tokyo Merry-Go-Round","synopsis":"Keita and the other Marginal Prince are away from St. Alphonso Academy and meet each other in the city, where they meet Keita's sister.\n\nExtra episode released with the 7th DVD volume.","img":"https://cdn.myanimelist.net/images/anime/13/50039.webp","source":"Visual novel","numberOfEpisode":"1","studio":null,"type":"Special","score":6.1,"genres":["Romance","School","Shounen Ai"]},{"title":"Patalliro! Stardust Keikaku","synopsis":"A series of diamond robberies have taken place all over the world. When Malynera's reserves are also emptied, Patalliro and Bancoran head to Japan following a clue in the form of a mechanical spider found on the scene. \n\nHowever, while they're interrogating a suspect, he's assassinated before they manage to get any more information from him than the name of an organization, \"Tarantella\". Furthermore, the assassin seems to be Bancoran's former lover Bjorn, who's supposed to be dead! Is he really alive and involved in the case? Can our heroes find out more about him and the mysterious organization in time to put a stop to their plans? ","img":"https://cdn.myanimelist.net/images/anime/11/35537.webp","source":"Manga","numberOfEpisode":"1","studio":"Toei Animation","type":"Movie","score":6.52,"genres":["Adventure","Comedy","Romance","Shoujo","Shounen Ai"]},{"title":"Kakushin","synopsis":"A musical anime promoting motivation for LGBT teens. The focus of the short is on a young man and his struggling affection towards his male classmates.","img":"https://cdn.myanimelist.net/images/anime/11/88880.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"ONA","score":5.48,"genres":["Music","Shounen Ai"]},{"title":"Honoo no Mirage: Muyou no Michi","synopsis":"Recap of the first four episodes of Honoo no Mirage.","img":"https://cdn.myanimelist.net/images/anime/1837/102586.webp","source":"Light novel","numberOfEpisode":"1","studio":"Madhouse","type":"Special","score":null,"genres":["Action","Historical","Supernatural","Drama","Romance","School","Shounen Ai"]},{"title":"Patalliro Saiyuuki! Special","synopsis":"Unaired episode 27 of Patalliro Saiyuuki! that was included in the 5th DVD volume.","img":"https://cdn.myanimelist.net/images/anime/4/58917.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"Special","score":null,"genres":["Adventure","Comedy","Fantasy","Shoujo","Shounen Ai"]}]