[{"title":"Kyuuketsuki","synopsis":"The vampire. A legendary creature that lives in the shadows and preys on humanity.\n\nOnohara Mikage is an unfortunate girl who sold herself to a clan of vampires to pay off her parents' debt. What has the clan head, Claude, prepared for her? Will she be able to pay herself off and obtain her freedom?","img":"https://cdn.myanimelist.net/images/anime/1314/104171.webp","source":"Visual novel","numberOfEpisode":"2","studio":null,"type":"OVA","score":5.98,"genres":["Hentai","Vampire"]},{"title":"Tokimeki Tonight","synopsis":"The main character, Ranze, is a junior high girl with troubles: her father is a vampire and her mother is a werewolf. Ranze has yet to manifest her supernatural powers, and her parents are beginning to get worried she might be normal. So begins the fantasy romantic comedy story.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/41441.webp","source":"Manga","numberOfEpisode":"34","studio":"Group TAC","type":"TV","score":7.23,"genres":["Comedy","Fantasy","Romance","Shoujo","Vampire"]},{"title":"Itsuka Tenma no Kuro Usagi Picture Drama","synopsis":"Picture Dramas from the Blu-ray disks.\n\nEpisodes:\n1 - Let's Just Do It Radio!\n2 - Each One's Breakfast \n3 - Himea's Guitar Lesson\n4 - Each One's Bath Time\n5 - Traditional Feeling\n6 - Izumi-chan's What If Series","img":"https://cdn.myanimelist.net/images/anime/5/35285.webp","source":"Light novel","numberOfEpisode":"6","studio":"Zexcs","type":"Special","score":6.2,"genres":["Comedy","Ecchi","Romance","Shounen","Supernatural","Vampire"]},{"title":"Tenshi ni Narumon!","synopsis":"Yuusuke was just a normal kid going to high school. Then one day, the cute and behaloed Noelle fell, quite literally, into his life, naked as a baby and every bit as innocent. Before he can even fathom what's just happened, Yuusuke is inducted into a rather odd family of otherworldly beings. \n\nPapa is a Frankenstein monster with a taste for calisthenics. Mama is a gorgeous lady with a penchant for \"round objects\" -- really! The eldest sister, Sara, is literally invisible; the brother, Gabriel, is a teenage vampire with an attitude problem; and the youngest sister, Ruka, loves inventing things. There's a disapproving Grandma, who's a witch to the nth degree, and her vulture familiar. All Yuusuke wanted was for the beautiful Natsumi to even notice his attention, but now he has an angel-in-training to follow him wherever he goes. And Noelle, too, has a guide on her path to being an angel, the mysterious Michael.\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/1671/94180.webp","source":"Original","numberOfEpisode":"26","studio":"Studio Pierrot","type":"TV","score":6.74,"genres":["Comedy","Romance","Vampire","Fantasy"]},{"title":"Vlad Love","synopsis":"Mitsugu Bamba is a high school girl who finds meaning in donating blood. She frequently visits a blood bank to donate blood, despite being harshly treated by the nurse. One day, she encounters a beautiful girl who looks like she's from overseas at the blood bank. The pale girl looks like she's about to faint any minute, but then, she starts destroying the blood bank. The girl loses consciousness and Mitsugu takes her home... \n\n(Source: Official Website)","img":"https://cdn.myanimelist.net/images/anime/1664/106310.webp","source":"Original","numberOfEpisode":"12","studio":"Drive","type":"TV","score":null,"genres":["Comedy","Supernatural","Vampire","School"]},{"title":"Kimera","synopsis":"Strange \"lifepods\" have crashed in the western mountains, bringing with them supernatural beings previously found only in the realm of folk-lore and fantasy. Vampires walk the Earth, at war with Humanity and each other, driven by the most terrifying of genetic imperatives. Like wasps seeking a spider, they have come to this planet for only one purpose: to perpetuate their species.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/3460.webp","source":"Manga","numberOfEpisode":"1","studio":null,"type":"OVA","score":5.17,"genres":["Action","Sci-Fi","Horror","Supernatural","Vampire","Shounen Ai"]},{"title":"Yichang Shengwu Jianwenlu","synopsis":"Yoshihito, a 23-year-old man who has no job or girlfriend. In order to make ends meet he rents out one of the rooms in his house. While he's showing Lily, his first tenant, around the house, she's suddenly attacked by a vampire named Vivian, and Yoshihito notices that Lily is actually a werewolf. As Yoshihito and Lily start living in the same house, Yoshihito is scouted for an organization that maintains order of the parallel universes, and strange creatures one after another become tenants in his house.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1523/101986.webp","source":"Novel","numberOfEpisode":"13","studio":null,"type":"ONA","score":6.4,"genres":["Supernatural","Vampire"]},{"title":"Vampire","synopsis":"Yuuto Akiyama, a butler with ancient powers, begins serving a household of busty vampires! Yuuto must satisfy these women, and figure out the secret of the strange house.\n","img":"https://cdn.myanimelist.net/images/anime/10/74613.webp","source":"Original","numberOfEpisode":"2","studio":"Y.O.U.C","type":"OVA","score":6.6,"genres":["Hentai","Supernatural","Vampire"]},{"title":"Master Mosquiton","synopsis":"In the 1920's, Inaho resurrects a vampire named Mosquiton with her blood. He awakens and becomes her slave. Now, Inaho is after the O-Part, which will grant her immortality. However, a bunch of supernatural monsters are out to stop them from achieving their goal.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/15445.webp","source":"Manga","numberOfEpisode":"6","studio":null,"type":"OVA","score":6.73,"genres":["Action","Adventure","Comedy","Demons","Supernatural","Vampire"]},{"title":"Yuugen Kaisha","synopsis":"In a country where companies are categorized into many subdivisions and corporations, only one of them is a ghost corp—the Phantom quest corp. When otherworldly supernatural phenomenon threatens the city and its populace, Ayaka Kisaragi and her employees are on the job to fight any and all supernatural menace.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1932/96386.webp","source":"Original","numberOfEpisode":"4","studio":"Madhouse","type":"OVA","score":6.5,"genres":["Action","Adventure","Comedy","Super Power","Supernatural","Magic","Vampire"]},{"title":"Master Mosquiton '99","synopsis":"Catholic schoolgirl Inaho discovers that a vampire, Mosquiton, is feeding off of her classmates. So she stakes him, but he is revived after her blood comes in contact with the his remains. Mosquiton becomes her slave and also a history teacher. Together, along with Yuuki and Honou, the unlikely duo have many escapades and adventures. One of Inaho's main goals is to find the mythical O-Part to make some money!\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/1/1806.webp","source":"Manga","numberOfEpisode":"26","studio":null,"type":"TV","score":6.55,"genres":["Action","Adventure","Comedy","Supernatural","Vampire"]},{"title":"Vampire Sensou","synopsis":"The rural American west is the setting for this OVA, in which a bizarre and brutal attack on a NASA base in Arizona attracts the attention of a French secret service agent, Monsieur Lassar, when a dead CIA agent is found floating on the Seine in Paris. Lassar is convinced that these two events are related, and sets out to prove it. His investigation leads him to film star Lamia Vindaw and a vampire cult that may be far more vicious and dangerous than its eccentric exterior makes it seem.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1341/96594.webp","source":"-","numberOfEpisode":"1","studio":"Toei Animation","type":"OVA","score":4.71,"genres":["Super Power","Supernatural","Vampire"]},{"title":"Gregory Horror Show","synopsis":"The first series is a set of 25 stories about a male businessman arriving at the hotel after taking a train home from work. He encounters the mysterious owner of the hotel, an old mouse known as Gregory, who suggests that he stay a while. Soon, the man becomes drawn into a bizarre series of events taking place within Gregory House as he tries desperately to escape from this bizarre purgatory.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/5/13265.webp","source":"Original","numberOfEpisode":"25","studio":"Milky Cartoon","type":"TV","score":6.62,"genres":["Mystery","Comedy","Horror","Demons","Supernatural","Vampire"]},{"title":"Hipira-kun","synopsis":"In the city of Salta, a place where the sun never shines, a community of vampires lives. Hipira is a little vampire who lives the life of a typical boy, attending school and dealing with bullies along the way. However, he also has a soft spot for exploring, playing pranks on others and having grand adventures! Whether he's befriending a human soul, scaring his neighbours by pretending day has come or encountering giant frogs and aliens, Hipira is always getting himself into and out of trouble.","img":"https://cdn.myanimelist.net/images/anime/13/46765.webp","source":"Picture book","numberOfEpisode":"10","studio":"Sunrise","type":"TV","score":6.16,"genres":["Comedy","Fantasy","Kids","Supernatural","Vampire"]},{"title":"Keishichou Tokumubu Tokushu Kyouakuhan Taisakushitsu Dainanaka: Tokunana OVA","synopsis":"The OVA will be focus on when Kujaku Nijou first entering group, which occurs one year before the main anime begins.","img":"https://cdn.myanimelist.net/images/anime/1417/104653.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"OVA","score":6.04,"genres":["Action","Police","Vampire","Fantasy"]},{"title":"Yami no Teio: Kyuuketsuki Dracula","synopsis":"On a seemingly normal night in Boston, a satanic ritual is taking place: a bride is to be offered up as a sacrifice. However, Dracula, the King of Vampires, swoops in and steals her, with the intent of depriving the woman of both her blood and her life. And yet, despite his earlier motives for abducting the bride, Dracula is astonished by her beauty and decides to keep the woman as his wife. \n\nHe and Domini, his spouse, lead a fruitful life together, bearing a healthy son by the name of Janus, with Dracula's crime against Satan fading from memory. On the other hand, Satan hasn't forgiven him for stealing his rightful bride and is plotting to ruin his happiness when the time is right. Another group, the Vampire Hunters, similarly wish to destroy Dracula as vengeance for the souls he has taken to feed himself. \n\nNow carrying the burden of a family, Dracula must protect himself from Satan's plots as well as from the vengeful Vampire Hunters in a desperate fight for survival and forbidden love.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/6763.webp","source":"Other","numberOfEpisode":"1","studio":"Toei Animation","type":"Special","score":3.92,"genres":["Vampire"]},{"title":"Mars Red","synopsis":"Mars Red takes place in 1923, and vampires have existed for quite a while. But now, the number of vampires is increasing and a mysterious, artificial blood source called Ascra has appeared.\n\nThe Japanese government, in turn, creates \"Code Zero,\" an unit within the army tasked with taking down the vampiric forces. And what better way to track vampires than by using vampires?\n\nCreated by Lieutenant General Nakajima, this unit has historically been in the business of information war, but has been re-assigned to solve the vampire crisis. \n\n(Source: Funimation, edited)","img":"https://cdn.myanimelist.net/images/anime/1088/105889.webp","source":"Other","numberOfEpisode":"?","studio":"Signal.MD","type":"TV","score":null,"genres":["Action","Military","Historical","Supernatural","Vampire"]},{"title":"Tezuka Osamu no Don Dracula","synopsis":"After living in Transylvania for several years, \"Earl Dracula\" (as Osamu Tezuka's official website calls him in English) has moved to Japan. In the Nerima Ward of Tokyo, he and his daughter, Chocola, and faithful servant Igor have taken up residence in an old-Western style house.\n\nWhile Chocola attends Junior High School, Earl Dracula is desperate to drink the blood of beautiful virgin women; an appropriate meal for a vampire of his stature. However, each night that Earl Dracula goes out on the prowl he finds himself getting involved in some kind of disturbance which leads to him causing various trouble for the local residents. With nobody in Japan believing in vampires, his very presence causes trouble amongst the people in town.","img":"https://cdn.myanimelist.net/images/anime/7/15129.webp","source":"Manga","numberOfEpisode":"8","studio":null,"type":"TV","score":6.14,"genres":["Comedy","Horror","Supernatural","Vampire"]},{"title":"Murder","synopsis":"Short animated film by acclaimed multi-talented artist Makoto Wada.","img":"https://cdn.myanimelist.net/images/anime/3/6634.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.46,"genres":["Parody","Mystery","Vampire"]},{"title":"Keishichou Tokumubu Tokushu Kyouakuhan Taisakushitsu Dainanaka: Tokunana Recap","synopsis":"Recap of first eight episodes of Keishichou Tokumubu Tokushu Kyouakuhan Taisakushitsu Dainanaka: Tokunana.","img":"https://cdn.myanimelist.net/images/anime/1490/104552.webp","source":"Original","numberOfEpisode":"1","studio":"Anima&amp;Co.","type":"Special","score":5.7,"genres":["Action","Fantasy","Police","Vampire"]},{"title":"Vie Durant","synopsis":"The Antarctic thaws and it is an era when most of the land has been submerged in water. The extinction of Mankind already draws near. Mankind who were born from Adam and Eve, were now deteriorating as they repeatedly get cloned from generation to generation. Things essential for the survival of living things were lost.\n\nEven so, the ones remaining cling on to survive...\n\n\"We should get what we need for survival from something else...!\"\n\nAnd so, a mere small group of humans began a new life upon the surface of water, exhausting the resources of each and every other living thing to survive. In the end, they discover people who posess a huge quantity of things necessary for survival.\n\nThe young men who posessed such things continues their journey even today, to escape from those who were pursuing them. They just wanted to find that something somewhere. They were seeking for the one and only \"help\" there was... \n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/7/24039.webp","source":"Original","numberOfEpisode":"8","studio":"Marine Entertainment","type":"ONA","score":5.03,"genres":["Sci-Fi","Drama","Vampire"]},{"title":"Gregory Horror Show: The Second Guest","synopsis":"The second series, The Second Guest is similarly set with 25 stories, except this time the main victim is a woman who has just taken a taxi home from her best friend's wedding ceremony.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/3/35057.webp","source":"Original","numberOfEpisode":"25","studio":"Milky Cartoon","type":"TV","score":6.61,"genres":["Mystery","Comedy","Horror","Demons","Supernatural","Vampire"]},{"title":"Zoku Gosenzo San'e","synopsis":"A direct sequel, continuing about nine months after the first season ends. ","img":"https://cdn.myanimelist.net/images/anime/4/21411.webp","source":"Original","numberOfEpisode":"4","studio":null,"type":"OVA","score":5.58,"genres":["Hentai","Vampire"]},{"title":"Gregory Horror Show: The Last Train","synopsis":"The third series, The Last Train is set with 26 stories during a bizarre train ride that Gregory embarks upon.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/2/35059.webp","source":"Original","numberOfEpisode":"26","studio":"Milky Cartoon","type":"TV","score":6.38,"genres":["Mystery","Comedy","Horror","Demons","Supernatural","Vampire"]},{"title":"Forsaken","synopsis":"The song tells of a person who is visited at night by a vampiress. While the man thinks he is being shown \"beautiful things\", in reality he is having his blood sucked by the vampiress.\n\nMusic video by Dream Theater, produced by Gonzo and directed by Yasufumi Soejima.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/9/32977.webp","source":"Music","numberOfEpisode":"1","studio":"Gonzo","type":"Music","score":5.76,"genres":["Music","Vampire"]},{"title":"Vampiyan Kids: Pilot","synopsis":"A young boy ends up at a castle belonging to a vampire and his daughter.","img":"https://cdn.myanimelist.net/images/anime/6/8386.webp","source":"Original","numberOfEpisode":"1","studio":"Production I.G","type":"Special","score":6.16,"genres":["Action","Comedy","Kids","Vampire"]},{"title":"Gregory Horror Show: The Bloody Karte","synopsis":"The fourth series, The Bloody Karte (presented as a side series on the DVDs) is a set of 12 stories about Catherine working in a mysterious hospital.  \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/5/35061.webp","source":"Original","numberOfEpisode":"12","studio":"Milky Cartoon","type":"Special","score":5.77,"genres":["Mystery","Comedy","Horror","Demons","Supernatural","Vampire"]},{"title":"Hipira-kun ONA","synopsis":"The phone-only episodes 11 &amp; 12 of Hipira-kun.","img":"https://cdn.myanimelist.net/images/anime/11/59993.webp","source":"-","numberOfEpisode":"2","studio":"Sunrise","type":"ONA","score":5.75,"genres":["Comedy","Fantasy","Kids","Supernatural","Vampire"]},{"title":"Higanjima X","synopsis":"Akira is in the midst of the final battle between the human race and vampires. He only has 47 days until Japan is turned into an island of vampires.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/82352.webp","source":"Manga","numberOfEpisode":"12","studio":null,"type":"ONA","score":null,"genres":["Horror","Vampire","Fantasy","Seinen"]},{"title":"Vampire in the Garden","synopsis":"Two girls, Momo and Fine, from different backgrounds who meet by chance. A story about an unlikely friendship between the human and vampire race that intertwines with the power of music.\n\n(Source: Netflix)","img":"https://cdn.myanimelist.net/images/qm_50.gif","source":"Original","numberOfEpisode":"?","studio":"Wit Studio","type":"ONA","score":null,"genres":["Vampire"]},{"title":"Dracula no Uta","synopsis":"An imaginative take on Dracula is shown in this musical video from the Minna no Uta franchise.","img":"https://cdn.myanimelist.net/images/anime/8/57523.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Music","score":4.8,"genres":["Kids","Music","Vampire"]},{"title":"Tokimeki Tonight Recaps","synopsis":"Recaps of some episodes from the TV series. Includes new humorous sketches called \"Tokimeki a la Carte\".","img":"https://cdn.myanimelist.net/images/anime/13/29257.webp","source":"-","numberOfEpisode":"2","studio":null,"type":"Special","score":6.29,"genres":["Comedy","Fantasy","Romance","Shoujo","Vampire"]},{"title":"Hipira-kun Special","synopsis":"Last episode of Hipira-kun bundled with the DVD/Blu-ray release.","img":"https://cdn.myanimelist.net/images/anime/9/59991.webp","source":"-","numberOfEpisode":"1","studio":"Sunrise","type":"Special","score":5.79,"genres":["Comedy","Fantasy","Kids","Supernatural","Vampire"]},{"title":"Answer","synopsis":"A music video for \"Answer\", a song by Red Dracul Scar Tissue and Jazztronik.","img":"https://cdn.myanimelist.net/images/anime/7/78630.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Music","score":5.28,"genres":["Music","Supernatural","Vampire"]},{"title":"Urmă (Zanzou)","synopsis":"A music video for Red Dracul Scar Tissue's song \"Urmă (Zanzou)\".","img":"https://cdn.myanimelist.net/images/anime/7/78631.webp","source":"Music","numberOfEpisode":"1","studio":null,"type":"Music","score":5.2,"genres":["Music","Supernatural","Vampire"]},{"title":"Higanjima X: Aniki","synopsis":"A new episode of Higanjima X that was included in Blu-ray.","img":"https://cdn.myanimelist.net/images/anime/6/88803.webp","source":"Manga","numberOfEpisode":"1","studio":null,"type":"Special","score":null,"genres":["Fantasy","Horror","Seinen","Vampire"]},{"title":"Kyuuketsuki Sugu Shinu","synopsis":"Vampires are said to have many weaknesses such as garlic, crosses, and sunlight. Game-loving vampire lord Draluc just so happens to be weak to... everything. He dies, turning into a pile of ash, at the slightest shock.\n\nAfter Vampire Hunter Ronaldo learned of a castle inhabited by a vampire rumoured to have kidnapped a kid, he went there intending to take the devil down. However, the vampire turned out to be Draluc, a wimp who keeps turning into ash at the smallest things. Moreover, the kid wasn't being held captive—he was just using the \"haunted house\" as his personal playground!\n\nWhen his castle is destroyed, Draluc moves into Ronaldo's office, much to the other's chagrin. Despite their differences, they must try to work together to defend themselves from rogue vampires, Ronaldo's murderous editor, investigators, and more—with Draluc dying continuously along the way. \n\n(Source: MU, amended)","img":"https://cdn.myanimelist.net/images/anime/1559/107297.webp","source":"Manga","numberOfEpisode":"?","studio":null,"type":"","score":null,"genres":["Comedy","Supernatural","Vampire","Shounen"]},{"title":"Bakemonogatari","synopsis":"Koyomi Araragi, a third-year high school student, manages to survive a vampire attack with the help of Meme Oshino, a strange man residing in an abandoned building. Though being saved from vampirism and now a human again, several side effects such as superhuman healing abilities and enhanced vision still remain. Regardless, Araragi tries to live the life of a normal student, with the help of his friend and the class president, Tsubasa Hanekawa.\n\nWhen fellow classmate Hitagi Senjougahara falls down the stairs and is caught by Araragi, the boy realizes that the girl is unnaturally weightless. Despite Senjougahara's protests, Araragi insists he help her, deciding to enlist the aid of Oshino, the very man who had once helped him with his own predicament.\n\nThrough several tales involving demons and gods, Bakemonogatari follows Araragi as he attempts to help those who suffer from supernatural maladies.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/75274.webp","source":"Light novel","numberOfEpisode":"15","studio":"Shaft","type":"TV","score":8.35,"genres":["Romance","Supernatural","Mystery","Vampire"]},{"title":"Owari no Seraph","synopsis":"With the appearance of a mysterious virus that kills everyone above the age of 13, mankind becomes enslaved by previously hidden, power-hungry vampires who emerge in order to subjugate society with the promise of protecting the survivors, in exchange for donations of their blood.\n\nAmong these survivors are Yuuichirou and Mikaela Hyakuya, two young boys who are taken captive from an orphanage, along with other children whom they consider family. Discontent with being treated like livestock under the vampires' cruel reign, Mikaela hatches a rebellious escape plan that is ultimately doomed to fail. The only survivor to come out on the other side is Yuuichirou, who is found by the Moon Demon Company, a military unit dedicated to exterminating the vampires in Japan.\n\nMany years later, now a member of the Japanese Imperial Demon Army, Yuuichirou is determined to take revenge on the creatures that slaughtered his family, but at what cost?\n\nOwari no Seraph is a post-apocalyptic supernatural shounen anime that follows a young man's search for retribution, all the while battling for friendship and loyalty against seemingly impossible odds.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/73474.webp","source":"Manga","numberOfEpisode":"12","studio":"Wit Studio","type":"TV","score":7.54,"genres":["Action","Military","Supernatural","Drama","Vampire","Shounen"]},{"title":"JoJo no Kimyou na Bouken (TV)","synopsis":"In 1868, Dario Brando saves the life of an English nobleman, George Joestar. By taking in Dario's son Dio when the boy becomes fatherless, George hopes to repay the debt he owes to his savior. However Dio, unsatisfied with his station in life, aspires to seize the Joestar house for his own. Wielding an Aztec stone mask with supernatural properties, he sets out to destroy George and his son, Jonathan \"JoJo\" Joestar, and triggers a chain of events that will continue to echo through the years to come.\n\nHalf a century later, in New York City, Jonathan's grandson Joseph Joestar discovers the legacy his grandfather left for him. When an archeological dig unearths the truth behind the stone mask, he realizes that he is the only one who can defeat the Pillar Men, mystical beings of immeasurable power who inadvertently began everything.\n\nAdapted from the first two arcs of Hirohiko Araki's outlandish manga series, JoJo no Kimyou na Bouken follows the many thrilling expeditions of JoJo and his descendants. Whether it's facing off with the evil Dio, or combatting the sinister Pillar Men, there's always plenty of bizarre adventures in store.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/40409.webp","source":"Manga","numberOfEpisode":"26","studio":"David Production","type":"TV","score":8.25,"genres":["Action","Adventure","Supernatural","Vampire","Shounen"]},{"title":"Hellsing Ultimate","synopsis":"There exist creatures of darkness and evil that plague the night, devouring any human unfortunate enough to be caught in their grasp. On the other side is Hellsing, an organization dedicated to destroying these supernatural forces that threaten the very existence of humanity. At its head is Integra Fairbrook Wingates Hellsing, who commands a powerful military and spends her life fighting the undead.\n\nIntegra's vast army, however, pales in comparison with her ultimate weapon: the vampire Alucard, who works against his own kind as an exterminator for Hellsing. With his new vampire servant, Seras Victoria, at his side, Alucard must battle not only monsters, but all those who stand to oppose Hellsing, be they in the guise of good or evil.\n\nIn a battle for mankind's survival, Hellsing Ultimate proves that appearances are not all they may seem, and sometimes the greatest weapon can come in the form of one's worst nightmare.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/7333.webp","source":"Manga","numberOfEpisode":"10","studio":"Graphinica","type":"OVA","score":8.45,"genres":["Action","Military","Horror","Supernatural","Vampire","Seinen"]},{"title":"Kekkai Sensen","synopsis":"Supersonic monkeys, vampires, talking fishmen, and all sorts of different supernatural monsters living alongside humans—this has been part of daily life in Hellsalem's Lot, formerly known as New York City, for some time now. When a gateway between Earth and the Beyond opened three years ago, New Yorkers and creatures from the other dimension alike were trapped in an impenetrable bubble and were forced to live together. Libra is a secret organization composed of eccentrics and superhumans, tasked with keeping order in the city and making sure that chaos doesn't spread to the rest of the world.\n\nPursuing photography as a hobby, Leonardo Watch is living a normal life with his parents and sister. But when he obtains the \"All-seeing Eyes of the Gods\" at the expense of his sister's eyesight, he goes to Hellsalem's Lot in order to help her by finding answers about the mysterious powers he received. He soon runs into Libra, and when Leo unexpectedly joins their ranks, he gets more than what he bargained for. Kekkai Sensen follows Leo's misadventures in the strangest place on Earth with his equally strange comrades—as the ordinary boy unwittingly sees his life take a turn for the extraordinary.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/73559.webp","source":"Manga","numberOfEpisode":"12","studio":"Bones","type":"TV","score":7.69,"genres":["Action","Comedy","Super Power","Supernatural","Vampire","Fantasy","Shounen"]},{"title":"Hellsing","synopsis":"Hellsing, an organization specializing in dealing with supernatural threats, is called in to eliminate a vampire that is turning the villagers of Cheddar into ghouls. To put an end to this, the leader of the organization, Sir Integra Fairbrook Wingates Hellsing, dispatches her most formidable asset: a powerful vampire known as Alucard.\n\nArmed with only a single handgun, Alucard wreaks havoc on the monsters plaguing Cheddar. However, a young police officer, Seras Victoria, gets caught up in the chaos and becomes mortally wounded as a result. Taking pity on the girl, Alucard gives her a choice: die as a human or live on as a vampire. Seras accepts his offer and begins a new life as a member of Hellsing.\n\nThough it was her decision, Seras struggles with the fact that she is no longer human. Nevertheless, she must embrace being a creature of the night soon if she wants to survive on the front lines in the fight between humans and the supernatural.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/19956.webp","source":"Manga","numberOfEpisode":"13","studio":"Gonzo","type":"TV","score":7.53,"genres":["Action","Horror","Supernatural","Vampire","Seinen"]},{"title":"Rosario to Vampire","synopsis":"Youkai Academy is a seemingly normal boarding school, except that its pupils are monsters learning to coexist with humans. All students attend in human form and take normal academic subjects, such as literature, gym, foreign language, and mathematics. However, there is one golden rule at Youkai Academy—all humans found on school grounds are to be executed immediately!\n\nTsukune Aono is an average teenager who is unable to get into any high school because of his bad grades. His parents inadvertently enroll him into Youkai Academy as a last-ditch effort to secure his education. As Tsukune unknowingly enters this new world, he has a run-in with the most attractive girl on campus, Moka Akashiya. Deciding to stay in the perilous realm in order to further his relationship with Moka, he does not realize that beneath her beauty lies a menacing monster—a vampire.\n\nRosario to Vampire is a supernatural school comedy that explores Tsukune's romantic exploits, experiences, and misadventures with a bevy of beautiful but dangerous creatures.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/75242.webp","source":"Manga","numberOfEpisode":"13","studio":"Gonzo","type":"TV","score":6.93,"genres":["Harem","Comedy","Romance","Ecchi","Vampire","Fantasy","School","Shounen"]},{"title":"Blood Lad","synopsis":"Staz Charlie Blood is a powerful vampire who rules the Eastern district of Demon World. According to rumors, he is a bloodthirsty and merciless monster, but in reality, Staz is just an otaku obsessed with Japanese culture and completely uninterested in human blood. Leaving the management of his territory to his underlings, Staz spends his days lazing around, indulging in anime, manga, and games.\n\nWhen Fuyumi Yanagi, a Japanese girl, accidentally wanders through a portal leading into the demon world, Staz is overjoyed. But just as he is starting to feel an unusual attraction to her, his territory is attacked, resulting in Fuyumi's untimely death. She turns into a wandering ghost and the crestfallen Staz vows to resurrect her as this would mean being able to travel to the human world, something he has always dreamed of.\n\nBlood Lad follows Staz and Fuyumi, soon joined by the spatial magician Bell and the half-werewolf Wolf, as they travel to find a magic that can bring humans back to life.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/47677.webp","source":"Manga","numberOfEpisode":"10","studio":"Brain's Base","type":"TV","score":7.41,"genres":["Action","Comedy","Demons","Seinen","Supernatural","Vampire"]},{"title":"Owari no Seraph: Nagoya Kessen-hen","synopsis":"Yuuichirou Hyakuya is finally reunited with his childhood friend Mikaela Hyakuya, whom he had long presumed to be dead. Upon their reunion, however, he discovers that Mikaela has been turned into a vampire. Determined to help his friend, Yuuichirou vows to get stronger so that he can protect Mikaela as well as the comrades in the Moon Demon Company.\n \nKureto Hiiragi receives information that a large group of vampires will be gathering in Nagoya, preparing for their assault on the Imperial Demon Army's main forces in Tokyo. Led by Guren Ichinose, Yuuichirou's team is one of many selected to intercept and eliminate the vampire nobles.\n \nWith the Nagoya mission quickly approaching, the members of Shinoa squad continue to work towards fully mastering their weapons, while learning how to improve their teamwork. Yuuichirou must gain the power he needs to slay the nobles and save his best friend, before he succumbs to the demon of the Cursed Gear.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/76632.webp","source":"Manga","numberOfEpisode":"12","studio":"Wit Studio","type":"TV","score":7.69,"genres":["Action","Military","Supernatural","Drama","Vampire","Shounen"]},{"title":"Strike the Blood","synopsis":"Kojou Akatsuki's days as an ordinary high school student in the Demon District of Itogami Island come to an abrupt end after a fateful encounter leaves him with the remarkable abilities of a vampire.\n\nIt isn't long before he is thrust into the center of attention when it is discovered that he is the fourth primogenitor, an immensely powerful vampire whom most consider to be merely a legend. Fearing Kojou's destructive potential, the Lion King Organization sends in an apprentice sword-shaman, Yukina Himeragi, to monitor, and should he become a threat, kill the boy deemed the world's most powerful vampire. Forced together by circumstance, the two form an unlikely alliance as Kojou comes to terms with his abilities and they both struggle to protect the city from various emerging chaotic forces.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/56163.webp","source":"Light novel","numberOfEpisode":"24","studio":"Connect","type":"TV","score":7.23,"genres":["Action","Harem","Supernatural","Ecchi","Vampire","Fantasy","School"]},{"title":"Monogatari Series: Second Season","synopsis":"Apparitions, oddities, and gods continue to manifest around Koyomi Araragi and his close-knit group of friends: Tsubasa Hanekawa, the group's modest genius; Shinobu Oshino, the resident doughnut-loving vampire; athletic deviant Suruga Kanbaru; bite-happy spirit Mayoi Hachikuji; Koyomi's cutesy stalker Nadeko Sengoku; and Hitagi Senjogahara, the poignant tsundere.\n\nMonogatari Series: Second Season revolves around these individuals and their struggle to overcome the darkness that is rapidly approaching. A new semester has begun and with graduation looming over Araragi, he must quickly decide the paths he will walk, as well as the relationships and friends that he'll save. But as strange events begin to unfold, Araragi is nowhere to be found, and a vicious tiger apparition has appeared in his absence. Hanekawa has become its target, and she must fend for herself—or bow to the creature's perspective on the feebleness of humanity.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/52133.webp","source":"Light novel","numberOfEpisode":"26","studio":"Shaft","type":"TV","score":8.78,"genres":["Mystery","Comedy","Supernatural","Romance","Vampire"]},{"title":"Vampire Knight","synopsis":"The cheerful Yuuki Cross and the gruff Zero Kiryuu are members of the disciplinary committee at Cross Academy, which houses two very distinct classes: the Day Class and the Night Class. Their job consists of upholding order between the classes when they switch out. While that may not seem like an especially difficult task, the Day Class is unaware of the truth behind the Night Class—their utterly gorgeous students are vampires.\n\nTen years ago, Yuuki was saved from a vampire attack by Kaname Kuran, a Pureblood vampire. Now, Kaname is the leader of the Night Class, and Yuuki's disciplinary committee position allows her to see him again, making her feelings for him grow complicated. Meanwhile, Zero bears a white-hot hatred of all vampires and believes they can never live in harmony with humans. But a secret from Zero's past soon threatens the fragile peace of all at the academy, and things may never be the same again.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/3/7327.webp","source":"Manga","numberOfEpisode":"13","studio":"Studio Deen","type":"TV","score":7.14,"genres":["Drama","Mystery","Romance","Shoujo","Supernatural","Vampire"]},{"title":"Shiki","synopsis":"Fifteen-year-old Megumi Shimizu dreamed of a glamorous life in the big city; however, her unexpected death in the quiet village of Sotoba marks the beginning of what appears to be a ferocious epidemic that turns the hot summer into a season of blood and terror. A young doctor named Toshio Ozaki  begins to doubt the nature of the disease and comes to understand that to discover the truth, he must abandon his humanity. Meanwhile, Natsuno Yuuki, an antisocial youth from the city, is haunted by the sudden death of Megumi and must realize the pain of friendship in the face of his own tragedy. Toshio and Natsuno form an unlikely pair as they work together to save Sotoba before it transforms into a ghost town of vampires.\n\nShiki, adapted from the horror novel written by Fuyumi Ono, goes beyond the average vampire story. It tells the tragic tale of survival in a world where one cannot easily distinguish between good and evil. Abandoned by God, the Shiki, as the vampires call themselves, have only their will to live as they clash with the fear of the paranoid/unbelieving villagers. Shiki explores the boundary that separates man from monster.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/21343.webp","source":"Manga","numberOfEpisode":"22","studio":"Daume","type":"TV","score":7.83,"genres":["Horror","Mystery","Supernatural","Thriller","Vampire"]},{"title":"Rosario to Vampire Capu2","synopsis":"It has been one year since Tsukune Aono enrolled at Youkai Academy, and since then his life has taken an interesting turn. In addition to being the only human at a school for monsters, he has attracted a bevy of beautiful women who want him all for themselves: the sexy succubus Kurumu Kurono; Yukari Sendou, a witch; stalker and yuki-onna Mizore Shirayuki; and Moka Akashiya, a kind vampire who, when her rosary is removed, reveals a darker personality.\n\nBut soon, trouble visits Youkai Academy in the form of Moka's younger sister, Kokoa Shuzen. She is furious that her \"true older sister\" is sealed within Moka's rosary, and vows to bring out Moka's darker self. However, Kokoa's thoughtless actions may affect more than just her sister...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/25093.webp","source":"Manga","numberOfEpisode":"13","studio":"Gonzo","type":"TV","score":7.05,"genres":["Comedy","Ecchi","Fantasy","Harem","Romance","School","Vampire"]},{"title":"Kizumonogatari I: Tekketsu-hen","synopsis":"During Koyomi Araragi's second year at Naoetsu Private High School, he has a chance encounter with Tsubasa Hanekawa, the top honor student in his class. When they strike up a conversation, Hanekawa mentions a shocking rumor: a vampire with beautiful blonde hair and freezing cold eyes has been seen lurking around town.\n\nHappy to have made a new friend, Araragi writes off the rumor and goes about the rest of his evening in a carefree manner. However, on his way home, he stumbles across splatters of blood leading down the stairs to the subway. His curiosity pushes him to investigate further, so he follows the gruesome pools into the depths of the station. \n\nWhen he arrives at the source of the blood, he is terrified by what he sees—the rumored blonde vampire herself, completely dismembered. After she calls for his help, Araragi must make a decision, one which carries the potential to change his life forever.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/80621.webp","source":"Light novel","numberOfEpisode":"1","studio":"Shaft","type":"Movie","score":8.42,"genres":["Vampire"]},{"title":"Blood+","synopsis":"Saya Otonashi is a seemingly ordinary girl living a mundane life with her adoptive family in Okinawa City. In fact, her only peculiarities are suffering from anemia and being unable to remember any of her life beyond the previous year.\n\nHowever, Saya's forgotten past quickly comes back to haunt her—one night, she is attacked at school by a creature that feeds on human blood. Just when all hope seems lost, a mysterious man named Haji appears and fends off the creature temporarily. But when her rescuer forces her to drink his blood, Saya suddenly enters a trance and slays the monster with ease, using her own blood as a catalyst. \n\nSaya then learns of an organization named Red Shield, founded for the sole purpose of defeating the hellish beasts. Now Saya and Haji must work together with Red Shield to fight these fearsome monsters and unlock the secrets to the girl's past.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/10183.webp","source":"Original","numberOfEpisode":"50","studio":"Production I.G","type":"TV","score":7.69,"genres":["Action","Military","Mystery","Horror","Supernatural","Drama","Vampire"]},{"title":"Owarimonogatari","synopsis":"A peculiar transfer student named Ougi Oshino has just arrived at Naoetsu Private High School. She is quickly introduced to senior student Koyomi Araragi by their mutual friend Kanbaru Suruga, in hopes of obtaining advice regarding a strange discovery she has made. After taking a look at the school's layout, Ougi notices that a classroom has appeared in an otherwise empty area—a place that should not exist. \n\nUnsure if this is the work of an apparition, Araragi and Ougi attempt to unravel the truth behind this enigma. But Araragi soon discovers, after finding himself locked in with Ougi, that the room holds the memory of an event he had long since forgotten.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/76479.webp","source":"Light novel","numberOfEpisode":"12","studio":"Shaft","type":"TV","score":8.46,"genres":["Mystery","Comedy","Supernatural","Vampire"]},{"title":"Vampire Knight: Guilty","synopsis":"The cheerful Yuuki Cross and the gruff Zero Kiryuu are members of the disciplinary committee at Cross Academy, which houses two very distinct classes: the Day Class and the Night Class. Their job consists of upholding order between the classes when they switch out. While that may not seem like an especially difficult task, the Day Class is unaware of the truth behind the Night Class—their utterly gorgeous students are vampires.\n\nTen years ago, Yuuki was saved from a vampire attack by Kaname Kuran, a Pureblood vampire. Now, Kaname is the leader of the Night Class, and Yuuki's disciplinary committee position allows her to see him again, making her feelings for him grow complicated. Meanwhile, Zero bears a white-hot hatred of all vampires and believes they can never live in harmony with humans. But a secret from Zero's past soon threatens the fragile peace of all at the academy, and things may never be the same again.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/3/10075.webp","source":"Manga","numberOfEpisode":"13","studio":"Studio Deen","type":"TV","score":7.31,"genres":["Drama","Mystery","Romance","Shoujo","Supernatural","Vampire"]},{"title":"Demi-chan wa Kataritai","synopsis":"High school biology teacher Tetsuo Takahashi may look like your average everyday instructor, but beneath his gentle appearance lies something less ordinary: his fascination for the \"Ajin,\" more commonly known as \"Demi.\" Although these half-human, half-monster beings have integrated into human society, Takahashi believes that much about them will remain unknown unless he interacts with them firsthand.\n\nDemi-chan wa Kataritai follows Takahashi's daily life in Shibasaki High School together with his three Demi students—Hikari Takanashi, an energetic vampire; Kyouko Machi, a gentle dullahan; and Yuki Kusakabe, the shy snow woman. Along the way, Takahashi also meets fellow teacher Sakie Satou, a succubus with an aversion towards men. To fulfill his goal of learning more about the Demi, Takahashi decides to conduct casual interviews with the girls to learn more about their abilities, psyche, and interaction with human society. As Takahashi strengthens his bond with his students, he soon discovers that the Demi are not as unusual as he initially believed.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/83417.webp","source":"Manga","numberOfEpisode":"12","studio":"A-1 Pictures","type":"TV","score":7.68,"genres":["Comedy","Vampire","Fantasy","School","Seinen"]},{"title":"Kekkai Sensen &amp; Beyond","synopsis":"Three years ago, a gateway between Earth and the Beyond opened in New York City, trapping extradimensional creatures and humans alike in an impermeable bubble. After the city's restoration, monsters, magic, and madness are common findings in the area now known as Hellsalem's Lot. Leonardo Watch, a young photographer who unwillingly obtained the \"All-seeing Eyes of the Gods\" in exchange for his sister's eyesight, came to this paranormal city to find answers to the mysterious power that he possesses. He later finds his life drastically changed when he joins Libra, a secret organization of people with supernatural abilities dedicated to maintaining order in the everyday chaos of Hellsalem's Lot. \n\nHowever, this is only the beginning of Leonardo's unexpected journey ahead. Regardless of the constant threat of otherworldly enemies, he is determined to uncover the secrets of his power and find a way to restore his sister's eyesight. Kekkai Sensen &amp; Beyond follows Leonardo as he sets off on more crazy adventures with his comrades, fighting to ensure peace and order.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/88282.webp","source":"Manga","numberOfEpisode":"12","studio":"Bones","type":"TV","score":7.96,"genres":["Action","Comedy","Fantasy","Shounen","Super Power","Supernatural","Vampire"]},{"title":"Kizumonogatari III: Reiketsu-hen","synopsis":"After helping revive the legendary vampire Kiss-shot Acerola-orion Heart-under-blade, Koyomi Araragi has become a vampire himself and her servant. Kiss-shot is certain she can turn him back into a human, but only once regaining her full power. \n\nAraragi has hunted down the three vampire hunters that defeated Kiss-shot and retrieved her limbs to return her to full strength. However, now that Araragi has almost accomplished what he’s been fighting for this whole time, he has to consider if this is what he really wants. Once he revives this powerful immortal vampire, there is no telling what she might do, and there would be no way of stopping her.\n\nBut there is more to the story that Araragi doesn’t understand. If a newborn vampire like him could defeat the hunters, how did they overpower Kiss-shot? Can he trust her to turn him back to a human? And how is that even possible in the first place?\n\nAraragi is at his limit but he must come to a decision, and it may not be possible to resolve this situation without doing something he’ll regret…\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/81576.webp","source":"Light novel","numberOfEpisode":"1","studio":"Shaft","type":"Movie","score":8.83,"genres":["Action","Mystery","Supernatural","Vampire"]},{"title":"Kizumonogatari II: Nekketsu-hen","synopsis":"No longer truly human, Koyomi Araragi decides to retrieve Kiss-shot Acerola-orion Heart-under-blade's severed body parts that were stolen by three powerful vampire hunters. Awaiting him are Dramaturgie, a vampire hunter who is a vampire himself; Episode, a half-vampire with the ability to transform into mist; and Guillotinecutter, a human priest who is the most dangerous of them all.\n\nUnbeknownst to Araragi, each minute he spends trying to retrieve Kiss-shot's limbs makes him less of a human and more of a vampire. Will he be able to keep his wish of becoming human once again by the end of his battles?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/80930.webp","source":"Light novel","numberOfEpisode":"1","studio":"Shaft","type":"Movie","score":8.64,"genres":["Action","Mystery","Supernatural","Vampire"]},{"title":"Owarimonogatari 2nd Season","synopsis":"Following an encounter with oddity specialist Izuko Gaen, third-year high school student Koyomi Araragi wakes up in a strange, deserted void only to be greeted by a joyfully familiar face in an alarmingly unfamiliar place.  \n\nAraragi, with the help of his girlfriend Hitagi Senjougahara, maneuvers through the webs of his past and the perplexities of the present in search of answers. However, fate once again delivers him to the eccentric transfer student Ougi Oshino, who brings forth an unexpected proposal that may unearth the very foundation to which he is anchored. As Araragi peels back the layers of mystery surrounding an apparition, he discovers a truth not meant to be revealed.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/87322.webp","source":"Light novel","numberOfEpisode":"7","studio":"Shaft","type":"TV","score":8.95,"genres":["Mystery","Comedy","Supernatural","Vampire"]},{"title":"Blood-C","synopsis":"Peaceful schoolgirl by day, fearsome monster slayer by night, Saya Kisaragi is leading a split life. Equipped with a ceremonial sword given to her by her father for sacred tasks, she vanquishes every monster who dares threaten her quiet little village. But all too soon, Saya's reality and everything she believes to be true is tested, when she overhears the monsters speak of a broken covenant—something she knows nothing about. And then, unexpectedly, a strange dog appears; it asks her to whom she promised to protect the village, curious as to what would happen if she were to break that promise. Tormented by unexplainable visions and her world unraveling around her, we travel with Saya through her struggle to find a way to the truth in a village where nothing is as it seems.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/31649.webp","source":"Manga","numberOfEpisode":"12","studio":"Production I.G","type":"TV","score":6.61,"genres":["Action","Mystery","Horror","Supernatural","Vampire","School"]},{"title":"Diabolik Lovers","synopsis":"At the behest of her father, Yui Komori goes to live in a secluded mansion, home to the six Sakamaki brothers—Shuu, Reiji, Ayato, Kanato, Laito, and Subaru—a family of vampires. Though at first the siblings are confused as to why the girl has arrived, they soon realize that she is to be their new \"sacrificial bride,\" not to mention their other, more carnal intentions for her. After meeting the brothers, Yui quickly begins to question why her father would have sent her here and why she feels a strange, new pain in her chest. With each brother more sadistic than the last, Yui's life as a captive takes a harrowing turn in her new home. As her days turn into endless nights, and each brother vows to make her his own, Yui falls deeper and deeper into madness and ecstasy.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/51989.webp","source":"Visual novel","numberOfEpisode":"12","studio":"Zexcs","type":"TV","score":5.46,"genres":["Harem","School","Shoujo","Vampire"]},{"title":"Dance in the Vampire Bund","synopsis":"On live television, Mina Tepes, the ruler of all vampires, reveals the existence of her species to the world and states her plan to build a sanctuary in Japan for vampires, called the Vampire Bund. Using her family's wealth to pay off the nation's debt, they have agreed to let her build this safe-haven for her fellow creatures of the night. But not everyone is so easily swayed by Mina's influence, as her announcement brings about conflict with humans who believe that the queen's quest for peace is a façade.\n\nAkira Kaburagi does not believe in vampires and gets uneasy whenever they are brought up, although he has yet to realize why. Apart from suffering a head injury a year ago, he lives on blissfully until he meets Mina. She triggers within him memories of a life he had long forgotten, and he soon begins protecting her without understanding why. But Akira's secret is far stranger than he could have ever thought possible—he discovers that he is a werewolf, sworn from birth to protect the vampire queen, even if it costs him his life. Now, as these two dance a rondo of death in the Vampire Bund, Mina and Akira find out just how deep their bond goes.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/23561.webp","source":"Manga","numberOfEpisode":"12","studio":"Shaft","type":"TV","score":7.1,"genres":["Action","Supernatural","Vampire"]},{"title":"Jitsu wa Watashi wa","synopsis":"One day after school, Asahi Kuromine stumbles upon the truth that Youko Shiragami, the girl he has a crush on, is actually a vampire. According to her father's rules, Youko must now quit school in order to keep her family safe. However, Asahi does not want her to go and promises that he will keep her true nature secret. Unfortunately, this turns out to be easier said than done, as Asahi is a man who is easy to read and is unable to keep any secrets to himself.\n\nAnd this is the only the beginning of his troubles—more supernatural beings enter his life, and he is forced to protect all of their identities or face the consequences. Jitsu wa Watashi wa follows Asahi as he deals with his new friends and the unique challenges they bring, struggles to keep his mouth shut, and desperately tries to win Youko's heart in the process.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/74042.webp","source":"Manga","numberOfEpisode":"13","studio":"3xCube","type":"TV","score":6.99,"genres":["Comedy","Supernatural","Romance","Vampire","Fantasy","School","Shounen"]},{"title":"Servamp","synopsis":"Mahiru Shirota firmly believes that simple is best and troublesome things should be avoided at all costs. It is troublesome to do nothing and regret it later—and this ideology has led the 15-year-old to pick up a stray cat on his way home from school. As he affectionately names the feline Kuro, little does he know that this chance meeting will spark an extraordinary change in his everyday life.\n\nOne day, Mahiru returns home to find something quite strange: a mysterious young man he has never seen before. His subsequent panic results in the uninvited guest being exposed to sunlight and—much to Mahiru's shock—transforming into Kuro! Upon revealing himself as a mere lazy shut-in vampire, Kuro promises to leave once night falls. However, one disaster after another leads to Mahiru accidentally forming a contract with his new freeloader, dragging him into a life-threatening battle of supernatural servants and bloodthirsty beings that is anything but simple.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/80953.webp","source":"Manga","numberOfEpisode":"12","studio":"Brain's Base","type":"TV","score":7,"genres":["Action","Comedy","Supernatural","Drama","Vampire","Josei"]},{"title":"Trinity Blood","synopsis":"The background is in the distant future after the destruction brought about by Armageddon. The war between the vampires and the humans continue to persist. In order to protect the humans from the vampires, the Vatican has to rely on other allies to counter the situation. The protagonist,  Abel Nightroad, is a traveling priest from the Vatican and a crusnik, a vampire that drinks the blood of vampires. He is a member of the \"Ax\", a special operations group led by Cardinal Catherina Sforza. He encounters a young girl called Esther, who decides to go with him to Rome and train at the Vatican. Soon after he meets her, the order of Rozencreuz, led by Abel's twin, Cain, tries to continue the war so they can rule the world. It's up to Abel and the AX to try and stop them.","img":"https://cdn.myanimelist.net/images/anime/10/24649.webp","source":"Light novel","numberOfEpisode":"24","studio":"Gonzo","type":"TV","score":7.34,"genres":["Action","Supernatural","Vampire"]},{"title":"Karin","synopsis":"Vampires—supernatural beings that feed on the life essence of the unsuspecting at night—have been around for centuries. However, high schooler Karin Maaka is unusual, even among her own kind. Unlike her vampire family, ever since she was a child, Karin has suffered from polycythemia: a rare disorder which causes her to periodically produce excessive amounts of blood. And the more blood she produces, the more anemic and lightheaded she gets, ultimately leading to frequent nosebleeds.\n\nHer only solution? Force her excess blood onto random strangers, which surprisingly causes these \"victims\" to become livelier and happier than before. With her siblings—Anju, her reserved yet affectionate younger sister, and Ren, her womanizing elder brother—helping her abilities remain a secret by altering the affected humans' memories, no one is the wiser. That is, until Karin's newly transferred classmate, Kenta Usui, finds her behavior suspicious. And to make matters even more complicated, Karin feels her blood reacting unusually to Kenta's presence.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/46833.webp","source":"Manga","numberOfEpisode":"24","studio":"J.C.Staff","type":"TV","score":7.21,"genres":["Comedy","Romance","Vampire","School","Shounen"]},{"title":"Sirius","synopsis":"In the year 1930, vampires have infiltrated Tokyo to feast upon its unsuspecting citizens. As the number of victims continues to rise, the city's authorities decide to hire the Jaegers—a strange, diverse group of individuals tasked by the V Shipping Company to hunt down vampires around the world. Carrying musical instrument cases to disguise their identity, the Jaegers battle the vampires with the same mercilessness demonstrated by their foes.\n\nYuliy, the Jaeger's most skilled warrior, is the sole survivor of a vampire raid on his home village. Using the strength granted by his werewolf blood, he works with his team to assist Tokyo's law enforcement with the city's vampire problem. Though under the pretense of helping the police, the Jaegers are actually fighting the vampires over the mystical Ark of Sirius. With its power to change the fate of the world, Yuliy and his friends must locate the artifact before the vampires can use it to achieve their destructive goals.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1456/94897.webp","source":"Original","numberOfEpisode":"12","studio":"P.A. Works","type":"TV","score":7.12,"genres":["Action","Historical","Supernatural","Vampire"]},{"title":"Shingetsutan Tsukihime","synopsis":"Shiki Toono sustained a life threatening injury as a child, and due to that incident he was sent away from the Toono household and was given to a relative to be raised. Years later, when Shiki is in high school, the head of the Toono household—his father—dies, and he is ordered to move back in by his sister Akiha, who is the new head of the household. However, Shiki holds a huge secret. Ever since that injury, he has been seeing lines on objects, and only with a special pair of glasses is he able to stop seeing them. Also he is unable to remember anything well from the time before his accident. The day he moves back to the Toono household is the day he stumbles upon a woman named Arcueid Brunstud and decapitates her with one stab of his knife in a temporary fit of insanity. When she suddenly showed up beside him later alive and well, and ask him to be her bodyguard, Shiki's journey to unravel the mysteries of his past begins.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/20669.webp","source":"Visual novel","numberOfEpisode":"12","studio":"J.C.Staff","type":"TV","score":6.96,"genres":["Action","Horror","Mystery","Romance","Super Power","Supernatural","Vampire"]},{"title":"Devils Line","synopsis":"Vampires walk among society, existing as part of its underbelly. They do not require blood to survive, but extreme emotions can immensely increase their bloodlust, turning them into uncontrollable monsters. Tsukasa Taira, a 22-year-old university student, learns of the existence of vampires when her longtime friend reveals himself to be one of them after a tense confrontation with Yuuki Anzai—a human and vampire hybrid.\n\nHer friend is arrested, and Tsukasa soon finds herself drawn to Anzai, who reluctantly reciprocates her feelings. However, this unconventional romance may prove too difficult to maintain, as Anzai struggles to contain the part of him that wishes to devour Tsukasa.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1598/90817.webp","source":"Manga","numberOfEpisode":"12","studio":"Platinum Vision","type":"TV","score":6.82,"genres":["Action","Drama","Romance","Seinen","Supernatural","Vampire"]},{"title":"Strike the Blood II","synopsis":"The second season of Strike the Blood which adapts three arcs from the 9th, 11th, and 12th light novel volumes. ","img":"https://cdn.myanimelist.net/images/anime/10/82780.webp","source":"Light novel","numberOfEpisode":"8","studio":"Connect","type":"OVA","score":7.17,"genres":["Action","Supernatural","Ecchi","Vampire","Fantasy"]},{"title":"Vampire Hunter D (2000)","synopsis":"The story revolves around D, the infamous \"dunpeal\" (born of a vampire father and a human mother) outcast and renowned vampire hunter. His prowess at hunting the creatures of the night allowing his acceptance among humans, he is called upon to locate Charlotte Elbourne, the lovely daughter of an affluent family who has been mysteriously kidnapped.\n\nWhen the sun sets, the hunt goes on! Charlotte's father offers a rich bounty, be she dead or alive, a task D willingly accepts, even with notorious Markus brothers and their gang of bounty hunters seeking the prize as well. Amidst the chase and unknown to all lurks, a sinister evil which has been secretly manipulating their every move and has set a chilling trap that none will expect and few will survive. With the tables turned and the secrets revealed, the hunters could quickly become the hunted!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/21432.webp","source":"Light novel","numberOfEpisode":"1","studio":"Madhouse","type":"Movie","score":7.89,"genres":["Action","Sci-Fi","Horror","Drama","Romance","Vampire","Fantasy"]},{"title":"Itsuka Tenma no Kuro Usagi","synopsis":"Taito has been really sleepy lately, and keeps dreaming of a female vampire who says she has given him her \"poison.\" Sometimes he even thinks he hears her voice when he's awake. But after surviving an accident that should have killed him, Taito's world changes drastically and he realizes that his dreams are more real than he thought.","img":"https://cdn.myanimelist.net/images/anime/5/75197.webp","source":"Light novel","numberOfEpisode":"12","studio":"Zexcs","type":"TV","score":6.66,"genres":["Comedy","Supernatural","Romance","Ecchi","Vampire"]},{"title":"Zoku Owarimonogatari","synopsis":"Graduation day is finally here, marking the end of Koyomi Araragi's eccentric high school life full of peculiar relationships with otherworldly beings.\n\nHowever, Araragi is unexpectedly absorbed into his own bathroom mirror and trapped inside a bizarre world where everything he knows is completely reversed—the haughty Karen Araragi is shorter than usual, poker-faced Yotsugi Ononoki is brimming with emotion, and cute ghost girl Mayoi Hachikuji is a grown woman! But not everything is as it seems.\n\nZoku Owarimonogatari details the story of Araragi's endeavors in this new world as he struggles to return to his home and understand the nature of this bizarre dimension.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1022/96168.webp","source":"Light novel","numberOfEpisode":"1","studio":"Shaft","type":"Movie","score":8.56,"genres":["Mystery","Comedy","Supernatural","Vampire"]},{"title":"Fortune Arterial: Akai Yakusoku","synopsis":"Fortune Arterial's story revolves around the male protagonist Kohei Hasekura, who transfers into a prestigious public school in the style of an English six-year school encompassing junior-high and high school students. The school is on an island named Tamatsu Island off-shore from mainland Japan, and the only way to get there is by boat. Soon after transferring, he discovers that one of the student in the class next door to his, Sendo Erika, is in fact a type of vampire. \n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/11/26876.webp","source":"Visual novel","numberOfEpisode":"12","studio":"feel.","type":"TV","score":6.77,"genres":["Comedy","Romance","School","Supernatural","Vampire"]},{"title":"Blood: The Last Vampire","synopsis":"Teropterids are evil beasts which pose as humans and live only to drink human blood. Fortunately for the human world there are groups dedicated to destroying them. A brooding and mysterious girl named Saya is the best teropterid slayer there is, and now, in 1960s Japan, she is sent to a U. S. army base which may be infested...\n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/9/18913.webp","source":"Original","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":6.93,"genres":["Horror","Supernatural","Vampire"]},{"title":"Black Blood Brothers","synopsis":"Ten years after the Holy War in Hong Kong, Mochizuki Jirou, aka the Silver Blade, and the lone hero who fought and defeated the Kowloon Children despite the loss of his lover, returns to Japan with his young brother, Mochizuki Kotarou. The two quickly discover that the Kowloon Children who survived the Holy War are seeking to infiltrate the \"Special Zone\", a thriving city protected by an invisible barrier that will not allow Kowloon Children entrance, unless they're invited. Red Bloods refers to the humans; Black Bloods are the vampires, and the Mochizuki Brothers are Old Blood, the last descendants of an elite clan of vampires. When Kotarou is abducted by one of the Kowloon Children, Jirou has no choice but to fight once more.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/13804.webp","source":"Light novel","numberOfEpisode":"12","studio":"Group TAC","type":"TV","score":7.17,"genres":["Action","Comedy","Fantasy","Shounen","Supernatural","Vampire"]},{"title":"Diabolik Lovers More,Blood","synopsis":"Yui Komori, still held captive by the Sakamaki brothers—pureblood vampires after her blood—experiences yet more bizarre twists to her life following her stay at their household. Though haunted by enigmatic dreams, Yui soon deciphers their meaning when caught in a car crash, which subsequently leads to meeting four new vampires: the Mukami brothers, Ruki, Azusa, Kou, and Yuuma, who themselves capture the bewildered girl.\n\nYui later awakens in the Mukami mansion, where the brothers reveal their plans for her: she is their \"Eve,\" and her blood will find the \"Adam\" among them; together, they will have the power to rule the world. However, with the Sakamaki brothers hot on their heels, things might not go quite as smoothly as they had imagined.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/73657.webp","source":"Visual novel","numberOfEpisode":"12","studio":"Zexcs","type":"TV","score":5.85,"genres":["Harem","School","Shoujo","Vampire"]},{"title":"Blood Lad: Wagahai wa Neko de wa Nai","synopsis":"Bundled with the tenth limited-edition volume of Blood Lad manga.","img":"https://cdn.myanimelist.net/images/anime/2/52611.webp","source":"Manga","numberOfEpisode":"1","studio":"Brain's Base","type":"OVA","score":7.22,"genres":["Action","Comedy","Demons","Seinen","Supernatural","Vampire"]},{"title":"Dance with Devils","synopsis":"Ritsuka Tachibana has always been a good student, so she is completely shocked when she is suddenly summoned by the student council. Even more, they seem to think of Ritsuka as a troublemaker. Led by the handsome Rem Kaginuki, the student council—also consisting of Urie Sogami, Shiki Natsumizaka and Mage Nanashiro—tries to question her, but it soon becomes clear that they have ulterior motives. \n\nHowever, this is only the beginning. When her mother gets kidnapped, her life is turned upside down, and Ritsuka gets drawn into a world of vampires and devils. Both groups are searching for the \"Grimoire,\" a forbidden item allowing its owner to rule the world. The return of her brother Lindo from overseas gives her hope, but even he appears to be hiding something. In a world filled with secrets, Ritsuka questions whom she can trust in this dark musical tale, while the handsome and dangerous members of the student council compete for her attention. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/75640.webp","source":"Original","numberOfEpisode":"12","studio":"Brain's Base","type":"TV","score":6.51,"genres":["Harem","Demons","Supernatural","Romance","Vampire","Shoujo"]},{"title":"Kurozuka","synopsis":"Adaptation of Takashi Noguchi's manga, which itself adapts Baku Yumemakura's supernatural romance novel.\n\nThe original novel is about a 12th-century man named Minamoto no Yoshitsune (Kurou). Kurou flees into the mountains after losing to his brother Minamoto no Yoritomo, the first Shogun to rule all of Japan. History records that he committed suicide, but instead, Kurou meets a strange, beautiful woman named Kuromitsu in her mountain hermitage. Eventually, Kurou falls in love with Kuromitsu, but then realizes she conceals a dark secret. He learns that he is unable to die and continues to live for a thousand years as Japan evolves into a future society.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/21844.webp","source":"Manga","numberOfEpisode":"12","studio":"Madhouse","type":"TV","score":6.96,"genres":["Action","Drama","Historical","Horror","Romance","Sci-Fi","Vampire"]},{"title":"Bloodivores","synopsis":"60 years ago, a strange case of insomnia struck the population, forcing them to stay awake for more than a full week. The victims, completely sleep deprived, all went mad. To cure this illness, a new medicine was produced, but the side effects turned the patients into vampires. Humanity went to war against this new species and triumphed, but some of the vampires managed to survive. Born from a Human and a Vampire, the main character Mi Liu, \"The Child of Hope,\" is to represent the new hope that will connect the two species. Ringleader of a bank robbery, Mi Liu is arrested and transferred to a special prison of the National Defense Agency that monitors Vampires. Trying to break free with Anji, Mi Liu is attacked by strange monsters and he finds out that the prison location corresponds to the birthplace of Vampires, the old capital \"Blue Town.\" Why are Vampires trapped in Blue Town? What are those strange monsters attacking them? Our heroes must fight to solve those mysteries.\n\n(Source: Emon via ANN)","img":"https://cdn.myanimelist.net/images/anime/11/82233.webp","source":"Web manga","numberOfEpisode":"12","studio":"Creators in Pack","type":"TV","score":5.57,"genres":["Action","Supernatural","Vampire"]},{"title":"Hellsing: The Dawn","synopsis":"During the height of World War II, Nazi Germany seeks to strengthen their soldiers with technology crafted under the influence of vampiric biology. Out of fear of this technology turning the tide of war in the Axis's favor, Sir Arthur Hellsing enlists his butler and soldier Walter C. Dornez and vampire Alucard to put a stop to the German plot, sending the two men into a conflict that will scar them both forever.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/30667.webp","source":"Manga","numberOfEpisode":"3","studio":"Graphinica","type":"Special","score":7.23,"genres":["Action","Horror","Seinen","Supernatural","Vampire"]},{"title":"Tonari no Kyuuketsuki-san","synopsis":"Rumors tell about an ageless girl who only comes out at night, living in a mansion in the middle of the forest. Some say that she is a living doll with a soul. Upon hearing these rumors, Akari Amano seeks out this girl, only to find herself lost as she treks through the woods amidst the darkness.\n\nA vampire named Sophie Twilight saves her, turning out to be the rumored girl. However, unlike the vampires told in myths, Sophie does not attack humans and instead orders her blood online. Akari instantly becomes charmed with her doll-like appearance and proceeds to abruptly move in with her, thus starting their life together.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1851/96154.webp","source":"4-koma manga","numberOfEpisode":"12","studio":"AXsiZ","type":"TV","score":7.13,"genres":["Comedy","Shoujo Ai","Slice of Life","Supernatural","Vampire"]},{"title":"Strike the Blood: Valkyria no Oukoku-hen","synopsis":"It was officially announced at the Dengeki Game Festival 2015 event that Strike the Blood will be getting a two-episode OVA series to be released at the end of 2015. The OVA will be an original story written by Gakuto Mikumo.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/12/77275.webp","source":"Light novel","numberOfEpisode":"2","studio":"Barnum Studio","type":"OVA","score":7.35,"genres":["Action","Supernatural","Ecchi","Vampire","Fantasy","School","Shounen"]},{"title":"Blood-C: The Last Dark","synopsis":"Having escaped the many horrors of her village, Saya Kisaragi vows to hunt down the monster responsible and make him pay with his life. As she tears through flesh and bone for her vendetta, she encounters SIRRUT, a group of ingenious hackers, who enlist Saya to help them defeat a common enemy—someone she knows all too well.\n\nUnfortunately, the path she follows is paved with tragedy, as once again, Saya faces betrayal at the hands of those she has come to trust. With her back against the wall, the fearsome monster slayer must fight with all her strength and skill if she is to overcome this final mission and exact vengeance.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/34495.webp","source":"Original","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.23,"genres":["Action","Horror","Supernatural","Vampire"]},{"title":"Kaibutsu Oujo","synopsis":"When Hiro Hiyorimi tries to save a beautiful young woman from certain death, he ends up a dead hero himself! However, since the drop-dead girl is Hime, daughter of the King of the Monsters, his \"reward\" is to come back as a not-quite-living soldier in her honor guard of horror! That means helping fight off the army of supernatural monstrosities Hime's siblings are unleashing against her in hopes of moving up the ladder of succession.\n\nAnd if facing off with vampires and zombies isn't bad enough, how can anyone be prepared for the REALLY weird ones, like were-sharks, pandas and killer dumplings? This sure as hell isn't the afterlife Hiro was hoping for, but the really sad part is that Hime is the good girl in all of this... or at least as close to good as you can come when you're on the wrong side of the gates of hell!\n\n(Source: RightStuf)","img":"https://cdn.myanimelist.net/images/anime/2/20946.webp","source":"Manga","numberOfEpisode":"25","studio":"Madhouse","type":"TV","score":7.05,"genres":["Action","Comedy","Supernatural","Horror","Vampire","Shounen"]},{"title":"Tsukuyomi: Moon Phase","synopsis":"Freelance photographer Kouhei Morioka is traveling to a castle in Germany to take photos of paranormal activity for his friend Hiromi Anzai, editor of an occult magazine. Upon entering the castle, he’s confronted by a young girl in a white dress and cat ears who calls herself Hazuki. She takes a keen interest in Kouhei and offers him a kiss, but she instead reveals herself to be a vampire, sucks his blood, and turns him into her slave.\n\nMuch to Hazuki’s dismay, however, Kouhei is unaffected by her bite. Hoping to escape the castle and her possessive butler Vigo, Hazuki instead forces Kouhei to help her. With the help of his powerful exorcist cousin Seiji Midou, the two make it out safely. Finally free, Hazuki flees to Japan in search of her mother. Not long after Kouhei returns home, he discovers Hazuki has nested in his home, where he reluctantly allows her to stay. Meanwhile, other vampires set out to find the missing Hazuki.\n\nEqual parts gothic and adorable, Tsukuyomi: Moonphase is a charming and mystical story where two unlikely allies form a unique bond in an attempt to defy a society of immortals.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/75255.webp","source":"Manga","numberOfEpisode":"25","studio":"Shaft","type":"TV","score":7.03,"genres":["Comedy","Fantasy","Romance","Seinen","Vampire"]},{"title":"Noblesse: Awakening","synopsis":"Long ago lived the \"nobles,\" an ancient race of immortal supernatural beings. They were revered as rulers and gods. Among the nobles was the \"Noblesse,\" a powerful individual shrouded in mystery named Cadis Etrama di Raizel, or \"Rai.\" Upon awakening in South Korea after an 820-year-long sleep, Rai sets to find his loyal and devoted servant, Frankenstein, whom he discovers to be the current director of Ye Ran High School. In his wish to learn more about modern civilization, Rai enrolls as a student to better experience life in the modern world.\n\nNoblesse: Awakening details the beginning of Rai's new life as a high school student as he spends time with friends and fights threats both human and supernatural in order to prevent their schemes from harming Korea.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/78406.webp","source":"Web manga","numberOfEpisode":"1","studio":"Production I.G","type":"ONA","score":7.62,"genres":["Action","School","Supernatural","Vampire"]},{"title":"Vampire Hunter D","synopsis":"10,000 years in the future, the world has become a very different place; monsters roam the land freely, and people, although equipped with high tech weapons and cybernetic horses, live a humble life more suited to centuries past. The story focuses on a small hamlet plagued by monster attacks and living under the shadow of rule by Count Magnus Lee, a powerful vampire lord who has ruled the land for thousands of years. When a young girl is bitten by the Count and chosen as his current plaything, she seeks out help of a quiet wandering stranger, D. It so happens that D is one of the world's best vampire hunters, and he takes it upon himself to cut through Magnus Lee's many minions, and put an end to the Count's rule.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/4/24228.webp","source":"Light novel","numberOfEpisode":"1","studio":"Production Reed","type":"Movie","score":7.11,"genres":["Action","Sci-Fi","Horror","Supernatural","Vampire"]},{"title":"JoJo no Kimyou na Bouken","synopsis":"Kujo Jotaro is a normal, popular Japanese high-schooler, until he thinks that he is possessed by a spirit, and locks himself in prison. After seeing his grandfather, Joseph Joestar, and fighting Joseph's friend Muhammad Abdul, Jotaro learns that the \"Spirit\" is actually Star Platinum, his Stand, or fighting energy given a semi-solid form. Later, his mother gains a Stand, and becomes sick. Jotaro learns that it is because the vampire Dio Brando has been revived 100 years after his defeat to Jonathan Joestar, Jotaro's great-great-grandfather. Jotaro decides to join Joseph and Abdul in a trip to Egypt to defeat Dio once and for all.","img":"https://cdn.myanimelist.net/images/anime/1801/104558.webp","source":"Manga","numberOfEpisode":"6","studio":"APPP","type":"OVA","score":7.35,"genres":["Adventure","Drama","Fantasy","Horror","Shounen","Supernatural","Vampire"]},{"title":"Demi-chan wa Kataritai: Demi-chan no Natsuyasumi","synopsis":"During summer break, Tetsuo asks Sakie to join him on patrol duty for the local summer festival, which both the demis and Himari and her friends go to. As each group decides to check out a nearby shrine, they get spooked by some strange occurrences, which turn out to be each other. As the next term begins, Tetsuo converses with an invisible woman named Matsuri.\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/6/88769.webp","source":"Manga","numberOfEpisode":"1","studio":"A-1 Pictures","type":"ONA","score":7.56,"genres":["Comedy","Vampire","Fantasy","School","Seinen"]},{"title":"Shiki Specials","synopsis":"The official website of the Shiki television anime series confirmed on Saturday that the anime's eighth and ninth Blu-ray Disc/DVD volumes will each include an unaired episode. The eighth volume will ship with Episode 21 and the unaired episode \"Dai Futatō to Han wa\" (a wordplay for \"Episode 20.5\") on May 25, 2011, while the ninth volume will ship with Episode 22 and the unaired episode \"Dai Futatō-ichi to Han wa\" (\"Episode 21.5\") on June 22. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/36543.webp","source":"Light novel","numberOfEpisode":"2","studio":"Daume","type":"Special","score":7.84,"genres":["Mystery","Horror","Supernatural","Thriller","Vampire"]},{"title":"Strike the Blood III","synopsis":"It was announced at a Dengeki Game Festival stage event that the Strike the Blood light novel series will get a third OVA release. It will cover until the end of Seisen-hen.\n\n(Source: MAL news)","img":"https://cdn.myanimelist.net/images/anime/1545/93427.webp","source":"Light novel","numberOfEpisode":"10","studio":"Connect","type":"OVA","score":7.19,"genres":["Action","Supernatural","Ecchi","Vampire","Fantasy"]},{"title":"Owari no Seraph: Owaranai Seraph","synopsis":"Specials included in the Blu-ray and DVD releases.","img":"https://cdn.myanimelist.net/images/anime/6/76505.webp","source":"Manga","numberOfEpisode":"9","studio":"Wit Studio","type":"Special","score":7.33,"genres":["Comedy","Police","Supernatural","Vampire","Shounen"]},{"title":"Owari no Seraph: Kyuuketsuki Shahar","synopsis":"The story is set before the main story's \"Battle in Nagoya\" arc.\n\nThe Shinoa Squad receives another mission from Guren; to rescue a human girl named Riko from a mysterious vampire, Shahar, and bring her back to her family. However, Ferid and Crowley also appear when they find Shahar. Can Yuuichirou save the girl?\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/12/82059.webp","source":"Manga","numberOfEpisode":"1","studio":"Wit Studio","type":"OVA","score":7.19,"genres":["Action","Military","Supernatural","Drama","Vampire","Shounen"]},{"title":"Yami no Matsuei","synopsis":"Even after death, life is full of paperwork and criminals. Tsuzuki Asato is a 26 year old, happy-go-lucky, and dorky shinigami (god of death) whose job is to makes sure that those who are dead remain dead and stay in their proper realms. Even though he's had this job for over 70 years, he is in the worst division with horrible pay. He also has a knack for not keeping partners (since shinigami work in pairs), but now he seems to have one that will stick around; stubborn, smart-mouthed, serious and defensive 16 year old, Kurosaki Hisoka. With each case they investigate, they come closer to the conspiracies of the serial killer Dr. Muraki Kazutaka. Tsuzuki's relationship with Hisoka is growing stronger and closer...but there is a dark past to how Tsuzuki died that will not give him peace. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/6726.webp","source":"Manga","numberOfEpisode":"13","studio":"J.C.Staff","type":"TV","score":7.1,"genres":["Comedy","Drama","Fantasy","Horror","Magic","Shoujo","Shounen Ai","Vampire"]},{"title":"JoJo no Kimyou na Bouken: Adventure","synopsis":" Kujo Jotaro is a normal, popular Japanese high-schooler, until he thinks that he is possessed by a spirit, and locks himself in prison. After seeing his grandfather, Joseph Joestar, and fighting Joseph's friend Muhammad Abdul, Jotaro learns that the \"Spirit\" is actually Star Platinum, his Stand, or fighting energy given a semi-solid form. Later, his mother gains a Stand, and becomes sick. Jotaro learns that it is because the vampire Dio Brando has been revived 100 years after his defeat to Jonathan Joestar, Jotaro's great-great-grandfather. Jotaro decides to join Joseph and Abdul in a trip to Egypt to defeat Dio once and for all. ","img":"https://cdn.myanimelist.net/images/anime/8/53147.webp","source":"Manga","numberOfEpisode":"7","studio":"APPP","type":"OVA","score":7.17,"genres":["Adventure","Drama","Fantasy","Horror","Shounen","Supernatural","Vampire"]},{"title":"Holy Knight","synopsis":"The story centers around a timid orphan named Mizumura Shinta who goes to a missionary school in Tokyo. His seemingly normal life changes when a beautiful half-human Romanian girl named Lilith suddenly transfers into his school. Mizumura discovers that he is actually a vampire hunter and the successor of the Romuald lineage.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/41841.webp","source":"Manga","numberOfEpisode":"2","studio":"Lilix","type":"OVA","score":6.08,"genres":["Ecchi","Fantasy","Supernatural","School","Vampire","Seinen"]},{"title":"Owari no Seraph: The Beginning of the End","synopsis":"Recap of 1st Season Aired Before Nagoya Kessen-hen.","img":"https://cdn.myanimelist.net/images/anime/13/76490.webp","source":"Manga","numberOfEpisode":"1","studio":"Wit Studio","type":"Special","score":7.13,"genres":["Action","Drama","Shounen","Supernatural","Vampire"]},{"title":"Vampire Knight: Gekiai no Portrait","synopsis":"Aidou has the idea to hold elections for Moon Dorm's President. The candidates are Kaname and the current president Ichijou. Who will win? \n\n","img":"https://cdn.myanimelist.net/images/anime/9/59837.webp","source":"Manga","numberOfEpisode":"1","studio":"Studio Deen","type":"Special","score":6.85,"genres":["Comedy","Vampire","Shoujo"]},{"title":"Hellsing: Digest for Freaks","synopsis":"This OVA is a summary of the first three episodes of Hellsing, with the animation style of Hellsing Ultimate and following the events of the Hellsing manga.","img":"https://cdn.myanimelist.net/images/anime/7/26935.webp","source":"Manga","numberOfEpisode":"1","studio":"Satelight","type":"OVA","score":7.71,"genres":["Action","Horror","Military","Seinen","Super Power","Supernatural","Vampire"]},{"title":"JoJo no Kimyou na Bouken: Phantom Blood","synopsis":"An adaptation of the original five volume arc of the popular JoJo's Bizarre Adventure manga, covering the Phantom Blood chapters. Jonathan Joestar is an aristocratic boy whose life is suddenly turned upside down by a mysterious new boy who arrives, Dio Brando. Dio has a connection to his father, and over time, a rivalry forms as Dio becomes obsessed with a mysterious, ancient, and mystical stone mask that Jonathan's father keeps. ","img":"https://cdn.myanimelist.net/images/anime/5/50055.webp","source":"Manga","numberOfEpisode":"1","studio":"APPP","type":"Movie","score":7.75,"genres":["Action","Adventure","Horror","Shounen","Vampire"]},{"title":"Keishichou Tokumubu Tokushu Kyouakuhan Taisakushitsu Dainanaka: Tokunana","synopsis":"In Tokyo, there exists a peaceful cohabitation between supernatural creatures—elves, dwarves, vampires, and more—and humans. However, contrary to history, powerful dragons once ruled over this world of creatures and humans but have since disappeared. Consequently, a diabolical group under the alias \"Nine,\" who seek the miracles of the once godlike dragons, stirs up trouble in the streets of Tokyo, commiting mass murder and causing destruction. To combat the dangerous group of Nine, the police organize the Special 7—a group of highly skilled professionals whose abilities exceed those of ordinary humans. \n\nCaught up in a bank robbery turned hostage crisis, Seiji Nanatsuki, having recently become a detective, has a chance encounter with Shiori Ichinose, a member of Special 7. Assisting with the resolution of the robbery, Seiji is recognized for his clear sense of justice and refreshing character, suddenly earning him a spot on the elite unit. \n\nAs he takes on new missions, Seiji finds that being a detective as part of Special 7 isn't the police work he expected, where working alongside a team of different species with special abilities and vibrant personalities brings unpredictability to his daily life and police work. While the everyday crime in Tokyo continues, Seiji and the Special 7 will fight not only to resolve special cases, but also obstruct the ill-intentioned plans of the merciless group of Nine.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1338/102486.webp","source":"Original","numberOfEpisode":"12","studio":"Anima&amp;Co.","type":"TV","score":6.04,"genres":["Action","Police","Vampire","Fantasy"]},{"title":"Phantom in the Twilight","synopsis":"Set in modern day London, the story takes place in a world where \"Shadows\" are born from human fear and anxiety. A young girl arrives to study abroad, only to be caught in a bizarre incident as she enters university. In a city with no acquaintances, the helpless girl wanders into \"Café Forbidden,\" a mysterious café that exclusively opens at midnight. She meets an assortment of handsome men employed at the café, where guardians who protect the boundary between humans and shadow convene.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1156/93567.webp","source":"Original","numberOfEpisode":"12","studio":"LIDENFILMS","type":"TV","score":6.46,"genres":["Action","Supernatural","Vampire"]},{"title":"Kyuuketsuhime Miyu (TV)","synopsis":"Evil Shinma (shape-shifting monsters and vampires) roam the Earth on a mission to unleash their darkness upon the Human race. Miyu Royal Princess from the dark is the Chosen One—the one being who must banish the Evil Shinma from the Earth. She has the power to offer Humans the gift of eternal happiness, yet is herself, trapped between two worlds; destined for perpetual solitude and internal conflict. \n\nMiyu's only companion is Larva, once an evil Shimna; now her devoted guardian. Together they share a dark journey through the weakness of the human heart and the tragic loss of innocence. Cut off from humanity by the knowledge of what she is, Miyu lives an endless quest as both the hunter and the hunted, on the edge of darkness. \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/8/61317.webp","source":"Manga","numberOfEpisode":"26","studio":"AIC","type":"TV","score":7.16,"genres":["Action","Horror","Demons","Drama","Vampire","Shoujo"]},{"title":"Touhou Niji Sousaku Doujin Anime: Musou Kakyou","synopsis":"Welcome to the fascinating world of Gensokyo, in which youkai (A term for all sorts of spiritual creatures), animals and some humans live, completely separated from our world by a magical barrier. The only gateway between the two worlds is the Hakurei shrine.\n\nReimu Hakurei is the maiden working at said shrine. Whenever problems of supernatural causes (known as \"Incidents\") occur, Reimu goes out with her friends to investigate, eliminate the cause and hopefully restore Gensokyo to its equilibrium.","img":"https://cdn.myanimelist.net/images/anime/3/27302.webp","source":"Game","numberOfEpisode":"?","studio":null,"type":"OVA","score":7.15,"genres":["Magic","Vampire","Fantasy"]},{"title":"Kekkai Sensen: Soresaemo Saitei de Saikou na Hibi","synopsis":"A recap episode of episodes 1 through 10 of Kekkai Sensen. Leonardo Watch reflects on his experiences at Libra.","img":"https://cdn.myanimelist.net/images/anime/3/74387.webp","source":"Manga","numberOfEpisode":"1","studio":"Bones","type":"Special","score":6.81,"genres":["Action","Fantasy","Shounen","Super Power","Supernatural","Vampire"]},{"title":"Mahou Sensei Negima!: Shiroki Tsubasa Ala Alba","synopsis":"OVA episodes that are bundled with the limited edition of the manga volumes 23-25. First episode to cover chapters 176 and 177 of the manga. Second episode to cover chapters 178-180. And third episode to cover chapters 182 and 183.","img":"https://cdn.myanimelist.net/images/anime/5/9329.webp","source":"Manga","numberOfEpisode":"3","studio":"Shaft","type":"OVA","score":7.5,"genres":["Adventure","Harem","Comedy","Supernatural","Magic","Romance","Ecchi","Vampire","Shounen"]},{"title":"Renkin San-kyuu Magical? Pokaan","synopsis":"Renkin San-kyuu Magical? Pokaan follows the daily lives of four young girls. There is just one catch: they are anything but normal. This group of friends—the energetic werewolf Liru, the joyful witch-in-training Uma, the motherly android Aiko, and the seductive vampire Pachira—are actually princesses from the netherworld who have traveled to the human world in search of a new home. Unfortunately, their naivety and severe lack of knowledge make living peacefully among earthlings much more difficult than they imagined. \n\nAs they attempt to adapt to their brand new lifestyle, they cause all sorts of trouble, and end up attracting the unwanted attention of a woman by the name of Dr. K-Ko. The scientist believes that these new residents of Earth are up to no good and attempts to capture the girls to prove the existence of the supernatural and gain credibility with the scientific community. Every day brings a new adventure as the girls deal with the insanity of her antics and all that the human realm has to offer.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/75229.webp","source":"Original","numberOfEpisode":"12","studio":"Remic","type":"TV","score":7,"genres":["Comedy","Ecchi","Magic","Parody","Vampire"]},{"title":"Vassalord.","synopsis":"Charley, a cyborg vampire who does the Vatican's dirty work, is the thrall of the local vampire playboy Johnny Rayflo. As the two fight crime—and each other—hilarity, violence and sacrilege ensue! But can Charley resist his own desperate cravings for blood? Find out as the devilish duo go up against a childlike vampire princess, a mysterious branch of the Unitarian Church...and one another. \n\n(Source: Tokyopop) ","img":"https://cdn.myanimelist.net/images/anime/3/43213.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"OVA","score":6.91,"genres":["Action","Comedy","Fantasy","Mystery","Shounen Ai","Supernatural","Vampire"]},{"title":"Diabolik Lovers OVA","synopsis":"OVA of Diabolik Lovers included with the upcoming game Diabolik Lovers DARK FATE.","img":"https://cdn.myanimelist.net/images/anime/12/74238.webp","source":"Visual novel","numberOfEpisode":"1","studio":"Production I.G","type":"OVA","score":5.87,"genres":["Harem","School","Vampire","Shoujo"]},{"title":"Nyanpire The Animation","synopsis":"A heartwarming story about a stray black cat, who was given blood from a vampire. He was taken in by a girl called Misaki and started to live with her. Nyanpire's favorite phrase is \"Give me blood nya.\"","img":"https://cdn.myanimelist.net/images/anime/11/46147.webp","source":"Manga","numberOfEpisode":"12","studio":"Gonzo","type":"TV","score":6.71,"genres":["Comedy","Supernatural","Vampire"]},{"title":"Fortune Arterial: Akai Yakusoku - Tadoritsuita Basho","synopsis":"After the school festival, Kohei and friends head to a small cottage out of town and enjoy themselves after working hard.","img":"https://cdn.myanimelist.net/images/anime/6/25892.webp","source":"Visual novel","numberOfEpisode":"1","studio":"feel.","type":"OVA","score":6.94,"genres":["Harem","Comedy","Romance","Vampire","Fantasy"]},{"title":"Hellsing: Psalm of the Darkness","synopsis":"Special that can be found on DVD. Contains animation not reused in the TV series.","img":"https://cdn.myanimelist.net/images/anime/4/19043.webp","source":"Manga","numberOfEpisode":"1","studio":"Gonzo","type":"Special","score":7,"genres":["Action","Supernatural","Vampire","Seinen"]},{"title":"Strike the Blood IV","synopsis":"Fourth season of Strike the Blood.","img":"https://cdn.myanimelist.net/images/anime/1792/104833.webp","source":"Light novel","numberOfEpisode":"12","studio":"Connect","type":"OVA","score":7.25,"genres":["Action","Supernatural","Ecchi","Vampire","Fantasy"]},{"title":"Blade","synopsis":"The story revolves around Blade, a \"Daywalker\" vampire hunter who was born with vampire and human blood after a vampire attacked his mother. While visiting Japan on a mission, Blade tracks down Deacon Frost, the vampire who killed his mother. Blade confronts \"Existence,\" a mysterious organization composed of vampires modified by Frost. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/29742.webp","source":"Other","numberOfEpisode":"12","studio":"Madhouse","type":"TV","score":6.26,"genres":["Action","Drama","Horror","Vampire"]},{"title":"Diabolik Lovers Recap","synopsis":"Recap of episodes 1-6 with new narrations.","img":"https://cdn.myanimelist.net/images/anime/9/55639.webp","source":"-","numberOfEpisode":"1","studio":"Production I.G","type":"Special","score":5.41,"genres":["Shoujo","Vampire"]},{"title":"Itsuka Tenma no Kuro Usagi: Kokoro Utsuri no Toukoubi - School Attendance Day","synopsis":"Episode bundled with the ninth volume of the Itsuka Tenma no Kuro Usagi novel.\n\nIncludes Mirai's chibi-style dream, body-swapping and a crossover with Densetsu no Yuusha no Densetsu.","img":"https://cdn.myanimelist.net/images/anime/9/79553.webp","source":"Light novel","numberOfEpisode":"1","studio":"Zexcs","type":"OVA","score":6.98,"genres":["Comedy","Supernatural","Romance","Ecchi","Vampire","Shounen"]},{"title":"Kekkai Sensen &amp; Beyond: Zapp Renfro Ingaouhouchuu!!/Baccardio no Shizuku","synopsis":"Bundled with the 5th volume of the Kekkai Sensen: Back 2 Back manga. ","img":"https://cdn.myanimelist.net/images/anime/1874/96668.webp","source":"Manga","numberOfEpisode":"1","studio":"Bones","type":"OVA","score":7.23,"genres":["Action","Comedy","Super Power","Supernatural","Vampire","Fantasy","Shounen"]},{"title":"Kyuuketsuhime Miyu","synopsis":"A quiet gothic horror story about a vampire girl, Miyu, whose destiny it is to hunt down murderous demons known as Shinma and return them to their land of origin, the Dark. Miyu is pursued by the Spiritualist Himiko, determined to find out who Miyu is and to stop her from sucking the life blood from helpless humans. Each of the four episodes chronicle one of Miyu's encounters with a Shinma and the humans that it is affecting, from the perspective of Himiko's pursuit of Miyu. \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/12/78948.webp","source":"Manga","numberOfEpisode":"4","studio":"AIC","type":"OVA","score":7.01,"genres":["Action","Horror","Demons","Drama","Vampire","Shoujo"]},{"title":"Night Walker: Mayonaka no Tantei","synopsis":"Shido Tatsuhiko is not only a private eye... he is also a vampire with no real memory of his past. Joined by Yayoi Matsunaga, a female government agent, Riho Yamazaki, an orphaned teenage girl working as his girl Friday and Guni, a little green imp, Shido must face demonic creatures known as Nightbreed. Meanwhile, Cain, the vampire who made him what he is now, is seeking him...\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/31985.webp","source":"Visual novel","numberOfEpisode":"12","studio":"AIC","type":"TV","score":6.98,"genres":["Action","Comedy","Horror","Mystery","Vampire"]},{"title":"Blood Lad: Kanketsu Kinen","synopsis":"A short conclusion memorial PV promoting the final tankoubon volume of the Blood Lad manga going on sale. The PV shows various moments throughout the whole manga. ","img":"https://cdn.myanimelist.net/images/anime/11/83781.webp","source":"Manga","numberOfEpisode":"1","studio":"Brain's Base","type":"ONA","score":6.53,"genres":["Music","Shounen","Vampire"]},{"title":"Hitsuji no Uta","synopsis":"Kazuna's family has a history of suffering from a disease that creates an uncontrollable vampire-like thirst for blood. Knowing none of this, Kazuna was sent to live with the Eda couple as a child. As the sickness begins to show signs of being present within himself, he comes into contact with his older sister, Chizuna, who has been suffering from it since early childhood. Knowing that the sickness incurs a heavy weight upon those that suffer from it, Chizuna tries to ease her brother's burden, to help him learn to control his urges, but... \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/7/18066.webp","source":"Manga","numberOfEpisode":"4","studio":"Madhouse","type":"OVA","score":6.29,"genres":["Horror","Drama","Vampire"]},{"title":"Servamp Movie: Alice in the Garden","synopsis":"The film's story will deal with Misono Alicein's past.\n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/5/89004.webp","source":"Manga","numberOfEpisode":"1","studio":"Platinum Vision","type":"Movie","score":7.18,"genres":["Action","Comedy","Supernatural","Drama","Vampire","Josei"]},{"title":"Vampire Hunter","synopsis":"The world is a dark, brooding place populated by humans, but ruled in reality by powerful beings known as the Darkstalkers, and there is constant conflict between them as they try to determine who is the most powerful of them all. Zombies, vampires, werewolves - all of them compete in contests of strength and sheer will to attain their own personal goals. \n\nAll of this becomes moot when a race of Aztec robots called the Huitzil decide that humanity isn't worth saving, and start waging war on the world, while in the sky, a solar god from outer space plots the conquest of Earth. And the Darkstalkers must become unwilling allies in order to save the world. \n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/2/7358.webp","source":"Game","numberOfEpisode":"4","studio":"Madhouse","type":"OVA","score":6.67,"genres":["Action","Adventure","Supernatural","Drama","Vampire","Fantasy"]},{"title":"Dance in the Vampire Bund: Special Edition","synopsis":"A Dance in the Vampire Bund recap episode featuring re-edited footage from the first 7 episodes.","img":"https://cdn.myanimelist.net/images/anime/5/21014.webp","source":"Manga","numberOfEpisode":"1","studio":"Shaft","type":"Special","score":6.56,"genres":["Action","Supernatural","Vampire"]},{"title":"Owarimonogatari 2nd Season Recaps","synopsis":"Two recaps aired before the first episode of the day at the time Owarimonogatari 2nd Season was airing.\n\nEpisode 0.5 (aired before Mayoi Hell) - Owari ni Mukau Monogatari (Heading Towards the End of the Story): Araragi's voice actor Hiroshi Kamiya retells events from Koyomi Vamp, Mayoi Maimai, Shinobu Time, Yotsugi Doll, Koyomi Nothing and Koyomi Dead.\n\nEpisode 4.5 (aired before Ougi Dark) - Araragi Koyomi no Monogatari (Araragi Koyomi's Story): Hanekawa's voice actor Yui Horie looks back at Araragi's past year and what happened to him throughout the series. ","img":"https://cdn.myanimelist.net/images/anime/9/88962.webp","source":"Light novel","numberOfEpisode":"2","studio":"Shaft","type":"Special","score":7.8,"genres":["Mystery","Comedy","Supernatural","Vampire"]},{"title":"Dance with Devils: Fortuna","synopsis":"Ritsuka Tachibana. She lives a calm and unchanging life. Ritsuka's older brother Lindo returns from studying abroad in the United Kingdom. Shikou Academy student council president Rem Kaginuki calls on the girl, and she begins having mysterious encounters with the student council members. Her life changed a little from that day, but Ritsuka expected nothing more. \n\nHowever, she comes home to find her mother collapsed with suspicious hooded men nearby. They were not human but devils, vampires, and exorcists seeking the Forbidden Grimoire. Ritsuka's former daily life crumbles around her, and she finds herself slowly becoming attracted to Rem, who helps her in her predicament. On the other hand, confusion deepens with regard to her brother who carries a secret. Ritsuka is unsure what path to choose as she finds herself at the center of a love story.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/86240.webp","source":"Original","numberOfEpisode":"1","studio":"Brain's Base","type":"Movie","score":6.45,"genres":["Harem","Demons","Supernatural","Romance","Vampire","Shoujo"]},{"title":"Blood-C: Special Edition","synopsis":"Two summary episodes of the TV series that are airing prior to Blood-C: The Last Dark.  They will feature secret content that was never aired during the TV series' run.","img":"https://cdn.myanimelist.net/images/anime/11/39001.webp","source":"-","numberOfEpisode":"2","studio":"Production I.G","type":"Special","score":6.76,"genres":["Action","Horror","School","Supernatural","Vampire"]},{"title":"Hakuouki Hekketsuroku Episode 0","synopsis":"Summary of the first season of Hakuouki Shinsengumi Kitan. Aired the week before the second season began. ","img":"https://cdn.myanimelist.net/images/anime/9/26949.webp","source":"Visual novel","numberOfEpisode":"1","studio":"Studio Deen","type":"Special","score":7.13,"genres":["Action","Harem","Historical","Supernatural","Drama","Samurai","Vampire","Josei"]},{"title":"Kaibutsu Oujo: Konsui Oujo","synopsis":"Episode 26 included in the ninth DVD volume of Kaibutsu Oujo.","img":"https://cdn.myanimelist.net/images/anime/13/22440.webp","source":"Manga","numberOfEpisode":"1","studio":"Madhouse","type":"Special","score":7.02,"genres":["Action","Comedy","Horror","Supernatural","Vampire","Shounen"]},{"title":"Legend of Duo","synopsis":"The fate of mankind is doomed in the early 21st century due to losing \"purana,\" an essence of living force supporting all life forms. Not willing to witness the extinction of mankind, a vampire named Duo disclosed the secret of purana to humans, saving the latter from destruction. However, just like Prometheus in Greek mythology got punished for bringing fire to mankind, Duo is punished for breaking the taboo. The vampire sent to punish him is Zieg, Duo's best friend, or, more than the best friend.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/23556.webp","source":"Original","numberOfEpisode":"12","studio":"Marine Entertainment","type":"TV","score":4.97,"genres":["Supernatural","Drama","Vampire","Shounen Ai"]},{"title":"Devils Line: Anytime Anywhere","synopsis":"Bundled with the limited edition of the manga' 12th compiled volume.","img":"https://cdn.myanimelist.net/images/anime/1471/93329.webp","source":"Manga","numberOfEpisode":"1","studio":"Platinum Vision","type":"OVA","score":6.85,"genres":["Action","Supernatural","Drama","Romance","Vampire","Seinen"]},{"title":"Strike the Blood: Kieta Seisou-hen","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1918/103377.webp","source":"Light novel","numberOfEpisode":"1","studio":"Connect","type":"OVA","score":6.84,"genres":["Action","Supernatural","Ecchi","Vampire","Fantasy"]},{"title":"Wild Arms: Twilight Venom","synopsis":"This anime is based on a playstation game under the same title. The story is about four people who travel the desolated land of Filgaea and carve themselves a legendary story while they're at it. These adventurers are Sheyenne Rainstorm, a gunslinger who holds the legendary weapon called ARMs; Kiel Aromax, a scientist who looks like he should be carrying a sword; Roleta Oratorio the Crest Sorceress, a magic-user who uses cards called Crests to cast spells; and Mirabelle Graceland, one of the Noble Red, which are a family of vampiric creatures who live alongside human beings They also travel with cute little intelligent furry things, from the Popepi Pipepo Tribe, named Isaac and Jerusha.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1532/94186.webp","source":"Game","numberOfEpisode":"22","studio":"Bee Train","type":"TV","score":6.68,"genres":["Action","Sci-Fi","Adventure","Magic","Vampire","Fantasy"]},{"title":"Renkin San-kyuu Magical? Pokaan Specials","synopsis":"DVD specials.","img":"https://cdn.myanimelist.net/images/anime/11/74299.webp","source":"Original","numberOfEpisode":"3","studio":"Remic","type":"Special","score":6.93,"genres":["Comedy","Parody","Magic","Ecchi","Vampire"]}]