[
  { "title": "Aki-Sora: Yume no Naka", "synopsis": "A sequel to Aki-Sora under a new name.", "img": "https://cdn.myanimelist.net/images/anime/12/23461.webp", "source": "Manga", "numberOfEpisode": "2", "studio": "Hoods Entertainment", "type": "OVA", "score": 6.2, "genres": ["Ecchi", "Romance", "Seinen", "Yuri"] },
  {
    "title": "Sono Hanabira ni Kuchizuke wo: Anata to Koibito Tsunagi",
    "synopsis": "My name is Sawaguchi Mai. I always get myself involved with my classmate, Kawamura Reo. Reo is pretty short and has silky hair... In short, she's cute. But sometimes, she can be really obstinate. I'm trying to do my best to get her to get along with the rest of the class, but since we're both headstrong we always end up fighting. It's so frustrating, especially since she can't do anything without me around!\n\nBut whenever I talk to her, Reo always acts like I'm bothering her. I wonder if she hates me... But then, just when I got all depressed Reo came up to me and told me, \"You've got it all wrong! I love you, Mai! I love you so much!\" Her confession completely took me by surprise. Could it be that I'm in love with Reo too?!\n\n(Source: DLsite)",
    "img": "https://cdn.myanimelist.net/images/anime/5/24845.webp",
    "source": "Visual novel",
    "numberOfEpisode": "1",
    "studio": "ChuChu",
    "type": "OVA",
    "score": 7.3,
    "genres": ["Hentai", "School", "Yuri"]
  },
  { "title": "Discipline", "synopsis": "The story revolves around Takuro Hayami who transferred to the mostly female Saint Arcadia School. Seemingly all of the girls want to have sex with him because the school only recently started admitting male students. Takuro seems like a normal student, but what the girls later realize when they try to take advantage of him is that he has a secret. Takuro has an \"Ultimate Sex Power\" that becomes the focus of St. Arcadia's sexual power struggle.", "img": "https://cdn.myanimelist.net/images/anime/9/4536.webp", "source": "Visual novel", "numberOfEpisode": "6", "studio": "Studio 9 MAiami", "type": "OVA", "score": 6.92, "genres": ["Hentai", "School", "Yuri"] },
  { "title": "Shoujo Sect", "synopsis": "Ten years ago, Shinobu Handa and Momoko Naitou met on a playground and became friends. Before their separation, they shared a kiss and a promise that they would see each other again. Years later, Shinobu still remembers that vow, but Momoko has forgotten it. \n\nNow the two attend the same school. However, their personalities are complete opposites. Shinobu is a delinquent collecting a string of lovers, but Momoko is a serious student and a member of the disciplinary committee. Shinobu uses her flirtatious nature to try to make Momoko rediscover the bond and feelings they once shared. \n\nVarious stories of love and lust envelop Momoko and Shinobu's lives. Can these two find their way back to one another?\n\n[Written by MAL Rewrite]", "img": "https://cdn.myanimelist.net/images/anime/12/22992.webp", "source": "Manga", "numberOfEpisode": "3", "studio": null, "type": "OVA", "score": 6.75, "genres": ["Comedy", "Hentai", "Romance", "Yuri"] },
  { "title": "Futa-bu!", "synopsis": "Akane Niimura is bored with her high school experience. In search of some extra stimulation, she decides to join the Futa Club as a “service member.” The club is made up of futanari - hermaphrodites - who spend their club time thoroughly enjoying each other.\n\nDespite wanting to be a part of the Futa Club, Akane is actually an ordinary girl. Thanks to that, her “service” duties are restricted to letting the other members of the club have their way with her. Akane is more than willing, but will she be able to pass the entrance exam?", "img": "https://cdn.myanimelist.net/images/anime/1943/103851.webp", "source": "Manga", "numberOfEpisode": "2", "studio": "Studio 9 MAiami", "type": "OVA", "score": 7.14, "genres": ["Hentai", "School", "Yuri"] },
  { "title": "Futa-bu!!", "synopsis": "A relaxing vacation at the Manra Valley onsen is just what the members of the Futabu, or Futanari Club, signed up for. Officially, their goal is to research the harvest festival native to the area for a high school project. Unofficially, they're there to have a little fun, and the springs are an aphrodisiac...", "img": "https://cdn.myanimelist.net/images/anime/7/77908.webp", "source": "Manga", "numberOfEpisode": "2", "studio": "Studio 9 MAiami", "type": "OVA", "score": 7.24, "genres": ["Hentai", "School", "Yuri"] },
  { "title": "Bikini Warriors Special", "synopsis": "According to the official Hobby Japan website, an unaired episode of Bikini Warriors will be bundled with the Blu-ray volume to be released on December 9th, 2015. \n\n(Source: Hobby Japan)", "img": "https://cdn.myanimelist.net/images/anime/12/78515.webp", "source": "Other", "numberOfEpisode": "1", "studio": "feel.", "type": "Special", "score": 5.45, "genres": ["Comedy", "Parody", "Ecchi", "Fantasy", "Yuri"] },
  { "title": "Seikon no Qwaser II Picture Drama", "synopsis": "BD Specials.", "img": "https://cdn.myanimelist.net/images/anime/3/30153.webp", "source": "-", "numberOfEpisode": "4", "studio": "TAKI Corporation", "type": "Special", "score": 6.04, "genres": ["Ecchi", "Yuri"] },
  { "title": "Futa-bu! Mix: Futanari World", "synopsis": "Sequel to Futabu!! Based on the adult doujin by BOSSHI.", "img": "https://cdn.myanimelist.net/images/anime/12/74645.webp", "source": "Manga", "numberOfEpisode": "1", "studio": null, "type": "OVA", "score": 6.72, "genres": ["Hentai", "School", "Yuri"] },
  { "title": "Nikutai Ten'i", "synopsis": "Kenichi and several of his friends stay after school to look at a new archaeological find, a bizarre looking mirror. Suddenly, the entire building is transported to an alternate dimension and a magic field surrounds it to prevent them from escaping. Also, their minds have switched to other people's bodies. The only way to switch bodies is when their sexual emotions are high. Kenichi must find a way to return everything back to normal before the dimension falls apart.\n\n(Source: ANN) ", "img": "https://cdn.myanimelist.net/images/anime/12/41583.webp", "source": "Visual novel", "numberOfEpisode": "2", "studio": "Arms", "type": "OVA", "score": 6.34, "genres": ["Hentai", "Yuri"] },
  { "title": "Honoo no Haramase Tenkousei", "synopsis": "The main character, Tatsuya Tagami, has an ambition of World Conquest, and the first step of his plan is to make every female classmate pregnant. Unfortunately, his dream is rather impossible in his all-boys school. Hence, he transfers himself to the newly reorganized Hakuka Co-Ed Academy, which was previously an all-girls school. \n\n(Source: ANN) \n", "img": "https://cdn.myanimelist.net/images/anime/1198/104004.webp", "source": "Visual novel", "numberOfEpisode": "3", "studio": null, "type": "OVA", "score": 6.74, "genres": ["Harem", "Hentai", "School", "Yuri"] },
  {
    "title": "Ice",
    "synopsis": "By A.D. 2010, all men have died off quickly due to a dramatic change in the environment and an unknown contaminant. The population decreased to the lowest number ever seen...until only the women were left alive.\n\nThey live huddled in small corners of a world mostly reclaimed by nature.\nThere are those who accept their inevitable extinction and live a carefree life...\nThere are those who try to continue on the race with the help of science...\nIt is a society of constant conflict over their differences of principles and policies.\n\nThe story takes place in the center of Tokyo. It is one of the places left for them. The conflict over the specimen of \"ICE\" and the chance it may provide to save humanity begins. \n\n(Source: AnimeNfo)",
    "img": "https://cdn.myanimelist.net/images/anime/1/2329.webp",
    "source": "Original",
    "numberOfEpisode": "3",
    "studio": "PPM",
    "type": "OVA",
    "score": 5.45,
    "genres": ["Action", "Military", "Sci-Fi", "Shoujo Ai", "Yuri"]
  },
  { "title": "Honoo no Haramase Doukyuusei", "synopsis": "Kazuya is a high school student. He is forced to move to a school dormitory because his parents have gone abroad on business, and they sold their house before leaving Japan. But, his school has no boys' dormitory, so he begins to live at a girls' dormitory. One day, he secretly peeks into the school sick-room while girls are under regular physical checkup, and he is surprised at their erotic breasts. He makes a vow to get their bodies and breasts....", "img": "https://cdn.myanimelist.net/images/anime/10/13159.webp", "source": "Visual novel", "numberOfEpisode": "2", "studio": null, "type": "OVA", "score": 6.72, "genres": ["Harem", "Hentai", "School", "Yuri"] },
  {
    "title": "G-Taste",
    "synopsis": "Volume #1: A Taste of Honey (Eps #1-3)\n\nAlthough she tries hard, lovely office worker Moe bungles her assignments more often than not. She'd fare better if she spent more time working and less time playing with the office equipment, but it wouldn't be near as much fun. Nana's so cute in her maid's outfit that it's easy to see why everyone wants a piece of her. And while domineering Mai is used to being the boss, she's going to discover the joys of humiliation. A taste will only leave you wanting more, so obey your sweet tooth.\n\nVolume #2: Heat Wave (Eps #4-6)\n\nSayaka is trying to be a prim and proper teacher, but every time she steps in front of a classroom she gets hot... And turning up the air conditioner isn't going bring her temperature down one bit. Misuzu may be a world-class swimmer, but the cold water in the practice pool only heats things up. She's one bathing beauty who doesn't need a sauna to make things steamy. The heat index will soar as these two lovely ladies do their best to set the screen on fire.\n\n(Source: AniDB)",
    "img": "https://cdn.myanimelist.net/images/anime/5/61909.webp",
    "source": "Manga",
    "numberOfEpisode": "7",
    "studio": null,
    "type": "OVA",
    "score": 5.95,
    "genres": ["Hentai", "Yuri"]
  },
  { "title": "Choukou Sennin Haruka", "synopsis": "Takamaru is a student at the Ten Treasure Academy, living an ordinary school life, seeking romances which are constantly interfered by Shihoudou Narika (the daughter of his apartment manager). One day, he fell in love at first sight with a transfer student named Takamori Haruka. On that very night, Takamaru and Narika became pursued by a group of mysterious ninja. Just when they thought all hope is lost, Haruka appeared in kunoichi attire. Haruka referred to Takamaru as \"young boss\", and asked him to do H stuff towards her. This gave her superhuman power that enabled her to defeat the mysterious ninjas. \n\nHowever, this was just the beginning of a very long battle.\n\n(Source: AlicesoftWiki)", "img": "https://cdn.myanimelist.net/images/anime/4/37293.webp", "source": "Visual novel", "numberOfEpisode": "3", "studio": null, "type": "OVA", "score": 6.11, "genres": ["Hentai", "Yuri"] },
  { "title": "Cream Lemon", "synopsis": "A collection of short stories, ranging from soap opera (the Ami series) to fantasy (Rall series) to horror (Cream Lemon Dark) to parody (Pop Chaser). It does deal with a lot of heavy perversions ranging from S&amp;M, male rape (by a bunch of females, that is), bondage, torture, yuri (lesbian love) and incest.\n\n(Source: AniDB)", "img": "https://cdn.myanimelist.net/images/anime/10/24804.webp", "source": "Original", "numberOfEpisode": "38", "studio": "APPP", "type": "OVA", "score": 6.32, "genres": ["Parody", "Fantasy", "Comedy", "Romance", "Hentai", "Drama", "Sci-Fi", "Yuri"] },
  { "title": "Star☆Jewel", "synopsis": "A war is being fought between the goddesses of dark and light. While the former try to steal the jewels from innocent women, leaving lifeless husks, the latter hunt the evildoers. Both types of goddesses are equipped with powers to fight, but their strongest weapons are their retractable penises—flooding the enemy with pleasure is the only sure-fire way to win. \n\n(Source: AniDB) ", "img": "https://cdn.myanimelist.net/images/anime/11/34879.webp", "source": "Original", "numberOfEpisode": "1", "studio": null, "type": "OVA", "score": 6.5, "genres": ["Hentai", "Yuri"] },
  { "title": "Anata no Shiranai Kangofu: Seiteki Byoutou 24 Ji", "synopsis": "The main character has been hospitalized for medical checkup. As nurses take care of him kindly, his sexual desire gradually becomes bigger.... \"If they took care of my sexual desire as well, it would be great....\" One day, he receives an email from someone unknown. \"Do you know what will happen to the girls who have been sexually insulted completely?\" The email arouses his sexual desire, and he finally starts raping the nurses....\n\n(Source: ErogeShop)", "img": "https://cdn.myanimelist.net/images/anime/4/14031.webp", "source": "Visual novel", "numberOfEpisode": "2", "studio": null, "type": "OVA", "score": 6.11, "genres": ["Hentai", "Yuri"] },
  { "title": "Nageki no Kenkou Yuuryouji", "synopsis": "Hiroe Ogawa is a healthy, normal girl with an extraordinary, private dilemma. Hiroe is unable to reach sexual climax under any circumstances. Over Hiroe's objections, older housemate Mayaka and landlady Yayoi use a varity of sexual techniques, appendages, and even hypnotism in order to help Hiroe achieve her elusive goal.\n\n(Source: ANN)", "img": "https://cdn.myanimelist.net/images/anime/9/41561.webp", "source": "-", "numberOfEpisode": "3", "studio": "AIC", "type": "OVA", "score": 6.25, "genres": ["Comedy", "Hentai", "Yuri"] },
  { "title": "Onmyouji Ayakashi no Megami: Inran Jubaku", "synopsis": "An evil goddess is trying to gain absolute power via absorbing the life energy of a human using a woman as a succubus. Four minor goddesses try to stop her, the goddess of Tiger, Dragon, Phoenix and Turtle, but their efforts seem useless as two of them fall under control of the evil goddess. The life of the young human is being absorbed so they must hurry to save him.\n", "img": "https://cdn.myanimelist.net/images/anime/2/29388.webp", "source": "Original", "numberOfEpisode": "2", "studio": null, "type": "OVA", "score": 5.97, "genres": ["Hentai", "Yuri"] },
  { "title": "Inko", "synopsis": "The female employees of a hamburger joint are subject to their manager's perversions while on the clock. Lena and Ayaka, both working at the shop, participate in these covert workplace activities while also enjoying each other's company in secret. But when they are caught messing around in the locker room by their manager, he has a special punishment in mind. Responding to the mysterious call from the end of Inbo, the two girls' classmate Masaru soon arrives to help the manager...\n\n[Written by MAL Rewrite]", "img": "https://cdn.myanimelist.net/images/anime/1947/104060.webp", "source": "Original", "numberOfEpisode": "3", "studio": null, "type": "OVA", "score": 5.7, "genres": ["Hentai", "Yuri"] },
  { "title": "Stainless Night", "synopsis": "After ten years of dormancy, Linea awakes from a capsule in the countryside of Japan. Without any memories, she wanders into a small research center staffed by three beautiful women. One of the researchers, Sayako, is entranced by the strange woman and leaves her present lover. Sayako takes Linea to bed, and finds that her abilities are beyond that of any ordinary woman. \n\n(Source: ANN)", "img": "https://cdn.myanimelist.net/images/anime/3/62803.webp", "source": "-", "numberOfEpisode": "2", "studio": null, "type": "OVA", "score": 6.12, "genres": ["Hentai", "Yuri"] },
  { "title": "Bakuhatsu Sunzen!! Tenshi no Countdown", "synopsis": "Motoki is a junior-high student who can't ever concentrate on homework because of his sisters loud lesbian sex in the other rooms, he doesn't think life can get much worse.....until he gets a tutor and falls in love with her, from which he becomes a sex slave for her.\n\n(Source: ANN)", "img": "https://cdn.myanimelist.net/images/anime/2/4496.webp", "source": "-", "numberOfEpisode": "1", "studio": null, "type": "OVA", "score": 5.54, "genres": ["Comedy", "Hentai", "Yuri"] },
  { "title": "Mitama: Nin", "synopsis": "The world has fallen into disorder, it divided into the north and the south and after kakamura has been destroyed both lands now fight over the world.  capitals gave been born, one in the north and one in the south with its respective Emperor. In this age there are people  who live as Shinobi/Ninjas...", "img": "https://cdn.myanimelist.net/images/anime/8/13391.webp", "source": "Visual novel", "numberOfEpisode": "2", "studio": null, "type": "OVA", "score": 5.87, "genres": ["Demons", "Hentai", "Martial Arts", "Yuri"] },
  { "title": "Houkago Mania Club: Koi no Hoshii no", "synopsis": "Why join a boring club like the literature or baseball club when you can be part of \"After school Mania club\", its a club that encourages conversation between its members to get to know each other better and ultimately have a date. After their usual meeting on a cafeteria the members can go shopping, find a girlfriend or boyfriend or why not, discover each other sexual preferences.\n\nBased on a game of the same name by Libido.", "img": "https://cdn.myanimelist.net/images/anime/3/26199.webp", "source": "Visual novel", "numberOfEpisode": "2", "studio": null, "type": "OVA", "score": 5.31, "genres": ["Hentai", "Yuri"] },
  { "title": "Dounika Naru Hibi", "synopsis": "A collection of short stories that take a refreshing and humorous look at the sexual relationships between young people in Japan.\n\n(Source: Kotonoha)", "img": "https://cdn.myanimelist.net/images/anime/1924/106583.webp", "source": "Manga", "numberOfEpisode": "1", "studio": "LIDENFILMS", "type": "Movie", "score": null, "genres": ["Slice of Life", "Drama", "Romance", "Yaoi", "Yuri"] },
  { "title": "G-Taste (2010)", "synopsis": "This OVA features five of the most popular girls from G-Taste: Riona Kisaragi, Yuki Shihoudou, Nana Morimura, Asuka Senou and Mai Kannazuki.", "img": "https://cdn.myanimelist.net/images/anime/10/61779.webp", "source": "Manga", "numberOfEpisode": "1", "studio": "AIC Plus+", "type": "OVA", "score": 5.36, "genres": ["Ecchi", "Yuri"] },
  { "title": "Parade Parade", "synopsis": "Meet Kaori Shiina. She's beautiful. She's talented. She's a pop idol. However, she has a secret, one which would destroy her career if it were ever revealed...", "img": "https://cdn.myanimelist.net/images/anime/5/41639.webp", "source": "Manga", "numberOfEpisode": "2", "studio": null, "type": "OVA", "score": 6.01, "genres": ["Hentai", "Music", "Yuri"] },
  { "title": "Soushitsukyou", "synopsis": "Naoto and his lover Miyuki were going to ski resort; however, their bus was stalled in blizzard. The passengers were helped by Natsuyo, a landlady of a Japanese style hotel, and they decided to stay at the hotel for a while. At that night, Naoto and Miyuki made love at the hotel over and over, but he couldn’t be satisfied, and finally he began to love Natsuyo. The situation was the same with other passengers. In this closed space, ritual and accidents continued... A bizarre and erotic story was just begun...\n\n(Source: AnimeNfo)", "img": "https://cdn.myanimelist.net/images/anime/9/11024.webp", "source": "Visual novel", "numberOfEpisode": "1", "studio": null, "type": "OVA", "score": 5.21, "genres": ["Hentai", "Yuri"] },
  { "title": "Body Jack: Tanoshii Yutai Ridatsu", "synopsis": "Dr. Toyama takes control of the body of a beautiful girl with his strange invention. He lets the young Asagedani \"slip into\" her body so he can see how it real feels to be a girl. Then Komaba's classmate, the equally beautiful Nakano, surprises \"him\" and mistakes his activities for a sexual advance from her friend.\n\n(Source: ANN)", "img": "https://cdn.myanimelist.net/images/anime/1606/94217.webp", "source": "Original", "numberOfEpisode": "1", "studio": null, "type": "OVA", "score": 5.33, "genres": ["Comedy", "Ecchi", "Yuri"] },
  { "title": "Ogenki Clinic", "synopsis": "Whatever problem a patient may have with sex, the wacky Dr. Okeguri and his sexy nurse, Ruko, are here to help! Using a variety of unconventional methods and an extremely affectionate bedside manner, this team is devoted to bringing pleasure to those in pain and joy to those in despair. \n\n(Source: AniDB)", "img": "https://cdn.myanimelist.net/images/anime/6/59729.webp", "source": "-", "numberOfEpisode": "3", "studio": null, "type": "OVA", "score": 5.93, "genres": ["Comedy", "Hentai", "Yuri"] },
  {
    "title": "Otenki Oneesan",
    "synopsis": "Hurricane Keiko has arrived! The newscast weather segment. Usually the last thing anyone ever thinks about (unless they said \"sun\" and it wound up being \"rain\") but Keiko Nakadai's going to change all that. Toiling in obscurity for years at a horribly rated TV station, Keiko has figured out what the weather report needs and doesn't mind taking off her top (or lifting her skirt) on the air to do it. The ratings aren't going to go down, that's for sure. \n\nOf course, some of the people at the station don't find this appealing, and decide that Keiko's got to go. They devise a series of horrible \"accidents\" for her, but Keiko usually seems to be about a step ahead of them. \n\nEventually, everyone at the station will discover that there's far more to her than meets the eye as Keiko's star rises incredibly quickly ... and as her importance increases, Michiko Kawai's (the old weather girl) drops. Something has got to be done, but who can do it? \n\n(Source: AnimeNfo) ",
    "img": "https://cdn.myanimelist.net/images/anime/6/50819.webp",
    "source": "-",
    "numberOfEpisode": "2",
    "studio": null,
    "type": "OVA",
    "score": 5.56,
    "genres": ["Comedy", "Hentai", "Yuri"]
  },
  {
    "title": "Utsukushiki Sei no Dendoushi Reirei",
    "synopsis": "Sweat-soaked bodies writhe in passion as a nurse and a doctor plot to murder the nurse's young ward; meanwhile, a young man endures the despair of unrequited love, unaware that the object of his desire is in love... with another woman!\n\nIf these hardly seem like sources for high comedy, perhaps it's because you're not Kaguya, a strangely powerful being with the ability to manipulate the fabric of reality, an extremely perverse sense of humor, and a propensity for baring her breasts.\n\nA living manifestation of the Hand (or some other bodily portion) of Fate, those who fall under Kaguya's twisted spell will never be the same again, for she delights in giving people their hearts' desires-and letting them suffer the consequences!\n\nTogether with her stumpy man-servant Pipi, Kaguya stages her human puppet shows with the flair of a master show-woman, foiling perfect murders, turning young men INTO the women of their dreams, and generally causing mass chaos and disaster.",
    "img": "https://cdn.myanimelist.net/images/anime/12/4250.webp",
    "source": "-",
    "numberOfEpisode": "2",
    "studio": null,
    "type": "OVA",
    "score": 5.58,
    "genres": ["Hentai", "Yuri"]
  },
  { "title": "Star☆Jewel Gaiden: Natsumi Oblivion", "synopsis": "A war is being fought between the goddesses of dark and light. While the former try to steal the jewels from innocent women, leaving lifeless husks, the latter hunt the evildoers. Both types of goddesses are equipped with powers to fight, but their strongest weapons are their retractable penises—flooding the enemy with pleasure is the only sure-fire way to win.\n\n(Source: AniDB)", "img": "https://cdn.myanimelist.net/images/anime/4/44740.webp", "source": "Original", "numberOfEpisode": "1", "studio": null, "type": "OVA", "score": 5.19, "genres": ["Hentai", "Yuri"] },
  { "title": "Tsuki Kagerou", "synopsis": "Based on the game by Studio Miris.", "img": "https://cdn.myanimelist.net/images/anime/5/8803.webp", "source": "Visual novel", "numberOfEpisode": "3", "studio": null, "type": "OVA", "score": 5.57, "genres": ["Hentai", "Yuri"] },
  {
    "title": "Kojin Jugyou",
    "synopsis": "Even as a young girl, Sara Iijima was a large-breasted woman. Because of this, she had felt self-conscious about herself... especially with men who were constantly leering at her. This only intensified when she was attacked by a rapist with a breast fetish. Although she escaped unharmed, this only made worse her insecurities. It was only because of the intervention of Dr. Chang that she was able to feel good about herself. Out of gratitude, Sara became Dr. Chang's protege in the method of psychic feedback, the method which was used to cure her of her insecurities.\n\nHowever, Dr. Sara's method of therapy is vastly different than what Dr. Chang had used. By swinging her huge breasts in a circle, she is able to induce a hypnotic trance in her patients, after which she is able to learn what is bothering the patient and offer the proper solution. There is a risk of using this: Sara is often vulnerable to the sexual appetites of her patients and she must maintain control of the situation\n\nSara is not alone, though. She is often accompanied by Tamine, a man who cannot seem to get a woman, no matter how he tries. But Tamine is devoted to Sara (mostly because of her huge breasts, which he is able to cop a feel whenever the chance arises), and aids her in helping others in need.",
    "img": "https://cdn.myanimelist.net/images/anime/11/66911.webp",
    "source": "-",
    "numberOfEpisode": "2",
    "studio": "J.C.Staff",
    "type": "OVA",
    "score": 5.5,
    "genres": ["Comedy", "Hentai", "Yuri"]
  },
  { "title": "My Life As", "synopsis": "It's been six months since Yasunari ran away from home. He is saved from the streets by Fumi and Rino (Aurora Snow), and ends up living with them as their pet. Along with his friend Chie (Britttany Andrews), he is introduced to a new world of S &amp;amp; M, and group sex. He publishes his new sexual experience in a magazine, which ends up in the hands of his brother, Tomoyasu. \n\nTomoyasu is desperate to find his brother. He is seriously upset after finding that his brother is enjoying his new life as a pet. When a new tutor, Serina, arrives unexpectedly, he takes out his anger and fustration of his broken home on Serina by forcing himself on her. Unknown to Tomoyasu, Serina is the friend of Yasunari's three masters! \n\n(Source: AniDB)", "img": "https://cdn.myanimelist.net/images/anime/3/11011.webp", "source": "Manga", "numberOfEpisode": "1", "studio": null, "type": "OVA", "score": 5.19, "genres": ["Comedy", "Hentai", "Yuri"] },
  { "title": "Shinseiki Cream Lemon", "synopsis": "No synopsis has been added for this series yet.\n\nClick here to update this information.", "img": "https://cdn.myanimelist.net/images/anime/9/25836.webp", "source": "-", "numberOfEpisode": "2", "studio": null, "type": "OVA", "score": 5.69, "genres": ["Hentai", "Yuri"] },
  { "title": "Suashi no Houkago", "synopsis": "Part of Little Mermaid Series along with Telepatist IQ315, Punky Funky Baby and Shining May.\n", "img": "https://cdn.myanimelist.net/images/anime/4/24803.webp", "source": "-", "numberOfEpisode": "1", "studio": null, "type": "OVA", "score": 5.19, "genres": ["Hentai", "Yuri"] }
]
