[{"title":"Pa Para Papa","synopsis":"A happy husband and wife enjoy eachother's company and go for scenic drives in their car.","img":"https://cdn.myanimelist.net/images/anime/1607/91754.webp"},{"title":"Kkoma Bus Tayo","synopsis":"Tayo the Little Bus is about exciting adventures that are to happen in the metropolitan city where different vehicles live with harmony with one another. Tayo is just starting to learn his route in this busy city centre and on his journey, he is making many new friends. Full of unique characters that capture children's imaginations and fun storylines, the series has a lot to offer.\n\n(Source: Official YouTube channel)","img":"https://cdn.myanimelist.net/images/anime/1580/93262.webp"},{"title":"Dash! Yonkurou: Horizon Gundan vs. Dash Gundan","synopsis":"A TV Special of Dash! Yonkurou that aired 4 months after the TV anime ended.\n\nBecause the Dash Warriors won against Oomiya's senior citizen team the Silver Warriors, they travel to the Amazon in Brazil to try out his natural tracks that he built. When the arrive they find the natural track has been destroyed by a storm when they are suddenly attacked by the Amazon Warriors. One of the boys has Horizon, an original Mini 4WD created by Yonkurou's father who disappeared.","img":"https://cdn.myanimelist.net/images/anime/1728/99056.webp"},{"title":"Chuldong! Super Wings","synopsis":"Super Wings follows the adventures of an adorable jet plane named Jett who travels around the world delivering packages to children. On every delivery, Jett encounters new problems that he must solve with the help of his friends the \"Super Wings\": Dizzy, Jerome and Donnie. Together, the team explores different countries and learns the diversity of new cultures.\n\n(Source: Official YouTube channel)","img":"https://cdn.myanimelist.net/images/anime/1000/95652.webp"},{"title":"Kkoma Bus Tayo-ui Ace Guchuljakjeon","synopsis":"It all starts when Duri lost his favorite sport car “Ace”. As Duri accidentally drops Ace on the road while he’s running, Rubby found Ace on the road while he was cleaning the street. Rubby thought it was garbage, so threw Ace away on the garbage dumb. So as Hana, Duri and Tayo rushed and went to find Ace, he was already taken away to the Land of Toys! Toy Land is where old and abandoned toys come to live together without humans! (Only lucky toys though!) Will Duri be able to find Ace and bring him back? It will be a fun but a long adventure, so come with us!\n\n(Source: Official YouTube channel)","img":"https://cdn.myanimelist.net/images/anime/1119/93265.webp"},{"title":"Kkoma Bus Tayo 2","synopsis":"The second season of Kkoma Bus Tayo.","img":"https://cdn.myanimelist.net/images/anime/1266/93263.webp"},{"title":"Lei Su Deng Shandian Chong Xian 3","synopsis":"The third season of Lei Su Deng Shandian Chong Xian.","img":"https://cdn.myanimelist.net/images/anime/1317/94789.webp"},{"title":"Chuldong! Super Wings 2","synopsis":"The second season of Chuldong! Super Wings. One major change in the story is that uncle Jimbo has retired to travel the world and his niece, Sky, takes over being the main traffic controller for the airport.","img":"https://cdn.myanimelist.net/images/anime/1545/95653.webp"},{"title":"Sunny","synopsis":"Music video by Densuke28 for the single SUNNY by Japanese hip-hop group TOKYO HEALTH CLUB. The video features two near-identical continuously looping scenes, where viewers are encouraged to try and spot the ten differences between them.","img":"https://cdn.myanimelist.net/images/anime/1344/103234.webp"},{"title":"Kkoma Bus Tayo 5","synopsis":"The fifth season of Kkoma Bus Tayo.","img":"https://cdn.myanimelist.net/images/anime/1174/96018.webp"},{"title":"Titipo Titipo","synopsis":"Say hi to Tayo's new friend - Titipo! Train Center's new born little train Titipo has just passed the driving examination and is prepared to work at the Train Village. Although Titipo dreams of becoming the best train in the world, his curious yet random personality catches him in unforeseen events and troubles everyday. Titipo expands his experience in the greater world and befriends Genie, Diesel, and other little trains. Will Titipo achieve his dream of becoming the best train? Come join the railroad journey and meet Titipo and the little train friends.\n\n(Source: Official YouTube channel)","img":"https://cdn.myanimelist.net/images/anime/1521/93267.webp"},{"title":"Kkoma Bus Tayo 4","synopsis":"The fourth season of Kkoma Bus Tayo.","img":"https://cdn.myanimelist.net/images/anime/1515/93266.webp"},{"title":"Kkoma Bus Tayo 3","synopsis":"The third season of Kkoma Bus Tayo.","img":"https://cdn.myanimelist.net/images/anime/1313/93264.webp"},{"title":"Power Battle Watch Car","synopsis":"The series is set in the near future, when an automobile company named JHC Motors is depicted to have created the Watch Cars, which are miniature sentient robotic cars that are supposed to have become good companions to children and adults alike. Watch Cars are depicted to have become a global trend. There is a Battle League where Watch Cars and their trainers battle. Jino, one of the young Watch Car Masters, goes to the Watch Car Battle League with his Watch Car Blue-will, but The Rangers of Darkness an evil force to takeover al the watch cars in The city, Jino and his friends must stop them. \n\n(Source: Wiki)","img":"https://cdn.myanimelist.net/images/anime/1013/95954.webp"},{"title":"Power Battle Watch Car Season 2","synopsis":"The second season of Power Battle Watch Car.","img":"https://cdn.myanimelist.net/images/anime/1376/95955.webp"},{"title":"Power Battle Watch Car: Watch Gamyeon-ui Yeogseub","synopsis":"The second movie of Power Battle Watch Car. \n\nA letter gets delivered to Jino, the champion of Hero's Cup. It was an inviation to the Ultimate Watch Car Battle League that is notorious for its brutality. On the day of the UWB, Bluewill, Jino's Watch Car, is kidnapped by strangers on the way back home from the UWB but in the end he is recovered. \n\nJino hides his identity and along with Bluewill who disguises himself as Bluethunder, participates in UWB to stop their scheme. \n\nWill Watch Car be able to become the new hero of UWB?\n\n(Source: Han Cinema)","img":"https://cdn.myanimelist.net/images/anime/1669/95956.webp"},{"title":"Power Battle Watch Car: Minicar Battle League - Bulkkoch-ui Jilju","synopsis":"A movie of Power Battle Watch Car. The story is directly tied to episode 4 and 5 of the second season.\n\nDuring the Watch Car Battle League championship, Roy and Avan could grab a opportunity to join the Racing Battle that is open to popular racers only. Roy continues with his blazing races in order to win the battle and get closer to Ari, his longtime one-sided love. Roy’s blazing race towards victory and love begins!\n\n(Source: Han Cinema)","img":"https://cdn.myanimelist.net/images/anime/1095/95957.webp"},{"title":"Norimono Man: Mobile Land no Car-kun","synopsis":"The anime will depict various vehicles as characters in the \"Mobile Land\" island. The protagonist Car-kun arrives at the island as a delivery worker. Through his deliveries, he gets to know the residents of Mobile Land, all while following traffic rules and having his deliveries stopped by the meddling Sabibi. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1612/106288.webp"},{"title":"Tayo-ui Jangnangam Eodeubencheo","synopsis":"When Bella finds out that all the toys were not forgotten and was touched by Ace and Duri's friendship, she decides to help other toys to find their friends(owners) back. But, it seems that Louie isn't the lucky one to find his old friend, Kevin. Tayo and Lani decide to help Louie to find Kevin but there are adventures that they never thought of!\n\n(Source: Official YouTube channel)","img":"https://cdn.myanimelist.net/images/anime/1698/101725.webp"},{"title":"Arms Rally","synopsis":"A flash animation about a long distance tank race in the Taklimakan desert (a real desert in Northwest China). It aired within \"Fight Tension☆Depart,\" a variety program that originally aired the anime as one of its segments.","img":"https://cdn.myanimelist.net/images/anime/1888/105574.webp"},{"title":"Tayo-ui Gonglyong Eodeubencheo","synopsis":"As little buses said goodbye to Tino, they forgot about dinosaurs at all. But as little buses meet Anne, the mother of Hana the Mechanic, they hear about dinosaur mystery from Anne. \n\nHana isn't happy that her mother is still obsessed with dinosaurs and their history and such, Anne takes an adventure to find the dinosaurs and she even takes the little buses this time. \n\nMeet the newest addition to the Tayo Adventure Series!\n\n(Source: Official YouTube channel)","img":"https://cdn.myanimelist.net/images/anime/1895/103411.webp"},{"title":"Bite-Choicar","synopsis":"Chashin was selected by the legendary choicar \"Stormbone,\" as the strongest racer, and will showcase a new concept of bite racing.\n\nBite racing is a new racing game that never hits a rail with two cars chasing in a match. The bite-free rail running on the track creates a more realistic racing experience. Various types of super cars such as speed type, balance type, and power type create unique racing on 3 types of tracks (crash track, line track, outdoor race).\n\n(Source: enewstoday.co.kr)","img":"https://cdn.myanimelist.net/images/anime/1656/106927.webp"},{"title":"Gozonji! Kakuza Tousan","synopsis":"The second season of the Kakuza Tousan franchise.","img":"https://cdn.myanimelist.net/images/anime/1437/105576.webp"},{"title":"Zhu Zhu Xia: Jing Su Xiao Yingxiong","synopsis":"GG Bond is separated from his friends and lands in an unfamiliar part of the universe. He will have to rejoin his teammates and take part in speed races to find his way home. This season has 4 arcs, each arc is composed of 26 episodes.\n\n(Source: videoageinternational.net)","img":"https://cdn.myanimelist.net/images/anime/1653/106924.webp"},{"title":"Redline","synopsis":"Every five years, an exhilarating race called Redline is held, and the universe's most anticipated competition has only one rule: that there are none. Racers are pushed to their absolute limit—a feeling that daredevil driver JP knows all too well. Having just qualified to participate in Redline, he is eager to battle against the other highly skilled drivers, particularly the beautiful rising star and the only other human that qualified, Sonoshee McLaren.\n\nBut this year's Redline may be far more dangerous than usual—it has been announced to take place on the planet Roboworld with its trigger-happy military and criminals who look to turn the race to their own advantage. However, the potential danger doesn't stop the racers; in fact, it only adds to the thrill. Relying solely on his vehicle's speed, JP prepares for the event to come, aiming to take first place in the biggest race of his life.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/28553.webp"},{"title":"Initial D First Stage","synopsis":"Unlike his friends, Takumi Fujiwara is not particularly interested in cars, with little to no knowledge about the world of car enthusiasts and street racers. The son of a tofu shop owner, he is tasked to deliver tofu every morning without fail, driving along the mountain of Akina. Thus, conversations regarding cars or driving in general would only remind Takumi of the tiring daily routine forced upon him.\n\nOne night, the Akagi Red Suns, an infamous team of street racers, visit the town of Akina to challenge the local mountain pass. Led by their two aces, Ryousuke and Keisuke Takahashi, the Red Suns plan to conquer every racing course in Kanto, establishing themselves as the fastest crew in the region. However, much to their disbelief, one of their aces is overtaken by an old Toyota AE86 during a drive back home from Akina. After the incident, the Takahashi brothers are cautious of a mysterious driver geared with remarkable technique and experience in the local roads—the AE86 of Mount Akina.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/6801.webp"},{"title":"Initial D Second Stage","synopsis":"Following his victory over RedSuns leader Ryosuke Takahashi, AE86 driver Takumi Fujiwara is challenged by the Lancer EVO-based \"Emperor,\" a group known for taking decals of racing teams they defeat, cutting them up and placing them on their cars like a fighter plane kill board. Takumi's undefeated streak is on the line as his AE86 is virtually no match against the more powerful and more agile four-wheel-drive EVOs of the Emperor team. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/12750.webp"},{"title":"Initial D Fourth Stage","synopsis":"Takumi Fujiwara and brothers Keisuke and Ryousuke Takahashi have formed \"Project D,\" a racing team aimed at bringing their driving skills to their full potential outside their prefecture. Using the internet, Project D issues challenges to other racing teams and posts results of their races. Managed by Ryousuke, the team has Takumi engaging in downhill battles with his AE86, while Keisuke challenges opponents uphill. Among their rivals are the Seven-Star Leaf (SSR) and Todo-juku.","img":"https://cdn.myanimelist.net/images/anime/12/43927.webp"},{"title":"Initial D Third Stage","synopsis":"Shortly after graduating from high school, Takumi is approached by RedSuns leader Ryosuke Takahashi and offered to join him in forming a professional racing team. Before coming up with an answer to the proposal, Takumi seeks retribution by issuing a rematch to Emperor leader Kyouichi Sudou, who previously defeated him due to an engine failure. He is also challenged by Kai Kogashiwa, a second-generation street racer whose father was once a fierce rival of Takumi's father Bunta. \n","img":"https://cdn.myanimelist.net/images/anime/13/40397.webp"},{"title":"Initial D Fifth Stage","synopsis":"Taking place in the sacred land of street running Kanagawa, once more Takumi Fujiwara will show his driving skills in his now legendary Hachi-roku. ","img":"https://cdn.myanimelist.net/images/anime/3/43573.webp"},{"title":"Initial D Final Stage","synopsis":"After defeating every racing team in the prefecture, everything comes down to one last race. Takumi Fujiwara has never lost a race, but when his opponent is also using an AE86, it turns into a battle of the AE86. Will Project D succeed in the final and most difficult race of Initial D?","img":"https://cdn.myanimelist.net/images/anime/1404/101364.webp"},{"title":"Initial D Extra Stage","synopsis":"The Lancer EVO-driving group \"Emperor\" have defeated every racing team they've met in the Gunma region. Now they're out to challenge the duo of Mako and Sayuki and their SilEighty - the Impact Blue of Usui Mountain. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/13169.webp"},{"title":"Initial D Battle Stage","synopsis":"There are many street races in the Initial D Series. This OVA has no plot other than to collect all the street races into one stage. The dialog during the original races is left in. ","img":"https://cdn.myanimelist.net/images/anime/2/13168.webp"},{"title":"Initial D Extra Stage 2","synopsis":"Iketani missed an opportunity to see Mako-chan and hates himself for never calling to say he was sorry. By chance he runs into her 6 months later, and the situation is awkward. Iketani does not have time to talk at that moment, but both want to talk, so they arrange a second meeting. Iketani goes to the meeting place early, but an old man was left behind from an tourist bus, and asks Iketani to catch the bus for him. Iketani being a nice guy, so he can't say no. ","img":"https://cdn.myanimelist.net/images/anime/10/10462.webp"},{"title":"Wangan Midnight","synopsis":"Based on a seinen manga by Kusunoki Michiharu serialised in Young Magazine. \n\nThe story gets its roots from the actual street racing that occurs on Tokyo's Shuto Expressway, one stretch of which is known as the \"Wangan\", literally meaning \"bay side\" (although it is generally used to refer to the freeway), the longest, straightest road in the entire country. Of course, there's also lots of traffic to contend with, including a fair number of heavy trucks. Because of this, the action is inherently hazardous, and wrecks are common. Blown engines are also a frequent hazard, especially with the extreme-high power engines. \n\nOne day, Akio Asakura, a third year high school student, is driving his Fairlady Z (Z31) and is challenged by Tatsuya Shima, a doctor, in his black Porsche 964 Turbo (nicknamed the \"BlackBird\"). With a friend in the passenger seat and two girls in the back, Akio pitifully tries to win, but is defeated. Determined to become faster, he goes to the junkyard to buy parts for his car, when he sees a pristine, unscratched midnight blue Fairlady Z (S30) in the junkyard. Intrigued as to why such a machine is about to be junked, he buys it. He soon finds that the car is unnaturally fast due to a tuned L28 engine, bored and stroked to 3.1 liters combined with twin turbos, which produces 620bhp. He also finds that all of the car's previous owners had unfortunate accidents in it, starting with the first owner's death. The manga follows Akio's various encounters, though the central plot revolves around his constant battle with the BlackBird for superiority. \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/11/12936.webp"},{"title":"New Initial D Movie: Legend 1 - Kakusei","synopsis":"The first movie in a trilogy, focusing on the battle against the Takahashi brothers.","img":"https://cdn.myanimelist.net/images/anime/7/75648.webp"},{"title":"Initial D Battle Stage 2","synopsis":"This is simply the OAV summing up the major events and battles of \"Initial D 4th Stage\" much like the \"Initial D Battle Stage\" original summed up the first 3 seasons. Additionally, has 2 extra battles from the manga that were not incorporated into the original 4th Stage.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/13167.webp"},{"title":"Capeta","synopsis":"Taira Kappeita, or Capeta, was a 4th grader boy. He had lost his mother when he had been very little. Although he pretended to be tough in front of his father, actually he felt lonely. One day, his father brought junk parts home from his workplace and made a racing cart. Soon, they went to a circuit to drive the cart. However, Capeta found that its frame was bent and it could hardly run straight. But, with his technique he managed the cart. Furthermore, he followed soon after the fast cart and he could nearly leave it behind. The driver in the cart was Minamoto Naomi, the champion of the East Japan Junior Cart. Looking at their chase, Naomi's mother, Minamoto Nanako, advised Capeta to take part in the official race.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/17667.webp"},{"title":"Tailenders","synopsis":"Tomoe Shiro, a formidable racer with a very promising career, experiments a U-turn when a serious accident puts his life at stake. He recovers miraculously though when his heart is replaced with the engine of his own racing car. However, because of that very reason, race regulations demote him to the category of a mere mechanical part of the vehicle and is deprived from the right to participate as a pilot in regular races. Only in a far away colonial planet, along with a multitude of other charismatic pilots also vetoed from participating in regular competitions, will he be given the opportunity to race for his pride and the money of the prize. And so this exciting rally starts!!\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/4/28930.webp"},{"title":"New Initial D Movie: Legend 2 - Tousou","synopsis":"The second movie in a trilogy.","img":"https://cdn.myanimelist.net/images/anime/6/72246.webp"},{"title":"Riding Bean","synopsis":"Bean Bandit and his partner Rally Vincent are couriers for hire - transporting clients and delivering goods in his custom sports car \"Roadbuster\" for a hefty price. But when they are hired to escort a kidnapped girl named Chelsea to her home, they don't realize they're being framed for kidnapping as their former clients Semmerling and Carrie plan their escape with Chelsea's father and the ransom money. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/55505.webp"},{"title":"New Initial D Movie: Legend 3 - Mugen","synopsis":"The third and final movie in a trilogy.","img":"https://cdn.myanimelist.net/images/anime/9/76759.webp"},{"title":"Mach GoGoGo","synopsis":"The Mach 5 is one of the fastest and most technologically advanced race cars built by man. Equipped with various gadgets and a powerful engine, it provides a challenge for anyone who would dare race against it. The driver of this amazing vehicle is Gou Mifune, a teenager who dreams of breaking into the world of professional racing.\n\nIn spite of this, Gou's father and the creator of the Mach 5, Daisuke Mifune, does not want his son anywhere near a racetrack. Undeterred, his girlfriend Michi, younger brother Kurio, and Kurio's monkey sidekick Sanpei become Gou's biggest fans as he sets out to become the greatest racer of all time.\n\nHowever, Gou soon learns that becoming a professional racer is not easy. From the underhanded plots of corrupt businessmen to stiff competition in the form of his rival, Racer X, Gou faces many obstacles on the road ahead, and has a lot to prove before he can cross the finish line.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/40191.webp"},{"title":"eX-Driver","synopsis":"Ex-Driver is set in the future, when all transportation is easily controlled by AI. Though like all machines they tend to break down or lose control or re-programmed. This is where three high schoolers with non AI cars, Subaru WRX, Super 7, Lotus comes in to save the day and make sure the public is safe at all times. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/26197.webp"},{"title":"Bakuon!! OVA","synopsis":"Bundled with the 7th and 9th volumes of the Bakuon!! manga.","img":"https://cdn.myanimelist.net/images/anime/8/79867.webp"},{"title":"Bakusou Kyoudai Let's &amp; Go","synopsis":"Based on the manga by Tetsuhiro Koshita, Bakusou Kyoudai Let's &amp; Go!! has two main seasons evolving around the Go brothers and the TRF Victorys. The third season, Bakusou Kyoudai Let's &amp; Go!! MAX evolves more around two new main characters, but the primary idea is the same... Racing!\n\nLet's &amp; Go!! focuses on Retsu and Go Seiba, two young brothers who receive racing cars called \"Mini 4WD\" by Dr. Tsuchia. From there on, the series portraits those two boys, training and customizing parts to later on participate on Japans Cup, where all of Japan's racers enter to be the best of the best!","img":"https://cdn.myanimelist.net/images/anime/7/26251.webp"},{"title":"Initial D: Project D to the Next Stage - Project D e Mukete","synopsis":"A special that comes with the Fourth Stage DVD-BOX. It is comprised of a recap from First Stage to Third Stage, along with staff commentary and sneak preview of the making of the Fourth Stage.","img":"https://cdn.myanimelist.net/images/anime/12/35739.webp"},{"title":"F-Zero: Falcon Densetsu","synopsis":"Rick Wheeler was a police detective who got into a fatal car accident while pursuing the criminal Zoda. He was placed into artificial coldsleep for 150 years. Wheeler is brought back to life by Jody Summer and Dr. Stewart, who work with a group of good racers who try to keep prize money out of the hands of unsavory people like the Dark Million Organization run by Black Shadow and Deathborn.","img":"https://cdn.myanimelist.net/images/anime/1569/95419.webp"},{"title":"Next A-Class","synopsis":"In the not so distant future, to cope with the traffic jams and verticalization due to the increased population, the city of Tokyo was reconstructed under the theme of city sharing in which people share the urbane space by transforming the roads and city structure by time of the day. A woman named Nico is walking in the city. She is having her long-awaited day off; however, she does not know what to do and who to hang out with. She hopes an exciting thing suddenly happens.\n\nThen, a truck passes right before her eyes. The loud music and flashy decoration of the vehicle reminds Nico the car it that everyone's talking about on the internet. As soon as Nico sees it, she runs after it, then runs into Gatsu and Makito. Nico gets in their latest A-Class and they chase after the truck driving through the city that is changing its form rapidly.\n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/4/44099.webp"},{"title":"Redline Pilot","synopsis":"Pilot episode for the movie.","img":"https://cdn.myanimelist.net/images/anime/2/32029.webp"},{"title":"Chousoku Henkei Gyrozetter","synopsis":"In 21st century Japan, cars with artificial intelligence for increased safety, known as \"A.I. cars,\" have revolutionized the car industry. Special schools teaching children driving A.I. cars have been established. One day, Kakeru Todoroki, a fifth grader of Arcadia Academy, was summoned by the school principal and given an A.I. car \"to save the humanity by chosen drivers like you.\" The car, however, is not just a car but also a transforming robot known as \"Gyrozetter.\" \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/9/41937.webp"},{"title":"Bakusou Kyoudai Let's &amp; Go WGP","synopsis":"After the first season, Retsu and Go have now formed a team called \"TRF Victorys\" which Tokichi Mikuni, J, and Ryo Takaba are part of. Together, they aim for the World Cup.\n\nIn this cup, teams from all over the globe enter. Some of the teams are, NA Astrorangers (Americans), Eisen Wolf (Germans), Rosso Estrada (Italians).","img":"https://cdn.myanimelist.net/images/anime/6/50431.webp"},{"title":"eX-Driver the Movie","synopsis":"After winning domestic preliminary round, Lisa, Lorna, and Soichi advance to ex-Driver world race competition held in Los Angeles as representative team from Japan. Like a bad omen, they encountered a reckless AI car the first night they arrived at Los Angeles. Although they successfully stopped the car, the local police department is not very happy about that and insists to examine their car overnight. \n\nHowever, the problem did not stop just there. The daughter of the United States team`s sponsor, Angela, has gone missing. Lorna realized that Angela was on the reckless AI car before. Soichi who guessed that Angel could be in danger then start looking for her. But Soichi got captured by a mysterious man, and he shocked to find Angela is also there. \n\nDuring the confinement inside a warehouse, Soichi finds out that apparently there is a connection between the series of incident and illegal gambling on the ex-Driver world race competition. Now Soichi must escape from the warehouse with Angela... \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/13/26195.webp"},{"title":"eX-Driver: Nina &amp; Rei Danger Zone","synopsis":"The story takes place on a world 100 years in the future, a few years before Lisa and Lorna joined eX-D organization. The world where people drives computer-controlled electrically powered \"AI cars\" which automatically take you where you want to go. However, one AI car mysteriously start to run amok. Now Nina and Rei, as the main driver for ex-D organization have to solve the mystery behind the AI car with evil plot and trap awaiting for them... \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/5/87659.webp"},{"title":"Mach GoGoGo (1997)","synopsis":"The Mach is a racing car loaded with a new engine \"X\" specially developed and built by a man named Kenich Hibiki who was a racing driver as well as a motor engineer. However, in a test driving made prior to its completion, he was involved in an accident and judged as dead. Meanwhile his father Daisuke who was watching the test driving all the way recovered the wrecked car as his son`s memento. A few years later the damaged car rebuilt by him revives as the new Mach which comes to participate in Grand Prix. This time, however, for the purpose to protect the driver from a possible accident, the new car is equipped with a safety system called \"Safety Seven\" with seven guarding devices. Also, it is loaded with the engine \"X\" that miraculously survived the tragic accident. Now its driver is Go, younger brother of Kenichi, who is determined to succeed to his brother`s will. In fact, he successfully participates in Grand Prix and keeps growing up to be a top racer of the world.\n\n(Source: official site)","img":"https://cdn.myanimelist.net/images/anime/4/6010.webp"},{"title":"Bakusou Kyoudai Let's &amp; Go MAX","synopsis":"The story follows the life of Retsuya and Gouki, two brothers with the same objective as Go and Retsu, to race and win championships!\n\nThe two new brothers are faced with various traps set by an evil organization...together, along with other friends, they try to enjoy their races as much as possible, showing off their competitive spirit and taking down any kind of evil that might put the sport they love so much at risk!","img":"https://cdn.myanimelist.net/images/anime/13/18301.webp"},{"title":"Zeonic Toyota Special Movie","synopsis":"Toyota Auris advertisement on Japanese television, featuring Char Aznable from Gundam series.","img":"https://cdn.myanimelist.net/images/anime/13/54101.webp"},{"title":"F","synopsis":"Akagi Gunma is a young, impetuous and rash teenager who decides to move to the big city to fulfill his dream of racing a Formula One car. The story follows how this simple farmer boy from the country moves on to the city in pursuit of his dreams.\n\n(Source: ANN, edited)","img":"https://cdn.myanimelist.net/images/anime/9/73616.webp"},{"title":"Goddamn","synopsis":"Car racing anime, based on the manga by Kaoru Shintani that serialised in Big Comic Superior from 1988 to 1990. ","img":"https://cdn.myanimelist.net/images/anime/1179/93959.webp"},{"title":"Scan2Go","synopsis":"Sometime in the near future, in an age in which we have established contact and communications with planets outside our galaxy, Scan2Go has become a huge phenomenon throughout all of outer space. Giant races are held at every locality, with each racer gunning for the title of the universe's number one racer!\n\nThe main character in the series, Kazuya, possesses the power of the eagle, performed well with his blazing, innate power commanding his falconine beast spirit. He competes in a tournament, the \"Pro-Racer Exhibition Race.\", but was no match for the other teams that had won their way through the competitive Space Preliminaries.\n\nRealizing the difficult obstacles that lie before them, Kazuya and his friends leave the small Earth behind and set off on a universe-wide quest to hone their skills as warriors!","img":"https://cdn.myanimelist.net/images/anime/1544/100121.webp"},{"title":"Dash! Yonkurou","synopsis":"The story is a succession of races in imaginative paths and runs to suit her run. The story will focus increasingly what is the real Emperor, will be discovered having this many mini title that will compare against the Emperor of Yonkuro, the epilogue to the epic challenge of the Rally of hell in this race will challenge a group of thugs who want to take advantage of Best of Mini 4WD racers to be able to recover a hidden treasure.The story centers on a brother and sister, Tatsuya and Kiyoko, the children of a scientist at the Twin X facility. This story is used by the very popular main character Yonkuro Hinomaru.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/50417.webp"},{"title":"Arrow Emblem Grand Prix no Taka","synopsis":"An anime with much of wheel actions ... Takaya Todoroki, a young man who wants to become a famous driver and built a car to be able to participate in a race with a big prize. In the race, because of the poor quality of building, Takaya has a serious accident in which he wrecked his car but he doesn`t hurt himself. That`s when a mysterious driver contact Takaya to enter onto some famous racing team...This mysterious man is a former driver .. a very famous one who appears every now and then to help Takaya fight his own destiny, to set him on the right track and most of all prove himself, unlike him.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/18506.webp"},{"title":"Oval x Over","synopsis":"A promotional video for the Indy Racing League Bridgestone Indy Japan 3000.\n\nA thrilling race. Three drivers with their own stories. A narrow line between victory and defeat. Who will be the champion? ","img":"https://cdn.myanimelist.net/images/anime/5/29979.webp"},{"title":"Yoroshiku Mechadock","synopsis":"Mechadock is a powerful race car obtained from a simple economy car, which is able to race on any ground.","img":"https://cdn.myanimelist.net/images/anime/7/16963.webp"},{"title":"Crush Gear Nitro","synopsis":"Story about a young boy name: Mahha Masaru, who dreamt of having a crush gear fight with the others even though he doesn't have his very own crush gear!\n\nOne day,  a sudden chance came to him and he got the legendary crush gear which look similer to the one that was used by Kouya Marino and finally he can go and paticipate in his own crush gear fight with his friends and foe!! ","img":"https://cdn.myanimelist.net/images/anime/1925/94230.webp"},{"title":"Hey! Bumboo","synopsis":"Bumboo is a very strange car-like creature with a cute yellow body. He was born from a mysterious egg at an automobile factory. Having heard the first cries of a newborn baby, a boy named Ken comes to the factory and meets Bumboo. They soon become good friends and set out on their exciting journey.\n\nTraveling the world with his four-wheeled friend and Mister the dog, Ken faces big trouble from Doctor Monkey—who wants to get Bumboo into his own hands—but finds thrills and excitement around every corner.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/5633.webp"},{"title":"Dekobou no Jidousha Ryokou","synopsis":"A man encounters strange animals during his road trip in his car. Short film from 1934.","img":"https://cdn.myanimelist.net/images/anime/2/15842.webp"},{"title":"The New A-Class.: Next Stage with YOU","synopsis":"Mercedes-Benz's newest commercial for the A-Class car line featuring the girl group Perfume as CGI songstresses. ","img":"https://cdn.myanimelist.net/images/anime/13/77724.webp"},{"title":"Four Seasons: Fuuka to Nanami","synopsis":"A spin-off episode of Yamaha Motor’s original video animation “Master of Torque,” featuring Fuuka Torimi and Nanami Hiyoshi that illustrates the changing of the four seasons and the different joys of motorcycling that come with them.\n\n(Source: Official Site)","img":"https://cdn.myanimelist.net/images/anime/10/86102.webp"},{"title":"Shakotan★Boogie","synopsis":"It's girls, gangs, and cars in this adaptation of the 1985 manga in Young Magazine, by Lullaby for Wednesday's Cinderella-creator Michiharu Kusunoki. Local punks steal cars, switch the plates, and sell them, but not without racing them for a while against rival gangs. The anime continues the story where the 1987 live-action movie starring Kazuya Kimura left off.\n\n(Source: The Anime Encyclopedia)","img":"https://cdn.myanimelist.net/images/anime/8/43517.webp"},{"title":"Track City","synopsis":"Jimmy was a typical boy who liked to play computer games. One day he was playing a game called 'Track City' when suddenly he got transported into the game world! Once he regained consciousness, a woman who apparently is the mayoress of the city explains to him that the world is threaten by a powerful malign virus and her allies and their only hope is to ask for the help of the \"Legendary racer\", the best player of 'Track City\". Things get complicated when Jimmy learns that the game made a mistake and confused him with the Legendary racer! Will Jimmy learn the necessary skills to defeat the viruses that threaten the world? Or will he be erased by the 'big head', the heavenly punisher that annihilates those who cannot achieve victory?","img":"https://cdn.myanimelist.net/images/anime/6/34761.webp"},{"title":"PES: Peace Eco Smile - Drive your Heart","synopsis":"Special spin-off episode that aired between episodes three and four of the original PES series. Is also an ad to Toyota's new Vios vehicle.","img":"https://cdn.myanimelist.net/images/anime/8/50253.webp"},{"title":"Shima Kousaku no Asia Shinseki-den","synopsis":"A spinoff of Shima Kousaku no Asia Risshi-den","img":"https://cdn.myanimelist.net/images/anime/11/80672.webp"},{"title":"Bakusou Kyoudai Let's &amp; Go Special","synopsis":"No synopsis has been added for this series yet.\n\nClick here to update this information.","img":"https://cdn.myanimelist.net/images/anime/13/27281.webp"},{"title":"Bakusou Kyoudai Let's &amp; Go!! WGP Bousou Mini Yonku Daitsuiseki","synopsis":"Rion gets tricked into installing a chip into his racing car called \"Gun Bluster\" by the mini-4wd company he was associated with. His car starts racing without control and causing various riots with fellow racers, Rion teams up with the TRF Victorys and start chasing after Gun Bluster to remove the chip.\n\nRion, Retsu and Go Seiba along with the other TRF members, Ryo Takaba with the help of his little brother, Jiromaru, Tokichi and J are confroted with an association that is also after Gun Bluster, but what are their intentions?\n\nUnited along-side their trademark mini-4wd, the TRF's and Rion race together and avoid traps to safelly capture Gun Bluster!","img":"https://cdn.myanimelist.net/images/anime/3/27273.webp"},{"title":"Futari Daka","synopsis":"Two motor-bike crazy young men meet on a track one day. One almost kills the other and after a while, they discover that they have the same first name. Since they are both excellent at racing, they very quickly become rivals ... but their passion and firstname is not the only thing they have in common.","img":"https://cdn.myanimelist.net/images/anime/2/59891.webp"},{"title":"Machine Hayabusa","synopsis":"Because of the appearance of a villain team, Black Shadow, the international racing was ruined. To compete with Black Shadow, Saionji Racing Team was founded. They developed a racing car, Hayabusa. It was a super racing machine that carries hyper power engine, Cavalier Engine. The main driver of the team was Hayabusa Ken whose big brother was killed by Black Shadow.\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/10/29015.webp"},{"title":"Joubuna Tire!","synopsis":"Amateur animation by 20-year-old Hikeaki Anno while he was studying at Osaka University of Arts. The short features a speeding car with physics-defying tires.","img":"https://cdn.myanimelist.net/images/anime/5/84311.webp"},{"title":"Homé-Pato the Movie","synopsis":"The scene is set in future Tokyo.\nWhat if there was a police car that praises drivers?\n\n\"Instead of punishing bad driving, let's reward good driving\" is the motto. The project is aimed to decrease car accidents on the metropolitan expressway. It is an animation that illustrates the dream of a Tokyo Smart Driver.\n\nThe person driving the car is an ordinary man.\nHe's zooming by while listening to his favorite driving song when he suddenly sees a pink car approaching him in the rearview mirror.\n\nWhat will be this man's destiny?\n\n*This animation is fictitious. Please obey the rules of the road. \n\n(Source: Official Youtube Page)","img":"https://cdn.myanimelist.net/images/anime/3/74025.webp"},{"title":"Chou Supercar Gattiger","synopsis":"A scientist invents 5 special solar powered cars that can be joined into one supercar. The cars are given to the scientists son and his friends to compete in the racing circuit, but they are pursued by an evil organization that wants the secret of solar power. \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/5/27329.webp"},{"title":"Mach Girl","synopsis":"A spin-off of Mach Go Go Go (aka: Speed Racer). The titular Mach Girl is, according to Anime News Network, \"a girl named Lip who wanders the land to compete in high-stakes races with her Mach Pink three-wheeler.\"","img":"https://cdn.myanimelist.net/images/anime/1177/97974.webp"},{"title":"Circuit no Ookami II: Modena no Ken","synopsis":"The adventures of Ken Ferrari, a former racer and motor journalist with an appetite for women. Based on the manga by Satoshi Ikezawa.","img":"https://cdn.myanimelist.net/images/anime/1192/90761.webp"},{"title":"Turning Mecard","synopsis":"A Korean/Japanese co-production created by Bakugan and Dragon Ball Super contributor Atsushi Maekawa.\n\nTurning Mecard stars Jason, a grade-schooler who meets a Mecanimal, a transforming minicar from the alternate world of Triforce, named Evan. Jason and Evan are both searching for missing family members, and team up to help each other. Together, they meet more Mecanimals as they battle across dimensions and learn important lessons along the way.\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/7/85659.webp"},{"title":"Estima: Sense of Wonder","synopsis":"Promotional shorts for Toyota's Estima (or Previa) car make.","img":"https://cdn.myanimelist.net/images/anime/13/81540.webp"},{"title":"Gegege no Kitarou: Youkai Japan Rally 3D","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/13/68017.webp"},{"title":"Tamagotchi Movie: Tanpen Himitsu no Otodoke Daisakusen!","synopsis":"First movie in 9 years for Tamagotchi. To premiere alongside with Kami-sama Minarai: Himitsu no Cocotama Movie.","img":"https://cdn.myanimelist.net/images/anime/5/82642.webp"},{"title":"Master of Torque: Epilogue","synopsis":"An epilogue of Master of Torque shows what the series' characters are up to one year after the events of Season 3 at the foot of Mt. Fuji.\n\n(Source: Official Email)","img":"https://cdn.myanimelist.net/images/anime/13/83538.webp"},{"title":"Pi Po Pa Po Patrol-kun","synopsis":"A children's anime about police and their talking police cars. It has no steady plot.","img":"https://cdn.myanimelist.net/images/anime/12/5740.webp"},{"title":"Gekisou! Rubenkaiser","synopsis":"A race car driver competes around the world in a race car left to him by his father.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/8/62437.webp"},{"title":"Alphard x Taka no Tsume","synopsis":"A collaboration between Taka no Tsume and Toyopet's Alphard car store launching in Ibaraki, Saitama, and Okayama. Collaborative goods will be sold on January 20+21 for at the stores as well.","img":"https://cdn.myanimelist.net/images/anime/1197/90147.webp"},{"title":"Hei Mao Jing Zhang","synopsis":"The series follows Officer Black Cat's adventures around the forest neighbourhood, apprehending criminals, dealing justice, and solving crimes.","img":"https://cdn.myanimelist.net/images/anime/6/83206.webp"},{"title":"Yume no Jidousha","synopsis":"It is most likely a story about a great dream like car.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Petit Petit Muse","synopsis":"Two twins, Ara and Ari, aspire into the world of fashion. Ara wants to become a fashion model, while her sister, Ari, wants to become a fashion designer. They meet a man named Yorang, who is the fashion designer in Heaven.","img":"https://cdn.myanimelist.net/images/anime/12/78380.webp"},{"title":"Boo Boo Boy","synopsis":"A young boy has adventures with his transforming car.","img":"https://cdn.myanimelist.net/images/anime/5/79707.webp"},{"title":"Zhan Long Si Qu","synopsis":"Go for Speed is a Chinese anime about Mini 4wds. It was produced by Nanjing Hongying Animation Entertainment Co. Ltd and first aired in China in 2009.  \n\n(Source: Go For Speed Wiki)","img":"https://cdn.myanimelist.net/images/anime/4/76386.webp"},{"title":"Tobidase! Machine Hiryuu","synopsis":"The bosses of rival car companies decide to fight each other in the sporting arena by backing different race car teams. Chairman Gapporin hires Okkanabichi the supreme racer, while Chairman Misaki hires Riki Kazama, a relatively untried driver for the flying car known as Machine Hiryu. Mixing elements of Speed Racer with Time Bokan, this Tatsunoko production ticks the same boxes, with Riki's cute girlfriend Nana, mini-mechanic Chuta, the cute ape and pooch, and the comic and glamorous villains lurking in the background. Early work from many big names, including Yoshitaka Amano and Kunio Okawara, is strictly in the studio mould. Manga versions of the story ran in several magazines, such as Terebi Magazine and Terebi Land. Racing fever seemed to have struck the Japanese animation business at this time: compare to the same year's Arrow Emblem.\n\n(Source: The Anime Encyclopedia)","img":"https://cdn.myanimelist.net/images/anime/3/53621.webp"},{"title":"Beompeoking Jaepeo","synopsis":"Bumper King Zapper is a 3D animation series about bumper car battles of the future.","img":"https://cdn.myanimelist.net/images/anime/10/71749.webp"},{"title":"Porong Porong Pororo 4","synopsis":"A direct continuation of the previous season where an anthropomorphic car gets separated from his home and arrive in Pororo's village and beings to live there.","img":"https://cdn.myanimelist.net/images/anime/11/66623.webp"},{"title":"Porong Porong Pororo 5","synopsis":"The fifth season of Pororo with a focus more on racing.","img":"https://cdn.myanimelist.net/images/anime/11/66625.webp"},{"title":"Kinyoru, Abe Reiji: Heikinteki na Salaryman no Ijou na Nichijou (ONA)","synopsis":"Kinyoru, Abe Reiji web exclusive episodes that were made to promote the Nissan Serena automobile.","img":"https://cdn.myanimelist.net/images/anime/13/77770.webp"},{"title":"Turning Mecard W","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/8/85660.webp"},{"title":"Hei Mao Jing Zhang (1992)","synopsis":"The series follows Officer Black Cat's adventures around the forest neighbourhood, apprehending criminals, dealing justice, and solving crimes.","img":"https://cdn.myanimelist.net/images/anime/2/83207.webp"},{"title":"Robocar Poli","synopsis":"In Brooms Town, every vehicle has a voice and a personality, and they work together with the human residents in a peaceful harmony. The residents are happy and carefree, but once in a while trouble rears its head. Brooms Town can rest easy, though, for at any sign of danger, the Rescue Team is there. Poli the police car, Roy the fire truck, and Amber the ambulance are joined by their friends as they patrol the streets of Brooms Town and help out its citizens.\n\nRobocar Poli is aimed at small children, and has a charming cast of characters composed of rescue vehicles that can transform into humanoid robots. Aimed at teaching children about safety rules, every episode has a moral to be learned. Poli and his friends are here to teach everything from road safety to the value of friendship and teamwork.","img":"https://cdn.myanimelist.net/images/anime/2/76801.webp"},{"title":"Turning Mecard W Season 2","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/3/85661.webp"},{"title":"Geki Drive","synopsis":"Bandai began streaming an animated promotional video for its upcoming Geki Drive racing kits Tuesday. The new, customizable cars are set for release in January 2016. The video shows two cars, the Dragon Gear (white) and Night Cougar (black). The cars are the first is the toy line's GD Machine Series. A third car, Burst Phoenix (red), is also planned. The cars utilize the \"Link Unit System,\" making them easy to upgrade with new parts and assemble. Bandai is also releasing a 90-degree bank-curved track. The track is recreated in the animated promotional video.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/83117.webp"},{"title":"Sore Ike! Anpanman: Hashire! Wakuwaku Anpanman Grand Prix","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/3/66775.webp"},{"title":"Wakuwaku♥Nukegake Daisakusen","synopsis":"Official music video for dorlis's mini-album CD Swingin' Party2.","img":"https://cdn.myanimelist.net/images/anime/12/79578.webp"},{"title":"Shiden Pilot","synopsis":"Described as a \"modern car racing anime for tween and teen audiences.\" Though intended to be a television series, several problems led to the project's cancellation after the creation of a 30-minute pilot. The single episode was presented at the 2004 Tokyo Anime Fair.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/63073.webp"},{"title":"Pororo Geugjangpan Super Sseolmae Daemoheom","synopsis":"Pororo and the gang entry a sleigh racing contest after getting guidance under a 'champion'. Turns out the champion was a liar and now the gang has to fight tooth and nail to win first place in order to keep their pride after talking big.","img":"https://cdn.myanimelist.net/images/anime/8/66629.webp"},{"title":"Gonglyong Mecard","synopsis":"Gonglyong Mecard is a spin-off-series of Mecard, based on the idea that dinosaurs didn't become extinct 65 million years ago, but transformed into mecanimals. Its characters don't have any relations to the cast from Turning Mecard, Turning Mecard W and Turning Mecard R.\n\n(Source: Gonglyong Mecard Wikia)","img":"https://cdn.myanimelist.net/images/anime/1868/98715.webp"},{"title":"Bad! Bad! Bad!","synopsis":"Music video directed by Mitsuyuki Ishibashi and animation director Kousuke Sugimoto for BAD! BAD! BAD! by the band ketchup mania.","img":"https://cdn.myanimelist.net/images/anime/1226/97330.webp"},{"title":"Robocar Poli 2","synopsis":"In Broom's Town, a small town with a strong rescue team, there are always accidents and troubles such as a car sliding off a cliff in the rain, a car crash, a child locked in a firehouse and so on. In every episode the town's rescue team saves characters. At the end of each episode, the rescue team strongly advises the characters who were in danger and children.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/12/78248.webp"},{"title":"Xingji Biaoche Wang","synopsis":"Set in the future on the Yellow River Planet, the realm of car racing has advanced beyond Formula One   -   into the domain of the Galaxy Racers. Riders steer their simulator-racers which remotely control the actual customized speedsters hurtling around a track.\n\nThe hero, a teenager named Roy, was born to race and aspires to be the King of Galaxy Racers. But his guardian, his grandfather, sees a threat from and great danger in the evil and greedy Taz, the CEO of the Titan Space Navigation Auto Group which seeks to swallow or destroy all competitors, and whose Mosha Racing Team would just as ruthlessly run over and crush Roy under its thundering wheels. He arranges for him to join the good guys in the Matela Racing Team to race for the highest honors.\n\nMany years ago, Ray’s father, Dr Renault, worked for the Titan Group and he invented the Galaxy Racers but he was against CEO Taz’s destructive greed. He tries to escape   -   and disappears! Monopolizing the technology and construction of the Racers, Taz, the Titan Group and Mosha Racing Team swallowed, crushed and beat all rival companies, racers and teams.\n\nDesperately, Ray’s grandfather uses a secret design hidden by Dr Renault from Taz and builds for him a superior racer, The Lion King. But he has first to learn the skills and garner experience from racing at the highest levels. To acquire these qualities plus humility and resilience, he relies on his Matela friends who have their own cool cars, to help him. But arrayed against them are the Mosha baddies and their menacing machines.\n\nIn a series of hair-raising and nail-biting races with thrills &amp; spills, growling engines, screeching wheels, burning rubber, smashing metal against metal, intense bitter rivalry, persevering friendships &amp; loyalties forged in grueling teamwork and battle, Ray and Team Matela must conquer their fears and overcome the arrogant and powerful Team Mosha which uses cheating as a winning strategy.\n\nWill justice prevail or evil triumph? Find out on The Galaxy Racers on a track near you!\n\n(Source: CHINAnimax)","img":"https://cdn.myanimelist.net/images/anime/11/80957.webp"},{"title":"Turning Mecard W: Black Mirror-ui Buhwal","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/4/85663.webp"},{"title":"Sam to Chip no wa Hachamecha Dai Race","synopsis":"The Hari Hari Island Adventure Rally is just about to start! Hello Kitty, Keroppi, and other Sanrio favorites have gathered in fantastical cars for an endurance race around the island’s many obstacles. Sam and Chip think their vehicle has what it takes to win the checkered flag, but after a late start and a few unfortunate accidents, can this plucky duo survive the odds and pull off a victory?\n\n(Source: Shiteater Fansubs)","img":"https://cdn.myanimelist.net/images/anime/7/84562.webp"},{"title":"Roll","synopsis":"A short animation showing a car driving around a rotating track.","img":"https://cdn.myanimelist.net/images/anime/1176/96883.webp"},{"title":"Nishitesu CMs","synopsis":"Animated commercials for the Nishitesu Group (Nishi-Nippon Railroad Co., Ltd.) that are available on the company's official YouTube channel. So far they cover bus driver recruitment and freight transport.","img":"https://cdn.myanimelist.net/images/anime/1739/90146.webp"},{"title":"Controller of Controller","synopsis":"A video game character finds a VR headset on the street.","img":"https://cdn.myanimelist.net/images/anime/1573/95073.webp"},{"title":"Chuldong! Super Wings 3","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1328/101000.webp"},{"title":"Turning Mecard R","synopsis":"Turning Mecard R was announced as a CG-reboot of Turning Mecard. It features the same characters as Turning Mecard and Turning Mecard W.\n\n(Source: Wikia)","img":"https://cdn.myanimelist.net/images/anime/1592/98721.webp"},{"title":"Turning Mecard W: Vandyne-ui Bimil - Teugbyeolpan","synopsis":"The birth of a powerful mechanic! The Battle of destiny begins again!\n\nDuring peaceful days and friends, Dr. Franklin calls call on Isobel. They must train the new mechanic and take charge of a mission. The mechanics are back and joined by a new, powerful mechanic and are challenged by Vandyne to a sudden battle.\n\n(Source: Hancinema)","img":"https://cdn.myanimelist.net/images/anime/1475/91955.webp"},{"title":"Turning Mecard W: Vandyne-ui Bimil","synopsis":"It follows the fan favorite character Vandyne as his hidden secrets are revealed. Unlike the Turning Mecard R reboot, which exclusively uses 3DCG visuals, this series is like the earlier entries and is animated with 2D and 3D visuals.\n\nThe mini-series is part of a new promotional campaign from Sono Kong. The Korean toy manufacturer will launch four new mechanimals this month at retail.\n\n(Source: toonbarn.com)","img":"https://cdn.myanimelist.net/images/anime/1728/91954.webp"},{"title":"Lei Su Deng Shandian Chong Xian","synopsis":"Twin brothers Frank and Karl live with Uncle Charles when their parents are away. They go to school and meet Mike and Sally.\nThey meet Sally, Norton and Mike and tell them all about R.C. Racing, but Karl tells that R.C. Racing is just babies games. Then after school, the guys go to the Race Tin club, and Mike races the duo. Karl fumbles with the controller buttons and Frank copies Mike and comes into second. After the race, Sally and his father arrive. They get to the car shop and analyze some cars. Mike tells them what R.C. Racing cars are like. He explains his car as an example, and he tells that the higher the level, the car will have to be modified with spoilers and new body kits.\nFrank and Karl Race Marco and later on Sword, continuing to race Tommy and Norton, onwards against Ocean, and they race Sword again in the finals.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/1281/93043.webp"},{"title":"Lei Su Deng Shandian Chong Xian 2","synopsis":"The second season of Lei Su Deng Shandian Chong Xian.","img":"https://cdn.myanimelist.net/images/anime/1400/94788.webp"}]