[{"title":"Sekisou-tai","synopsis":"By changing the overlapping of sections in the time axis / space axis, the laminate based on the die cut of the hand transforms into various shapes.","img":"https://cdn.myanimelist.net/images/anime/8/83703.webp"},{"title":"Hannyashingyou","synopsis":"A film by Keiichi Tanaami.","img":"https://cdn.myanimelist.net/images/anime/1584/97665.webp"},{"title":"Noise","synopsis":"An experiment concerning the attempts at creating a 'moving image' long before the invention of cinema. A re-experiencing of the history of 'magic with light' unfolds through the use of various devices and techniques, including flip-book animation and Muybridge’s photographs in motion zoopraxiscope.\n\n(Source: IFFR)","img":"https://cdn.myanimelist.net/images/anime/1679/97702.webp"},{"title":"Anne's Secret Diary","synopsis":"Videos directed by mareykrap that were featured at the My Name is Red-Haired Anne art exhibition in Seoul, South Korea, which showcases the artistic talents of Korean artists through the imaginative retelling and reinterpretation of Anne of Green Gables. These videos were used for the 1st chapter of the exhibit titled \"A Poor Orphan Girl\".","img":"https://cdn.myanimelist.net/images/anime/1774/105966.webp"},{"title":"Feed","synopsis":"Four housekeepers package and prepare meals for children. The children feed the livestock, which are to be used for their meals. This repeats the cycle.","img":"https://cdn.myanimelist.net/images/anime/1134/103423.webp"},{"title":"Get Back on the Hill","synopsis":"This film was made based on Tanaami’s fear of heights and his experience of seeing New York from the rooftop of a 50-floor apartment. Even the quotidian activity of walking across a zebra crossing becomes an abstract image observed from these heights. Using the process of color separation, the colors shift across each frame and create a surreal universe.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Rainbow Scene","synopsis":"A triple projection film where the projections are positioned side-by-side.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Green Red","synopsis":"A photograph of a seated heterosexual couple, naked apart from their long necklaces, is rephotographed with a fixed camera that zooms outwards in one take. The colors subtly shift as the camera zooms out from their arm to eventually reveal their bodies over twelve minutes. Screened at the 3rd Sogetsu Animation Festival 1971.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"She","synopsis":"An early film by Keiichi Tanaami.","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"I'm Here","synopsis":"One doesn't always know where to go, but he must move forward. He has to move toward his goal. Always transforming, his heart and mind drift and run towards the goal he discovers.\n\n(Source: YouTube)","img":"https://cdn.myanimelist.net/images/anime/1059/104628.webp"},{"title":"Ryou","synopsis":"A group of boys set out in search of a large fish. When they near its location, one of the boys jumps in the water as bait.","img":"https://cdn.myanimelist.net/images/anime/1127/105692.webp"},{"title":"U.F.O","synopsis":"Without using a camera, this film was made on an optical printer with a countdown leader as its primary visual subject. Tanaami gave frame-by-frame color printing instructions to his film laboratory by phone to create the film.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Walls","synopsis":"A man walks in a crowd. He cannot stand the crowd but to cover his ears. Then it disappears and he gets lost in a white void space. In that space there is no other man but himself. He had nothing to identify himself and his existence was to come to naught. He starts to struggle to get away from there.","img":"https://cdn.myanimelist.net/images/anime/1459/97549.webp"},{"title":"Gravity (2019)","synopsis":"Vertical music video directed by Kousuke Sugimoto for the song Gravity by The Charm Park that was included on his album \"Reverse &amp; Rebirth\".","img":"https://cdn.myanimelist.net/images/anime/1742/106591.webp"},{"title":"Jam Pot","synopsis":"Described by filmmaker Nobuhiro Kawanaka as ‘sexier than sex itself’, the film intercuts between close-up images of a naked heterosexual couple and long shots of a bamboo forest taken from above using a helicopter. The edited cut was projected and rephotographed using high contrast black-and-white film, which was printed in 80-100 types of color gradations at the laboratory, creating what looked like a posterization effect.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Sweet Touch of Love","synopsis":"The film is comprised of a countdown leader that goes backwards and forwards mixed in with an animated Marilyn Monroe seductively eating a banana. It was made for the 1st 100-ft Film Festival, organized by the Underground Center, with a line-up of works made with one 100-ft reel of film.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Issunboushi (2007)","synopsis":"A collaborative film between Keiichi Tanaami and Nobuhiro Aihara with a new interpretation of the traditional Japanese folk tale.","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Mukashi no Yama","synopsis":"Inspired by Katsuhiko Kamimura's Myths of India, a collection of short stories on Hindu mythology, Mukashi no Yama tells a poetic and humerus tale about mountains that could fly. When they fell to the ground, the earth shook with a great sound. \n\n(Source: Official Website)","img":"https://cdn.myanimelist.net/images/anime/1521/99816.webp"},{"title":"Zenbu Wakatteru","synopsis":"A man returns to his apartment at the end of the day completely disheartened. As he goes to light a cigarette, the flame takes on a life of its own.","img":"https://cdn.myanimelist.net/images/anime/1209/104627.webp"},{"title":"Blow Up 2","synopsis":"A film by Keiichi Tanaami.","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Kara no Tamago","synopsis":"The film is about a family, [that] runs a chicken farm. The boy hankers after birds and his little sister keeps an eye on him. The father loves eggs. The mother loves somebody else. In the family fixture, each member stays there with bias or secrets.","img":"https://cdn.myanimelist.net/images/anime/1387/97552.webp"},{"title":"Ningen Moyou","synopsis":"A projection with six projectors, Human Events is a film made for a dance performance by Tsujimura Kazuko at Kinokuniya Hall, Shinjuku, Tokyo. The images comprise of extreme close-ups of the dancer’s body that is massaged by a finger as the color of the image changes. Arranged in a two (side)-by-three (down) composition, different parts of the body gets scattered in ways that defy the familiar order of the anatomy.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Kaze no Sei","synopsis":"The story of a mother, her baby, and a wind spirit, and their journey in the sky.\n\n(Source: Official Website)","img":"https://cdn.myanimelist.net/images/anime/1892/99815.webp"},{"title":"I'm Just Me","synopsis":"Music video directed by mareykrap that was originally featured at the My Name is Red-Haired Anne art exhibition in Seoul, South Korea, which showcases the artistic talents of Korean artists through the imaginative retelling and reinterpretation of Anne of Green Gables. This video was used for the 8th chapter of the exhibit titled \"Independent Women\" and was later posted on the offical Genie Music YouTube channel.","img":"https://cdn.myanimelist.net/images/anime/1405/105965.webp"},{"title":"Kuroi Neko","synopsis":"A woman repeatedly strokes her cat while it moves around in her arms.","img":"https://cdn.myanimelist.net/images/anime/1115/104621.webp"},{"title":"Riyuu","synopsis":"Music video directed by Kato Ryu for the song Riyuu by Noriyuki Makihara that was included on his forty-seventh single \"Believer\". The short version of the music video was uploaded to Makihara's official YouTube channel on August 9, 2016. Later in the month, the full version was released on GYAO! for a limited time. It was also included on DVD with a limited edition release of his twenty-first album, also titled \"Believer\".","img":"https://cdn.myanimelist.net/images/anime/1541/104905.webp"},{"title":"Templex","synopsis":"One rainy day, a woman wakes up, opens the curtains, and stares at her reflection in the window, noticing her curly hair. She climbs out of bed and begins to wash it, while strange images of self-hatred fill her mind.","img":"https://cdn.myanimelist.net/images/anime/1714/104368.webp"},{"title":"Kai Ten Ryo Kou Ki with Tavito Nanao","synopsis":"Music video directed by ShiShi Yamazaki for the song Kai Ten Ryo Kou Ki by Japanese music group Open Reel Ensemble, featuring Tavito Nanao.","img":"https://cdn.myanimelist.net/images/anime/1762/106580.webp"},{"title":"Madonna no Yuuwaku","synopsis":"A film by Keiichi Tanaami.","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Maware Migi, Nigerunda","synopsis":"Music video for the song Maware Migi, Nigerunda by collaborative unit mishmash*Julie Watai. The same video was used for the English cover of the song titled Do a 180 released on the same day. The video was made by Yoriko Mizushiri and Marie Matsunaga.","img":"https://cdn.myanimelist.net/images/anime/1722/104649.webp"},{"title":"Nana Song","synopsis":"Music video directed by Sou Ootsuki for NANA SONG by Japanese music unit Fuuri on their self-titled debut album. The music video was included on DVD with the release of the album.","img":"https://cdn.myanimelist.net/images/anime/1836/106553.webp"},{"title":"Sushi","synopsis":"Short film by Yoriko Mizushiri about preparing and eating a piece of sushi.","img":"https://cdn.myanimelist.net/images/anime/1682/104427.webp"},{"title":"Tumbled Cat","synopsis":"Toshikazu Tamura's first year work at the Tokyo University of the Arts, Graduate School of Film and New Media, Department of Animation. Images of cats are stamped in a notebook to create moving vignettes.","img":"https://cdn.myanimelist.net/images/anime/1619/104406.webp"},{"title":"Out of My Mind","synopsis":"Deep within my dream, there comes a landscape in my shapeless eyes. The peaceful sight gradually distorts. When anxiety and upsurge stands behind us, the nightly liberation begins.\n\n(Source: YouTube)","img":"https://cdn.myanimelist.net/images/anime/1582/104381.webp"},{"title":"Suki tte Nandarou... Namida","synopsis":"Music video directed by ShiShi Yamazaki for the song Suki tte Nandarou... Namida by YUKI (Yuki Kuramochi). The full version of the music video was officially released on YouTube for a limited time before the single's drop on July 29, 2015. It was also included on DVD with a limited edition release.","img":"https://cdn.myanimelist.net/images/anime/1167/104803.webp"},{"title":"Furidashi","synopsis":"You always stumble before you arrive. The glass in your hand gets chipped with every fall. Then, you start  again. However, there are things you can discover only through repetition. The answer resides in yourself.\n\n(Source: YouTube)","img":"https://cdn.myanimelist.net/images/anime/1956/104622.webp"},{"title":"It's Marey O'Clock Now!","synopsis":"Title animation for mareykrap's first solo exhibition it's zero o'clock now.","img":"https://cdn.myanimelist.net/images/anime/1338/106579.webp"},{"title":"Youkoso Boku desu","synopsis":"The first \"Yokoso Boku desu\" animated short film, featuring four surreal, humorous song performances: \"Fancy Shirts\", \"Antenna Chon-Mage\", \"The Tea Time\", and \"Strange Genius\".","img":"https://cdn.myanimelist.net/images/anime/1053/105833.webp"},{"title":"Mofumofuiction","synopsis":"A cavalcade of heretofore unheard-of critters, great and small, cute and hirsute.\n\n(Source: Fantasia Festival)","img":"https://cdn.myanimelist.net/images/anime/1972/105712.webp"},{"title":"Nantoka Tengoku","synopsis":"Anthology film by animation collective G9+1 about various interpretations of heaven.","img":"https://cdn.myanimelist.net/images/anime/1420/104123.webp"},{"title":"Tokyo Mikansei","synopsis":"The fifth anthology work by animation collective G9+1, about the forever unfinished city Tokyo.","img":"https://cdn.myanimelist.net/images/anime/1362/104122.webp"},{"title":"Origami of Landscape","synopsis":"An animation of landscapes fluidly changing shapes.","img":"https://cdn.myanimelist.net/images/anime/3/83553.webp"},{"title":"New Tokyo Ondo","synopsis":"For this nonsensical animation,30 pictures per second were produced with only pencil tool.A man stretches out his arm and grasp the night view of a distant city NEW TOKYO. He and female companion rush down the length of his arm toward the city lights.The work is defined by a speedy style and comical pictures that express the sense of omnipotence derived from coming into a large sum of money and folly of letting happiness slip through your hands.\n\nShort film by nuQ (Misaki Uwabo). \n\n(Source: Official Page)","img":"https://cdn.myanimelist.net/images/anime/11/74479.webp"},{"title":"Ten","synopsis":"Independent animation by Suzuki Shiniichi (鈴木伸一).","img":"https://cdn.myanimelist.net/images/anime/8/71327.webp"},{"title":"Katte ni Shiyagatte","synopsis":"Official music video for Kindan no Tasuketsu's song Katte ni Shiyagatte.","img":"https://cdn.myanimelist.net/images/anime/7/87270.webp"},{"title":"Takoyaki Story","synopsis":"Music video directed by Sawako Kabuki for the song TAKOYAKI STORY by 1980YEN in the album \"FAST FOOD.\"","img":"https://cdn.myanimelist.net/images/anime/1914/98112.webp"},{"title":"Nameless Flipbook","synopsis":"A short made for the stage event BIBLO held by the University of Tokyo, to be preformed by the dance group WISH. Though the director states that the performance will be slightly different from the animated video.","img":"https://cdn.myanimelist.net/images/anime/1008/91231.webp"},{"title":"Nosferatu","synopsis":"Official music video for Kindan no Tasuketsu's song Nosferatu.","img":"https://cdn.myanimelist.net/images/anime/4/87268.webp"},{"title":"Phantasm","synopsis":"Enter Taro Shinkai's captivating dreamworld.","img":"https://cdn.myanimelist.net/images/anime/8/71872.webp"},{"title":"Flying Luna Clipper","synopsis":"A trip on a chartered plane with a number of other thrill-seekers (most of whom are anthropomorphic fruits and vegetables) and hop from island to island, each of which offer their own unique visual delights. \n\n(Source: IMDB)","img":"https://cdn.myanimelist.net/images/anime/1170/98289.webp"},{"title":"Ametsuchi","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1278/101480.webp"},{"title":"Don't You Wish You Were Here?","synopsis":"\"My first abstract animation. What color do you have in your mind?\"\n\n(Source: Maya Yonesho)","img":"https://cdn.myanimelist.net/images/anime/12/71461.webp"},{"title":"Initiation feat. Hatsune Miku","synopsis":"Music video directed by YKBX for the title track Initiation by Keiichirou Shibuya and Hiroki Azuma, featuring Hatsune Miku. It was included on DVD with the release of the album.","img":"https://cdn.myanimelist.net/images/anime/1739/103236.webp"},{"title":"Believe in It","synopsis":"\"Your dream will come true if you believe in it.\"\n\n(Source: Maya Yonesho)","img":"https://cdn.myanimelist.net/images/anime/9/71458.webp"},{"title":"Learn to Love","synopsis":"\"Someone loves you whether you know it or not.\"\n\n(Source: Maya Yonesho)","img":"https://cdn.myanimelist.net/images/anime/3/71460.webp"},{"title":"Two Tea Two","synopsis":"The woman does the decision to coexist with the past.\nReturning to one person was not an answer. It is a new image.\n\n(Source: Official You Tube channel)","img":"https://cdn.myanimelist.net/images/anime/10/82935.webp"},{"title":"Kitsutsuki: The Ten Hole Stories","synopsis":"G9+1 film.","img":"https://cdn.myanimelist.net/images/anime/1093/104077.webp"},{"title":"Shapeshifter","synopsis":"Space Shower TV Station ID directed by Takashi Ohashi, with music by Tomggg.","img":"https://cdn.myanimelist.net/images/anime/1026/101672.webp"},{"title":"Land","synopsis":"Short animation directed by Masanobu Hiraoka.","img":"https://cdn.myanimelist.net/images/anime/1003/98151.webp"},{"title":"Adobe Student and Teacher Edition","synopsis":"Saigo no Shudan's earliest work, it is a commercial for Adobe's Student and Teacher Edition software. Though it is unknown if Saigo no Shudan created it as an example for their portfolio or if Adobe actually paid for their animation services.","img":"https://cdn.myanimelist.net/images/anime/1712/95535.webp"},{"title":"Ring Ring Boy","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Mousou Teikoku Chikuonki","synopsis":"Music video directed by Kousuke Sugimoto for the single Mousou Teikoku Chikuonki by Eri Kitamura. The limited edition version included a DVD with this music video, a making-of, and a short version that was released on the Teichiku Records YouTube channel in December of 2017 to promote the single.","img":"https://cdn.myanimelist.net/images/anime/1237/100480.webp"},{"title":"Üks Uks","synopsis":"Opening one's inner doors of conflict is the key to finding harmony.\n\nAn independent film by Yonesho Maya, which won the Yuri Norstein Award music prize at the Laputa Animation Festival.","img":"https://cdn.myanimelist.net/images/anime/11/71455.webp"},{"title":"Idea ga Tsukamaranai.","synopsis":"A man is racking himself at a desk. On his desk there is a tiny man also racking himself at his desk.The big man remains still without any idea. The tiny man moves around in vain trying to catch some idea, which is supposed to be inside of him. Both man get cornered searching for idea, become desperate and after the daybreak the big man is struck by an idea...\n\n(Source: Official website)\n","img":"https://cdn.myanimelist.net/images/anime/5/74775.webp"},{"title":"Aru Apartment no Isshitsu","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1091/96049.webp"},{"title":"Kamen no Marionette-tachi","synopsis":"Screened at the 1st Sogetsu Animation Festival in 1965, the film was made in 35mm using the animation equipment owned by animator Yoji Kuri.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/anime/1593/105335.webp"},{"title":"Hatoya","synopsis":"A surreal take on The Honest Woodcutter as a promotion for DJ Shugo's \"Otoko-darake no Dai Enkai\" music event.","img":"https://cdn.myanimelist.net/images/anime/9/88647.webp"},{"title":"Controller of Controller","synopsis":"A video game character finds a VR headset on the street.","img":"https://cdn.myanimelist.net/images/anime/1573/95073.webp"},{"title":"Uneasiness and Triangle","synopsis":"One of Masanobu Hiraoka's earlier short animations.","img":"https://cdn.myanimelist.net/images/anime/1049/98175.webp"},{"title":"Drive Car","synopsis":"Official music video for Keigo Iwase's second single Drive Car.","img":"https://cdn.myanimelist.net/images/anime/6/87596.webp"},{"title":"Buggy Map","synopsis":"Short animations by Densuke28 simulating video game bugs. The original short was a personal project and was released on his Vimeo page. The following year, a new version of the work was showcased at a museum exhibition on seven different screens, accompanied with a 3D printed model of the character in the short. A forty-nine second clip titled \"BUGGY MAP -Exhibition Ver.-\" was uploaded to Densuke28's official Vimeo which combines the animations on the multiple screens into one video.","img":"https://cdn.myanimelist.net/images/anime/1690/96921.webp"},{"title":"Countdown","synopsis":"\"I would make my new animation with my New Year's cards, and my New Year's cards with my new animation.\"\n\n(Source: Maya Yonesho)","img":"https://cdn.myanimelist.net/images/anime/7/71459.webp"},{"title":"On the Table","synopsis":"A psychedelic short animation by Masanobu Hiraoka.","img":"https://cdn.myanimelist.net/images/anime/1842/98176.webp"},{"title":"Koto no Shidai","synopsis":"Official music video for Tamaki Roy's song Koto no Shidai, which was released on his album \"Nagi\" on June 21, 2017.","img":"https://cdn.myanimelist.net/images/anime/10/86847.webp"},{"title":"Humane","synopsis":"Music video for Humane by KUF from their album 'Universe'.\n","img":"https://cdn.myanimelist.net/images/anime/1111/98076.webp"},{"title":"Flicker Love No.1","synopsis":"After seeing Velvet Underground perform in Andy Warhol’s Exploding Plastic Inevitables in New York, Tanaami became interested stroboscopic effects. This flicker film was conceived as the first of many but this was the only one that was realized.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"I Want Nothing","synopsis":"Music video for I Want Nothing by The Black Ghosts.","img":"https://cdn.myanimelist.net/images/anime/1300/97097.webp"},{"title":"Women","synopsis":"Co-directed with the painter Shigetaka Sawada, the film was made in 35mm and screened at the 2nd Sogetsu Animation Festival in 1966.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Tsukiyo &amp; Opal","synopsis":"Half asleep with my eyes closed, my conscience flies beyond time and space and I transform myself to all the life forms existing. I become the universe and the universe becomes me, until I fall asleep.... It is a song to pray for the existence of heart and soul at an awakening.","img":"https://cdn.myanimelist.net/images/anime/1849/96392.webp"},{"title":"In the Sea and near a Girl.","synopsis":"Short animation by Masanobu Hiraoka with music and sound design by Aimar Molero.","img":"https://cdn.myanimelist.net/images/anime/1771/98734.webp"},{"title":"Shuugou no Kangae","synopsis":"An educational film about abstract thought.","img":"https://cdn.myanimelist.net/images/anime/12/77375.webp"},{"title":"Sanuki Eiga-sai Opening Eizou","synopsis":"Sanuki Film Festival in 2015 and 2016 had opening animations to officially launch the beginning of the festival.","img":"https://cdn.myanimelist.net/images/anime/1532/92751.webp"},{"title":"Bug","synopsis":"Promotional web videos directed by Densuke28 to showcase the 2019 Spring &amp; Summer line for Japanese clothing brand KAIKO.","img":"https://cdn.myanimelist.net/images/anime/1889/101685.webp"},{"title":"Shinrabanshou.mp3","synopsis":"Space Shower TV Station ID directed by Wataru Uekusa, with music by sasakure.UK.","img":"https://cdn.myanimelist.net/images/anime/1601/102217.webp"},{"title":"Cup of Smoke","synopsis":"Music video for the remixed version of Cup of Smoke by Your Gay Thoughts &amp; Alphabets Heaven from the album \"The Watercolors Remixed.\"","img":"https://cdn.myanimelist.net/images/anime/1895/98381.webp"},{"title":"4.Eyes Re-Mix 2005","synopsis":"A remix of the short film 4.Eyes by Keiichi Tanaami.","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Ushinawareta Choushoku","synopsis":"A businessman happily goes about his carefully prepared morning routine. One day, this routine is suddenly interrupted.","img":"https://cdn.myanimelist.net/images/anime/1902/102382.webp"},{"title":"Danbou to Reibou","synopsis":"Official music video for Nishinakajima Kinako's song Danbou to Reibou promoting his special feature interview with Natalie (a Japanese entertainment news website) on February 27, 2019. The music video is available to view on Space Show Music's official YouTube channel.","img":"https://cdn.myanimelist.net/images/anime/1191/98545.webp"},{"title":"Introspection","synopsis":"\"We can understand each other without understanding each language.\"\n\n(Source: Maya Yonesho)","img":"https://cdn.myanimelist.net/images/anime/10/71457.webp"},{"title":"Maze Maze Wien","synopsis":"An independent film by Yonesho Maya using her unique style of combining card-sized drawings and stop motion animation that walks the viewer through real locales, in this case, Vienna.","img":"https://cdn.myanimelist.net/images/anime/4/71473.webp"},{"title":"Screw","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/1665/97838.webp"},{"title":"Kai Douryoku Real","synopsis":"Montage of the human body fusing stop-motion and computer animation into a bizzare scifi representation. It was shown at the Japanese Media Arts Festival and got the Excellence Award. And it won the Special Jury Prize in the Off Theatre Competition at the 10th Yubari International Fantastic Film Festival.","img":"https://cdn.myanimelist.net/images/anime/2/70643.webp"},{"title":"To Disappear","synopsis":"Music video for the song \"To Disappear\" by Your Gay Thoughts from the album \"The Watercolors.\"\n","img":"https://cdn.myanimelist.net/images/anime/1490/98380.webp"},{"title":"On a Forest, in the Air","synopsis":"A silent short animation by Masanobu Hiraoka.","img":"https://cdn.myanimelist.net/images/anime/1663/98737.webp"},{"title":"Fast Week","synopsis":"The genesis of fast food.","img":"https://cdn.myanimelist.net/images/anime/1773/102390.webp"},{"title":"Time on the Planet","synopsis":"The sun rises in one place and the sun sets in another.\nWhen a woman's hair grows up, a man shaves off her elongated beard.\nEven if the time is different, the time passes in the same way anywhere.\nThe earth turns and the sun rises again.\n\nEach of the frames has a structure that loops indefinitely.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/1532/90975.webp"},{"title":"Frogtoise","synopsis":"Music video directed by Katsuki Tanaka for the Exploitation Edit of Frogtoise by German musician Schneider TM (Dirk Dresselhaus).","img":"https://cdn.myanimelist.net/images/anime/1735/99045.webp"},{"title":"Ake-Vono","synopsis":"Music video directed by Kouhei Yoshino for the song Ake-Vono by Japanese instrumental band NETWORKS.","img":"https://cdn.myanimelist.net/images/anime/1475/101665.webp"},{"title":"Animatope","synopsis":"Space Shower TV Station ID directed by Takashi Ohashi, with music by composed by Yuri Habuka and sung by PUPI.","img":"https://cdn.myanimelist.net/images/anime/1335/101673.webp"},{"title":"Catalyst","synopsis":"Official music video for Yamamoto Seiichi's song Catalyst. The song features only instrumental music and was released on his album \"Palm.\"","img":"https://cdn.myanimelist.net/images/anime/1078/95526.webp"},{"title":"Kamo ga Suki","synopsis":"One sunny afternoon, a middle-aged man goes on a walk to feed some ducks.","img":"https://cdn.myanimelist.net/images/anime/1171/102389.webp"},{"title":"Kunchi","synopsis":"An early work of Saigo no Shudan, this movie is collaboration with the artist to-kichi. The motif is \"Nagasaki Kunchi\" which is the most famous festival in Nagasaki, Japan.\n","img":"https://cdn.myanimelist.net/images/anime/1326/95530.webp"},{"title":"(a long day of) Mr. Calpaccio","synopsis":"An experimental work created by UrumaDelvi in 2005 and screened at several film festivals. The UrumaDelvi and Productions Inc. company later released it on DVD in 2006.","img":"https://cdn.myanimelist.net/images/anime/5/88829.webp"},{"title":"Oniwa no Soto","synopsis":"Saigo no Shudan's advertisement movies for the 2014 Shibukaru Festival hosted by the Parco department store. A regular version and long version exist of the advertisement, though both share very little footage between each other.","img":"https://cdn.myanimelist.net/images/anime/1663/95536.webp"},{"title":"Factory","synopsis":"Two contributions by Mirai Mizue to the SPACE SHOWER TV Canvas 2.0.0 campaign. Space Shower TV is a music video channel in Japan similar to MTV. Between segments there are sometimes small animations featuring the station ID. The campaign was launched to invite all animators to come and submit works featuring the station's ID. The only requirement was that the animation is between 15-90 seconds in length. In order to encourage indie artists, all videos were shown on the specially created website; and 10 professional artists' creations (including Mirai Mizue) were already there to give examples of what Space Shower TV was looking for in content.","img":"https://cdn.myanimelist.net/images/anime/1352/94786.webp"},{"title":"Kai Douryoku","synopsis":"Not much is known about the piece compared to its award-winning \"Real\" counterpart made 4 years later.","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Paper Moon","synopsis":"Music video for Paper Moon by Metome.","img":"https://cdn.myanimelist.net/images/anime/4/86257.webp"},{"title":"Tansui","synopsis":"Early experimental film by Koji Yamamura.","img":"https://cdn.myanimelist.net/images/anime/1667/102523.webp"},{"title":"Tokyo Art Month","synopsis":"A special web movie for the 2011 Autumn Tokyo Art Month. People could by tickets which granted them multi-access to various museums, fashion collections, and art fairs. The event ran for the entire month of November.","img":"https://cdn.myanimelist.net/images/anime/1326/95531.webp"},{"title":"Kanabun no Koushin","synopsis":"A bizarre early work by Saigo no Shudan. They used children's toy instruments to create the kitschy soundtrack. \"Kanabun\" is the Japanese colloquial name for a drone beetle (Pseudotorynorrhina japonica) which is in the scarab family.","img":"https://cdn.myanimelist.net/images/anime/1429/95533.webp"},{"title":"Miracle","synopsis":"Music video directed by Shunji Iwai for the song Miracle by illion, Youjirou Noda's solo project, in the album \"P.Y.L.\"","img":"https://cdn.myanimelist.net/images/anime/1166/100512.webp"},{"title":"RoboCop","synopsis":"Music video directed by Takaharu Shimizu for the song RoboCop by Kenmochi Hidefumi on his album \"Footwork\".","img":"https://cdn.myanimelist.net/images/anime/1693/102884.webp"},{"title":"Birthday","synopsis":"Toshiaki Hanzaki's graduation work depicting the evolution of various species in a comical fashion.","img":"https://cdn.myanimelist.net/images/anime/1780/98524.webp"},{"title":"Shiroi Niji","synopsis":"Music video directed by Masanobu Hiraoka for the song Shiroi Niji by ABEDON (Yoshiharu Abe) from his album \"B.\"","img":"https://cdn.myanimelist.net/images/anime/1169/98738.webp"},{"title":"Shake","synopsis":"Short animation directed by Masanobu Hiraoka featuring the song Smoke And Mirrors by Sean Lennon.","img":"https://cdn.myanimelist.net/images/anime/1393/98150.webp"},{"title":"Just a Seeker's Song","synopsis":"Music video directed by Sou Ootsuki for the single Just a Seeker's Song by APOGEE.","img":"https://cdn.myanimelist.net/images/anime/1719/98878.webp"},{"title":"Port of Wormy","synopsis":"A surreal short created by Mirai Mizue.","img":"https://cdn.myanimelist.net/images/anime/1305/94785.webp"},{"title":"Superfluid","synopsis":"Short film by Kojirou Shishido originally released in 2007. A 4K version of the film was uploaded to his YouTube channel November 14, 2018.","img":"https://cdn.myanimelist.net/images/anime/1954/102042.webp"},{"title":"Pussy","synopsis":"A double-projection film where the projections are positioned side-by-side. The subject of the film is images taken from Screw, a pornographic tabloid newspaper, editions of which Tanaami bought from newspaper stands in New York during his trip in 1969. He color printed the black-and-white photographs to apply different colors for psychedelic effect.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Subarashii Shigoto","synopsis":"An office worker observes and reports on the work of a certain dwarf. One day during lunch, an accident occurs.","img":"https://cdn.myanimelist.net/images/anime/1603/102416.webp"},{"title":"Midnight Run feat. Nana Furuya","synopsis":"Music video directed by Kakeru Mizui for the single Midnight Run by Japanese rock band Drive Boy, featuring Nana Furuya.","img":"https://cdn.myanimelist.net/images/anime/1092/102867.webp"},{"title":"Collapse Zen","synopsis":"Short animation by Kojirou Shishido featuring various grey structures crumbling apart.","img":"https://cdn.myanimelist.net/images/anime/1189/102043.webp"},{"title":"Ringing City","synopsis":"Big cities are glutted with information. Unconscious curiosity, hidden under apparent indifference, invites us into a noisy loop.","img":"https://cdn.myanimelist.net/images/anime/1361/103354.webp"},{"title":"Calicula Machine","synopsis":"A short film made for international festivals by Kinoshita Renzo in 1974~1976.","img":"https://cdn.myanimelist.net/images/anime/1069/98736.webp"},{"title":"The Laughing Spider","synopsis":"A short movie by Keiichi Tanaami.","img":"https://cdn.myanimelist.net/images/anime/1175/97666.webp"},{"title":"Aishite Aishite Aishite","synopsis":"Music video for Kikuo's Vocaloid song Aishite Aishite Aishite.","img":"https://cdn.myanimelist.net/images/anime/1571/104976.webp"},{"title":"Mizu no Naka no Suisougaku","synopsis":"Official music videos for Nishinakajima Kinako's 1st album \"Mizu no Naka no Suisougaku.\" This includes the song Instant and QB House, the music videos aired on Space Shower TV.","img":"https://cdn.myanimelist.net/images/anime/1208/95527.webp"},{"title":"Houkago no Thesaurus","synopsis":"Official music video for Her Ghost Friend's song Houkago no Thesaurus.","img":"https://cdn.myanimelist.net/images/anime/1543/95532.webp"},{"title":"Ongaku wa Tomatta","synopsis":"Official music video for Panpan no Tou's song Ongaku wa Tomatta.","img":"https://cdn.myanimelist.net/images/anime/1266/95529.webp"},{"title":"Do You Remember That Night?","synopsis":"Animated music videos for songs from the third 10th anniversary album \"Do You Remember That Night?\" by Sugiurumn, featuring a variety of accompanying artists. The album is a compilation of tracks from his previous discography, with That Night feat. Tomomi Ukumori as the only original song.","img":"https://cdn.myanimelist.net/images/anime/1492/99028.webp"},{"title":"The Ghost of Cartoon","synopsis":"Space Shower TV Station ID directed by Ryuu Ookubo, with music by Mndsgn.","img":"https://cdn.myanimelist.net/images/anime/1081/102219.webp"},{"title":"Sizq","synopsis":"Music video directed by Kouhei Yoshino for the song Sizq by Japanese instrumental band NETWORKS that was included on their album \"Dynamic Nature\".","img":"https://cdn.myanimelist.net/images/anime/1467/101670.webp"},{"title":"Hana (2006)","synopsis":"Kenji Kawasaki's first film.","img":"https://cdn.myanimelist.net/images/anime/1581/102261.webp"},{"title":"Kakera","synopsis":"Based on chapter one of Hans Christian Andersen’s The Snow Queen. The original text depicts a disaster brought about by tools and technology. There is a connection between this theme and the nuclear power plant accident that occurred in Japan in 2011. Tsuji's film attempts to be an interleaving depiction of the original story and the real-life disaster.\n\n(Source: Vimeo)","img":"https://cdn.myanimelist.net/images/anime/1632/99805.webp"},{"title":"This Is My House","synopsis":"This is a story of an adolescent boy living in a burning house with his parents. He can't drink black coffee yet he refuses his mother's offer of sugar lump. Rejecting his mother's kindness and ignoring his father's concern, he struggles with his own internal conflicts and continues to perform the minor rebellions of youth. Trying to attract the attention of a girl, the boy crashes a stolen motorcycle. In the aftermath of the accident he finds in his pocket a bill stolen from his mother's purse, now changed into a sugar lump. Rather than mend the relationship with his family, he takes the sugar lump to his friends, but they reject him, throwing the sugar lump away.\n\n(Source: airport-anifes.jp)","img":"https://cdn.myanimelist.net/images/anime/1692/97548.webp"},{"title":"Atomic World","synopsis":"Yoshiki Imazu's graduation work at Musashino Art University.","img":"https://cdn.myanimelist.net/images/anime/1112/103355.webp"},{"title":"Itekoma Hits","synopsis":"Otoboke Beaver's new album ITEKOMA HITS features six new tracks, two re-recorded songs, and the contents from their Love Is Short and Bakuro Book EPs. To promote the album, an animated summary video was made by Naoyuki Asano.","img":"https://cdn.myanimelist.net/images/anime/1521/103623.webp"},{"title":"Umete, Bye-Bye","synopsis":"One day, a giant comes to an inhabited island and begins planting yellow balloons in the sand. However, the job was not completed properly. This is unacceptable.","img":"https://cdn.myanimelist.net/images/anime/1041/102952.webp"},{"title":"Yamasuki, Yamazaki","synopsis":"When you're insanely happy, you're so happy to be happy, that you forget what made you happy. Shishi Yamazaki’s graduation film featuring the tracks Yama Yama and Kashi Kofima by musical group Yamazaki.","img":"https://cdn.myanimelist.net/images/anime/1661/103458.webp"},{"title":"SAIGO","synopsis":"Light animation by TOCHKA.\n\nTakamori Saigo was born in Kagoshima in 1828 and has been dubbed the last true samurai who is still loved by the people of Kagoshima. Saigo committed harakiri in the Battle of Shiroyama in 1877. Nobody knows what he actually looked like since he only appears in an etching and drawings. No photos of him at all. \n\nThe directors visited Saigo's descendants to ask for his facial features and characteristics for this film. Now Saigo has come back to life in animation, and he wanders around in towns and Sakurajima, an active composite volcano in Kagoshima. This is an experimental animation done by using penlights.\n\n(Source: The Guanajuato International Film Festival)","img":"https://cdn.myanimelist.net/images/anime/4/82922.webp"},{"title":"Tele◯Potion","synopsis":"Music video directed by Ryo Hirano for the title track of Tavito Nanao's twelfth single TELE◯POTION. This movie edit version of the song was featured in the 2014 film adaptation of Hiromi Kawakami's romance novel \"Nishino Yukihiko no koi to bouken\".","img":"https://cdn.myanimelist.net/images/anime/1928/102762.webp"},{"title":"Kiseki","synopsis":"Experimental animation by Kuri Youji.","img":"https://cdn.myanimelist.net/images/anime/3/71265.webp"},{"title":"MTV Ident: Horny","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/12/89822.webp"},{"title":"Anime Mitai na","synopsis":"Music Video by the dresscodes of the album's 6th track \"Anime Mitai na\" to promote the new Album \"1\".","img":"https://cdn.myanimelist.net/images/anime/8/86132.webp"},{"title":"Angel (Special)","synopsis":"A man in a prison dreams of being an angel.","img":"https://cdn.myanimelist.net/images/anime/11/65735.webp"},{"title":"Kono Mayonnaise wa Yuru Sugiru","synopsis":"Everything is liquid in this world, like the mayonnaise.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/3/72282.webp"},{"title":"The Harmonic Gleam Vibration","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/3/58125.webp"},{"title":"Yami no Kioku, Yume no Inei","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/13/58109.webp"},{"title":"Blend","synopsis":"This short experiments with the flow of oil ink over the surface of the water. Mizue manipulated the ink by blowing with straws or stirring with toothpicks and used stop motion animation techniques to shoot the resulting effects.","img":"https://cdn.myanimelist.net/images/anime/12/71620.webp"},{"title":"Natsu no Shisen 1942","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/4/58113.webp"},{"title":"Odoroki Ban","synopsis":"Independent animation by Furukawa Taku.","img":"https://cdn.myanimelist.net/images/anime/11/71339.webp"},{"title":"Jikkyou Chuukei","synopsis":"Official music video for Radwimps' Jikkyou Chuukei song.","img":"https://cdn.myanimelist.net/images/anime/5/81557.webp"},{"title":"Konohana no Sakuya Mori","synopsis":"A horse puppet wanders into a silver world and pauses before an ethereal flower.\n\n(Source: CoolConnections)","img":"https://cdn.myanimelist.net/images/anime/1500/95371.webp"},{"title":"Kaze no Kokyuu: Animation ni Yoru Oufuku Shokan","synopsis":"Short animation by Keiichi Tanaami.","img":"https://cdn.myanimelist.net/images/anime/6/73776.webp"},{"title":"Why","synopsis":"A boxing ring turns into a stage for abstract animation where the punches thrown in the match and the halftone dots in reprographics gradually become indistinguishable. Tanaami shot a boxing match on a Motordrive camera, made two thousand offset prints, and rephotographed each of them. He explains his inspiration for the work being the experience of watching a boxing match on television but finding the newspaper print the next morning better capturing the exhilaration of the sport.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/anime/9/73609.webp"},{"title":"Southpaw","synopsis":"Music video for Southpaw by Kuricorder Quartet.","img":"https://cdn.myanimelist.net/images/anime/1993/102813.webp"},{"title":"Stone","synopsis":"Independent, stop motion animation by Aihara Nobuhiro, combining drawings and real landscapes.","img":"https://cdn.myanimelist.net/images/anime/12/71311.webp"},{"title":"Such a Good Place to Die","synopsis":"A short film by Onohana.","img":"https://cdn.myanimelist.net/images/anime/9/83552.webp"},{"title":"Box","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/2/75697.webp"},{"title":"Nice to See You","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/4/72723.webp"},{"title":"Direct Animation","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/4/72632.webp"},{"title":"Head Spoon","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/13/72630.webp"},{"title":"Wall","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/2/75695.webp"},{"title":"?/Sankaku no Rhythm/Trump no Arasoi","synopsis":"Four short vignettes in this early animated film. In the first, shadows pull away to reveal a puddle, and automobile and bicycle tires pass through it. In the second, cutout shadows of a variety of shoes of people walking are seen. The third is a flurry of geometric forms. In the fourth, the playing card spade courts the heart and pushes away the club, but eventually the club returns, beats up the spade, and wins the heart. \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/2/85267.webp"},{"title":"Propagate","synopsis":"Dynamically expressing the growth and prosperity of organic plants with geometric figures.\n","img":"https://cdn.myanimelist.net/images/anime/5/85268.webp"},{"title":"You Should See Me in a Crown","synopsis":"A new official music video for American singer and songwriter Billie Eilish's song \"you should see me in a crown\" animated by Takashi Murakami. The music video was available for purchase on iTunes Japan and US on the same day.","img":"https://cdn.myanimelist.net/images/anime/1493/100246.webp"},{"title":"Five Fire Fish","synopsis":"A short animation by Koji Yamamura, created in cooperation with  the National Film Board of Canada.","img":"https://cdn.myanimelist.net/images/anime/10/85473.webp"},{"title":"Landscape","synopsis":"A short animation by Keiichi Tanaami.","img":"https://cdn.myanimelist.net/images/anime/2/74281.webp"},{"title":"Kojin Toshi","synopsis":"Short film by Kurosaka Keita.","img":"https://cdn.myanimelist.net/images/anime/12/76311.webp"},{"title":"Bara Bara Film","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/12/72937.webp"},{"title":"Tanaami Keiichi no Shouzou","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/3/58121.webp"},{"title":"Kamakura","synopsis":"\"A snow-covered house is situated in the middle of a rice field.\nWhat should one do, in a space of white and quietude?\nBy spring, the snowy hut melts and loses its appearance.\nThe Japanese MA, the in-between state of time and space –\nan animation, a haiku\"\n\n(Source: Berlinale 2014 programme)","img":"https://cdn.myanimelist.net/images/anime/11/70693.webp"},{"title":"New York Trip","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/10/72722.webp"},{"title":"Miira no Yume","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/3/75690.webp"},{"title":"Rhythm","synopsis":"A comfortable rhythm composed of light and shadow. Director Ogino-style absolute movie which freely manipulates geometric figures.\n","img":"https://cdn.myanimelist.net/images/anime/6/85269.webp"},{"title":"Pulsar","synopsis":"Clay (technically gypsum) animation set to a beat with robots, scifi motif, and alligators with human arms. It was broadcasted a year later (1991) by the Japanese TV program Miyake Yuuji no Ebizori Kyoshou Tengoku, \"Ebiten\" for short, which showed works of independent film makers.\n\nThis has the prototype character, Pulta, which was used for Bowda Katsuhi's Robot Pulta anime when he was hired by the NHK.","img":"https://cdn.myanimelist.net/images/anime/5/70639.webp"},{"title":"Usawaltz","synopsis":"In the black and white world with so many animals relaxing, there are small rabbits called 'usa' dancing in their world.\n\n(Source: Official site)","img":"https://cdn.myanimelist.net/images/anime/8/78346.webp"},{"title":"Tarzan","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/7/72628.webp"},{"title":"Iro wo Kuu Akuma","synopsis":"Anthology produced by Adobe Creative Cloud's Japan division to promote their software suite. It showcases the talents of various Japanese experimental animators.","img":"https://cdn.myanimelist.net/images/anime/1151/102844.webp"},{"title":"Memories: Younenki no Joukei","synopsis":"Film by Tanaami Keiichi.","img":"https://cdn.myanimelist.net/images/anime/4/73777.webp"},{"title":"Ushi Atama","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/3/72763.webp"},{"title":"Jinkou no Rakuen","synopsis":"Psychedelic –and at times sinister– music by Shinpei Kikuchi accompanies a disorienting display of reproduced imagery taken from magazines and posters of sunny beaches and bikini models. Tanaami made positive and negative reprographic prints of these images onto transparent cel sheets, placed them on top of one another, and twisted them in different directions to create a moiré effect. Speaking on the work, Tanaami explained his paradise only exists in the world of reproduction.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/anime/12/73775.webp"},{"title":"Kage no Kodomo","synopsis":"A boy and his sister are nearly eaten by their father and they rush out of the house. They run away in their father’s car and wind up in the wilderness, where they meet a Giant and a Witch. This animation film in black &amp; white charcoal drawings uses the sound of a bass guitar and combines a Japanese Manga feel with a fairy tale by the Brothers Grimm.\n","img":"https://cdn.myanimelist.net/images/anime/11/19128.webp"},{"title":"Mimizu Monogatari","synopsis":"Short film by Kurosaka Keita.","img":"https://cdn.myanimelist.net/images/anime/3/76316.webp"},{"title":"Against","synopsis":"Short animation by Yukie Nakauchi","img":"https://cdn.myanimelist.net/images/anime/10/84182.webp"},{"title":"Drill","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/12/75696.webp"},{"title":"Motion Lumine","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/9/72634.webp"},{"title":"Run &amp; Roll","synopsis":"Run &amp; Roll is a campaign film created by Keiichi Tanaami for the Kyoto Marathon by CW-X.","img":"https://cdn.myanimelist.net/images/anime/12/81091.webp"},{"title":"Taku Boda","synopsis":"A short animation by Taku Furukawa and CG animator Noriyuki Boda.","img":"https://cdn.myanimelist.net/images/anime/4/72787.webp"},{"title":"Why Re-Mix 2002","synopsis":"Film by Tanaami Keiichi.","img":"https://cdn.myanimelist.net/images/anime/11/73783.webp"},{"title":"Mac the Movie","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/2/72633.webp"},{"title":"Tori","synopsis":"A short film by Furukawa Taku.\n\nAfter a sleeping man is harassed by a bird, he becomes hell-bend on chasing it down and capturing it for revenge, but the bird turns out to be smarter than it looks. ","img":"https://cdn.myanimelist.net/images/anime/8/72726.webp"},{"title":"Yakusoku","synopsis":"A short animation by Taku Furukawa. ","img":"https://cdn.myanimelist.net/images/anime/13/72934.webp"},{"title":"Sleepy","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/11/72629.webp"},{"title":"Usatalk","synopsis":"Usa greets you.\n\n(Source: Official site)","img":"https://cdn.myanimelist.net/images/anime/2/87636.webp"},{"title":"Youshi Kei: Mou Hitotsu no Nijiiro Toshi","synopsis":"Film by Tanaami Keiichi.","img":"https://cdn.myanimelist.net/images/anime/3/73778.webp"},{"title":"Utsukushii Hoshi","synopsis":"Furukawa Taku film made for UNICEF.","img":"https://cdn.myanimelist.net/images/anime/5/72727.webp"},{"title":"Landmark","synopsis":"Short animation by Taro Shinkai.","img":"https://cdn.myanimelist.net/images/anime/10/71874.webp"},{"title":"Haruko no Bouken","synopsis":"Short film by Kurosaka Keita.","img":"https://cdn.myanimelist.net/images/anime/9/76313.webp"},{"title":"Henkei Sakuhin Dai 1-ban","synopsis":"Short film by Kurosaka Keita.","img":"https://cdn.myanimelist.net/images/anime/11/76314.webp"},{"title":"Aitata Bocchi","synopsis":"Old friends Cabbage and Pea reunite under awkward circumstances.","img":"https://cdn.myanimelist.net/images/anime/9/83551.webp"},{"title":"Mechano: Scientific Attack Force","synopsis":"Three 10-minute videos present a trippy view into the minds of their creators. Brought together by Pierre Taki of Denki Groove, Mechano: Scientific Attack Force features three shorts done in very different styles.\n\nThe three short films are:\n\n\"Plastic Gun Man\" - a 3D Western spoof\n\"World Meccano Triangle\" - a music video reminiscent of '90s era screensavers\n\"Haiirogaoka no Soridaijin\" (translated as \"Prime Minister of Gray Hill\") - an anime-style animated video parody of Akira Mochizuki's famous 1977 manga, Yuuhi ga Oka no Souri Daijin","img":"https://cdn.myanimelist.net/images/anime/13/62687.webp"},{"title":"Play Jazz","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/11/72724.webp"},{"title":"Karma","synopsis":"\"In his early experimental short Karma (カルマ, 1977), Aihara uses water as his central motif.  The film is hand drawn and appears to be shot on 16mm using a blue filter.  At first we can only see tiny specks on the screen, coming and going like snow flurries.  The specks gradually grow larger and take the shape of bubbles, then even larger into rivulets of water on a transparent surface.\"\n\n(Source: Nishikata Film Review)","img":"https://cdn.myanimelist.net/images/anime/8/71315.webp"},{"title":"Kaibutsu Gakushou","synopsis":"An animated archive of imaginary monsters written by a fictitious monsterologist in Medieval Europe.\n This work depicts the habits of monsters using movement inspired by short phrases such as “Taste of Tears”, “Tamed Wildness”, etc.\n\n(Source: Yamamura Animation)","img":"https://cdn.myanimelist.net/images/anime/13/84097.webp"},{"title":"Maku","synopsis":"\"There are two people who face each other in each space. Each pair keeps a few distance between their partners and find some fearful, tender, and comfortable feelings that fascinate them. The feelings are put into practice immediately, and they start groping each feelings. Somehow, I try to blend and connect them. \"Feelings\" are sound bliss for all who have a body and sense. I busily pick my feelings on the track of my life and reconstruct by animation to appreciate them.\"\n\n(Source: Yoriko Mizushiri)","img":"https://cdn.myanimelist.net/images/anime/7/88832.webp"},{"title":"\"Tokyo\"","synopsis":"A short film spelling Tokyo in hiragana.","img":"https://cdn.myanimelist.net/images/anime/1109/96789.webp"},{"title":"In Search of Axis","synopsis":"Polygon Pictures Inc.'s first animated work.","img":"https://cdn.myanimelist.net/images/anime/1409/95844.webp"},{"title":"Swimming","synopsis":"The short animation evokes all the awkwardness of a school swimming class. A chubby young boy, steps up reluctantly for his turn, after watching the sporty prowess of his peers.\n\n(source: Official website)","img":"https://cdn.myanimelist.net/images/anime/6/71851.webp"},{"title":"Zenchuu Maite","synopsis":"Based on a poem by Kenji Miyazawa.\nA worm in this river looks shiny to me.\n8  γ  e  6  α\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/10/72281.webp"},{"title":"Portrait","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/6/72725.webp"},{"title":"Sakana no Iu Koto wo Kiku","synopsis":"A work completed by Onohana during her enrollment at the Tokyo University of the Arts. A young boy is compelled to release his pet fish into the sea.","img":"https://cdn.myanimelist.net/images/anime/9/83554.webp"},{"title":"Venus","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/2/75694.webp"},{"title":"Toumei Ningen","synopsis":"Independent animation by Shimamura Tatsuo.","img":"https://cdn.myanimelist.net/images/anime/4/71325.webp"},{"title":"Nowhereland","synopsis":"Official music video for the international multinational band The Hotpantz' song Nowhereland. ","img":"https://cdn.myanimelist.net/images/anime/12/87364.webp"},{"title":"Age of Obscure: Boubaku Jidai","synopsis":"Short film by Mirai Mizue and Onohana with music by Twoth.","img":"https://cdn.myanimelist.net/images/anime/1526/90848.webp"},{"title":"Ice Fist","synopsis":"A music video for Vampillia's song \"Ice Fist.\"","img":"https://cdn.myanimelist.net/images/anime/10/87261.webp"},{"title":"Clock","synopsis":"A bizarre short about a man who wakes up by a bunch of clocks only to act as a cuckoo clock for a room full of chickens at a bar.","img":"https://cdn.myanimelist.net/images/anime/9/65733.webp"},{"title":"Jikan","synopsis":"Experimental animation by Manabe Hiroshi, member of the Animation Sannin no Kai pioneer group of independent animation.","img":"https://cdn.myanimelist.net/images/anime/2/71299.webp"},{"title":"Color Cycling","synopsis":"A work with the theme of color following a soul and the circle of life as color and colorlessness wax and wane.\n\nThe short had an updated version uploaded on February 21, 2019 which has some minor color changes for some scenes.","img":"https://cdn.myanimelist.net/images/anime/1929/98223.webp"},{"title":"Chiruri","synopsis":"The story of a boy and a girl who try to find the one thing that matters. Independent film by Kenji Kawasaki, with accompanying music by Kai Shiono.","img":"https://cdn.myanimelist.net/images/anime/1787/101133.webp"},{"title":"Henkei Sakuhin Dai 2-ban","synopsis":"Short film by Kurosaka Keita.","img":"https://cdn.myanimelist.net/images/anime/6/76312.webp"},{"title":"Petit Manga","synopsis":"A short animation by Taku Furukawa.","img":"https://cdn.myanimelist.net/images/anime/13/72932.webp"},{"title":"Rule","synopsis":"A short animation by Taku Furukawa.","img":"https://cdn.myanimelist.net/images/anime/3/72933.webp"},{"title":"Aa / ii","synopsis":"When the mind says aah, the body says hee. I dance around the confusion and the consensus, and my whole life is getting composed of these dances.\n","img":"https://cdn.myanimelist.net/images/anime/1578/96394.webp"},{"title":"Tokyo Fantasia","synopsis":"A musical animated film by G9+1, a group of veteran animators. It won the Tokyo Anime Award in 2010.","img":"https://cdn.myanimelist.net/images/anime/1823/104076.webp"},{"title":"Sensuikan Cassiopeia","synopsis":"Experimental animation by Manabe Hiroshi, member of the Animation Sannin no Kai pioneer group of independent animation.","img":"https://cdn.myanimelist.net/images/anime/3/71301.webp"},{"title":"Genei Toshi","synopsis":"Independent animation by Shimamura Tatsuo.","img":"https://cdn.myanimelist.net/images/anime/6/71323.webp"},{"title":"Essential Free &amp; Easy","synopsis":"An April Fools' style commercial commissioned by Kao Japan. Essential Free &amp; Easy Cool Wax Shampoo and Conditioner are real products Kao Japan makes, they are meant to help remove hair wax from men's hair and condition the hair so it is more receptive to new wax when the hair is then dried and styled again. Takashi Taniguchi known for his bizarre animation style, animated the web commercial. It's a ballad of a man who is in pain from having to scrub out his hair wax every day and frustratingly pulls his hair as he has to restyle the next day. An anthropomorphic Essential Free &amp; Easy Cool Wax Shampoo and Conditioner tell him to use them so that his pain can go away. He is very happy with the results.\n","img":"https://cdn.myanimelist.net/images/anime/1245/100364.webp"},{"title":"Nou Nen feat. Utae","synopsis":"Music video for Nou Nen feat. utau by THE POTONE!","img":"https://cdn.myanimelist.net/images/anime/1018/90158.webp"},{"title":"Experiment","synopsis":"A short film by Tsuji Naoyuki that blends stop motion with 2D drawn animation.","img":"https://cdn.myanimelist.net/images/anime/1269/92989.webp"},{"title":"A Woman in a Fashion Building","synopsis":"Desire, delusions and a reality of a woman who came to a fashion building.\n\n(Source: Official website)\n\n","img":"https://cdn.myanimelist.net/images/anime/1874/90974.webp"},{"title":"Tokyo SOS","synopsis":"The fourth anthology work by animation collective G9+1, this time on the theme of global warming. The film features music by Kazunori Maruyama.","img":"https://cdn.myanimelist.net/images/anime/1410/104074.webp"},{"title":"Hakuchuu Meikyuu","synopsis":"Short animation by Taro Shinkai.","img":"https://cdn.myanimelist.net/images/anime/10/71875.webp"},{"title":"Yume Utsutsu","synopsis":"Is the path I am walking on now part of a dream or reality? This is the first animation film that is largely motionless.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/13/72283.webp"},{"title":"Souiu Megane","synopsis":"A material, an origin, a meaning, a value. When you have a question on glasses, let's answer \"Well, that's glasses\".\nRio de Janeiro International Short Film Festival Best Film of The Young Jury.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/3/72280.webp"},{"title":"Tsuiseki","synopsis":"Experimental animation by Manabe Hiroshi, member of the Animation Sannin no Kai pioneer group of independent animation.","img":"https://cdn.myanimelist.net/images/anime/5/71303.webp"},{"title":"Sol","synopsis":"This video clip is a story of realization.\nA story of a child who has been inheriting a negative legacy of humankind that continuously accumulates in diverse ways. The child keeps carrying the legacy, that is too heavy and too much to bear for her body, feverishly without knowing the real meaning of the act.\n\nSoon, the child starts to act out a vision of knowledge, prayers, courage and curiosity. She realizes that positive power is the best balance towards purification and she should stop carrying on the negativity through a negative attitude.\n\n(Source: Vimeo)","img":"https://cdn.myanimelist.net/images/anime/13/75796.webp"},{"title":"Shashinki '87","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/4/75692.webp"},{"title":"Shashinki","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/5/75691.webp"},{"title":"Banana ga Suki","synopsis":"A short music video for Yano Akiko &amp; Yuki's song Banana ga Suki. It promotes the single's release in 2 weeks and the video was posted to Victor Entertainment's official YouTube channel.","img":"https://cdn.myanimelist.net/images/anime/1396/95517.webp"},{"title":"Yonimo Osoroshii Grimm Douwa","synopsis":"The truth behind the well-known Grimm's Tales is cruel and full of blood and lust!\n\nEpisode 1: \"Hansel &amp; Gretel\": Two brothers lost in the woods were actually criminals...\n\nEpisode 2: \"The Blue Beard\": The true character of the Blue Beard was a cannibal who was unable to tolerate his wife's adultery. \n\nEpisode 3: \"Cinderella\": Actually Cinderella had abnormal affections toward the prince.","img":"https://cdn.myanimelist.net/images/anime/4/27232.webp"},{"title":"Yonimo Osoroshii Nihon Mukashibanashi","synopsis":"The horrible truths behind Japanese Fairy Tales from the ancient times are finally revealed! This title includes three episodes: \"The Monkey and the Crab\", \"Click-Crack Mountain\" and \"Urashima and the Kingdom beneath the Sea\".\n\n(Source: Official Website)","img":"https://cdn.myanimelist.net/images/anime/6/27233.webp"},{"title":"Tamala 2010: A Punk Cat in Space OVA","synopsis":"After a long 5-year wait, the team that created the widely acclaimed \"TAMALA2010 A Punk Cat in Space\" (Winner of the Jury and Public's Prize for Best Animated Feature Film in Canada's FanTasia 2003), brings you a fusion of extremely cute graphics and nice music. Also included are 3 shorts directed by Studio 4C's Hidekazu Ohara. It's a new animation world you'd want to see and listen to again and again.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/8/19770.webp"},{"title":"G-senjou no Higeki","synopsis":"Short experimental animation from Yoji Kuri.","img":"https://cdn.myanimelist.net/images/anime/13/64697.webp"},{"title":"Mononoke Dance","synopsis":"An animated music video for Denki Groove's song \"Mononoke Dance\".","img":"https://cdn.myanimelist.net/images/anime/11/75664.webp"},{"title":"Yami wo Mitsumeru Hane","synopsis":"A story set in a world before ours. A world in chaos where forces of good and evil fight and mingle. By doing so, it creates the chance to give birth to the new world. \n\nA couple of winged beings make love and fly away. They bear a child in an egg, and when the child opens its eyes they are immediately destroyed, one consumed by fire and the other by water. \n\nMythical, elemental and mysterious, the world created by Tsuji is dangerous, menacing and suffuse with signs of apocalypse, but somehow simultaneously tender and compassionate. A Feather Stare at the Dark captures simple gestures and primal feelings and amplifies them, realising the non-verbal and non-literal with remarkable grace. ","img":"https://cdn.myanimelist.net/images/anime/9/18949.webp"},{"title":"Good-by Elvis and USA","synopsis":"A chaotic mixture of hand-drawn animation and magazine cut-outs appropriating American pop culture. With a soundtrack involving music and sounds played in reverse, iconography of war and pop culture are intercut or merged together with images of eroticism and consumption. The film screened at the 3rd Sogetsu Animation Festival 1971.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/anime/6/71243.webp"},{"title":"Toki no Kousa","synopsis":"A four-dimensional short anime will start at the very beginning of Shibuya Crossing, that is, 10,000 years in the past.\n\nThe anime is part of a collaborative project helmed by Yoshitoshi Shinomiya. It features a hybrid of animation and live-action. The short was screened on Shibuya's Crossing screens and a YouTube-friendly version was posted as well.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1062/94949.webp"},{"title":"Koumon-teki Juuku Ketsujiru Juke","synopsis":"Short film by Sawako Kabuki.","img":"https://cdn.myanimelist.net/images/anime/6/76359.webp"},{"title":"Dreams","synopsis":"Abstract animation by Keiichi Tanaami and Nobuhiro Aihara.","img":"https://cdn.myanimelist.net/images/anime/11/69151.webp"},{"title":"Okashina Hotel","synopsis":"Short film made by Michio Mihara in 2008.","img":"https://cdn.myanimelist.net/images/anime/4/59309.webp"},{"title":"Requiem (ONA)","synopsis":"Short animation by Sawako Kabuki.","img":"https://cdn.myanimelist.net/images/anime/10/76374.webp"},{"title":"Red Colored Bridge","synopsis":"Experimental animation by Keiichi Tanaami.","img":"https://cdn.myanimelist.net/images/anime/11/69171.webp"},{"title":"Beluga","synopsis":"A horror spin on the classic tale of \"The Little Match Girl\".","img":"https://cdn.myanimelist.net/images/anime/1643/93895.webp"},{"title":"Yasashii Kinyoubi","synopsis":"An animation mixing hand-drawn and cut-out techniques depicting the daily rituals of weekday morning that is occasionally interrupted by flights of fantasy delivered in stroboscopic flashes. Showing scenes of brushing teeth and face washing, Tanaami describes the film to be like a self-portrait on his favorite day of the week.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/anime/12/58107.webp"},{"title":"Kiekaketa Monogataritachi no Tame ni","synopsis":"A somewhat dark and surreal tale by Naoyuki Tsuji. Our protagonist sets out on a journey in a world which starts at The Gate of Confusion. To complete his travels, he must meet various strange characters to relieve himself of his burdens and set himself free.\n","img":"https://cdn.myanimelist.net/images/anime/5/19067.webp"},{"title":"Madonna (Movie)","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/10/58127.webp"},{"title":"Jubilee","synopsis":"A music video by Koji Yamamura.","img":"https://cdn.myanimelist.net/images/anime/13/32293.webp"},{"title":"Crayon Angel","synopsis":"In Crayon Angel, Tanaami recalls his childhood memories of wartime Japan during the Second World War. The animation mixes wartime footage, family photographs and pop imagery, much of which is seen through fusuma-like grids that cut apart the image and distance it from the viewer. The soundtrack includes a haunting heartbeat, sounds of sirens and Robert Plant’s moans. The title refers to a campaign ran during the war by a confectionary company that asked children to submit crayon drawings of their brand icon, an angel, which had a profound emotional impact on Tanaami as a child.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/anime/3/71888.webp"},{"title":"Oh Yoko!","synopsis":"Made to accompany the song ‘Oh! Yoko!’ by John Lennon, the hand-drawn animation playfully appropriates and imagines moments in the lives of the celebrity couple, John Lennon and Yoko Ono, in pop caricature versions, with occasional appearances from Elvis Presley and the Yellow Submarine. The animation was aired on the late-night television program 11PM.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/anime/13/71241.webp"},{"title":"Haru no Shikumi","synopsis":"Short film by Atsushi Wada about Spring.","img":"https://cdn.myanimelist.net/images/anime/6/69159.webp"},{"title":"Modern No.2","synopsis":"Minimalistic abstract hand made animation from the award winning Mirai Mizue.","img":"https://cdn.myanimelist.net/images/anime/11/51519.webp"},{"title":"Gokiburi Taisou","synopsis":"Female humanoid cockroaches do calisthenics (though resembling normal dancing more).","img":"https://cdn.myanimelist.net/images/anime/5/87363.webp"},{"title":"Children","synopsis":"A short film by Takuya Okada set in a conformist society.\n\n(Source: IMDB)","img":"https://cdn.myanimelist.net/images/anime/1772/99106.webp"},{"title":"Animal Dance","synopsis":"A myriad of shadows resembling humans, animals and bacteria constantly move and merge with each other, while piano music plays in the background.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/10/28668.webp"},{"title":"Ga no Iru Tokoro","synopsis":"A Place Where There Are Moths depicts the conflict between drab concrete block apartment living and the natural environment in Japanese cities. The forces of nature are represented by the motif of a tree whose leaves metamorphose into orange moths and take over a middle-aged woman's apartment, pushing her room higher and higher within the building.\n\n(Source: Midnight Eye)","img":"https://cdn.myanimelist.net/images/anime/7/59753.webp"},{"title":"Coffee Break","synopsis":"A short film by Furukawa Taku.","img":"https://cdn.myanimelist.net/images/anime/9/71261.webp"},{"title":"Samero","synopsis":"Short film from animator Tsuji Naoyuki, who is known for his use of both charcoal and puppet animation.  Wake Up is a dark and brooding animation epitomizing his story telling style by combining serene worlds and childlike images with darkness and nightmarish scenes.","img":"https://cdn.myanimelist.net/images/anime/4/25824.webp"},{"title":"Kanojo no Dokushinshatachi ni Yotte Hadaka ni Sareta Seifuku no Shojo Kenkyuu","synopsis":"An erotic animation made for the late-night television program 11PM with a reference to Marcel Duchamp’s work of the same title.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/anime/13/58451.webp"},{"title":"Yume 10 Yoru","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/11/58123.webp"},{"title":"Good-by Marilyn","synopsis":"Animated to the song ‘Manatsu no dekigoto’ (Midsummer Happening) by Miki Hirayama, the film is a playfully erotic animation with appropriated images that include Marilyn Monroe, Mickey Mouse, Superman, Roy Lichtenstein prints and the Glico chocolate icon of a man running through the finishing line of a race. Screened at the 3rd Animation Festival at Sogetsu Art Center in the same year that Tanaami participated in the exhibition ‘Watashi no Marilyn Monroe’ (My Marilyn Monroe) at Gallery Décor, Tokyo.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/anime/8/72107.webp"},{"title":"Memory of Red","synopsis":"A short animation by Nobuhiro Aihara.","img":"https://cdn.myanimelist.net/images/anime/9/74283.webp"},{"title":"4.Eyes","synopsis":"The human eye, a well-known motif in psychedelic culture, is duplicated and intensified in this cinematic trip. Drawing from his experiences designing discotheques, Tanaami presents two prints of the same film in double projection with a time delay ––one projected a few seconds earlier than the other–– to suggest the mind slipping out of consciousness.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/anime/13/73774.webp"},{"title":"Jam","synopsis":"This film is based on a very simple idea: the increasingly varied the sounds, the greater is the number of creatures... My intention in this film was to fill the screen with chaotic movements.\n\n(Source: Mirai Mizue)","img":"https://cdn.myanimelist.net/images/anime/10/51649.webp"},{"title":"Balloon","synopsis":"A short animation by Yutaro Kubo.","img":"https://cdn.myanimelist.net/images/anime/11/75303.webp"},{"title":"Futon","synopsis":"A futon, a traditional Japanese mattress, as seen by Yoriko Mizushiri, becomes the vehicle of dream fantasies combining the most pleasant sensations such as the morning coffee, the warmth of bedding and a soft rice carpet under one’s feet. Lazy stretching serves as a start of sensuous, sleepy gymnastics. With a fluid movement, the passive body will turn once again from the left to the right of the mattress to dive into the fantasies of even deeper unconsciousness a little while later.\n\n(Source: Krakow Film Festival)","img":"https://cdn.myanimelist.net/images/anime/11/69469.webp"},{"title":"Natsu no Gero wa Fuyu no Sakana","synopsis":"Music video by Sawako Kabuki.","img":"https://cdn.myanimelist.net/images/anime/9/79872.webp"},{"title":"Isu","synopsis":"What would you do if you were in a room with nothing to do for 15 minutes? This stop-motion animation depicts what people from different occupations would do with that time. ","img":"https://cdn.myanimelist.net/images/anime/12/70441.webp"},{"title":"Count Down","synopsis":"A promotional video of the exhibition 'ArtPath 2011' by Tokyo University of the Arts Musical Creativity and the Environment. The excitement before ArtPath starts.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/6/71852.webp"},{"title":"Kuchao","synopsis":"The primary schoolboy \"Kuchao\" is hated person in his class. Even if everyone fly balloons, only he doesn't part with his it. When he immediately begins to chew a bubble gum, he enter the imagination world after school. When his balloon becomes the face and begins to chew a bubble gum, it changes into various things. His imagination makes rapid progress more. Then, the bird approaches while flying and...\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/2/71833.webp"},{"title":"Shunga","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/3/58131.webp"},{"title":"Fashion","synopsis":"Experimental anime from animation pioneer Yoji Kuri from 1960.","img":"https://cdn.myanimelist.net/images/anime/13/71293.webp"},{"title":"Animation!","synopsis":"A collection of short animations, from the revelations Tomoyoshi Joko and Hiroco Ichinose.\n\nBy Tomoyoshi Joko\nAFRO - 2006 (1:30)\nMr. Cloud and Mr. Rain - 2007 (6:35)\nBuildings - 2008 (5:44)\nLizard Planet - 2009 (5:00)\nKanagawa Dog - 2009 (00:20)\n\nBy Hiroco Ichinose\nannihilation - 2005 (00:12)\nThe last breakfast - 2006 (2:28)\nUshi Nichi (Cow's Day) - 2007 (9:29)\nha-P - 2008 (4:14)\nCOSMIC! (pilot film) - 2009 (3:20)\nYOKOHA-MAMAN -2009 (00:20)\nmorning (pilot film) - 2009 (1:30)\n\nJoint\nBuil-Bun - 2006 (1:30)","img":"https://cdn.myanimelist.net/images/anime/8/19405.webp"},{"title":"Master Blaster","synopsis":"Short film by Kabuki Sawako with music by Sugahara Shinsuke.","img":"https://cdn.myanimelist.net/images/anime/7/76329.webp"},{"title":"Walking Man","synopsis":"Film by Tanaami Keiichi.","img":"https://cdn.myanimelist.net/images/anime/2/73782.webp"},{"title":"Hand Soap","synopsis":"An atmospheric and dark vision of adolescence and family life.","img":"https://cdn.myanimelist.net/images/anime/6/69841.webp"},{"title":"Hustle!! Tokitama-kun","synopsis":"Director's description: \"I want to show you a world that you have never seen.\" I think this is something that all computer graphics producers strive for. What to create?! How do you create it with computer graphics? The skill of drawing does not change that much when performed on a computer instead of paper. This work is a mixture of traditional cel-based animation, 3-D animation and 2-D computer graphics techniques, each with its own history and production standards. My theme for this production was \"The Transformation of Time and Space.\" I used ToonShader and hand drawn animation to achieve the desired effect. I think that I have succeeded in creating a world that you have never seen.\n\n(Source: plaza.bunka.go.jp)","img":"https://cdn.myanimelist.net/images/anime/9/27163.webp"},{"title":"Sougiya to Inu","synopsis":"A horror take on the classic tale of Snow White.","img":"https://cdn.myanimelist.net/images/anime/1249/93896.webp"},{"title":"Kappo","synopsis":"Legs and shoes float across the screen in this short film by Yoriko Mizushiri.","img":"https://cdn.myanimelist.net/images/anime/11/69161.webp"},{"title":"Fantastic Cell","synopsis":"Mirai Mizue's debut animation short film.","img":"https://cdn.myanimelist.net/images/anime/13/71614.webp"},{"title":"Tama Gura Abayo: Moki Yumokyu Superdeluxe","synopsis":"Music video by Sawako Kabuki for cover of \"Here, There and Everywhere\" by The Beatles.","img":"https://cdn.myanimelist.net/images/anime/7/76373.webp"},{"title":"Modern","synopsis":"I finished this film in only two months after the completion of Playground. Inspired by optical illusions, like Escher's paintings, I made the film using isometric drawings. my idea was to make a great film using only transformations of rectangular parallelepipeds. I applied the method of geometric animation, a technique used in Metropolis, in this film. Along with \"cell\" animation, I continue making films with the application of this method. Hopefully, I will eventually discover a third alternative method to use in my films.\n\n(Source: Mirai Mizue)","img":"https://cdn.myanimelist.net/images/anime/2/68997.webp"},{"title":"Nouryou Anime: Denkyuu Ika Matsuri","synopsis":"Death is the gateway to birth. The deceased crosses the line to join the kingdom of the dead. He sees there the dance of the sperm and the egg. He is drawn towards the sky. This is the path to the afterlife.\n\n(Source: starandshadow.org.uk)","img":"https://cdn.myanimelist.net/images/anime/13/73673.webp"},{"title":"Arara","synopsis":"Naoko had a fight with her brother over a trivial thing and pushed him away. She knew she was childish but she ran away from home.","img":"https://cdn.myanimelist.net/images/anime/5/86134.webp"},{"title":"Bollogi Iyagi","synopsis":"An award winning surreal stop motion anime from Korea using noodles, about a little Bologee (a so-called convex boy) who was born on the Concave Planet. He desperately wants to get to a another planet called Convex Star.\n\nWhen he finally manages to get there he falls in love with a girl from the Convex Planet. The people living there do not approve......","img":"https://cdn.myanimelist.net/images/anime/2/18010.webp"},{"title":"An Expression","synopsis":"Symbolized an urban man with a triangle figure, a country woman with a circle, and represented the encounter between the two by movement.\n\nDirector Shigenji Ogino tried to naturally color the movie via the kinema color technique. Due to being an early work, the technique isn't smooth. Because of this the film has a photosensitive epileptic seizure warning as there are high frequency flashes of red and green frames for the duration of the entire film. \n\nPlease be careful while viewing.","img":"https://cdn.myanimelist.net/images/anime/7/85264.webp"},{"title":"A Play","synopsis":"Music Video for the group ALT, made by Satoshi Murai.","img":"https://cdn.myanimelist.net/images/anime/5/71786.webp"},{"title":"Timbre A to Z","synopsis":"A series of short films where Mirai Mizuki uploaded one abstract representation of a letter of the alphabet every day for 26 days.","img":"https://cdn.myanimelist.net/images/anime/3/70209.webp"},{"title":"Visions of Frank: Short Films by Japan's Most Audacious Animators","synopsis":"A series of 9 animated shorts based on the Frank comics by Jim Woodring, featuring computer/CGI, traditional cel, stop-motion, and even sand painting techniques.  Contributing animators and musicians include COCOA, Eri Yoshimura, Naomi Nagata, TAMAPRO/DROP, Taruto Fuyama, Masaki Maito, Kanako Kawagushi, Masaya Sakaue, Bill Frisell, Dame Darcy, and Woodring himself.","img":"https://cdn.myanimelist.net/images/anime/4/24754.webp"},{"title":"Yume","synopsis":"A visualization of how dreams mush up unrelated events together to make up a single story.","img":"https://cdn.myanimelist.net/images/anime/4/71818.webp"},{"title":"Hakubutsushi","synopsis":"Short film by Yamamura Kouji.","img":"https://cdn.myanimelist.net/images/anime/11/76685.webp"},{"title":"Tensai Banpaku Opening","synopsis":"Opening animation for Tensai Banpaku Genius Expo directed by Mirai Mizue.","img":"https://cdn.myanimelist.net/images/anime/3/70193.webp"},{"title":"Tentoumushi no Otomurai","synopsis":"The story of the animation begins from a girl, named Eiko, mistakenly killing two ladybirds. From this incident, the girl's guilt swells up to create an illusion of seeing a button of her blouse as ladybirds, and fears for a feeling towards an existence of numerous selves in some other places. Being submerged in such continuous wave of guilt and fear, she keeps sewing hundreds of buttons to inside of her skirt.\n\n(Source: Official Website)","img":"https://cdn.myanimelist.net/images/anime/2/35173.webp"},{"title":"Calligraffiti","synopsis":"Short animation directed by an illustrator and picture book writer Furukawa Taku.","img":"https://cdn.myanimelist.net/images/anime/4/60691.webp"},{"title":"Spacy","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/2/75693.webp"},{"title":"Hana no Hi","synopsis":"A haptic animation with comfortable noses.\n\n(Source: Official site)","img":"https://cdn.myanimelist.net/images/anime/9/87253.webp"},{"title":"Sayokyoku","synopsis":"Short film by Yamamura Kouji.","img":"https://cdn.myanimelist.net/images/anime/5/76492.webp"},{"title":"Embah","synopsis":"Girl who watches something in glass. Young person who looks into in from the outside to house. Bear that held fishbowl. \n\n(Source: Taro Shinkai)","img":"https://cdn.myanimelist.net/images/anime/9/71871.webp"},{"title":"Playground","synopsis":"Another experimental film by Mirai Mizue.","img":"https://cdn.myanimelist.net/images/anime/7/71618.webp"},{"title":"\"Parade\" de Satie","synopsis":"A Parade for three managers and four performers. \n\n(Source: Yamamura Animation)","img":"https://cdn.myanimelist.net/images/anime/1714/102585.webp"},{"title":"Thunder","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/8/75699.webp"},{"title":"Kairaku no Sono","synopsis":"A study for the relation between movements and music. \n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/2/71847.webp"},{"title":"Recorder","synopsis":"Short animation by Ryu Kato.","img":"https://cdn.myanimelist.net/images/anime/5/71617.webp"},{"title":"Comics","synopsis":"Furukawa Taku film.","img":"https://cdn.myanimelist.net/images/anime/13/72721.webp"},{"title":"Goldfish Fetish","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/9/58117.webp"},{"title":"Abstract feat. Alkama","synopsis":"Abstract stop-motion short film using \"lightning doodles\" by Tochka.","img":"https://cdn.myanimelist.net/images/anime/8/87400.webp"},{"title":"L'Œil du cyclone","synopsis":"Masanobu Hiraoka's 2015 non-narrative animated short.","img":"https://cdn.myanimelist.net/images/anime/8/81958.webp"},{"title":"Moving Colors","synopsis":"An animated short film produced by past students of Taku Furukawa based on colors.","img":"https://cdn.myanimelist.net/images/anime/4/80537.webp"},{"title":"Ghost","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/11/75698.webp"},{"title":"Itte.","synopsis":"Music video directed by Ootori for Yorushika's song Itte. It is the third track from their first mini-album \"Natsukusa ga Jama wo Suru.\"","img":"https://cdn.myanimelist.net/images/anime/1123/99552.webp"},{"title":"Fue","synopsis":"Based on a poem by Sakutaro Hagiwara. A child and an adult have different troubles.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/6/71811.webp"},{"title":"Akai Kutsu! Onnanoko!","synopsis":"A short animation film by Taku Furukawa.","img":"https://cdn.myanimelist.net/images/anime/2/72929.webp"},{"title":"Kangaeru Renshuu","synopsis":"The description of Suwami Nogami's minimalistic line drawing piece, Imagination Practice, calls it an unending \"thought loop\". It depicts an artist sitting in front of a window with a self-portrait, like a miniature mirror image, on the desk in front of him. The window frame and the blue sky filled with moving clouds are in colour, but the figure of the artist is not coloured in. The soundtrack sounds like a skipping record that is punctuated by humourous springing noises (a la Bugs Bunny) as the image 'bounces' in an unending loop from the establishing shot into the \"drawing.\" A philosophical piece, Imagination Practice considers the circular dialogue between an artist and his work.\n\n(Source: Midnight Eye)","img":"https://cdn.myanimelist.net/images/anime/7/59757.webp"},{"title":"Grim","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/7/75689.webp"},{"title":"Aya Hito Shiki to Iu na no Ishi Hata","synopsis":"Short animation by Taro Shinkai.\n","img":"https://cdn.myanimelist.net/images/anime/11/71876.webp"},{"title":"Chirico","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/6/75035.webp"},{"title":"A Smart Experiment","synopsis":"Bonus short included on the \"Atsushi Wada Works 2002-2010\" DVD.","img":"https://cdn.myanimelist.net/images/anime/10/72286.webp"},{"title":"Akuma no Kairozu","synopsis":"Film by Takashi Ito.","img":"https://cdn.myanimelist.net/images/anime/7/75688.webp"},{"title":"Hizumu Realism","synopsis":"A music video for \"Hizumu Realism,\" a song by A Crow is White.","img":"https://cdn.myanimelist.net/images/anime/11/78577.webp"},{"title":"A Log Day of Timbre","synopsis":"A special follow up version of Mizue Mirai's Timbre A-Z.","img":"https://cdn.myanimelist.net/images/anime/1214/96645.webp"},{"title":"Yasashii Fue, Tori, Ishi","synopsis":"A lot of wrong may happen, but no problem. A whistle, a bird, a stone, a human, they are gentle.\n\n(Sorce: Official website)","img":"https://cdn.myanimelist.net/images/anime/2/71809.webp"},{"title":"Color Noise","synopsis":"Short animation by Yutaro Kubo.","img":"https://cdn.myanimelist.net/images/anime/12/80057.webp"},{"title":"Usalullaby","synopsis":"Increasing in its number, small rabbits take care of a great dolphin. Can the dolphin get to sleep by rabbits' gentle caress? May many people have good sleep and sweet dreams tonight even in the world with whining sounds and wriggle of yin and yang.\n\n(Source: Official Site)","img":"https://cdn.myanimelist.net/images/anime/4/78344.webp"},{"title":"The Place Where We Were","synopsis":"A couple are seen at home. The woman says a heartfelt prayer while the man looks up from his newspaper, holding a cup of tea. They both look out of the window. In the sky above their house a giant angel is flying past. A forest has grown on the angel's back. In the forest three creatures sit around a table and playing cards. The cards are laid out and feature different images: three cards depicting babies jump down a hole in the middle of the table and begin a journey through the body of the angel. They stop in a cave where a creature plays the harp for them and turns the cards into tears. The tears fly through the air out of the angel's eyes and one of them reaches the woman's womb. In the next scene she is seen sitting at home, with her cat, contentedly stroking her own pregnant belly. The next scene is an exterior: a field with a lone tree growing on it. The man is dancing and walking towards the tree: behind the tree he finds his partner, the woman, holding a baby. They all smile at each other.\n\n\n(Source: Tommaso Corvi-Mora)","img":"https://cdn.myanimelist.net/images/anime/2/19068.webp"},{"title":"Alice in Voodooland","synopsis":"Music video by Kousuke Sugimoto for the title track Alice In Voodooland by RoughSketch and featuring Aikapin.","img":"https://cdn.myanimelist.net/images/anime/1416/97880.webp"},{"title":"Een","synopsis":"Short film by Sawako Kabuki","img":"https://cdn.myanimelist.net/images/anime/1806/96616.webp"},{"title":"Devour Dinner","synopsis":"Various scenes of predation. ","img":"https://cdn.myanimelist.net/images/anime/7/51511.webp"},{"title":"Hanasu na★","synopsis":"A televised advertisement for Mode Gakuen, a vocational college in Japan located in Tokyo, Osaka, Nagoya, and Paris. They specialize in fashion, styling, graphic design both in techniques as well as business. Every year they make a new student recruitment video with a tag line. For 2018, the video was animated with the tag line Suki na Koto dake wa, Shindemo Hanasu na★.","img":"https://cdn.myanimelist.net/images/anime/1290/92085.webp"},{"title":"Schoolyard","synopsis":"Space Shower TV Station ID directed by Kouhei Yoshino, with music by Serph.","img":"https://cdn.myanimelist.net/images/anime/1033/101671.webp"},{"title":"Commercial War","synopsis":"In a mixture of cut-out and hand-drawn animation techniques, Tanaami jumbles together symbols of American consumer culture –such as Coca Cola, Superman, Space Age astronauts and hamburgers– with occasional Japanese iconography, such as the squat toilet. The frenetic pace of the animation, the catchphrases and songs on the soundtrack as well as the hand-drawn CRT television monitor that occasionally frames the images makes reference to television commercials.\n\n(Source: Collaborative Cataloging Japan)","img":"https://cdn.myanimelist.net/images/anime/11/73824.webp"},{"title":"Neon Genesis Evangelion","synopsis":"In the year 2015, the world stands on the brink of destruction. Humanity's last hope lies in the hands of Nerv, a special agency under the United Nations, and their Evangelions, giant machines capable of defeating the Angels who herald Earth's ruin. Gendou Ikari, head of the organization, seeks compatible pilots who can synchronize with the Evangelions and realize their true potential. Aiding in this defensive endeavor are talented personnel Misato Katsuragi, Head of Tactical Operations, and Ritsuko Akagi, Chief Scientist.\n\nFace to face with his father for the first time in years, 14-year-old Shinji Ikari's average life is irreversibly changed when he is whisked away into the depths of Nerv, and into a harrowing new destiny—he must become the pilot of Evangelion Unit-01 with the fate of mankind on his shoulders.\n\nWritten by Hideaki Anno, Neon Genesis Evangelion is a heroic tale of a young boy who will become a legend. But as this psychological drama unfolds, ancient secrets beneath the big picture begin to bubble to the surface...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/21418.webp"},{"title":"Higurashi no Naku Koro ni","synopsis":"Keiichi Maebara has just moved to the quiet little village of Hinamizawa in the summer of 1983, and quickly becomes inseparable friends with schoolmates Rena Ryuuguu, Mion Sonozaki, Satoko Houjou, and Rika Furude. However, darkness lurks underneath the seemingly idyllic life they lead. \n\nAs the village prepares for its annual festival, Keiichi learns about the local legends surrounding it. To his horror, he discovers that there have been several murders and disappearances in the village in the recent years, and that they all seem to be connected to the festival and the village's patron god, Oyashiro. Keiichi tries to ask his new friends about these incidents, but they are suspiciously silent and refuse to give him the answers he needs. As more and more bizarre events occur, he wonders just what else his friends might be keeping from him, and if he can even trust them at all.\n\nWhen madness and paranoia begin taking root in Keiichi's heart, he will stumble straight into the mysteries at work in Higurashi no Naku Koro ni, a story that is told across multiple arcs.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/19634.webp"},{"title":"FLCL","synopsis":"Naota Nandaba is an ordinary sixth grader living in a city where nothing amazing ever seems to happen. After his brother Tasuku leaves town to play baseball in America, Naota takes it upon himself to look after everything Tasuku left behind—from his top bunk bed to his ex-girlfriend Mamimi Samejima, who hasn't stopped clinging to Naota since Tasuku left. \n\nLittle does Naota know, however, that his mundane existence is on the verge of being changed forever: enter Haruko Haruhara, a Vespa-riding, bass guitar-wielding, pink-haired psychopath whose first encounter with Naota leaves him with tire tracks on his back and a giant horn on his head. Though all he wants is some peace and quiet, when Haruko takes up residence at his parents' home, Naota finds himself dragged into the heart of the greatest battle for supremacy that Earth—and quite possibly the entire universe—has ever seen.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/77356.webp"},{"title":"Neon Genesis Evangelion: The End of Evangelion","synopsis":"With the final Angel vanquished, Nerv has one last enemy left to face—the humans under Seele's command.\n\nLeft in a deep depression nearing the end of the original series, an indecisive Shinji Ikari struggles with the ultimatum presented to him: to completely accept mankind's existence, or renounce humanity's individuality. Meanwhile, at the core of a compromised Nerv, Gendou Ikari and Rei Ayanami approach Lilith in an attempt to realize their own ideals concerning the future of the world.\n\nThe End of Evangelion serves as an alternate ending to the polarizing final episodes of Neon Genesis Evangelion. With the fate of the universe hanging in the balance, the climactic final battle draws near.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/39305.webp"},{"title":"Devilman: Crybaby","synopsis":"Devils cannot take form without a living host. However, if the will of an individual is strong enough, they can overcome the demon and make its power their own, becoming a Devilman.\n\nWeak and unassuming, Akira Fudou has always had a bleeding heart. So when his childhood friend Ryou Asuka asks for his help in uncovering devils, Akira accepts without hesitation. However, to Akira's surprise, the place they go to is Sabbath: an immoral party of debauchery and degeneracy. Amidst bloodshed and death, demons possess the partiers, turning their bodies into grotesque monsters, and begin wreaking havoc. In a reckless attempt to save his best friend, Akira unwittingly merges with the devil Amon and becomes a Devilman, gaining the power to defeat the remaining demons.\n\nThough it grants him great power, this new partnership awakens an insatiable and primeval part of Akira. Having the body of a devil but the same crybaby heart, Akira works alongside Ryou, destroying those that harm humanity and his loved ones.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/89973.webp"},{"title":"Serial Experiments Lain","synopsis":"Lain Iwakura, an awkward and introverted fourteen-year-old, is one of the many girls from her school to receive a disturbing email from her classmate Chisa Yomoda—the very same Chisa who recently committed suicide. Lain has neither the desire nor the experience to handle even basic technology; yet, when the technophobe opens the email, it leads her straight into the Wired, a virtual world of communication networks similar to what we know as the internet. Lain's life is turned upside down as she begins to encounter cryptic mysteries one after another. Strange men called the Men in Black begin to appear wherever she goes, asking her questions and somehow knowing more about her than even she herself knows. With the boundaries between reality and cyberspace rapidly blurring, Lain is plunged into more surreal and bizarre events where identity, consciousness, and perception are concepts that take on new meanings.\n\nWritten by Chiaki J. Konaka, whose other works include Texhnolyze, Serial Experiments Lain is a psychological avant-garde mystery series that follows Lain as she makes crucial choices that will affect both the real world and the Wired. In closing one world and opening another, only Lain will realize the significance of their presence.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1718/91550.webp"},{"title":"Paprika","synopsis":"The world of dreams can be an incredible window into the psyche, showing one's deepest desires, aspirations, and repressed memories. One hopeful tech lab has been developing the \"DC Mini,\" a device with the power to delve into the dreams of others. Atsuko Chiba and Kosaku Tokita have been tirelessly working to develop this technology with the hopes of using it to deeply explore patients' minds and help cure them of their psychological disorders.\n\nHowever, having access to the deepest corners of a person's mind comes with a tremendous responsibility. In the wrong hands, the DC Mini could be used as a form of psychological terrorism and cause mental breakdowns in the minds of targets. When this technology is stolen and people around them start acting strangely, Atsuko and Kosaku know they have a serious problem on their hands. Enlisting the help of Officer Konakawa, who has been receiving this experimental therapy, they search both the real and dream worlds for their mental terrorist.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1929/93629.webp"},{"title":"Perfect Blue","synopsis":"J-pop idol group CHAM! has spent the last two years entertaining its fans. Sadly, all good things must come to an end, and CHAM! must see one of its members, Mima Kirigoe, leave the group to pursue her acting career. While Mima's choice is met with a mixed response, she hopes her fans will continue to support her.\n\nHowever, Mima's life begins to change drastically after her departure from the group. Wanting to shed her pop-idol image, she takes on a role in a crime drama series, and her career as an actress gradually becomes more demanding and taxing for both Mima and her manager, Rumi Hidaka. To add to Mima's growing unease, an obsessed fan who is incapable of accepting that Mima has quit being an innocent idol, begins stalking her; a new anonymous website begins to impersonate her life with intricate detail; and CHAM! also appears to be doing better without her. One by one, each disturbing development drives Mima to become increasingly unhinged and unable to distinguish reality from fantasy.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/79127.webp"},{"title":"Mousou Dairinin","synopsis":"The infamous Shounen Bat (Lil' Slugger) is terrorizing the residents of Musashino City. Flying around on his rollerblades and beating people down with a golden baseball bat, the assailant seems impossible to catch—much less understand. His first victim, the well-known yet timid character designer Tsukiko Sagi, is suspected of orchestrating the attacks. Believed only by her anthropomorphic pink stuffed animal, Maromi, Tsukiko is just one of Shounen Bat's many victims.\n\nAs Shounen Bat continues his relentless assault on the town, detectives Keiichi Ikari and Mitsuhiro Maniwa begin to investigate the identity of the attacker. However, more and more people fall victim to the notorious golden bat, and news of the assailant begins circulating around the town. Paranoia starts to set in as chilling rumors spread amongst adults and children alike.\n\nWill the two detectives be able to unravel the truth behind Shounen Bat, or will the paranoia get to them first?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/10240.webp"},{"title":"Mawaru Penguindrum","synopsis":"For the Takakura family, destiny is an ever-spinning wheel, pointing passionately in their direction with equal tides of joy and sorrow before ticking on to the next wishmaker. With their parents gone, twin brothers Kanba and Shouma live alone with their beloved little sister Himari, whose poor health cannot decline any further.\n\nOn the day Himari is given permission to temporarily leave the hospital, her brothers take her out to the aquarium to celebrate, where the family's supposed fate is brought forth with her sudden collapse. However, when Himari is inexplicably revived by a penguin hat from the aquarium's souvenir shop, the hand of fate continues to tick faithfully forward.\n\nWith her miraculous recovery, though, comes a cost: there is a new entity within her body, whose condition for keeping her fate at bay sends the boys on a wild goose chase for the mysterious \"Penguin Drum.\" In their search, the boys will have to follow the threads of fate leading from their own shocking past and into the lives of other wishmakers vying for the Penguin Drum, all hoping to land upon their chosen destiny.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/30238.webp"},{"title":"Ousama Game The Animation","synopsis":"It can be rough transferring to a new school—even more so if you don't want to make any friends, like Nobuaki Kanazawa. But the reason for his antisocial behavior soon becomes clear when his class receives a text from someone called \"The King.\" Included are instructions for the \"King's Game,\" and all class members must participate. Those who refuse to play, quit halfway, or don't follow an order in the allotted time of 24 hours will receive a deadly punishment.\n\nHaving played the game before and watched as those around him died, Nobuaki tries to warn his clueless classmates. Unfortunately, they only believe him after the King's Game claims its first casualties. Stuck in a horrific situation with no chance of escape, Nobuaki has a choice: put his own survival above those around him, or do what he couldn't before and save his classmates.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/88190.webp"},{"title":"Poputepipikku","synopsis":"Poputepipikku turns absurdist comedy up to eleven with its pop culture references and surreal hilarity. With two bonafide high school girl protagonists—the short and exceptionally quick to anger Popuko, and the tall and unshakably calm Pipimi—they throw genres against the wall and don't wait to see what sticks. Parody is interlaced with drama, action, crudeness, and the show's overarching goal—to become a real anime.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/88816.webp"},{"title":"FLCL Progressive","synopsis":"Hidomi Hibajiri is a dissilusioned young girl who never takes off her headphones. Her whole life consists of going to school, helping out at her mother's cafe, and listening to music. And with nothing else to break the crippling monotony, she keeps her headphones on at all times. That is, until she is run over by a mysterious guitar-wielding woman.\n\nThat same night, a robot barges into Hidomi’s room along with a boy from her class, Ko Ide, and the kids are chased around town together. They're saved by the guitar-wielding woman from before, but now Hidomi's got a horn growing from her forehead? Who knows where these robots are coming from, what kind of vespa woman this weird guitar woman is warning her about, or what this thing on her forehead is, but it doesn't look like Hidomi is going to be able to ignore all this with headphones!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1499/93700.webp"},{"title":"Boogiepop wa Warawanai","synopsis":"Five years ago, a string of grisly murders shook the city to its core and now the rumors have begun once more. Boogiepop... Everyone knows about Boogiepop: meet her one dark night and you are taken. People tell each other the stories and laugh: no one believes that she can possibly exist in this day and age. Still, strange things appear to be going on and the darkness is taking on many forms. Something is out there. Are you safe?\n\n(Source: RightStuf)","img":"https://cdn.myanimelist.net/images/anime/1327/95777.webp"},{"title":"Tenshi no Tamago","synopsis":"In a desolate and dark world full of shadows, lives one little girl who seems to do nothing but collect water in jars and protect a large egg she carries everywhere. A mysterious man enters her life... and they discuss the world around them. \n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/11/63181.webp"},{"title":"Yami Shibai","synopsis":"The mysterious, yellow-masked Storyteller is a man whose true name and origin are both unknown. He appears at dusk where children gather and recites sinister tales based on Japanese urban legends, to which his young audience eerily intakes. However, the Storyteller is no ordinary teller of tales. He incorporates a kamishibai, a traditional paper-scrolling device, to add visuals to his already demented narration.\n\nA series of short horror stories, Yami Shibai begins with a bachelor who, after moving into a new apartment, immediately starts sensing a malevolent glare being pressed into him. A single talisman rests on his ceiling, but he has no way of knowing it is one of the few safeguards that separate him from a bottomless pit of suffering. Each story is more terrifying, more appalling, and more sickening than the last as the Storyteller's audience find themselves being sucked into the vicious world of his words.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/74107.webp"},{"title":"FLCL Alternative","synopsis":"Life seems to drift by for Kana Koumoto and her friends in their small Japanese town. Every day is just like the last, and it feels like every new day will be the same. Kana goes to school, hangs out with her friends, and likes to paint her nails and listen to music, but it feels like nothing special is ever going to happen. \n\nAs a change of pace, Kana and her friends decide to design a bottle rocket and launch it into space, even though it might not get there at all. However, just when the rocket is completed, a robot suddenly crashes into and destroys it, shortly followed by a pink-haired woman claiming to be a \"Galactic Investigator.\" Kana's life quickly becomes more exciting than she ever imagined, dealing with new feelings, changing friends, and even boy troubles. It turns out life can go by in the blink of an eye, fast enough to even miss it, so what's with these weird robots that seem to show up at the worst times?!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1494/93701.webp"},{"title":"Nekojiru-sou","synopsis":"The main character, a cat named Nyatto, embarks upon a journey to save his sister's soul, which was ripped in two when Nyatto tried to save her from Death. She trails after him, brain-dead. They encounter many brilliant, mind-bending situations, beginning with a disturbing magic show.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/84241.webp"},{"title":"Mind Game","synopsis":"After seeing her jump onto a subway at the last second and getting her ankle crushed between the doors, Nishi reconnects with his high school sweetheart, Myon. Nishi is still very much in love with Myon, but is shocked to learn that she is engaged to another man. Nishi agrees to meet Myon's fiancé at her family's Yakitori restaurant, but members of the Yakuza storm the joint and murder Nishi when he tries to stop them from raping Myon.\n\nNishi, now dead, wakes up and meets a constantly shapeshifting god, who mocks him for dying. The god tells Nishi to walk into a portal and disappear from existence, which Nishi rejects, choosing instead to sprint past the god and reanimate. With a new outlook on life and knowledge of how the Yakuza are going to attack him, Nishi kills one of the Yakuza with his own gun, fleeing in a stolen car with Myon and her sister.\n\nAcclaimed director Masaaki Yuasa's debut film, Mind Game's constantly shifting visuals tell a story about living one's life without regrets that is unlike any other.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1722/96276.webp"},{"title":"Shoujo Kakumei Utena: Adolescence Mokushiroku","synopsis":"All eyes are on Utena Tenjou, a mysterious transfer student to Ohtori Academy. But Utena's eyes seem to be fixed on one familiar face that stands out among the rest—Touga Kiryuu, Utena's childhood friend. Touga knows of Utena's past and possesses knowledge of the Mark of the Rose, a set of unique rings worn by those who compete for the hand of the Rose Bride. The Rose Bride, Himemiya Anthy, belongs to whomever wins her in a duel, and the one that wins all the duels is said to be given the power to bring revolution to the world. Utena is drawn into the duels, but Touga and their complicated history together may end up unraveling everything. Nothing is as it seems in this retelling of the original anime series.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/22710.webp"},{"title":"Yami Shibai 2","synopsis":"For the second time, the masked storyteller returns to tell children tales and legends of horror and woe, such as the tale of a ventriloquist's dummy, a locker that grants wishes, a capsule toy machine that returns lost possessions, and a strange food called Ominie-san.\n\nBuilding on the foundation that was laid by the first, Yami Shibai 2 is a collection of Japanese scary stories of the unknown and the occult that are truly terrifying, narrated in a style of art that mimics kamishibai storytelling. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/74108.webp"},{"title":"Nihon Animator Mihonichi","synopsis":"Nihon Animator Mihonichi is a collaborative series of standalone anime shorts with the support of various directors and studios. Aiming to expose new animators to a worldwide audience, these small works offer a glimpse into the future of the industry, featuring rising talents, cutting-edge techniques, and experimental aesthetic designs.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/71901.webp"},{"title":"Panty &amp; Stocking in Sanitarybox","synopsis":"A special short included with the 5th DVD/BD release.","img":"https://cdn.myanimelist.net/images/anime/6/29589.webp"},{"title":"Genius Party","synopsis":"A collection of seven individual and unique shorts which range from touching to downright bizarre. With each story different from the last, we encounter monsters going to school, a man who has a hard time dealing with himself, and a child who learns the hard way about the circle of life, as well as many other unique characters and experiences.\n\nA journey through the minds of the most prolific artists in Japan, this compilation truly is the setting of a Genius Party.\n \n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/20882.webp"},{"title":"Higurashi no Naku Koro ni (2020)","synopsis":"New Higurashi no Naku Koro ni anime project.","img":"https://cdn.myanimelist.net/images/anime/1808/105271.webp"},{"title":"Yami Shibai 3","synopsis":"A young boy silently sketches out the forms of the horrors that dwell in his mind. During this adventure into the occult and mysterious, he tells tales that involve dreams of a person with a muscular arm that you must not look at, a hospital with a room that holds a grim secret, and a visit to an eerily silent taxidermy museum.\n\nThese tales and more are compiled in Yami Shibai 3. Presented in an art style similar to kamishibai storytelling, this horror series stays true to the gruesome and creepy trend that is prominent in Yami Shibai and Yami Shibai 2nd Season.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/78074.webp"},{"title":"Poputepipikku TV Special","synopsis":"Episode 13 and 14 of Poputepipikku. The special has four versions shown on four different broadcasters: Tokyo MX (Blue Dragon ver.), Nico Nico Douga (Vermilion Bird ver.), Abema TV Anilive (White Tiger ver.) and Abema TV Pop Team Epic Channel (Black Tortoise ver.). Each version has a unique combination of seiyuus.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1091/100387.webp"},{"title":"Kanashimi no Belladonna","synopsis":"The beautiful Jeanne marries a man named Jean, and the happy newlyweds make their way to the Lord's castle with a cow's worth of money for his blessings. However, the demonic Lord is unmoved by their offering, ignoring their desperate, impoverished pleas. The Lord's wife offers an alternative: Jeanne must become the Lord's conquest for the night in a ritual deflowering.\n\nScarred by the experience, the shaken Jeanne receives no sympathy from her husband. Instead, she is neglected. But as Jeanne drifts off to sleep, she is met by a strange spirit that encourages her to deliver retribution to those who wronged her. And with a mysterious surge of pleasure and an unquenching libido, Jeanne agrees.\n\nKanashimi no Belladonna is a captivating, psychosexual adventure that tells a story of cunning witchcraft and deceitful superstition in a poor, rural village of medieval France.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/24740.webp"},{"title":"Yami Shibai 4","synopsis":"Excited children gather around the enigmatic masked Storyteller once more. His unique kamishibai storytelling draws them into tales of fear and dread. These are dark and foreboding stories, which could happen to anyone...\n \nThis season has tales of a salaryman who buries a dead cat, only to be haunted soon after; a college student and her cheap new apartment that hides a ghastly secret; boys exploring an abandoned haunted house before coming across a strange fish tank; a man who finds himself on the wrong bus, and in more danger than he thought possible; and a young couple's visit to an amusement park, which suddenly takes a dark turn. All these stories and more await in Yami Shibai 4.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/83113.webp"},{"title":"Inaka Isha","synopsis":"A hapless country doctor describes with breathless urgency a night-time summons to attend a young patient. Events soon take on a surreal aspect as \"unearthly horses\" transport him instantaneously to the bedside. The doctor, preoccupied with personal distractions and grievances against those he is employed to care for, fails to find what is revealed to be a vile, fatal wound. He is humiliated by the villagers, who are \"always expecting the impossible from the doctor,\" and doomed to an endless return trip, losing everything. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/5344.webp"},{"title":"Genius Party Beyond","synopsis":"Containing shorts that couldn't be included in the original, Genius Party Beyond weaves stories that are both deep and insightful: the idea all life is relative in size, the consequences of an oppressive government, and how to deal with your darker desires, among others.\n\nFrom the directors and artists of works such as Samurai Champloo, Neon Genesis Evangelion, and Akira, come a multitude of thought-provoking tales, to create a collection equalling the original in storytelling genius.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/18914.webp"},{"title":"Yami Shibai 5","synopsis":"The mysterious masked Storyteller returns to tell more twisted tales of horror. Continuing his particular style of kamishibai inspired storytelling, he now finds that his audience is an eerie crowd of young girls, who eagerly await his devilish stories.\n\nHe recounts ghostly legends involving girls of all ages: a housewife who receives a barrage of chilling phone calls; a strange girl whose flower readings are always right; a mother and daughter's ominous meeting with the \"crow lady\"; and a young girl whose demands from others grow more and more outrageous with each request. Witness once again the Storyteller's haunting and gripping tales, which are sure to leave one with more than just chills...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/86158.webp"},{"title":"Kaze no Na wa Amnesia","synopsis":"Two years ago, a mysterious wind swept over the Earth without warning, taking everyone's memories with it. Not knowing their names or even how to speak, cars crashed, planes dropped from the sky, and society crumbled in an instant. One young man happens to wander into a military testing facility, where he meets Johnny, a young boy who underwent experimental memory enhancement treatment and could, therefore, still remember who he was. Johnny names the young man Wataru and teaches him everything that he can before his frail body fails him.\n\nWataru sets out on a journey to see if he can find other people like him, and in San Francisco, he meets a mysterious silver-haired woman named Sophia, who refuses to speak about her past. Sophia says that she is heading to New York, and decides to travel together with Wataru. As the pair make their way across America, they learn about what has happened to the rest of society, and what the essence of humanity really is.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1/1793.webp"},{"title":"Uzumaki","synopsis":"In the town of Kurouzu-cho, Kirie Goshima lives a fairly normal life with her family. As she walks to the train station one day to meet her boyfriend, Shuuichi Saito, she sees his father staring at a snail shell in an alley. Thinking nothing of it, she mentions the incident to Shuuichi, who says that his father has been acting weird lately. Shuuichi reveals his rising desire to leave the town with Kirie, saying that the town is infected with spirals.\n\nBut his father's obsession with the shape soon proves deadly, beginning a chain of horrific and unexplainable events that causes the residents of Kurouzu-cho to spiral into madness.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1432/105265.webp"},{"title":"AD Police","synopsis":"The year is 2027 in MegaTokyo, six years before the Knight Sabers will make their debut. Boomers (artificial humans) are still a relatively new advancement, and the implementation and integration of boomers into society is still a bit buggy -- sometimes fatally so. Whenever a boomer incident occurs, though, there is the Advanced Police, a special force trained to deal with boomer crimes.\n\nLeon McNichol is a rookie in the AD Police, and is just starting to become exposed to the horrors and tragedies one finds every day in MegaTokyo. He and his veteran partner, Gina Marceau, slowly learn about the ever-fading line that separates man from machine. ","img":"https://cdn.myanimelist.net/images/anime/13/2851.webp"},{"title":"Yami Shibai 6","synopsis":"Late at night, in a clearing within a dark fog-filled forest, there sits a kamishibai storyboard. A visitor approaches, and suddenly, the fog recedes. A shape begins to take form beside the board—this figure is the masked Storyteller, who once again starts to spin tales of horror and despair.\n\nThe events described in these macabre tales might happen to anyone, even your neighbors or friends: a group of girls bully one of their members in a cave, only to find themselves the victims of a dark presence; a boy with scopophobia moves to the countryside, but he still cannot escape the eyes of others; a man has a window that won't stay closed, and is the recipient of strange phone calls; and a salaryman steals an umbrella on a rainy day, but this seemingly insignificant act leads to consequences he never expected. Visitors may enjoy the Storyteller's offerings, but they should also be vigilant so that they don't wind up as the subjects of his next story.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1911/95045.webp"},{"title":"Tsukuyomi: Moon Phase Special","synopsis":"Omake Special from the final DVD volume. The Special storyline has very little to do with the original series outside of having some of the same characters, and has a completely different storyline which does not fit into anything which came before it.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/8/3433.webp"},{"title":"Utsu Musume Sayuri","synopsis":"Sayuri is a curious creature who lives on her husband with her equally surreal mother and father. With an antenna-like whip protruding from her head, she is a striking daughter, and her long-awaited time to strike has come. Her family and friends watch eagerly as Sayuri carries out this bizarre ceremony.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/37519.webp"},{"title":"Yami Shibai 7","synopsis":"A rusted door opens to a decrepit apartment filled with darkness. Inside, the masked Storyteller waits to spin more twisted tales of horror, inviting all to listen.\n\nIn one story, a woman is tormented by her past sins; in another, a man visits a chilling art exhibit, where things quickly go awry when he ignores the warnings regarding taking photographs. That is not all, though—an unsuspecting woman hears strange noises from her veranda, but when her boyfriend investigates, he receives the shock of his life; a lady receives a frantic call from her sister, who begs her to come to a phone booth, but when she arrives, she realizes that things are not as they appear; and a man looks for one of his belongings in his little sister's room, only to soon discover that a malevolent presence lives there. The Storyteller is all too eager to share these tales, which will no doubt shock and terrify his audience.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1795/101063.webp"},{"title":"Koroshiya 1 The Animation: Episode 0","synopsis":"A masochistic mobster meets his match in the dark streets of Tokyo. His nemesis, Ichi, is a psychopathic killer with an unrelenting thirst for bloodshed. A horrifying secret burns in his mind, and his hands deal death without mercy. At last, the shrouds of mystery are parted to reveal the origin of the monster. The city will know its greatest fear at the unveiling of Ichi the Killer. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/34131.webp"},{"title":"Nami","synopsis":"A woman is enjoying herself in bed until a swarm of fish bursts out from all over her house to disturb her leisure time. Will she decide to resist, or let them crawl inside her and take control?\n \n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/71841.webp"},{"title":"Kikumana","synopsis":"This work \"Kikumana\" is an animation of a girl called Kikumana who acts like in a stage performance, the role defeated by such an ill circumstance though she tries to find herself. The primal aim is to get the audience feeling a strange atmosphere spread from this work. The image has a pictorial atmosphere and a documentary touch at the same time. Unrealistic phenomena take place there.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/7/79930.webp"},{"title":"Acchi Kocchi","synopsis":"One of Yoji Kuri's short films.","img":"https://cdn.myanimelist.net/images/anime/1031/104174.webp"},{"title":"Atama Yama","synopsis":"After a stingy man eats some cherry seeds, a cherry tree grows on his head and he gets into a lot of trouble. \n","img":"https://cdn.myanimelist.net/images/anime/8/18494.webp"},{"title":"00:08","synopsis":"A man enjoys a drink over and over and over again, for eight seconds each time. It's the same every time... or at least that's what it seems like at first. With every sip, something changes, making things a little more intriguing each time.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/69727.webp"},{"title":"Tamala 2010: A Punk Cat in Space","synopsis":"It's the year 2010 on the planet of cats, where lies Meguro City, a megalopolis entirely controlled by the super-corporation Catty &amp; Co. The nefarious influence of this corporate empire extends malignantly across the feline galaxy. Tamala, a carefree, one-year-old kitten, decides to flee this cruel reality and boards her spaceship in search of her planet of origin. \n\n(Source: IMDb)","img":"https://cdn.myanimelist.net/images/anime/11/15876.webp"},{"title":"Agitated Screams of Maggots","synopsis":"\"Agitated Screams of Maggots\" was directed by Keita Kurosaka and released in 2006 with the single, \"Agitated Screams of Maggots\", made by Japanese rock band, DIR EN GREY. ASOM has a traditional drawing design with erotic and grotesque aspects. The video had also received some attention from it's art style and was shown at the International Film Festival Rotterdam in 2007.","img":"https://cdn.myanimelist.net/images/anime/13/25059.webp"},{"title":"Popee the Performer","synopsis":"Popee the Performer deals with a circus that operates in the middle of the desert. Each episode deals with the small cast of characters attempting at times to rehearse their performances, but it usually dissolves into the characters trying to humorously destroy each other in the usual cartoon manner.\n\nThe star of the show, Popee, is a clown in an odd red-striped jumpsuit and bunny ears. He is adept at juggling, being a clown, pulling large knives and small bombs out of thin air. He is not adept at ever succeeding in his nefarious plans to hurt his poor assistant or the owner of the circus. His mischievous nature is the driving force of each episode.\n\n(Source: animefringe.com)","img":"https://cdn.myanimelist.net/images/anime/8/15014.webp"},{"title":"Noisy Birth","synopsis":"A music video from Yoshiura Yasuhiro, done in year 2000. Music is done by Shibata Yuki.","img":"https://cdn.myanimelist.net/images/anime/10/10299.webp"},{"title":"Extra","synopsis":"Animation veteran and Studio 4°C collaborator Koji Morimoto teamed up with techo artist Ken Ishii for this AMV.\n\n\"EXTRA\" is a random cross talk about computer, music, images, and Internet by two authors working on their first collaboration in techno music and animation. This short animation which is stored on CD-ROM and immediately shakes the viewer with question as to what the word of the title, \"EXTRA,\" means.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/71738.webp"},{"title":"Kago Shintarou Anime Sakuhin Shuu","synopsis":"In these jokey short films, many of them crudely animated, Kago's sick sense of humor reaches its full heights of absurdity. There's a playful surrealist sensibility to Kago's work, as well as a tendency to revel in the ridiculous, the crude and the disturbing. His work straddles a weird boundary between avant-garde experimentation and low-brow fart jokes—the punchline of one of these films is literally an oozing torrent of shit—although, admittedly, his videos seem to lean a bit more heavily towards the fart jokes than his comics. But hey, who doesn't appreciate a good fart joke once in a while?\n\n(Source: Only the Cinema blog)","img":"https://cdn.myanimelist.net/images/anime/10/27656.webp"},{"title":"Connected","synopsis":"Music video by Ayumi Hamasaki, created by Studio 4°C.","img":"https://cdn.myanimelist.net/images/anime/9/5898.webp"},{"title":"Airy Me","synopsis":"A test subject is administered daily medication by a nurse in a ward where mysterious medical experiments take place. One day, when the nurse presses the switch of the test subject, it successfully transforms into a chimera. When the test subject continues to hold human desires to take on non-human forms, what spectacle will arise as a result? And what effect will this have on the subject's relationship with the nurse?\n\n(Source: Japan Media Arts Festival)","img":"https://cdn.myanimelist.net/images/anime/7/78635.webp"},{"title":"Bacterial Contamination","synopsis":"\"Kill yourself.\"\n\nAll it takes are those words to become the next victim. Ignore, slandered, and outcast, she has nowhere to turn. As their cruelty infects her, she begins to lose sight of herself. Her pain just won't go away, and as it consumes her whole being, she feels the only way to cleanse herself is to contaminate another.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/13/55475.webp"},{"title":"Ryokunohara Meikyuu","synopsis":"Hiroki and Kanata have been together since they were children. One day Hiroki is caught up in an accident while trying to save a little girl. The next thing he knows, he is looking down on his own body. Seperated from his body, Kanata, and everything else, he tries to figure out just what is going on.\n\nWhy is he outside his body which is living on as if nothing has changed, how can he convince Kanata that he is there, and who is the strange girl, Fhalei, who keeps appearing for him?\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/73807.webp"},{"title":"Tobira wo Akete (1995)","synopsis":"It's bedtime, and Nonoko is about to go to sleep. But the play of light and shadow on those objects on the wall look almost like... a person. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/5028.webp"},{"title":"Survival","synopsis":"Music video by Glay, created by Studio 4°C","img":"https://cdn.myanimelist.net/images/anime/7/5857.webp"},{"title":"Ai","synopsis":"A short experimental anime about a woman desperately in love. Made by Yoji Kuri, a well-known Japanese indie animator.","img":"https://cdn.myanimelist.net/images/anime/13/64699.webp"},{"title":"Seisai","synopsis":"A horrible murder has been committed on the grounds of Nankai Academy. Professor Yuko, one of the school's most popular teachers, died when she was pushed off of the roof of one of the school's buildings. Her death has left her students with feelings of confusion, pain, and above all else... anger. Four of her male students, Masayoshi, Daisuke, Mitsuru and Shinya, are determined to uncover the truth. They soon discover an important clue: Professor Yuko's planner had been marked on the very night she was killed... marked with the names of seven girls. \n\nWith this evidence, the boys begin their investigations... and they'll use any method required in order to find the murderer. Through rape, manipulation and torture, they uncover important details, but piecing the puzzle together won't be easy. And the longer their search draws on, the more they feel themselves being overtaken by their own dark desires... Will they ever find out the truth behind Yuko's death?\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/4213.webp"},{"title":"Ningen Doubutsuen","synopsis":"A story about a human zoo.","img":"https://cdn.myanimelist.net/images/anime/13/16203.webp"},{"title":"Gun x Sword-san","synopsis":"These are a series of 13 omake episodes of Gun x Sword, tied in very loosely to the plot, with the characters as chibi puppets. The main characters are Wendy and her turtle, Kameo, who is the size of a human in this series and is able to talk. All the episodes seem to center around analyzing various events in Gun x Sword and mocking the themes displayed.\n\nThey are included on the DVDs.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/2/11349.webp"},{"title":"Yukidoke","synopsis":"The short film tells the story of a young boy, who as a result of seeing a dog's corpse, becomes interested in the bodies of living things and starts to develop phobias. Before long all manner of things begin to appear grotesque to him. \n\n(Source: Wochi Kochi)","img":"https://cdn.myanimelist.net/images/anime/2/59759.webp"},{"title":"The Chocolate Panic Picture Show","synopsis":"Gainax's first professional production, The Chocolate Panic Picture Show is a wacky musical OVA based on a manga by Fujiwara Kamui, serialised in Monthly Super Action and partly inspired by Jamie Uys's The Gods Must Be Crazy (1980).\n\nFollow Manbo, Chinbo and Chonbo as they are flung into a strange, psychedelic world of madness they don't understand. See them cause chaos through their zany, unpredictable antics in this comical take on cultural imperialism.","img":"https://cdn.myanimelist.net/images/anime/6/81052.webp"},{"title":"X Densha de Ikou","synopsis":"Ishihara Toru is an everyday guy with an on-and-off girlfriend and a position working for a train buff. Things become complicated when a ghostly vehicle dubbed the X Train begins to ride the rails, destroying everything in its path. Somehow, it seems that Toru is connected with the X Train by a strange power, which draws the attention of some very dangerous and power hungry people who would wield it for their own...\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/2022.webp"},{"title":"Sayonara Gokko","synopsis":"Music video for the song Sayonara Gokko by amazarashi.","img":"https://cdn.myanimelist.net/images/anime/1180/99042.webp"},{"title":"Midori-ko","synopsis":"One of the must-see gems making its premiere at our festival, Midori-Ko is adored Japanese animator Kurosaka Keita's whimsically nightmarish vision of 21st-century Tokyo on the brink of apocalypse. Ten years in the making and entirely, single-handedly rendered in colored pencil, Kurosaka's fantastical labor of love is a marvel to behold. Emerging from the staggering detail and craft flooding every frame is the story of a young woman who sets out to engineer a dream-food that can put an end to the world's famine. Synthesizing Frederic Back's subtle, haptic textures with Bill Plympton's frenetic mutations and David Lynch's haunting wormholes, Kurosaka’s work still retains its own singular, luminous potency.\n\n(Source: Los Angeles Animation Festival summary)","img":"https://cdn.myanimelist.net/images/anime/4/73675.webp"},{"title":"Bobunemimimmi Specials","synopsis":"The official website for the Pop Team Epic anime announced on Monday that the series' Bobunemimimmi (Bob Epic Team) segments will be compiled into a standalone Blu-ray Disc release. The release will include all 22 previously released segments by the production team AC-bu, plus two new segments, a \"high speed kamishibai (paper theater) collection\" of the \"Hellshake Yano\" segment, and original stickers.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1409/93656.webp"},{"title":"Alexander Senki Movie","synopsis":"In 356 BC, Alexander the Great arrives in Greece with the ominous destiny that he will become the \"destroyer of the world.\" Inheriting the crown, he becomes king of the Macedonians and starts down a road of conquest with terrific speed. Alexander ultimately confronts his fated nemesis, Darius the Third, in a war with Persia which changes Alexander into the devil he was fated to become, assuring the destruction of all in his path, and possibly himself.\n\n(Source: TBS Global Business)","img":"https://cdn.myanimelist.net/images/anime/1831/95687.webp"},{"title":"Mochibei","synopsis":"Short film by Kurosaka Keita.","img":"https://cdn.myanimelist.net/images/anime/6/76317.webp"},{"title":"Aos","synopsis":"Surrealist explanation of reality. People enclosed in a room.\n","img":"https://cdn.myanimelist.net/images/anime/13/69011.webp"},{"title":"Kiseichuu no Ichiya","synopsis":"Short experimental animation from 1972 by Yoji Kuri.","img":"https://cdn.myanimelist.net/images/anime/3/64693.webp"},{"title":"Born by Myself","synopsis":" A dark surreal film of several creatures metamorphorphing inside a room. A stop motion animation film from the minds of Kobayashi Masahide and Keita Funamoto of The Village of Marchen","img":"https://cdn.myanimelist.net/images/anime/11/23961.webp"},{"title":"2005-nen Uchuu no Tabi","synopsis":"Experimental short film by Michio Mihara.","img":"https://cdn.myanimelist.net/images/anime/7/81170.webp"},{"title":"Gondora","synopsis":"A short anime about a guy living in his own world.","img":"https://cdn.myanimelist.net/images/anime/6/61765.webp"},{"title":"Adventures in Beauty Wonderland","synopsis":"One of Keiichi Tanaami's most recent short movies.","img":"https://cdn.myanimelist.net/images/anime/2/71884.webp"},{"title":"◯","synopsis":"Sawako Kabuki hand-drawn animation.","img":"https://cdn.myanimelist.net/images/anime/3/76372.webp"},{"title":"Crazy for It","synopsis":"Yutaro Kubo's graduation film.","img":"https://cdn.myanimelist.net/images/anime/8/71832.webp"},{"title":"3-tsu no Kumo","synopsis":"Plot Synopsis : Trilogy about clouds, that is, an omnibus movie consisting of three different stories of clouds. It is based on a charcoal drawing. The clouds without the fixed form are the worlds which surround us. \n\n1 \"Breathing Cloud\" 3min 10sec\nPeople’s body and soul transform into big a cloud, and are mixed with erotic shapes. \n\n2 \"Looking At A Cloud.\" 5min 45sec\nSomething happens at the junior high school. When a boy starts to draw a cloud, that drawing begin to move and eat the students... \n\n3 \"From The Cloud\" 3min 50sec\nA funny little story about people living on the soft cloud. A look at their daily life, in the morning, they listen to the bell and begin to go down the sky.\n","img":"https://cdn.myanimelist.net/images/anime/10/18948.webp"},{"title":"Alice in Dreamland","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/8/77671.webp"},{"title":"Wonder (Movie)","synopsis":"The 365 days animation consists of sequence of 8760 pictures, all different shape and color, hand-drawn by the director every day in 365 days. This is the ultimate analog approach by the abstract animated film creator in digital era. \n\n(Source: IMDb)","img":"https://cdn.myanimelist.net/images/anime/13/67977.webp"},{"title":"Fetish Doll","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/12/73762.webp"},{"title":"Tokyo Loop","synopsis":"A series of 16 \"short stories\" created by the creator's group Images Forum. The stories are:\n\nTokyo Strut (Sato Masahiko, Ueta Mio)\nTokyo Trip (Tanaami Keiichi)\nFishing Vine (Seike Mika)\nYuki-chan (Oyama Kei)\nDog &amp; Bone (Shiriagari Kotobuki)\nPublic Convenience (Tabaimo)\nTOKYO (Uda Atsuko)\nBlack Fish (Aihara Nobuhiro)\nUnbalance (Ito Takashi)\nTokyo Girl (Shimao Maho)\nManipulated Man (Wada Atsushi)\nNuance (Murata Tomoyasu)\nHashimoto (Furukawa Taku)\nFunkorogashi (Kuri Yoji)\nFig (Yamamura Koji)\n12 O’Clock (Iwai Toshio)","img":"https://cdn.myanimelist.net/images/anime/8/24467.webp"},{"title":"The Embryo Develops into a Fetus","synopsis":"Short animation by Mirai Mizue.","img":"https://cdn.myanimelist.net/images/anime/6/71906.webp"},{"title":"Nido to Mezamenu Komori Uta","synopsis":"An animated film describing the bullying of a Japanese child.","img":"https://cdn.myanimelist.net/images/anime/1952/94891.webp"},{"title":"Aki no Puzzle","synopsis":"A short 6-minute movie, containing flashing lights with images and drawings presented to the viewer.","img":"https://cdn.myanimelist.net/images/anime/10/73763.webp"},{"title":"Heya","synopsis":"Short experimental film from 1967 from animator Yoji Kuri.","img":"https://cdn.myanimelist.net/images/anime/6/16392.webp"},{"title":"Usagi ga Kowai","synopsis":"Tetsuji Kurashige's nightmarish U-SA-GUI (2002) begins by citing a section from Brillat-Savarin's 1825 treatise, The Physiology of Taste, in which the renowned French epicure suggests that stimulating foods, meats in particular, can have an influence on one's dreams. The film depicts a macabre game played by two rabbits and a blindfolded woman. The rabbits face each other over an old-fashioned illustrated board game. When they land on a square, the woman must eat the food indicated in the illustration. If she has chosen correctly, a die pops out of her mouth and lands on the floor giving the rabbits their next move.\n\n(Source: Midnight Eye)","img":"https://cdn.myanimelist.net/images/anime/7/59765.webp"},{"title":"Calm","synopsis":"Short animation by Ryu Kato.","img":"https://cdn.myanimelist.net/images/anime/12/71616.webp"},{"title":"Baka Baka Baka na Sekai","synopsis":"An absurd film by Kuri Youji.","img":"https://cdn.myanimelist.net/images/anime/9/71551.webp"},{"title":"Shinsatsushitsu","synopsis":"In Kei Oyama's grim Consultation Room, a medical diagnosis triggers a wave of traumatic fantasies, portrayed in greyish pencil drawings that waver as if left out for too long in the rain.\n\n(Source: Sydney Morning Herald)","img":"https://cdn.myanimelist.net/images/anime/6/59761.webp"},{"title":"Yoru no Okite","synopsis":"\"Yoru no Okite\" takes us to the sky (or to hell) to accompany the delirium of a man who is assassinated. A different take on a spirit who is adrift after being murdered. This restless spirit takes us on a surreal journey through death, the after life, and back to the land of the living again.\n","img":"https://cdn.myanimelist.net/images/anime/9/18950.webp"},{"title":"Watashi no Kao","synopsis":"Abstract horror short film about a girl's face.","img":"https://cdn.myanimelist.net/images/anime/13/69661.webp"},{"title":"Rinkaku","synopsis":"Following the release of their 8th album \"DUM SPIRO SPERO,\" Japanese rock band Dir en Grey went into hiatus following a vigorous touring schedule in Japan and abroad, a year and a half later returning with their single \"RINKAKU\" released on December 19th, 2012.  Once again animator Keita Kurosaka was enlisted to create a hand drawn music video, that in many regards is much less shocking and grotesque than the band's previous collaboration with Kurosaka, the infamous \"Agitated Screams of Maggots\" music video. ","img":"https://cdn.myanimelist.net/images/anime/12/50283.webp"},{"title":"DušaN","synopsis":"An independent animated music video for the song \"DušaN\" by the Slovakian band Saténové ruky. Kousuke Sugimoto created it for a friend who is in the band.  The video is about the protagonist's soul that just won't stop \"talking\" when he's coked.","img":"https://cdn.myanimelist.net/images/anime/5/79270.webp"},{"title":"Shui Naodai","synopsis":"In this story, the kids are constantly forced to bury themselves into their endless homework by those giant monsters behind them. The children's brains are filled with water that can be heated by tension. If a kid is overstressed, the water in their brain would boil and produce steam, which becomes the food of the greedy monsters and the energy of the whole city. Thus, those poor children repeat their lives day after day, serving as the powerplant of their world, spending their childhood in tragic misery...","img":"https://cdn.myanimelist.net/images/anime/7/15886.webp"},{"title":"The Bathroom","synopsis":"A surrealistic short from minimalist cartoonist Kuri Yoji.","img":"https://cdn.myanimelist.net/images/anime/9/27375.webp"},{"title":"Scrap Diary","synopsis":"An abstract work by Keichii Tanaami.","img":"https://cdn.myanimelist.net/images/anime/3/88365.webp"},{"title":"Shigeru","synopsis":"Short animation by Sawako Kabuki.","img":"https://cdn.myanimelist.net/images/anime/13/76371.webp"},{"title":"Picotopia","synopsis":"RIKEN's (The Incorporated Administrative Agency Rikagaku Kenkyusho) promotional video with animation by Mirai Mizue and music by twoth.","img":"https://cdn.myanimelist.net/images/anime/6/56913.webp"},{"title":"Suisei","synopsis":"The stream of a mil, an apple flows down through the stream, where innumerable illusion of fish appears and disappears in the sky reflected in the water.\n\n(Source: Yamamura Animation)","img":"https://cdn.myanimelist.net/images/anime/7/17156.webp"}]