[{"title":"Tales of Crestoria","synopsis":"The Bandai Namco concept movies for Tales of Crestoria. It is promoting the new mobile RPG game. While part of the \"Tales of...\" franchise, the game will feature original characters and story, to act as an entrance into the franchise for new fans who have no yet partaken in any of the anime/manga/video games of the franchise. The main theme of the work is \"sin\" and follows people who are living for their precious things while being chased by those who want to convict them for their sins.\n\nThere is no word yet as to when the game will be released.","img":"https://cdn.myanimelist.net/images/anime/1898/94634.webp"},{"title":"Hikaru no Go: Memories","synopsis":"Recap of Hikaru no Go included in the \"Special Character DVD ~Memories~\" disc. ","img":"https://cdn.myanimelist.net/images/anime/1264/99114.webp"},{"title":"Super Real Mahjong: Mahjong Battle Scramble - Konran-teki Sento Mahjong","synopsis":"Sequel of Super Real Mahjong.\n\nMahjong-playing sisters Kasumi, Miki, and Shouko are sent to a world where mahjong tiles are currency. In order to return to their world, they must defeat a mahjong-playing rabbit who rules the land.","img":"https://cdn.myanimelist.net/images/anime/11/47861.webp"},{"title":"Möbius Dust","synopsis":"On February 29, 2000, the Möbius meteorites fell on Earth. These meteorites brought a new form of matter known as Möbius Dust to Earth. The dust permeated Earth's atmosphere, leading to a miracle. The day the meteorites fell, nicknamed \"2.29,\" accelerated the economic disparity in Japan.\n\nBefore long, the Bloody War Alliance, discontent with this disparity, began committing acts of terrorism. Amidst all this, the police established the anti-RC special mobile unit and a joint anti-RC training school for the initial training of the unit members.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1787/99629.webp"},{"title":"Guilty Gear X","synopsis":"Animated promotional trailer for the Guilty Gear X, a game for PlayStation 2 and PC. Included in Guilty Gear X2's extras.","img":"https://cdn.myanimelist.net/images/anime/1352/92760.webp"},{"title":"Choubakuretsu Ijigen Menko Battle: Gigant Shooter Tsukasa","synopsis":"The anime follows Tsukasa, whose dream is to become the best at Gigant Shooter (battles in a game similar to pog) in the world. The menko card his father left for him called King Menger is his partner. Tsukasa's fellow gamers are the cute but tsundere Koide Miruko, the spectacled bully Numata Manabu, and the realist and sharp-tongued Doumoto Ataru.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/60675.webp"},{"title":"Dragon Quest X: Boukensha-tachi no Kiseki","synopsis":"The anime celebrates the Dragon Quest X online game's fifth anniversary by animating player-submitted \"miraculous stories\" related to the game. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/88312.webp"},{"title":"Treasure Gaust","synopsis":"Based on the game for the DS.","img":"https://cdn.myanimelist.net/images/anime/3/53535.webp"},{"title":"Neko no Nyagh: Nya Misérables","synopsis":"TV adaptation of Cocone Corporation's mobile puzzle game app.\n\nDiscover the adventures of the cat painter, Vincent van Meowogh who lives in a mansion in Paris surrounded by his quirky friends. Let's give him a spark of inspiration for his painting by completing puzzle stages, buy back the furniture and restore his home to its former glory!\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1714/97643.webp"},{"title":"Haitoku Pistols no Kinkyuu Kaigi?","synopsis":"In commemoration of the live appearance of the Haitoku Pistols at the XFLAG PARK 2017 held at Makuhari Messe International Exhibition Hall, a pseudo sequel to Mon-Soni!: Senritsu no Lucifer, Tada Hitotsu no Hajimari no Uta was created and posted to Monster Strike's official YouTube channel. The Haitoku Pistols meet at the cafe and talk about the event after looking at flyer of it. ","img":"https://cdn.myanimelist.net/images/anime/1497/99579.webp"},{"title":"Chikasugi Idol Akae-chan","synopsis":"Based on the upcoming \"Underground Princess\" idol role playing game for mobile devices.","img":"https://cdn.myanimelist.net/images/anime/2/59173.webp"},{"title":"WIXOSS","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1181/106738.webp"},{"title":"Kouchuu Ouja Mushiking: Greatest Champion e no Michi","synopsis":"The ultimate Beetle Battle unreels!\n\nThe King of Beetles, Mushiking is a beetle battle game of the 21st Century that is causing a whirlpool of sensational excitement among children. Its popularity has transcended the world of arcade games! The total number of cards issued has exceeded 420 million. Mushiking is not only one of the most popular in arcade games, but is also creating a buzz in various fields such as game boy advance, TV animations. and etc.\n\nKent Mirai is a passionate youth. His dream is to become the greatest Mushiking champion in the world. He is spending his time beetle battling with the King of Beetles, Mushiking everyday. One day, a mysterious boy named Shiro Mizorogi appears before Kent. This boy is so strong that the beetle battlers are ruthlessly defeated one after the other. The beetle that Shiro manipulates is a beetle that has never been seen before, called Dark Side Neptune Beetle. It is enveloped with an evil aura and its eyes glow eerily red. Shiro acquires the power of the dark side through Dr. Black, who stops at nothing in order to win the mushiking battle! The blazing battle between Kent and the King of Beetles, Mushiking vs. Dark Side and Neptune Beetle is launched!!\n\n(Source: Official Site)","img":"https://cdn.myanimelist.net/images/anime/7/46677.webp"},{"title":"Ekimemo!","synopsis":"The game centers around players traveling to different train stations in Japan and collecting the anthropomorphized representations of different stations and railway lines. The anime is set in Yokote City in Akita Prefecture, and will center around the characters Miroku, Mero, and Runa.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1712/90354.webp"},{"title":"IRoid: Koi no Yuukou Frontier","synopsis":"Commercial animated by Studio SHAFT for the dating sim app, IRoid.","img":"https://cdn.myanimelist.net/images/anime/3/88278.webp"},{"title":"Sword of Phantasia","synopsis":"An animated promotional/opening video for the iOS/Android game Sword of Phantasia.","img":"https://cdn.myanimelist.net/images/anime/11/84319.webp"},{"title":"Idol Fantasy","synopsis":"An animated promotional video for Square Enix's mobile game Idol Fantasy. Within the game you the female manager Aoi Nishizono, and your job is to raise male idols to stardom in a heart-throbbing setting.","img":"https://cdn.myanimelist.net/images/anime/1026/95307.webp"},{"title":"Wei Qi Shao Nian 2","synopsis":"Jiang Liu Er has fortified his skills as a Go player over the years. He now must make the long journey to become a grandmaster.","img":"https://cdn.myanimelist.net/images/anime/2/52917.webp"},{"title":"#Compass","synopsis":"NHN PlayArt and Nico Nico's #Compass [COMbat Providence AnalysiS System] smartphone game has been inspiring a series shorts in which TMS Entertainment is overseeing the production, but different staff members and studios are participating in the project. Each short highlights a different hero from the game. The shorts are posted to #Compass's official YouTube channel.\n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/1392/95935.webp"},{"title":"Hero Hero-kun","synopsis":"It's a comedy about children in elementary school.\n","img":"https://cdn.myanimelist.net/images/anime/10/31023.webp"},{"title":"Sawatte! Gudetama: 3-dome no Shoujiki","synopsis":"Advertisements for the Gudetama tap app Sawatte! Gudetama: 3-dome no Shoujiki. The videos are aired on television and streamed on Sanrio's official YouTube channel and typically have a gaming theme.\n\n","img":"https://cdn.myanimelist.net/images/anime/1868/96006.webp"},{"title":"Turning Mecard W","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/8/85660.webp"},{"title":"Wonder Gravity: Pino To Juuryoku Tsukai","synopsis":"Sega has released the opening movie for Wonder Gravity: Pino To Juuryoku Tsukai on its official YouTube channel for its upcoming smartphone adventure RPG from developer f4samurai. The game is scheduled to be released sometime later this year.\n\nThe opening movie features the theme song \"Splash!!!\" by Japanese rock band Mrs. Green Apple, which was made specifically for the game and is featured on their third album, \"Ensemble.\"\n\n(Source: Gematsu)","img":"https://cdn.myanimelist.net/images/anime/1257/91957.webp"},{"title":"Quiz Tokiko-san","synopsis":"Tokiko-san got the job of making quizzes/brain-teasers/riddles for Chuukyou Television Broadcasting (a real TV station that airs the anime the fictional character works for). In particular: matchstick puzzles. The show focuses on her trying to make puzzles as well as her early life, family, personality that lead to her profession—particularly her compulsiveness for organization.","img":"https://cdn.myanimelist.net/images/anime/1313/91294.webp"},{"title":"Turning Mecard W Season 2","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/3/85661.webp"},{"title":"Chao Shen Youxi","synopsis":"Three young friends skipped class and went to an Internet Cafe to play games but were caught by a female class monitor. One returns home, but the other two choose to purchase a mysterious game CD from the sexy female shopkeeper. When they start playing, they suddenly get transported to the game world.","img":"https://cdn.myanimelist.net/images/anime/10/81495.webp"},{"title":"Kick-Flight","synopsis":"A promotional video for the smartphone game Kick-Flight featuring the song \"Flyers\" by KANA-BOON.","img":"https://cdn.myanimelist.net/images/anime/1747/102917.webp"},{"title":"Break Go!Ga!","synopsis":"The new Break Go!Ga! toy line for boys is about combining the love of construction vehicles with battle bots, creating a customizable brawl of heavy duty equipment. Bandai is kicking off the toys' debut with a three-minute animated commercial demonstrating, albeit with some enhanced for animation abilities, the appeal of creating the best bot and crushing your opponent. The anime ad shows Red Cyclone and Slash Panzer's attacks.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/89474.webp"},{"title":"Yahabe","synopsis":"Yosuke Kamogawa had nothing to live for, but a mysterious pyramid appears called Yahabe! With the power to turn back time, how will Yosuke's life change?\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/4/81153.webp"},{"title":"Ryuu ga Gotoku Online x Taka no Tsume","synopsis":"A collaboration between Eagle Talon and the mobile game Ryuu ga Gotoku Online. It is a spin-off title of what is commonly known as the Yakuza game series in the Western world.\n\nIn the first episode, The Eagle Talon cast somehow find themselves within the game's world and run into Ichiban Kasuga. They explaining who they are and promoting the game's release. Even Ichiban himself knows he's in a game and promotes the mobile release (supposedly, Ichiban plays his own mobile game).\n\nIn the second episode, Ichiban Kasuga comes to visit The Eagle Talon cast in their world. He gives them some tips on how to look aggressive to take over the world. But their yakuza appearance draws yakuza to them, in which they then both promote the game as both world's yakuza are fans of the mobile game.","img":"https://cdn.myanimelist.net/images/anime/1821/96234.webp"},{"title":"Tobidase!! Buddy-kun","synopsis":"Parody shorts of Future Card Buddyfight DDD released only on CoroCoro Comic's official YouTube channel. Similar shorts are shown before each episode of Future Card Buddyfight DDD, but those are included in that main anime's entry.","img":"https://cdn.myanimelist.net/images/anime/13/85458.webp"},{"title":"Gekiyaba∞Bokkan!!","synopsis":"Music video directed by Toshitaka Shinoda and Takashi Ohashi for the single Gekiyaba∞Bokkan!! by Moso Calibration. It features a blend of live action, 2D, and 3D animation. The song was featured as the second ending for Time Bokan 24.","img":"https://cdn.myanimelist.net/images/anime/1732/100557.webp"},{"title":"Ponkotsu Quest: Maou to Haken no Mamono-tachi Specials","synopsis":"BD specials of Ponkotsu Quest: Maou to Haken no Mamono-tachi. ","img":"https://cdn.myanimelist.net/images/anime/12/84089.webp"},{"title":"Gonglyong Mecard","synopsis":"Gonglyong Mecard is a spin-off-series of Mecard, based on the idea that dinosaurs didn't become extinct 65 million years ago, but transformed into mecanimals. Its characters don't have any relations to the cast from Turning Mecard, Turning Mecard W and Turning Mecard R.\n\n(Source: Gonglyong Mecard Wikia)","img":"https://cdn.myanimelist.net/images/anime/1868/98715.webp"},{"title":"Mashiro Witch","synopsis":"The 3DCG animated opening for Square Enix's Mashiro Witch RPG mobile game expected to launch in late 2017.","img":"https://cdn.myanimelist.net/images/anime/9/88536.webp"},{"title":"Bakukyuu Renpatsu! Super B-Daman Specials","synopsis":"Two specials during Bakukyuu Renpatsu! Super Bedaman's airing. The first is a story recap that aired between episode 6 and 7. And the second is a \"Best Battle\" highlight reel that aired between episode 10 and 11.","img":"https://cdn.myanimelist.net/images/anime/4/81875.webp"},{"title":"Asobuild Concept Video","synopsis":"Web commercial to promote the grand opening of the entertainment and recreational facility \"ASOBUILD.\" The building is made up of six floors, each with their own theme and unique attractions.","img":"https://cdn.myanimelist.net/images/anime/1543/99700.webp"},{"title":"Circus","synopsis":"A concept movie music video for Super Junior-D&amp;E's single Circus. While the boy band duo is South Korean, the music video was created in Japan for the Japanese release of the single under the Avex Trax record label.","img":"https://cdn.myanimelist.net/images/anime/1939/90811.webp"},{"title":"Huoli Shaonian Wang zhi Chuanqi Zaixian","synopsis":"The 3rd Huoli Shaonian Wang animated season. It follows an entirely new story and new characters unrelated to the previous seasons. The previous seasons metaphorical usage of magic/spirit/chi to visualize yoyo battles has now become literal. The yoyo toys have spirit animals within them and the cast tries to return them to their world before the villains use them for evil purposes.\n\nLeon has an argument with his classmate Gurido for trifle. At the advice of Catherine, Leon and Gurido decide to judge the victory or defeat through yoyo competition. The Daemon Tiger appears when Leon and Gurido begin to fight in the woods. Leon follows Daemon Tiger and work with it. With Daemon Tiger’s help, Leon defeats Gurido.\n\n(Source: Official YouTube channel)\n","img":"https://cdn.myanimelist.net/images/anime/1882/93045.webp"},{"title":"Turning Mecard W: Black Mirror-ui Buhwal","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/4/85663.webp"},{"title":"Naki no Ryuu: Hiryuu no Shou (1991)","synopsis":"An OVA released in 1991. Unlike the previous OVA series, this episode was produced separately by Toshiba.","img":"https://cdn.myanimelist.net/images/anime/11/88606.webp"},{"title":"Tenkyuu no Arculs","synopsis":"The animated opening for Square Enix's Tenkyuu no Arculs RPG mobile game which launched for Android and iOS on July 21, 2016. The game had a short lived run and was terminated on January 11, 2017.","img":"https://cdn.myanimelist.net/images/anime/9/88534.webp"},{"title":"Taka no Tsume-dan Yoshida Presents \"Sengoku Taiga\" no Susume","synopsis":"A collaboration between Eagle Talon and the mobile game Sengoku Taiga. Yoshida is playing the game and suddenly becomes Yukimura while the Chancellor becomes Ieyasu. Yoshida explains the game mechanics and Chancellor is ecstatic that Yoshida's advice for battle tactics help him defeat Deluxe Fighter's character in the game. Yoshida continues to talk about a special event running from April 24, 2019 - May 8, 2019.","img":"https://cdn.myanimelist.net/images/anime/1927/100771.webp"},{"title":"Line Rangers","synopsis":"Line Rangers follows the Line characters as super heroes who battle enemies. The various \"story movies\" of the web anime are meant to promote the Line Rangers RPG game app.","img":"https://cdn.myanimelist.net/images/anime/13/85872.webp"},{"title":"Can You See? I'm Sushi","synopsis":"Music video for the song Can you see? I'm SUSHI by Japanese entertainer Pikotaro (Daimaou Kosaka) that was featured on NHK's Minna no Uta program. It was later released on Pikotaro's official YouTube channel. The animation was done by Creatures, Inc.","img":"https://cdn.myanimelist.net/images/anime/1183/101114.webp"},{"title":"Panpaka Pants x Lala-chan","synopsis":"A three-way collaboration between Lalala Lala-chan, Panpaka Pants, and the Aeon Cinema movie theater company. \n\nThe first is a short promoting good theater etiquette and was screened at all Aeon Cinemas (the same day as the web release). Collaborative goods were sold at 422 Molly Fantasy stores (also owned by the Aeon conglomerate). Molly Fantasy stores had 3 unique collaboration episodes shown on TVs at the store front promoting good gaming etiquette.","img":"https://cdn.myanimelist.net/images/anime/10/89794.webp"},{"title":"Ijigen Gattai Mojibakeru Z","synopsis":"A promotional anime for the Ijigen Gattai Mojibakeru Z toy line from Bandai.","img":"https://cdn.myanimelist.net/images/anime/10/77431.webp"},{"title":"Midori-chan","synopsis":"Various animated videos for Midori-chan, the mascot of Sammy Co.'s pachislot and pachinko games. The videos are web-exclusive releases on Sammy Co.'s official YouTube channel. Midori-chan was launched in 2016 debuting in her \"Nice to meAt you☆\" video. A 'full' version was released the following year but contains very little recycled footage, essentially giving her two significantly different debut videos. \n\nThe main purpose of Midori-chan is to promote the Myslot (マイスロ) app which allows people to register their gaming through their mobile device which uses QR Codes to let players see and archive their gaming statistics. It also allows users to win prizes, be ranked against others, play minigames (in the app), collect trophies, and find fellow pachinko friends.\n\nMidori-chan has also gone on to have her own digital 4-koma manga (2 different ones), LINE stickers, a book, and apparel line.","img":"https://cdn.myanimelist.net/images/anime/1943/92898.webp"},{"title":"Turning Mecard R","synopsis":"Turning Mecard R was announced as a CG-reboot of Turning Mecard. It features the same characters as Turning Mecard and Turning Mecard W.\n\n(Source: Wikia)","img":"https://cdn.myanimelist.net/images/anime/1592/98721.webp"},{"title":"Ni Zhuan Ci Yuan: AI Jue Qi","synopsis":"Shi Jiajie and Xiao Lei, who used the game as a livelihood, accidentally received the entry of the \"Epoch\" game. In order to win a huge prize in the game, Shi Jiajie decided to enter the game. As everyone knows, but it is involved in the inexplicable pursuit, but this is only the prelude to this layer of conspiracy…\n\n(Source: Donghua Info)","img":"https://cdn.myanimelist.net/images/anime/1021/105729.webp"},{"title":"Space Shower Man: Legacy for the Future","synopsis":"Space Shower TV Station ID directed by Densuke28, with sound design by Takahiro Nakajima.","img":"https://cdn.myanimelist.net/images/anime/1170/101684.webp"},{"title":"Turning Mecard W: Vandyne-ui Bimil - Teugbyeolpan","synopsis":"The birth of a powerful mechanic! The Battle of destiny begins again!\n\nDuring peaceful days and friends, Dr. Franklin calls call on Isobel. They must train the new mechanic and take charge of a mission. The mechanics are back and joined by a new, powerful mechanic and are challenged by Vandyne to a sudden battle.\n\n(Source: Hancinema)","img":"https://cdn.myanimelist.net/images/anime/1475/91955.webp"},{"title":"Turning Mecard W: Vandyne-ui Bimil","synopsis":"It follows the fan favorite character Vandyne as his hidden secrets are revealed. Unlike the Turning Mecard R reboot, which exclusively uses 3DCG visuals, this series is like the earlier entries and is animated with 2D and 3D visuals.\n\nThe mini-series is part of a new promotional campaign from Sono Kong. The Korean toy manufacturer will launch four new mechanimals this month at retail.\n\n(Source: toonbarn.com)","img":"https://cdn.myanimelist.net/images/anime/1728/91954.webp"},{"title":"Grand Marche no Meikyuu","synopsis":"The animated opening for Square Enix's Grand Marche no Meikyuu RPG mobile game which launched for Android and iOS on September 8, 2016. ","img":"https://cdn.myanimelist.net/images/anime/9/88537.webp"},{"title":"Battle Spirits: Kakumei no Galette","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1330/105615.webp"},{"title":"Fei Ren Xueyuan","synopsis":"The 3-minute animated promotional short for the Chinese MOBA of the same name.","img":"https://cdn.myanimelist.net/images/anime/1083/98946.webp"},{"title":"Parallel","synopsis":"A short animation by Densuke28.","img":"https://cdn.myanimelist.net/images/anime/1789/96877.webp"},{"title":"Paperman","synopsis":"Within the Paperman game, glimpses of an anime were shown. \n\nSeveral years later after a mobile version of the game was released, a special promotion was created where players can follow a link within the mobile game to take them to a special website where they could purchase a full 6 minute remake of the anime to view.","img":"https://cdn.myanimelist.net/images/anime/4/85635.webp"},{"title":"Bomberman: Yuuki wo Arigatou - Watashi ga Mimi ni Naru","synopsis":"The elementary school student Rieko lives with her parents who are deaf and mute, and her younger sister. Rieko wishes to draw cartoons and comics that make people happy, and doodles comics of Bomberman and friends in her notebooks.\n\nAn earthquake strikes during the night and ravages the city, leaving their neighbourhood a shambles. They travel to a shelter, but their parents' inability to hear and speak causes misunderstandings and conflict among the workers; Rieko helps resolve the situation while also keeping an eye on her younger sister.\n\nWith support from volunteer worker Kyoko, an older girl from Tokyo, the community within the shelter begin to grow and understand one another. Rieko helps keep the younger ones amused with her drawings of Bomberman characters, including a comic of the heroes and villains putting their differences aside to help each other when the battle arena comes down on top of them.\n\nThe film ends with a short public safety video from the Bomberman gang, offering pointers on how to safeguard against damage in your house and how to stay safe if you need to evacuate.\n\nDespite the prominent branding on the marketing materials, the Bomberman content is shockingly minimal. Rieko creates comic strips of Bomberman and friends to entertain her younger sister and children at the shelter, leading into animated vignettes with the cast of Super Bomberman 3; these three segments amount to only three minutes\n\n(Source: randomhoohaas.flyingomelette.com)","img":"https://cdn.myanimelist.net/images/anime/1809/102768.webp"},{"title":"Duel Masters Zero: Tokubetsu-hen - Tamashii Shoukan Special!","synopsis":"The 25th episode of Duel Masters Zero, it acted as a side-story recap episode going over the season's hottest duels.","img":"https://cdn.myanimelist.net/images/anime/1533/105295.webp"},{"title":"Huoli Shaonian Wang 3","synopsis":"Huoli Shaonian Wang is a Chinese multi-media franchise created to sell yoyo toys to children. Huoli Shaonian Wang 3 is the first animated season in the franchise but the 3rd story chronologically.\n\nThe show focuses on competitive schools that hold yo-yo contests. Each team has their own issues that they solve. Each yoyo has a name that reflects the toy's design. The show makes use of minor special effects in order to portray magic/spirit/chi and the speed of the yoyo. These \"magic spells\" are \"battling\" and the person whose \"magic\" remains, wins. \n\n(Source: Wiki)","img":"https://cdn.myanimelist.net/images/anime/1986/105835.webp"},{"title":"Role Playing Soldier","synopsis":"Music video directed by Sou Ootsuki for the song Role Playing Soldier by SKY-HI (Mitsuhiro Hidaka) on his fourth album \"JAPRISON\".","img":"https://cdn.myanimelist.net/images/anime/1614/102713.webp"},{"title":"Kuro Kishi to Shiro no Maou VR Sennyuu! Maoujou-hen","synopsis":"VR anime of mobile RPG Kuro Kishi to Shiro no Maou released via Virtual Gate is an exclusive to \"VR Park Tokyo,\" an amusement center in Japan. Only 4 people can watch it at a time. The viewers must enter a platformed pivot cage and adorn the VR headpiece. The caged area lets the viewer hold onto the bars so they can lean and pivot while watching the VR anime.","img":"https://cdn.myanimelist.net/images/anime/1303/99640.webp"},{"title":"Huoli Shaonian Wang 3: Xuji","synopsis":"A 26-episode second season sequel to Huoli Shaonian Wang 3. It aired 2 years after the original and focuses on the Blazing Team in a global competition against teams of other nations.","img":"https://cdn.myanimelist.net/images/anime/1162/105836.webp"},{"title":"Hana Ichi Monme","synopsis":"A music video adaptation of the classic Japanese children's game. The game is similar to the game Red Rover in the Western world. \n\n(Source: Wiki)","img":"https://cdn.myanimelist.net/images/anime/4/89913.webp"},{"title":"Magical Halloween: Miracle★Quartet","synopsis":"Bundled with the \"Magical Halloween: Miracle Quartet\" pachinko slot machine game CD.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1604/101843.webp"},{"title":"Huoli Shaonian Wang zhi Chuanqi Zaixian: Xuji","synopsis":"The sequel to Huoli Shaonian Wang zhi Chuanqi Zaixian. The main characters have passed through a magical door to the world of the elves. They travel to different countries using their yoyo skills to save this fantasy land.","img":"https://cdn.myanimelist.net/images/anime/1074/95684.webp"},{"title":"Huoli Shaonian Wang zhi You Quan Yingxiong","synopsis":"Another reboot within the Huoli Shaonian Wang franchise again focusing on new characters, new story, unrelated to the previous seasons.\n\nDark energy is growing threatening to ruin the balance of the world. 5 yoyo toys were summoned and 5 teenagers were chosen to master them. They must learn to work as a team to channel the magical spiritual power to push back the dark forces who too have harnessed humans. The magical spiritual power gives them superhero abilities such as flaming armor, the ability of flight, super speed, and water-bending.","img":"https://cdn.myanimelist.net/images/anime/1180/95685.webp"},{"title":"Valhait Rising: Kandou e.","synopsis":"Studio Colorido's promotional video for BANDAI NAMCO Online's mobile RPG VALHAIT RISING.","img":"https://cdn.myanimelist.net/images/anime/1433/106087.webp"},{"title":"Chikasugi Idol Akae-chan Specials","synopsis":"Unaired episodes 13, 14, and 15 included on DVD.","img":"https://cdn.myanimelist.net/images/anime/1815/90194.webp"},{"title":"Chuanyue Huoxian: Youling Jihua","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1699/105730.webp"},{"title":"Shin Tennis no Ouji-sama: Hyoutei vs. Rikkai - Game of Future","synopsis":"The new anime will tell an original story, featuring a match between the Hyoutei Academy Secondary Department led by Keigo Atobe and Rikkai University-Affiliated Middle School led by Seiichi Yukimura. The story was previously not depicted in the manga.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1874/107327.webp"},{"title":"Monster Strike: Zoku Saishuu-banashi - Pandora no Hako","synopsis":"- A strange phenomenon is overtaking the world?! -\n\nAfter defeating the War Gods, Ren and his friends are living the dream. It seems like they've finally managed to regain their normal lives. However, a mysterious girl by the name of Pandora appears, bringing with her a box that must never be opened. An unfortunate incident results in the box opening (of course), setting the world up for some big changes...\n\n(Source: YouTube)","img":"https://cdn.myanimelist.net/images/anime/2/84742.webp"},{"title":"100-man no Inochi no Ue ni Ore wa Tatteiru","synopsis":"Yotsuya Yuusuke along with his classmates Shindou Iu and Hakozaki Kusue have been transported to a strange and unknown world inhabited by mythological creatures. As soon as they arrive, they meet somebody calling himself the Game Master who then grants them a time-limited quest. To aid them in this quest, he also bestows Shindou and Hakozaki with the roles of a Magician and a Warrior while Yotsuya is randomly granted the role of... a Farmer?!\n\nThis is how a hectic life of adventuring began for three students who now have no choice, but to complete random quests for several phases in the fantasy world if they want to stay alive and protect the real world from the demons and monsters they encounter. \n\n(Source: MU)","img":"https://cdn.myanimelist.net/images/anime/1935/106283.webp"},{"title":"Zenonzard The Animation","synopsis":"Hinaria is unemployed, gaming every day. One day she decides to hack the servers belonging to the Beholder Group for some money, and she stumbles across a carefully secured record of two witches, Alice and Rimel. The two women wished to coexist with mankind, and the history they experienced is connected to the modern ZENONZARD.\n\n(Source: Official Site)","img":"https://cdn.myanimelist.net/images/anime/1035/106164.webp"},{"title":"Battle Spirits: Shounen Gekiha Dan","synopsis":"A 12-year-old boy named Dan Bashin is taken to the alternate world of Grand Rolo by two mysterious siblings, Yuuki and Kajitsu Momose. There, he learns that he's one of the chosen core soldiers, bearing the light of the red core. Along with the other soldiers, he must save Grand Rolo from Otherworld King, who has been exploiting the worlds natives. \n\n(Source: Battle-spirits Wikia)","img":"https://cdn.myanimelist.net/images/anime/6/21263.webp"},{"title":"Monster Strike the Movie: Sora no Kanata","synopsis":"13 years ago, suddenly one part of Tokyo broke off and began to float in the sky. Tokyo was separated into \"Old Tokyo\" as the part that was floating in the air, and \"New Tokyo,\" the part that stayed on the ground. Communication and interaction between the two Tokyos was impossible, and years passed. One day, a young girl perceives that Old Tokyo will fall back down to the ground, and she sets out on the perilous path from from Old Tokyo to New Tokyo to save the citizens from the impending crisis.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1206/93873.webp"},{"title":"Oreca Battle","synopsis":"The anime adaptation revolves around a young boy named Faiya Orega who loves Oreca competitions. One day, he is granted the power to summon real Oreca monsters due to the mysterious powers of the treasure chest Pandora. To protect the peace of the Oreca world, Faiya must fight the demon king who threatens the land.\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/1934/101823.webp"},{"title":"Rebirth","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1319/105669.webp"},{"title":"Saki Achiga-hen: Episode of Side-A - Kuro no Tanjoubi","synopsis":"Short original anime bundled with the limited edition Blu-ray Box of Saki Achiga-hen: Episode of Side-A.","img":"https://cdn.myanimelist.net/images/anime/9/72495.webp"},{"title":"Future Card Buddyfight Battsu","synopsis":"The fourth season of Future Card Buddyfight.","img":"https://cdn.myanimelist.net/images/anime/6/84792.webp"},{"title":"Bakugan: Battle Planet","synopsis":"The series follows pre-teens Dan Kouzo, Shun Kazami, Wynton Styles, Lia Venegas, and their dog Lightning. They are known as the \"Awesome Ones\" and make videos on the website ViewTube. Eventually, they stumble across a race of battling biomechanical creatures called Bakugan. They soon befriend the Bakugan and begin to battle each other with them, all while defending their neighborhood from thugs who use the Bakugan for malicious purposes. \n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/1477/100243.webp"},{"title":"Monster Strike: Rain of Memories","synopsis":"- They deserve better. Someone better than me... -\n\nThe stage is set one year before Ren arrives in Kaminohara.\nAkira has moved to Kaminohara from Sendai, all for the sake of revenge.\nThe wounds that his sister suffered in an MS battle fuel his vengeance.\n\nA lost Haruma is given directions by Akira,\nrevealing a caring side to the usually cold and calculating teen.\nHaruma observes Akira's violent MS battles,\nand realizes that Akira fights while reading his enemies' attacks.\n\nHaruma proposes the idea of recruiting Akira to his teammates,\nAoi and Minami. Surprised and naturally reluctant,\nAoi and Minami decide to trust Haruma.\nFor Haruma has resisted recruiting the fourth member of their team,\nsaving the spot for the right person...\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/7/83124.webp"},{"title":"Zero Duel Masters","synopsis":"It is featured in an alternate universe where Shobu had lost his duel against Hakuoh in their duel back in the Season 1 episode \"Just Duel It\".\n\nA mysterious organization is interested in fledgling duelist Shobu Kirifuda's ability to bring Duel Master creatures to life. With the support of his friends, Shobu duels with passion, discipline, and heart as he strives to be like his father and become the next Kaijudo master.\n\n(Source: Duel Masters Wikia)","img":"https://cdn.myanimelist.net/images/anime/8/8469.webp"},{"title":"Lu Shidai 2nd Season","synopsis":"Zhiquiang is a young boy who loves playing League of Legends with his friends. The series follows his crazy adventures.","img":"https://cdn.myanimelist.net/images/anime/3/78125.webp"},{"title":"God Eater Resonant Ops","synopsis":"The opening movie to God Eater Resonant Ops, the iOS/Android game. The animation was streamed on Bandai Namco's official YouTube channel and was promoting the game's release slated for the following month. A second version of the video was posted on April 4, 2018 but contains no change in animation. Only the watermark and the still image at the end were changed.","img":"https://cdn.myanimelist.net/images/anime/1548/95165.webp"},{"title":"Bishoujo Mobage: Mobami-chan","synopsis":"DeNA promotional anime video for its line of mobile game. The mascot character for the line of games is called Mobami (a combination of \"mobile\" and \"beauty.\")\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/70285.webp"},{"title":"Battle Spirits: Sword Eyes","synopsis":"The story is set 14 years after Atlantia, the largest country in the world of Legendia, was torn apart by riots. The protagonist Tsurugi Tatewaki was secreted away from the chaos at a young age. Oblivious to his true birthplace, Tsurugi grows up as a spirited boy in the neighboring rocky land of Pacifis.\n\nOne day, Tsurugi suddenly comes across the \"Shining Sword,\" and his great adventure begin. An army of darkness is hunting down the 12 Sword Braves, and as the army pursues Tsurugi, a figure appears before him. Bringer is a Card Battle Droid entrusted with the duty of protecting Tsurugi. Trained by Bringer in the ways of the Battle Spirits combat, Tsurugi joins the other Sword Braves in rising up against the army of darkness with his Key Spirit \"Shining Dragon.\"","img":"https://cdn.myanimelist.net/images/anime/11/49195.webp"},{"title":"Monsuto Anime: Katsubou no Hate no Risoukyou","synopsis":"Episode 0 of Monsuto Anime. It is the first item in the franchise to be completely animated in CG.\n\nThe big threat is passed, but the gang's still got little threats to handle. The monsters are becoming a part of daily life, but there's one big thing missing: Oragon. One day, a powerful monster appears in the middle of town. It's got Oragon inside!\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/3/84955.webp"},{"title":"Shin Megami Tensei Devil Children","synopsis":"A series based off of the Shin Megami Tensei: Devil Children franchise. ","img":"https://cdn.myanimelist.net/images/anime/1812/96501.webp"},{"title":"Mon-Soni! D'Artagnan no Idol Sengen","synopsis":"When D'Artagnan went to Tokyo for a little fun, she spotted an unforgettable sight: Lucifer singing while basking in moonlight in a park. From that moment, no matter if she was asleep or awake, D'Artagnan's heart would not stop throbbing for some reason.\n\nOne day, D'Artagnan sees a concert by the popular idol act Angely Diva at her friend Izumo's invitation. There, she resolved to follow her idol dreams, and the story of song and miracles begins.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/85906.webp"},{"title":"Arcade Gamer Fubuki Extra","synopsis":"It's time for fun at the beach! Check out all the girls from Arcade Gamer Fubuki in their swimsuits. ","img":"https://cdn.myanimelist.net/images/anime/12/23357.webp"},{"title":"Scan2Go","synopsis":"Sometime in the near future, in an age in which we have established contact and communications with planets outside our galaxy, Scan2Go has become a huge phenomenon throughout all of outer space. Giant races are held at every locality, with each racer gunning for the title of the universe's number one racer!\n\nThe main character in the series, Kazuya, possesses the power of the eagle, performed well with his blazing, innate power commanding his falconine beast spirit. He competes in a tournament, the \"Pro-Racer Exhibition Race.\", but was no match for the other teams that had won their way through the competitive Space Preliminaries.\n\nRealizing the difficult obstacles that lie before them, Kazuya and his friends leave the small Earth behind and set off on a universe-wide quest to hone their skills as warriors!","img":"https://cdn.myanimelist.net/images/anime/1544/100121.webp"},{"title":"Cardfight!! Vanguard: Shinemon-hen","synopsis":"This is the story of \"Shinemon Nitta\", the future manager of Card Capital.\n\n10 years before the reunion of Aichi Sendou and Toshiki Kai, the card shop run by the Tokura family \"Card Capital\" was going out of business. Then came the attempt to take over the store by Esuka Hibino, the owner of a major card shop.\n\nIn order to protect Card Capital, Shinemon Nitta stands up as the \"Self-proclaimed Manager!\"\n\n(Source: Cardfight!! Vanguard Wiki)","img":"https://cdn.myanimelist.net/images/anime/1804/102281.webp"},{"title":"Puzzle &amp; Dragons CM","synopsis":"Studio Colorido has created a short, animated commercial for the GungHo Online Entertainment's popular mobile game, Puzzles &amp; Dragons.\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/2/76708.webp"},{"title":"Master of Epic: The Animation Age","synopsis":"Over millions of years, there have been many ages - war, gods, and future to name a few. Each of these was infinitely less exciting than the current Animation Age! In this RPG-esque existence, becoming stronger is paramount to one's survival and leveling up is a must. From pacifists to news casting, from fishing woes to love advice, there's nothing the Animation Age can't show or teach us about life in a game world! Armed with healing spells, changes of clothes and plenty of summoned familiars, the characters of Master of Epic will do what it takes to level up and live to fight another day!\n\n(Source: Anime-Planet)","img":"https://cdn.myanimelist.net/images/anime/1/1885.webp"},{"title":"Si Ling Bianma: Zhi Shijie Caozong Zhe","synopsis":"“Ghost” is an online mobile game that Ye Yinyi always dreamed of completing, and to that end, has poured his blood and tears into it, even missing a date with his girlfriend. However, he learns about an alarming monster attack on a young woman near his house, a photograph of which shows the monster to bear a resemblance to the monster he designed. Why is the world of his mobile game appearing in real life? ","img":"https://cdn.myanimelist.net/images/anime/11/81331.webp"},{"title":"Cross Fight B-Daman eS","synopsis":"The anime takes place in Crest Land, where the mysterious B-Crystal has started to go berserk. The main protagonist Godai Kamon lives in the south area of Crest Land, and is an energetic boy who loves B-Daman. However, he lost his all past memories of B-Daman and his family, except for his big sister Aona who lives with him. One day, Kamon meets Galvan, a B-Daman at his local B-Daman shop, B-Junk, and he finds Galvan strangely familiar. Galvan becomes his partner, and he returns to the B-Daman battles once again. \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/2/42247.webp"},{"title":"Mini Van","synopsis":"An animated flash series of the manga Mini Vanguard.","img":"https://cdn.myanimelist.net/images/anime/8/76472.webp"},{"title":"Baku Tech! Bakugan Gachi","synopsis":"BakuTech! Bakugan Gachi is the sequel to the BakuTech! Bakugan series.","img":"https://cdn.myanimelist.net/images/anime/7/56743.webp"},{"title":"Battle Spirits: Heroes","synopsis":"Hajime Hinobori, whose parents love him, built a battle system to fulfill his dream of seeing the spirits alive and battle for him. He went on a journey with his friends and joined many tournaments. He entered the Battle Spirits World Competition to test his skills on different card battlers. New cards called Burst are introduced and added to the Battle Spirits franchise.\n\n(Source: Battle-spirits Wikia) ","img":"https://cdn.myanimelist.net/images/anime/3/32193.webp"},{"title":"Watashitachi, Luck Logic-bu! 2","synopsis":"The comedy shorts follow four girls who are members of the Luck Logic Club, whose activity is playing the Luck &amp; Logic card game. ","img":"https://cdn.myanimelist.net/images/anime/5/82951.webp"},{"title":"Akashic Re:cords","synopsis":"The animated opening for Square Enix and Kadokawa Game’s Akashic Re:cords RPG mobile game which launched for Android and iOS on November 10, 2016. The game had a short lived run and was terminated on August 31, 2017.\n\n","img":"https://cdn.myanimelist.net/images/anime/5/88533.webp"},{"title":"Duel Masters Zero","synopsis":"The previous season of 'Zero Duel Masters' was set in an alternate universe, so this season's plot is a continuation of the Duel Masters Charge.\n\nIt follows the aftermath of the duel of Shobu vs. Zakira.\n\n(Source: Duel Masters Wikia)","img":"https://cdn.myanimelist.net/images/anime/3/28926.webp"},{"title":"Susume, Karolina.","synopsis":"Short anime about professional shogi player Karolina Styczyńska.","img":"https://cdn.myanimelist.net/images/anime/1332/91741.webp"},{"title":"Usogui","synopsis":"There are gamblers out there who even bet their lives as ante. But to secure the integrity of these life-threatening gambles, a violent and powerful organization by the name of \"Kagerou\" referees these games as a neutral party. Follow Bak Madarame a.k.a. Usogui (The Lie Eater) as he gambles against maniacal opponents at games—such as Escape the Abandoned Building, Old Maid, and Hangman—to ultimately \"out-gamble\" and control the neutral organization of Kagerou itself. \n\n(Source: MU) ","img":"https://cdn.myanimelist.net/images/anime/9/39507.webp"},{"title":"A New Journey","synopsis":"League of Legends commercial animated by P.A. Works, published on League of Legends YouTube channel.","img":"https://cdn.myanimelist.net/images/anime/1549/98385.webp"},{"title":"Bakukyuu Hit! Crash B-Daman","synopsis":"Hitto Tamaga, an 11-year-old boy, lives in some town in Japan. He is a very unfortunate boy, whose only asset is brightness. He lives only with his father who is a Bedaman researcher, but he left home several months ago, and he's been missing since then. He is living alone in a hut built on a relative’s land. Nobody celebrates his 11th birthday...except his cousin Nana who lives in the same land. One day, Hitto receives a present from the lost father, and he is very grad to know that his father remembers his birthday. It is “Crash Bedaman” that he longed for. After he puts them together to complete Crash Bedaman, he brings it to Bee Park, or a battle field of Beedaman. A battle there shows him a new way he should go.\n\nThere is a message from his father with the present.\n\n“Overcome the difficulties”.\n\nPutting this word in his mind, he beats the enemies one after another with his Bedaman. With the encounter of partners and rivals, the mystery of Bedaman, a shadow organization, and the reason of the missing of his father gradually come to light. Defeating various obstacles in his way, he’s growing up. (Source: AnimeNFO)","img":"https://cdn.myanimelist.net/images/anime/7/18312.webp"},{"title":"Ma Shen","synopsis":"Mahjong holds a major influence over the world. Mahjong masters are highly respected, and these players compete to become the leading player: the Mahjong King! Players from across the world come together to duel one another.","img":"https://cdn.myanimelist.net/images/anime/6/81481.webp"},{"title":"Future Card Shin Buddyfight","synopsis":"The sixth season of Future Card Buddyfight featuring Gao Mikado's son.","img":"https://cdn.myanimelist.net/images/anime/1367/95055.webp"},{"title":"Shin Megami Tensei Devil Children: Light &amp; Dark","synopsis":"A series based off of the Shin Megami Tensei Devil Children: Light &amp; Dark games (known as DemiKids in the U.S.).\n\nThe year is 200X. Jin, Akira and Lena are three child hood friends who like mysterious things. One day in the library, along with the mysterious transfer student Ami, they find the \"Akuma Compendium\". They chanted an incantation in the book and, to their surprise, devils appeared. Ami then told Jin and Akira that they are the Devil Children that will decide the fate of the world. She hands them their Devil Risers. The group then pass through the \"Door of Time\" to the land of Valhalla where they fight an evil ruler known as Imperius who plans on conquering all of the world. The Nakama of Jin is Rand, a Sol Lion, and Akira's is Gale, a Hylon.\n\n(Source: Wikipedia.org)","img":"https://cdn.myanimelist.net/images/anime/5/23110.webp"},{"title":"Taiko no Tatsujin: 15 Shuunenkinen Short Animation","synopsis":"Toshio Suzuki and Studio Ghibli produced the short to commemorate the 15th anniversary of the Taiko no Tatsujin (Taiko: Drum Master) rhythm game series. The short features Taiko no Tatsujin characters Don-chan and Kacchan, as well as an original mouse character. The short will also be broadcast as a TV ad later. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/74714.webp"},{"title":"Saikyou Ginga Ultimate Zero: Battle Spirits","synopsis":"Rei is an adventurer called a \"Card Quester.\" He wishes to collect strong cards scattered throughout space, and battle with his rivals unfold. Soon enough, he will discover what happened to his own past. ","img":"https://cdn.myanimelist.net/images/anime/13/56575.webp"},{"title":"Card Wang: Mix Master","synopsis":"Mix Masters is a Korea-Japan co-produced anime series, also known by the name Mix Master: King of Cards. It is a co-production by Nippon Animation of Japan and Sunwoo Entertainment and KBS of Korea. The story centers on the fantasy and adventure card game, Mix Master, and the transference of this game from a video game to the real world after a scientist's new invention goes terribly wrong. Creatures from the video game called henches run loose upon the real world and it is up to the Mix Master to stop those creatures from causing trouble. All the while, an evil leader from the video game, Prince Brad, causes trouble for them for some nefarious purpose.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/12/20195.webp"},{"title":"3-gatsu no Lion: Ugoku! Nya Shogi","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1694/93396.webp"},{"title":"Usagi ga Kowai","synopsis":"Tetsuji Kurashige's nightmarish U-SA-GUI (2002) begins by citing a section from Brillat-Savarin's 1825 treatise, The Physiology of Taste, in which the renowned French epicure suggests that stimulating foods, meats in particular, can have an influence on one's dreams. The film depicts a macabre game played by two rabbits and a blindfolded woman. The rabbits face each other over an old-fashioned illustrated board game. When they land on a square, the woman must eat the food indicated in the illustration. If she has chosen correctly, a die pops out of her mouth and lands on the floor giving the rabbits their next move.\n\n(Source: Midnight Eye)","img":"https://cdn.myanimelist.net/images/anime/7/59765.webp"},{"title":"Battle Spirits: Sword Eyes Gekitouden","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/7/52985.webp"},{"title":"Shenmue: The Movie","synopsis":"Using scenes from the original SEGA Dreamcast game plus some extra made for the movie, Shenmue: the Movie details the events of the first game. After Ryo's father is murdered and a mysterious mirror taken, Ryo sets himself on a quest for revenge.","img":"https://cdn.myanimelist.net/images/anime/8/8654.webp"},{"title":"Mon-Soni!: Senritsu no Lucifer, Tada Hitotsu no Hajimari no Uta","synopsis":"Golden Week Special episode of Monsuto Anime.\n\n\"Change the world with music? Foolish.\"\n\nLucifer's world stops after her band disbands. Meaningless days pass, until she meets her cousin Satan and his bandmate Ibaraki Douji. They ask her to join their indie band, the \"Wicked Pistols.\" Satan talks about his dream of going major after winning the MONSTERS ROCK competition, only for Lucifer to reject him outright. However, Lucifer's heart begins to thaw after a certain event...\n\n(Source: Official YouTube Channel)","img":"https://cdn.myanimelist.net/images/anime/5/85670.webp"},{"title":"Battle Spirits: Double Drive","synopsis":"Shunta Mogami loves the Battle Spirits game. One day he is transported by a light from a Battle Spirits card to Spirits World, the origin of all Battle Spirits. He meets a girl named Eto, who claims to have summoned him to Spirits World in order to prevent its destruction at the hands of the revived Evil God-King, who once plotted the destruction of Spirits World before being defeated and sealed away. Together with the confident, green-deck-wielding Yoku Albatrosa, who also came from another world, Shunta sets out to find the twelve God-Kings whose power originally sealed the Evil God-King.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/79186.webp"},{"title":"Slime Boukenki: Umi da, Yeah!","synopsis":"A short anime directed by Yuasa Masaaki with Production IG, distributed on VHS as a bonus to a video game magazine subscription.  The main character is a Slime from the Dragon Quest video games.","img":"https://cdn.myanimelist.net/images/anime/9/23851.webp"},{"title":"Future Card Buddyfight Battsu: All-Star Fight","synopsis":"The fifth season of Future Card Buddyfight.","img":"https://cdn.myanimelist.net/images/anime/1924/95069.webp"},{"title":"Lord of Vermilion IV","synopsis":"Animated commercials for Square Enix's 4th installment of the arcade-based fantasy collectible card game. The commercials feature various characters talking to the viewer giving backstory to the game (Tokyo 2030 post-apocalypse world due to bio-terrorism), their particular character cards, and demanding the viewer use their powers to their full ability to take back the world.","img":"https://cdn.myanimelist.net/images/anime/8/87965.webp"},{"title":"Daitai 3-pun de Wakaru .hack History","synopsis":"An animated \"about 3-minutes long\" history on .hack in honor of its 15th anniversary. Haseo and Kite in their chibi forms are here to explain the main story line of the multi-media franchise just in time for new viewers to get the .hack//G.U. Last Recode video game, which is a remaster of .hack//G.U. with a brand new chapter continuing the story, being released in the first week of November.","img":"https://cdn.myanimelist.net/images/anime/12/88542.webp"},{"title":"Bakukyuu Renpatsu!! Super B-Daman","synopsis":"Tamago Tosaka is a fifth-grader who loves nothing more than a B-Daman battle. One day, Ganma Nishibe, a talented bead-warrior, is transferred to Tamago's school. Their B-Daman battles set the stage for this story. Beginning as rivals, the two come together to prepare for the B-Daman championships. The two boys come to trust and help one another as they work toward their shared goal.\n\n(Source: d-rights)","img":"https://cdn.myanimelist.net/images/anime/11/19555.webp"},{"title":"Monster Strike the Movie: Lucifer - Zetsubou no Yoake","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1347/106737.webp"},{"title":"Cinderella Girls Gekijou 3rd Season Specials","synopsis":"Specials included on the BD/DVD of Cinderella Girls Gekijou 3rd Season. ","img":"https://cdn.myanimelist.net/images/anime/1316/93508.webp"},{"title":"Koukyousei Million Arthur","synopsis":"The animated opening for Square Enix's Koukyousei Million Arthur RPG mobile game launched for iOS and Android on October 4, 2018. It is said to be a \"brand new\" Million Arthur story where legends and myths intersect. The plan is for the game to be an action hunting RPG, unlike the previous ones which were mobile RPG card games.","img":"https://cdn.myanimelist.net/images/anime/1501/94814.webp"},{"title":"Super Mario World: Mario to Yoshi no Bouken Land","synopsis":"Super Mario World: Mario to Yoshi no Bouken Land is an interactive anime video based on the game Super Mario World. It is designed for use with Bandai's Terebikko system, which utilizes a telephone-shaped microphone to \"interact\" with the video. It asks the viewer multiple choice questions, such as what will hatch from Yoshi's egg.\n\n(Source: Mario Wiki) ","img":"https://cdn.myanimelist.net/images/anime/12/78065.webp"},{"title":"Live On Cardliver Kakeru","synopsis":"Kakeru is a big fan of the Live On card game, like so many kids his age. However he loses every time he plays, no matter how hard he tries. Things change when one day Kakeru saves a small dog-like creature chased by weird people. The “dog” is in fact a Create Monster and gives Kakeru an unusual Live Change card, which in turn allows Kakeru to protect his newfound friend… And gets him involved in something he did not expect…\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/21028.webp"},{"title":"Monster Strike The Animation Episode 0","synopsis":"Oragon lived a lonely life all by himself, until one day he was pulled into a mysterious new dimension. There he learns that an incredibly powerful enemy will attack in six months, destroying his beloved Monster Strike forever! Now Oragon must gather allies in the Strike World to save Monster Strike!\n\nIt is animated in full CG unlike its predecessor.\n\n(Source: Official YouTube Channel)","img":"https://cdn.myanimelist.net/images/anime/1014/93215.webp"},{"title":"Puzzle &amp; Dragon","synopsis":"The story is set in modern day Japan following the growth of the protagonist Taiga Akashi, an elementary school kid who wants to be a professional gamer someday. \n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/1535/95070.webp"},{"title":"Cardfight!! Vanguard Gaiden: If","synopsis":"The series will explore an alternate universe to the main series, and will focus on Kouji Ibuki, an antagonist in the Cardfight!! Vanguard Movie: Neon Messiah, and Suiko Tatsunagi.\n\n(Source: ANN, edited)","img":"https://cdn.myanimelist.net/images/anime/1992/106795.webp"},{"title":"Mahjong Hishouden: Naki no Ryuu","synopsis":"The protagonist, Ryuu or Crying Dragon, is a mysterious man who often plays games with the gang members. He only wins by \"ron,\" a move in which one needs to wait for the opponent's tile to complete the win.\n\n*\"Ron\" is also called \"naki\" in mahjong, which has the same pronunciation as \"crying\" in Japanese.","img":"https://cdn.myanimelist.net/images/anime/1556/96601.webp"},{"title":"Puso Ni Comi","synopsis":"An anime adaptation of Sega's Phantasy Star Online 2 game's official web manga Puso Ni Comi: Phantasy Star Online 2 Comic. The story follows the lax, less than weighty daily life of the ARKS force members. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1087/97502.webp"},{"title":"Tales of the Rays: Everlasting Destiny","synopsis":"Bandai Namco announced a new short anime titled Tales of the Rays: Everlasting Destiny. The anime will tell a story featuring the \"other side\" of the rescue of Ickx from the second chapter of the game (Mirrage Prison), showing the actions of Stahn and Leon, and will connect to the game's new story \"Fairy's Requiem\" which is the 3rd arc in the game app.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1732/98432.webp"},{"title":"Mini Van 2nd Season","synopsis":"An animated flash series of the manga Mini Vanguard.","img":"https://cdn.myanimelist.net/images/anime/10/75678.webp"},{"title":"Duel Masters Movie 3: Honoo no Kizuna XX","synopsis":"The Darkness Civilization has attacked the Fire Civilization!\n\nShobu, together with Rekuta, goes to the world of Duel Masters to help the Fire Civilization. However, when Shobu arrives, he is shocked to see a badly beaten Storm XX, said to be the Fire Civilization's trump card. At that moment, Rekuta and Reppi Aini, Storm XX's comrade, are captured by Darkness Civilization creatures.\n\nWill Shobu be able to rescue the two, and what will become of the Fire Civilization?\n\n(Source: Duel Masters Wikia)","img":"https://cdn.myanimelist.net/images/anime/2/58229.webp"},{"title":"Shogi Hour","synopsis":"A NHK shogi tournament parody. ''55 AJN Trophy TV Shoji Tournamant'' Mr.Yamada versus Mr.Roboco.","img":"https://cdn.myanimelist.net/images/anime/4/24831.webp"},{"title":"Taiko no Tatsujin","synopsis":"A series of four minute claymation shows. Each episode shows the different antics of the various Taiko no Tatsujin characters.","img":"https://cdn.myanimelist.net/images/anime/12/6534.webp"},{"title":"Hi☆sCoool! SeHa Girls Special","synopsis":"The special episode was bundled with the complete series DVD set and focuses on a school sports festival.","img":"https://cdn.myanimelist.net/images/anime/5/82645.webp"},{"title":"THE iDOLM@STER Cinderella Girls: Starlight Stage - Shinshun! Happy New Year Campaign","synopsis":"A televised New Years commercial promoting the THE iDOLM@STER: Cinderella Girls - Starlight Stage (iOS/Android game) campaign starting the following day where you can receive 10 consecutive gifts in the gacha draw. The commercial opens with the girls listing off the best things to do for New Years.","img":"https://cdn.myanimelist.net/images/anime/3/90095.webp"},{"title":"Mini Van Special","synopsis":"A special episode released with the first DVD volume of Mini Vanguard.","img":"https://cdn.myanimelist.net/images/anime/3/55439.webp"},{"title":"Baku Tech! Bakugan Gachi Special","synopsis":"A web exclusive sequel episode shown on the official Bakugan youtube channel where the Invaders are the last boss.","img":"https://cdn.myanimelist.net/images/anime/9/81066.webp"},{"title":"Kakusansei Million Arthur","synopsis":"The animated opening for Square Enix's Kakusansei Million Arthur RPG mobile card game launched for iOS on April 9, 2012 and for Android on May 24, 2012. The mobile game was terminated on March 30, 2015.","img":"https://cdn.myanimelist.net/images/anime/9/88538.webp"},{"title":"Future Card Buddyfight Recap","synopsis":"Recap episode aired between episodes 23 and 24. ","img":"https://cdn.myanimelist.net/images/anime/10/74396.webp"},{"title":"Dream C Club Pure Songs Clips","synopsis":"A two-volume DVD/CD collection of character songs and music videos of Xbox 360 dating simulation game Dream C Club. The clips recreate the heroines of the game with two-dimensional graphics. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1870/106700.webp"},{"title":"Ys IV: The Dawn of Ys","synopsis":"This was an animated promotional video that Falcom commissioned for Ys IV: The Dawn of Ys game for PC Engine, to shop around to various production houses. This was done in hopes of getting it made into a full-scale animated series/movie/etc., but it never panned out.\n\n(Source: You Tube)","img":"https://cdn.myanimelist.net/images/anime/11/61611.webp"},{"title":"Hortensia Saga","synopsis":"Animated commercials for Sega's Hortensia Saga: Aoi no Kishidan mobile game. ","img":"https://cdn.myanimelist.net/images/anime/3/85276.webp"},{"title":"Cosmic Break","synopsis":"The game is set in the distant future in a parallel dimension called the Cosmic Ark. There is a race of long-dormant, gigantic robots called Arks, which have suddenly awakened to find their galaxy being ruled by the evil Chaos. Since they lay dormant for aeons, the three remaining great Arks of Wisdom, Courage and Strength have been drained of their energy, and now there is only enough energy remaining for one of them to be revived with the power to vanquish the evil Chaos. In order to accomplish this, three different Unions of followers of each of the great Arks have formed, each competing for the revival of their respective Ark and thereby, for the defeat of the Chaos and the fate of the world.\n\nBesides this overarching story, there are several backstories of characters of the game. There is, for example, the background of Crimrose and Ivis, the story of Eihwaz, or the meeting between Eris and Resha among others.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/12/46191.webp"},{"title":"Bakugan: Armored Alliance","synopsis":"Second season of Bakugan: Battle Planet.\n\nThe anime began airing on February 16, 2020 in Canada on Teletoon and on March 1, 2020 in the U.S. on Cartoon Network. Regular streaming began on April 3, 2020 in Japan.","img":"https://cdn.myanimelist.net/images/anime/1234/106364.webp"},{"title":"Pokemon Masters: Trainers Great Gathering Special Animation","synopsis":"Original special animated trailer made to promote the release of the game Pokémon Masters.\n\n(Source: Bulbapedia)","img":"https://cdn.myanimelist.net/images/anime/1283/102133.webp"},{"title":"Kairisei Million Arthur","synopsis":"The animated promotional videos for Square Enix's Kairisei Million Arthur RPG mobile card game launched for iOS and Android on November 19, 2014. It is a sequel to the original game.","img":"https://cdn.myanimelist.net/images/anime/3/88539.webp"},{"title":"Battle Spirits: Saga Brave","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1275/102211.webp"},{"title":"Pachislo Kizoku Gin","synopsis":"Ginya Otonashi is a college dropout who works part-time for a pachislot publishing company while aspiring to become a novelist. One day, Ginya comes across a secret organization and gets pulled into a competition to become #1 in \"Pachi Battle,\" which is all a part of the Slotseum, a pachislot competition.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/62405.webp"},{"title":"Hikaru no Go Recaps","synopsis":"Hikaru no Go recaps included on DVD 10 (Season 2 vol 1) which recaps episode 1-24 and DVD 19 (Season 3 vol 1) which recaps episode 25-52 of the TV series.","img":"https://cdn.myanimelist.net/images/anime/1651/105739.webp"},{"title":"Seupideuwang Beongae","synopsis":"Lightning Khan and a group of elementary school students compete against another team in a game of rollerblades and RC car racing as they plan to attend the National convention.","img":"https://cdn.myanimelist.net/images/anime/13/26097.webp"},{"title":"Rara Maji","synopsis":"The opening animation (and promotional video) to Rara Maji, a school girls' RPG with music, magic, and engaging stories. The game is a co-production between Wright Flyer Studios and A-1 Pictures, the latter also animated the video.\n\n(Source: Official site)","img":"https://cdn.myanimelist.net/images/anime/11/85884.webp"},{"title":"Jinzou Konchuu Kabutoborg VxV","synopsis":"BorgBattles between KabutoBorgs have become popular enough to hold world tournaments. The main character Ryuusei is an enthusiast of these battles. Along with his friends Katsuji and Ken, he continues fighting against new enemies day after day.","img":"https://cdn.myanimelist.net/images/anime/10/46187.webp"},{"title":"Shadowverse","synopsis":"Assorted animated videos for Cygames' Shadowverse digital TCG. Japanese and English versions of these animated features were released on the same day on Cygames' official YouTube channel and at a later date on the Shadowverse's official YouTube channel.","img":"https://cdn.myanimelist.net/images/anime/11/88535.webp"},{"title":"Dia Horizon","synopsis":"The web anime of Dia Horizon; characters are featured as chibis as they break the 4th wall to talk about their own real-life mobile game (which is being released this month). As well as promoting the full length TV anime coming out in a October 2017 as well as the 4-koma manga available now.","img":"https://cdn.myanimelist.net/images/anime/7/87292.webp"},{"title":"Xiang Qi Wang","synopsis":"Features preteens involved in the competition and challenges in the world of Chinese chess.","img":"https://cdn.myanimelist.net/images/anime/3/27196.webp"},{"title":"Wei Qi Shao Nian","synopsis":"A story of young Go players in ancient China. ","img":"https://cdn.myanimelist.net/images/anime/2/27549.webp"},{"title":"Turning Mecard","synopsis":"A Korean/Japanese co-production created by Bakugan and Dragon Ball Super contributor Atsushi Maekawa.\n\nTurning Mecard stars Jason, a grade-schooler who meets a Mecanimal, a transforming minicar from the alternate world of Triforce, named Evan. Jason and Evan are both searching for missing family members, and team up to help each other. Together, they meet more Mecanimals as they battle across dimensions and learn important lessons along the way.\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/7/85659.webp"},{"title":"4 Shuunen Monst? Shiru ka yo!","synopsis":"A 4th Anniversary Monster Strike TV commercial featuring Egashira 2:50 (pronounced Egashira Nijigojuppun), a Japanese comedian. The first commercial in the promotion was originally released with the live actor. It was then fully rotoscoped and released again with some changes as an animated version.","img":"https://cdn.myanimelist.net/images/anime/11/88496.webp"},{"title":"Super Real Mahjong: Kasumi Miki Shouko no Hajimemashite","synopsis":"An anime based on characters from the strip mahjong arcade game \"Super Real Mahjong 2\".","img":"https://cdn.myanimelist.net/images/anime/10/87939.webp"},{"title":"Wishing","synopsis":"Made famous in the Monster Strike anime special Mon-Soni! D'Artagnan no Idol Sengen, the Haitoku Pistols debuted their latest single, a Christmas-themed song titled Wishing on December 1st. A ballad backed by Lucy's powerful vocals, Wishing will be featured as the main theme for the XFLAG original anime Itazura Majo to Nemuranai Machi.\n\nThis official music video demo is entirely in CG as opposed to the main ONA which was 2D animated. The music video starts with all three band members speaking to the viewer before jumping into the demo and then finishing out with the band members speaking again.","img":"https://cdn.myanimelist.net/images/anime/1729/99580.webp"},{"title":"Super Zugan","synopsis":"A story about mahjong.","img":"https://cdn.myanimelist.net/images/anime/4/20073.webp"},{"title":"Chikyuu Bouei Kazoku Special","synopsis":"An alternative episode 11 (or episode 11.5) released on the DVD set of Chikyuu Bouei Kazoku. \n\nThe world's first experience simulation game park \"Amber Crystal\" opened in Chiba Prefecture. Opening day only allows couples inside with a special ticket. Seiko and cameraman Hayakawa, Mamoru and Junko-sensei are there to meet up. While saying \"because it is a game, it's okay to do anything\", Mamoru guards as a knight figure to raise XP to steadily power up. Meanwhile, Seiko who became a mage, realized that this game park is the invasion of the space monster and goes on to approach the final boss of the game.","img":"https://cdn.myanimelist.net/images/anime/11/25229.webp"},{"title":"Game Center Arashi","synopsis":"Arashi Ishino is Japan's \"Space invaders\" champion. He must use his skills to beat others at different video games.","img":"https://cdn.myanimelist.net/images/anime/5/34473.webp"},{"title":"Puso Ni Comi: Okawari","synopsis":"A second season of Puso Ni Comi, once again following the in-game avatars of the cast.","img":"https://cdn.myanimelist.net/images/anime/1466/106923.webp"},{"title":"LayereD Stories Zero","synopsis":"In Shibuya, Tokyo in 2037, LayereD is a platform that uses mixed reality technology to create visualizations of the Internet in the real world. By using special devices, people can have various augmented-reality experiences. Users are able to bring things they imagine into the real world, allowing for a wide variety of self-expression. However, the system does not provide people the freedom it was supposed to, and people actually live in an oppressive society. In the Varna Counter system, harmful creations are eliminated in order to make LayereD \"completely clean and healthy.\" Because users monitor each other to maintain regulations, society becomes rigid and constrained.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/89193.webp"},{"title":".hack//Intermezzo","synopsis":"A virtual multiplayer online role-playing game exists, known as \"The World.\" In \"The World,\" there is an event held in the Dungeon of Nankoflank that Mimiru, a character in the game, undertakes with Bear, another character of the game. Mimiru confesses to Bear that she's not doing the event for the treasures or experiences, but for the memories and experiences of when she had first started playing. The two later meet a certain character named Mimika and together, the three proceed through quests and events as Mimiru learns the meaning of the game.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/66499.webp"},{"title":"Hikaru no Go: Hokuto Hai e no Michi","synopsis":"Hikaru is given a phone call asking him to appear in the Japan/China/Korea Junior's Tournament but he finds out he will have to take place in a preliminary tournament to choose Japan's three contestants. Upon discussing this with Akira, he discovers that Akira has already been chosen for the tournament and will not be taking place in the preliminaries. Hikaru then decides not to visit Akira's Go Salon until he takes his place on the team with Akira. That may be tougher than originally planned, as not only does Hikaru have to battle with old friends for one of two coveted spots, but he may have a new challenger, in a promising player from the Kansai Go Institute. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/78453.webp"},{"title":".hack//G.U. Returner","synopsis":"The characters from previous .hack//G.U. Games and .hack//Roots receive an email from Ovan. He is requesting them to go to Hidden Forbidden Festival where is set up a mysterious summer festival. There they find an AIDA Chim Chim who wishes to peacefully co-exist with the other players of The World. It then transforms into the word \"Returner\", so they assume it to mean that Ovan will return to The World.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/23181.webp"},{"title":"Ingress the Animation","synopsis":"A project was launched where scientists discovered a mysterious substance that can interface directly with the human brain. This substance, called \"Exotic Matter (XM),\" has existed since ancient times, influencing human minds and the progress of humanity. In the wake of this discovery, a battle of powerful nations and corporate giants has been unleashed. Organizations across the globe have embarked on a secret race to exploit XM. It represents both an opportunity and a threat to humanity. Two Factions seeks to control the XM. The Enlightened view XM's power as a gift that enhances human experience and discovery. The Resistance sees XM as a hostile takeover of the human mind, choosing technology as humanity's best path forward. XM, and the mystery behind it lie at the center of this battle for the fate of humanity.\n\n2018—Now, a new struggle is about to unfold in Tokyo and across the globe. Dangerous and powerful forces seeking to exploit the potential of XM will collide. This groundbreaking project will mark the beginning of an epic augmented-reality experience combining the three elements of animation, location-based gaming, and the real world.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1944/93421.webp"},{"title":"Monster Strike","synopsis":"Ren Homura has just moved back to his hometown of Kaminohara, but he isn't able to remember much about the time he spent there other than vague flashbacks. When he retrieves his cell phone which he had sent to a shop for repairs, he finds that a mysterious game titled “Monster Strike” has been installed on it. Unaware of its purpose or how it got there, Ren decides to open it, an action that will change his life forever as he finds himself suddenly attacked by a strange man.\n\nNow trapped on the roof of his school which strangely has been designated as a \"stage,\" Ren is shocked to see the man summon a realistic monster from the game, one that is more than capable of inflicting damage on a human. His only chance of getting out of this situation alive is by summoning the dragon Oragon, who tells Ren that he will crush the opposing monster for him. Unfortunately, it turns out that Oragon is a tiny dragon that is completely useless!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/78835.webp"},{"title":".hack//Gift","synopsis":"As an expression of gratitude for the heroes of both the \".hack//Sign\" and the \".hack\" game series, Helba has prepared a special event for all the characters to find the newly established \"Twilight Hot Springs.\" The characters can get their well deserved rest and relaxation by having a soak in the wonderful hot springs, but there is only one problem—the hot springs are hidden and there have been mysterious player murders. With the only clue being the word “GIFT,\" the race has begun to find the culprit and the location of the hot springs.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/23085.webp"},{"title":"Ani*Kuri15","synopsis":"15 one-minute shorts created by various people from Japan's animation industry. The title of the collection, Ani*Kuri15, is abbreviated from the words \"anime\" and \"creators\".\n\nSeason One\nShinji Kimura (Studio 4°C; Art Director, Steamboy) - title: Attack of Higashimachi Ni Chome/Attack of Higashimachi 2nd Burough\nShōjirō Nishimi (Studio 4°C; Character Designer, Tekkonkinkreet) - Uchujin Raikou Hiroshi no Baai/Invasion from Space - Hiroshi's Case\nAkemi Hayashi (Gainax; Character Designer, Fruits Basket) - Namida no Mukou/From the Other Side of the Tears\nOsamu Kobayashi (Madhouse; Art/Mecha Desgin, Gungrave) - Sancha Blues/The Aromatic Tea Blues\nYasufumi Soejima (Gonzo; 3D/CG Director, Last Exile) - Hyotoko/Blaze Man\n\nSeason Two\nAtsushi Takeuchi (Production I.G; Mecha Design, Ghost in the Shell)\nMamoru Oshii (Production I.G; Director, Ghost in the Shell) - Project Mermaid\nKazuto Nakazawa (Studio 4°C; First Unit Director, Kill Bill Chapter 3: The Origin of O-Ren from Kill Bill: Volume 1) - \"yurururu\" ~Nichijou Hen~\nRanji Murata (Gonzo; Character Design, Blue Submarine No. 6) and Tatsuya Yabuta (Gonzo; Story Design, Final Fantasy VII) - Gyrosopter\nTobira Oda (Original Manga, Danchi Tomō) and Yasuyuki Shimizu (Key Animation, Naruto (movies)) (Studio 4°C)\n\nSeason Three\nMichael Arias (Studio 4°C; Director, Tekkonkinkreet) - Okkakekko\nMakoto Shinkai (Comix Wave Film; Director, The Place Promised in Our Early Days) - Neko no Shuukai/A Gathering of Cats\nShōji Kawamori (Satelight; Director, The Super Dimension Fortress Macross: Do You Remember Love?) - Project Omega\nMahiro Maeda (Gonzo; Director, Gankutsuou: The Count of Monte Cristo) - Onmitsu Hime\nSatoshi Kon (Madhouse; Director, Paprika) - Ohayō/Good Morning","img":"https://cdn.myanimelist.net/images/anime/13/62923.webp"},{"title":"Weiß Survive","synopsis":"Takeshi was just an ordinary guy until a perfectly innocent study session with Michi - the most beautiful girl in the school - ended up with him being mysteriously transported into the strange dimension known as the Weiss Schwarz Battle Space. Once there, a crazy but enthusiastic old man informs him that he is the chosen warrior and must win a succession of card battles to get back home. \n\nThe only problem: he doesn't know how to play! However, with the expert Michi ready to teach him the ins and outs of this bizarre and improbably slapstick card game, Takeshi will learn the ropes and get ready for the card battle of a lifetime. Assuming he survives the training... \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/17261.webp"},{"title":"Cardfight!! Vanguard: Asia Circuit-hen","synopsis":"Aichi and his friends have won the National Tournament and decide to go their own ways until a mysterious boy named Takuto Tatsunagi appears. He reveals that the Royal Paladins, Dark Paladins, and Kagero leaders have been captured, and the only way to free Cray is for the Vanguard fighters to use a new power- Limit Break. Because the Royal Paladins lose the ability to fight, Aichi's deck is changed to be a Gold Paladin deck. Aichi and his friends must now win the Vanguard VF Circuit if they are to learn more about the occurrences on Cray and free their old friends. \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/13/41627.webp"},{"title":"Pokemon Movie 21: Minna no Monogatari","synopsis":"As Satoshi continues his journey to become a Pokémon Master, he travels to Fura City to attend the annual Wind Festival. Pumped up, Satoshi and Pikachu are determined to win the festival's Get Race. Meanwhile, Kagachi, a show-off and a habitual liar, joins the competition at the request of his niece Lily. Having almost no knowledge about Pokémon, he manages to strike a deal with a socially awkward scientist named Torito in exchange for help with his upcoming speech. Following Kagachi's victory, Satoshi meets Risa, an ex-regional track and field champion looking to catch a Pokémon. However, during Torito's speech, Team Rocket strikes and manages to steal a capsule from his lab.\n\nTragedy strikes one after another as the Wind Festival's Sacred Flame disappears! As they set off on a journey to find the culprit, Satoshi and the group meet many people on the way—including Zeraora, the Thunderclap Pokémon who was believed to be dead...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1580/90795.webp"},{"title":".hack//The Movie: Sekai no Mukou ni","synopsis":"In 2024, the computer network prevails throughout daily life. Sora Yuuki is a 14-year-old girl. One day, she is invited to an online game \"The World\". After an accident in the game, the real world begins to deform.","img":"https://cdn.myanimelist.net/images/anime/2/35633.webp"},{"title":"Quanzhi Gaoshou zhi Dianfeng Rongyao","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1960/102480.webp"},{"title":"Closers: Side Blacklambs","synopsis":"After the invading dimensional monsters were beaten back, Seoul was rebuilt. This is the story of Closers in New Seoul.\nMysterious dimensional gates opened all over the planet and unleashed a worldwide invasion of dimensional monsters. No monsters and tactics had any effect on the waves of dimensional monsters pouring out of the dimensional gates. City after city was mercilessly destroyed.\n\nBut the opening of the dimensional gates did not only cause damage and destruction. The psychokinetic power that it awoke also enabled a tiny minority of humans to gain extraordinary psychic powers. With these psychic warriors, governments around the world were able to turn the tide of the war with these monsters. After unspeakable losses, the people of earth at least succeeded in closing the gates. Since they had closed the gates, these psychics began to be called \"CLOSERS,\" and the invasion of the dimensional monsters was named the First Dimensional War.\n\nWith the dimensional monsters vanquished, peace returned to the world, and the cities were rebuilt. Through dedicated research into the dimensional gates and psychokinetic power, humans learned that the gates open when there is a singularity in this mysterious power. However, their understanding of the gates was still incomplete. The CLOSERS who survived the First Dimensional War became part of an organization called UNION. Together, they researched the psychokinetic power in all over the world, working to prevent another dimensional war.\n\nAnd that's when the dimensional gates all over the world started shaking again - as ever stronger outbreed creatures renewed the attack on earth.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/11/78304.webp"},{"title":"Selector Destructed WIXOSS Movie","synopsis":"This movie is a retelling/summary of Selector Infected and Spread, with extra scenes interspersed such as the characters in childhood. Despite mostly being previously used scenes, they were cut and altered to make a high intensity and fast paced story, highlighting the moments of slow silence and reflection. Some changes were made such as the true origin of Tama's name, the significance of Sachi and Rumi, and the relationship between your name and being alone.\n\n(Source: Asenshi)","img":"https://cdn.myanimelist.net/images/anime/3/83118.webp"},{"title":"Cardfight!! Vanguard: Link Joker-hen","synopsis":"A few months have passed since the VF Circuit, and Aichi is now in High School. However Aichi is in a different high school than most of his friends, a high school where the instructors focus on looking towards the future. One day Aichi admits he thinks Cardfight can be a future people can believe in, but in order to prove it Aichi must use his new deck, a deck in which Royal Paladins and Gold Paladins are combined as one force. Slowly but surely Aichi must gain friends through Cardfighting and help his new team win the newly formed high school cardfighting championships.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/44566.webp"},{"title":"Yu☆Gi☆Oh! Duel Monsters: Battle City Special","synopsis":"A special episode of 'Yu-Gi-Oh! Duel Monsters' aired in between episodes 88 and 89. Mainly narrated by Anzu, the special recaps the major events of the Battle City tournament, beginning from the Pharaoh's meeting with Ishizu, and retelling several important duels including Yugi and Seto's tag duel, and Yugi's duels against Jonouchi and Bakura, up to Jonouchi's battle with Rishid on the Battle Ship. The special ends with Anzu wishing the series a happy new year.","img":"https://cdn.myanimelist.net/images/anime/2/11197.webp"},{"title":"Rockman.EXE Axess","synopsis":"Netto's father Yuuichirou Hikari has made a scientific breakthrough by introducing the \"synchro chips\". If an operator and his or her navi are in a special enviroment known as a \"dimensional area\", they can fuse together in the real world via a technique called \"cross fusion\"! Yuuichirou's first test subject, Misaki Gorou, attempts the process and sadly fails. Netto offers to try with Rockman, but his father forbids it. Cross Fusion puts enormous strain on the operator's health, and battling in the real world could mean death. \n\n(Source: Official Site)","img":"https://cdn.myanimelist.net/images/anime/1/2200.webp"},{"title":"Chou Yuu Sekai: Being the Reality","synopsis":"A hot-blooded high school teen, a mysterious female swordsman, and an unpredictable dark emo girl. It's impossible to distinguish between reality and the game world! What kind of conspiracy is awaiting them in this super journey of the world!\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/7/83712.webp"},{"title":"Saki Achiga-hen: Episode of Side-A Specials","synopsis":"The final 4 episodes of Saki: Achiga-hen - Episode of Side-A.","img":"https://cdn.myanimelist.net/images/anime/8/45084.webp"},{"title":"Mudazumo Naki Kaikaku: The Legend of Koizumi","synopsis":"Global political figures such as The Pope, Kim Jong Il, George W. Bush and recent Japanese Prime Ministers play riichi mahjong against each other.","img":"https://cdn.myanimelist.net/images/anime/2/35475.webp"},{"title":"Nazotokine","synopsis":"Tokine Amino works as a secretary for TEN2, an advertising agency. One day while cleaning the conference room, she is surrounded in light and finds she can't leave the room until she solves a puzzle.\n\nIt seems a creature named Hacchin is a being from another dimension called Quizn. He is interested in the intellectual pleasure that happens when someone solves a puzzles or uncovers a mystery. And he has his sight set on Tokine Amino.","img":"https://cdn.myanimelist.net/images/anime/4/81048.webp"},{"title":".hack//Tasogare no Udewa Densetsu: Offline de Aimashou","synopsis":"It's a short story about the characters from .hack// Legend of the Twilight meeting offline. It's more to hear than to see. It shows only backgrounds from the real world with the heads of the charater-game-avatars; but it reveals some interesting real life informations about the characters. ","img":"https://cdn.myanimelist.net/images/anime/2/44554.webp"},{"title":"Cardfight!! Vanguard: Legion Mate-hen","synopsis":"Several days after the mortal battle against Link Joker which embroils the whole world, the world has returned to peace.\n\nBut Kai Toshiki faces a surprising situation. Sendou Aichi, the hero who saved the world from the invasion of Link Joker, has suddenly disappeared. In addition, everyone's memory about Aichi is lost...Almost all hints have been lost, and Kai starts to search Aichi with \"Blaster Blade\" and the deck of Royal Paladin, the only existing hint and the proof of their bonds.\n\nKai is approached by fighters who call themselves \"Quatre Knights\". The four---Gaillard, Neve, Ratie and Sarah---are fighters with world-class power in vanguard fights. They control mysterious power and urge Kai to give up searching Aichi. What is their purpose...!? And what is their relationship with Aichi...!?\n\nKai, with the new power \"Legion\" in his hand, fights to take Aichi back. Now, the war has begun! \n\n(Source: Cardfight!! Vanguard Wikia)","img":"https://cdn.myanimelist.net/images/anime/5/64773.webp"},{"title":"Hi☆sCoool! SeHa Girls","synopsis":"The story of the anime will revolve around Dreamcast, Sega Saturn, and Mega Drive, who have just enrolled in SeHaGaga Academy at Tokyo's Haneda Ōtorii station. They are given an assignment needed to graduate by a suspicious teacher, and to clear this assignment, the girls need to enter the world of Sega games. The girls must try their best to graduate without incident.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/66173.webp"},{"title":"Kakegurui Picture Drama","synopsis":"Picture drama episodes included on the DVD/Blu-ray Volumes of Kakegurui.","img":"https://cdn.myanimelist.net/images/anime/1914/98035.webp"},{"title":"Ryuusei no Rockman","synopsis":"In the year 220X, the world has advanced toward radio-wave technology, and the world is connected through the Wave Road. Meet Subaru Hoshikawa, a fifth-grade student who lost his father in a space accident. Subaru meets an extraterrestrial radio-wave being named War-Rock, descending from a distant FM planet. War-Rock claims to know about Subaru's father, but many alien beings are after War-Rock. The two work together and merge into Rockman, a radio-wave human capable of traversing the Wave Road and battling the radio-wave viruses and FMs that threaten the Earth.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/26600.webp"},{"title":"B-Legend! Battle B-Daman","synopsis":"Upon the creation of marble launching machines known as B-Daman, people started to participate in the competitive sport B-DaBattles. However, B-Daman contain hidden powers which enhance marble shooting that can be misused for combative purposes.\n\nOne night, a certain object residing behind the walls of a restaurant calls upon Yamato Daiwa—a boy raised by cats. Yamato has been having visions of the object which resembles a machine familiar to everyone. Little does he know, hidden behind the walls is not a mere machine, but the fate of the world.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/21634.webp"},{"title":"Cardfight!! Vanguard G","synopsis":"Taking place after a three-year time skip, the series will follow Shindou Kurono, Kiba Shion, and Anjou Tokoha as the new protagonists of G.\n\nKurono uses the never-before-seen clan Gear Chronicle, which brings together the destinies of these three toward an \"impossible future, an impossible self signifying 'Generation.'\"\n\n(Source: vanguardus.blogspot.com, edited)","img":"https://cdn.myanimelist.net/images/anime/4/69867.webp"},{"title":"Yu☆Gi☆Oh!: Sevens","synopsis":"A new television anime series for the 20th anniversary of the anime franchise.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1148/106883.webp"},{"title":"Weiß Survive R","synopsis":"The second season of Weiß Survive.","img":"https://cdn.myanimelist.net/images/anime/7/24032.webp"},{"title":".hack//G.U. Trilogy: Parody Mode","synopsis":"A special bonus Parody Mode added to the extras of the .hack//G.U. Trilogy \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/10/8661.webp"},{"title":"Sword Art Online: Alicization - War of Underworld Recap","synopsis":"Recap of Sword Art Online: Alicization - War of Underworld.","img":"https://cdn.myanimelist.net/images/anime/1946/106255.webp"},{"title":"Fate/kaleid liner Prisma☆Illya: Prisma☆Phantasm","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1304/99488.webp"},{"title":"Hikaru no Go: New Year Special","synopsis":"New year special. Summary recap. This episode should be seen between episodes 12 and 13.","img":"https://cdn.myanimelist.net/images/anime/11/60751.webp"},{"title":"Haikyuu!! Quest Picture Drama","synopsis":"Picture Drama episodes from the special contents DVD bundled with the Haikyuu!! 3DS game.","img":"https://cdn.myanimelist.net/images/anime/1061/98110.webp"},{"title":"Majin Bone","synopsis":"Anime adaptation of Majin Bone, a digital card game project.\n\nMajin, the creator of the Universe, has been resurrected in the present day. Shougo Ryuujin, an ordinary high school student who transforms into the Bone Fighter Dragonbone with the Bone Card in order to save Earth. Together, with the other White Bone warriors take a stand against the Dark Bone, a foe that has appeared from darkness to devastate Earth. However, \"could the true enemy be ourselves?\"\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1490/90396.webp"},{"title":"Sword Art Online Fatal Bullet: The Third Episode","synopsis":"The short follows a boy looking for a girl he met in the Gun Gale Online game. The boy believes they have a connection, but to the girl their connection is part of a fantasy. The time to test whether their bond is real or fantasy will come. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1210/91229.webp"},{"title":"Nakanohito Genome [Jikkyouchuu]: Knots of Memories","synopsis":"An original story included with volume 10 of the Nakanohito Genome [Jikkyouchuu] manga.","img":"https://cdn.myanimelist.net/images/anime/1118/103618.webp"},{"title":"Yu☆Gi☆Oh! 5D's: Shinkasuru Kettou! Stardust vs. Red Demon's","synopsis":"A non-canon Yu☆Gi☆Oh! 5D's special from the 2008 Super Jump Anime Tour. Yuusei Fudou and Jack Atlas face off in a Riding Duel for the title of Duel King, with Aki and the twins watching. The ace dragons, Stardust Dragon and Red Daemon's Dragon, clash once again, and this time gain the power to 'evolve' using the Buster Mode trap card, becoming \"Stardust Dragon/Buster\" and \"Red Demon's Dragon/Buster.\"","img":"https://cdn.myanimelist.net/images/anime/8/10786.webp"},{"title":"Sword Art Online Fatal Bullet: The Third Episode - Pilot-ban","synopsis":"A special movie said to be inspired by the Sword Art Online Fatal Bullet video game. The story takes place during the Gun Gale Online arc.\n\nBandai Namco uploaded the short to their official YouTube channel saying it was a pilot version. They are also having an open audition for the female's voice via Twitter. Users can vote for the girls by retweeting their videos (which can either be through Twitter or a link to YouTube). February 8-19 will be the first selection where the top 3 accounts retweeted are chosen. And February 21-22 will be the final selection of girls where the previous 3 accounts along with 1 account chosen by the producer are judged. ","img":"https://cdn.myanimelist.net/images/anime/1821/90470.webp"},{"title":"Puzzle &amp; Dragons Cross","synopsis":"Dorogoza Island is rich in \"Drop Energy\" that players can use on friendly monsters. Once strong enough, they can face enemies in puzzle wars. Winners reap rewards, but what happens to the losers? Only the brave can take on these monstrous challenges!\n\n(Source: FUNimation)","img":"https://cdn.myanimelist.net/images/anime/5/80793.webp"},{"title":"Rockman.EXE Stream","synopsis":"A comet burns in the sky, its brilliant light shining down upon the people of Earth. At that time, a giant army of viruses invade the real world, crushing everything in their path. Netto and Enzan use cross fusion to intervene, but are whisked away to an unknown location, only to be confronted by the one responsible for the attack - Duo! \n\n(Source: Official Site)","img":"https://cdn.myanimelist.net/images/anime/5/41575.webp"},{"title":".hack//Quantum: Sore ike! Bokura no Chimuchimu-chan!!","synopsis":"DVD specials for .hack//Quantum. Main girls are being very special creatures and take lessons about the anime.","img":"https://cdn.myanimelist.net/images/anime/4/29050.webp"},{"title":"Future Card Buddyfight","synopsis":"An adaptation of the Future Card Buddyfight card game.\n\nFuture Card Buddyfight takes place in a more futuristic version of today. The card game connects to a parallel universe through special cards (Buddy Rare Cards) that act as portals. They bring monsters to Earth in order for them to become buddies with humans. Through friendship and courage, they take on and fight challenges, known as Buddyfights, where people of all ages have friendly non-hurtful competitions. The main character, Gaou Mikado has just started Buddyfighting. As the story progresses, Buddyfights are seeming to become a little too real...","img":"https://cdn.myanimelist.net/images/anime/9/78797.webp"},{"title":"Idaten Jump","synopsis":"Sho liked MTB very much and he always practiced at the practice field, “X-Zone”, with his friends, Takumi and Makoto. Takumi was a good mechanic and Makoto was a competitive girl rider. \n\nOne day, he was challenged by a MTB team, “Shark Tooth”, of Samejima brothers’ betting the X-Zone. For Sho, X-Zone was a memorable place where he had spent days with his dead father, and he couldn’t lose the game. \n\nThe day came, and during the race with the leader of Shark Tooth, black smoke suddenly covered around, and they were sent to another world. When he came to, he found Kakeru, Makoto, and his MTB, “Flame Caesar”, were also there. \n\nWhile they were wondering what had happened, MTB riders came. \nThey challenged Sho to a MTB bout. They said Sho had to collect 10 pieces of emblems by winning MTB bout, “Idaten Battle”. \n\nThis is how Sho came down to compete in Idaten Battle at various courses, such as, volcanos, ruins, deserts, snowy montains, and grave yards. \nWhether will show win the race to come back to his world? \n","img":"https://cdn.myanimelist.net/images/anime/4/21027.webp"},{"title":"Cardfight!! Vanguard G: GIRS Crisis-hen","synopsis":"The first half of the second season of Cardfight!! Vanguard G series.","img":"https://cdn.myanimelist.net/images/anime/3/76231.webp"},{"title":"Bishoujo Yuugi Unit Crane Game Girls","synopsis":"One day, Saya, an agent of the World Space Association, receives a sudden message that says a large number of asteroids are on a collision course with Earth, and it is her mission to stop them. Unfortunately, the only way to save the Earth is by having three people with extraordinary potential demonstrate a new skill on a crane game, which will create a beam of energy able to divert the asteroids.\n\nThe only three people with enough potential are three high school girls—Asuka, Mirai, and Kyouko. In order to harness their energy, Saya tells them that she has scouted them as idols and has them work at an arcade where she can monitor them. She says to the girls that all successful idols are good at crane games, and that building their skills is their first step in idol training. As the girls learn new crane game techniques, they begin to doubt Saya's intentions but are nonetheless unaware that the fate of the Earth lies in their hands.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/12/78958.webp"},{"title":"Shoubushi Densetsu Tetsuya","synopsis":"In the year 1947, the people of Shinjuku are down on their luck. With little money to buy food or necessities, some resort to gambling in order to survive. Traveling Tetsuya chooses to spend his time at Mahjong parlors where he is wiping the floor clean with his adversaries. However, when Tetsuya meets the intensely skilled Boushu-san, he realizes that his skills are still lacking.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1917/98459.webp"},{"title":".hack//Versus: The Thanatos Report","synopsis":"Bundled along with a free game, .hack//Versus, on the .hack//Sekai no Mukou ni Blu-ray disc, is a special called \"The Thanatos Report\". This special connects the events of the game with the events of the movie and \"reveal the last truth\". The protagonist of the special is David; a character who also appears in the main movie. The special takes place in both 2024 (the year in which the movie takes place) and 2025 (the year in which the game .hack//Versus takes place). \n\n(Source: AnimeReviews.co) ","img":"https://cdn.myanimelist.net/images/anime/10/42325.webp"},{"title":"Rockman.EXE Beast","synopsis":"Trill, a mysterious navi said to have originated from the world of Beyondard, is discovered. And new beast-type enemies, the Zoanoroids, want him for his special power. Netto Hikari and Rockman must protect their new friend while they try to figure out what Trill is really and his connection to the two legendary cyber beasts, Grega and Faltzer. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/80910.webp"},{"title":"Cardfight!! Vanguard (2018)","synopsis":"The main protagonist Sendou Aichi, is a timid and mundane third-year middle school boy. The thing that supported Aichi's heart, was the \"Blaster Blade\" card that he received as a child. It's an important rare card from \"Vanguard\", a card game with the imaginary world of \"Planet Cray\" as its stage. From the day he reunited with the person who gave him that card \"Toshiki Kai\", Aichi's everyday life began to change.\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/1408/96485.webp"},{"title":"Hikaru no Go: Sabaki no Ikkyoku! Inishie no Hana yo Sake!!","synopsis":"Alternate version of the story featured in episode 64 of Hikaru no Go.","img":"https://cdn.myanimelist.net/images/anime/9/29669.webp"},{"title":"Cardfight!! Vanguard G: Next","synopsis":"Third season of Cardfight!! Vanguard G series.","img":"https://cdn.myanimelist.net/images/anime/13/82028.webp"},{"title":"Cardfight!! Vanguard G: Stride Gate-hen","synopsis":"The second half of the second season of Cardfight!! Vanguard G series.","img":"https://cdn.myanimelist.net/images/anime/10/80198.webp"},{"title":"Monsuto Anime","synopsis":"Second season of Monster Strike, animated entirely in CG. \n\nA transfer student from America, Mana Livingston, becomes friends with the main cast and learns about the Monster Strike game, even obtaining her own ring and partner. Together everyone helps solve crises involving the energy points that draw monsters in random areas of Japan. By sealing them the monsters will stop being drawn to them. But Madarame, a CEO who reaches out to the children, is not telling them the whole truth.","img":"https://cdn.myanimelist.net/images/anime/7/84735.webp"},{"title":"Shadowverse (TV)","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1541/103429.webp"},{"title":"Pokemon Movie 23: Coco","synopsis":"The new film's story is set in Okoya Forest, a Pokémon paradise protected by strict rules that forbid outsiders from setting foot inside. The film centers on Coco, a boy who was raised by Pokémon and also considers himself as one, treating the Mythical Pokémon Zarude as his father. Ash and Pikachu encounter Coco during an adventure. The film focuses on the theme of a \"human raised by Pokémon,\" instead of the previous films' focus of the \"bond between a human trainer and their Pokémon.\"\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1029/106237.webp"},{"title":"Rockman.EXE Beast+","synopsis":"Beast+ continues from where Beast left off, though it is marketed as a stand-alone series. Episodes are reduced to approximately ten minutes in length, airing in the thirty minute time-slot Oha Coliseum alongside the Saru Getchu anime. Beast+ consists of a string of arcs beginning with the appearance of the Professor and Zero (both from Mega Man Network Transmission). \n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/12/73584.webp"},{"title":"Wonder Momo","synopsis":"One day, a group of aliens planning to take over the Earth invade Tokyo. Momoko, who aspires to be an idol, gets involved in the ensuing fight, albeit in an unexpected manner. Warudemon, king of the alien empire, uses various tactics to hunt down Momoko and the people around her. Momoko decides to stand up against this aggression.\n\nWonder Momo was originally an arcade game released in 1987. A fairly simplistic (by today's standards) side-scrolling beat 'em up game, featuring a transforming, hoop-wielding heroine.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/8/58783.webp"},{"title":"Lu Shidai","synopsis":"Zhiquiang is a young boy who loves playing League of Legends with his friends. Follow his crazy adventures.","img":"https://cdn.myanimelist.net/images/anime/13/82659.webp"},{"title":"Kodai Ouja Kyouryuu King: Yokuryuu Densetsu","synopsis":"Sequel series to Kodai Oja Kyoryu King. The Alpha Gang and the Ancients return. While the parents are talking, they are kidnapped by Gunenco, a member of the Zanjark Space Aliens. This causes the Alpha Gang and D-Team to join forces against the Zanjark Space Aliens in their plot to obtain the Cosmos Stones. Seth later returns as an ally to the Zanjark space aliens. Jark, the leader of the Zanjark, provides the dinosaur cards","img":"https://cdn.myanimelist.net/images/anime/13/23619.webp"},{"title":"Cardfight!! Vanguard Movie: Neon Messiah","synopsis":"A hybrid anime/live-action movie for the series to be released Fall 2014.\n\nAfter the events of Link Joker-hen, Aichi and Kai team up to a confront an enemy that threatens the peace they've just regained. The movie also covers the events leading up to Aichi's disappearance in Legion Mate-hen.","img":"https://cdn.myanimelist.net/images/anime/5/63797.webp"},{"title":"Rio: Rainbow Gate! Special","synopsis":"An extra episode of Rio: Rainbow Gate! which will be bundled with the seventh volume of the Blu-ray and the DVD. ","img":"https://cdn.myanimelist.net/images/anime/8/28328.webp"},{"title":"Lostorage Conflated WIXOSS: Missing Link","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/10/87210.webp"},{"title":"Hagane Orchestra","synopsis":"A group of young girls make a living by running an armored vehicle customization workshop in a desert town. They discuss different ways of promoting their business every day.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/82323.webp"},{"title":"Cardfight!! Vanguard G: Z","synopsis":"Fourth season of Cardfight!! Vanguard G series.","img":"https://cdn.myanimelist.net/images/anime/13/88063.webp"},{"title":"Cross Fight B-Daman","synopsis":"A rumor has spread amongst the children worldwide regarding the popular B-Daman matches: A select group will be allowed to participate in an upcoming secret competition, known as \"Cross Fight\"! \n \n(Source: translated and adapted from official site by Cranston) ","img":"https://cdn.myanimelist.net/images/anime/2/32803.webp"},{"title":"Tales of the Rays","synopsis":"Includes an animated promotional/opening video for the iOS/Android game Tales of the Rays and the main promotional video. Bandai Namco announced it was a sequel to Tales of the Rays and streamed the video on their official YouTube channel.\n\nThe game and videos star new characters Ickx Neve and Mileena Weiss along with a cast of returning characters from other Tales of games.\n\nIn a nontraditional manner, no new game app will be created, rather the current game app will receive a massive update and discontinue the main story line and start anew (several years later in-story) resetting the game play for all users. The story is said to take a darker tone.\n\nThe game's production was announced in 2015 and the official launch is expected some time later this year.\n\n(Source: ANN, edited)","img":"https://cdn.myanimelist.net/images/anime/13/84332.webp"},{"title":"Kakutou Ryouri Densetsu Bistro Recipe","synopsis":"An 11-year old boy named Zen bands together with his younger sister, Karen, and a young boy who has a large appetite, Pitan, to battle an evil empire by using their \"Foodons\"; strange monsters that are created from various foods.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1715/105092.webp"},{"title":"B-Legend! Battle B-Daman Fire Spirits!","synopsis":"It is not uncommon to wish upon shooting stars. But for B-DaPlayers all around the world, what they seek is not for their wishes to be granted. Gazing upon what many would assume are just rocks shrunk to the size of a pebble by atmospheric entry and fallen to the earth, the fated ones see instead what are known as Strike Shots—powerful marbles originating from the vast and mystical outer space. \n\nAfter achieving triumph in the war against his ultimate foes, Yamato Daiwa continues his journey as a rising B-DaPlayer, looking to obtain a new power worthy of his improved battle gear.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/22115.webp"},{"title":"Glamorous Heroes","synopsis":"A hot-blooded anime on the topic of e-sports based on the real Chinese online game 300 Da Zuozhan (300 Heroes). \n\nFormer top professional gamer Aoba Kaito returns to the gaming circle to regain his professional qualification which was deprived due to a doping suspicion. He and his friends confront against the conspiracy and rise to the top of the leaderboards. ","img":"https://cdn.myanimelist.net/images/anime/2/87661.webp"},{"title":"Yu☆Gi☆Oh! Zexal Special","synopsis":"A short special aired in the middle of information about Yu-Gi-Oh! with real people.\n\nKotori takes Yuma to the gymnastics club at their school to cheer on her friend. There they meet the ace of the club, Kimura Taiki, who plans to quit after a recent loss at a competition. To cheer him up, Yuma challenges him to a duel.","img":"https://cdn.myanimelist.net/images/anime/3/44710.webp"},{"title":"Rockman.EXE Movie: Hikari to Yami no Program","synopsis":"Deep in the dark recesses of the UnderNet, Forte sleeps as he drifts aimlessly. In this cybernetic graveyard, a pulsating power re-awakens Forte, alerting him to a dangerous being shortly ahead. A haunting face appears amidst a massive bright purple blob, laughing directly at Forte. Cursing him, Forte finds himself powerless as the blob takes form, and captures him within its grasp!\nNearing the time of sunset, a peaceful city and its people go about their everyday business. Curious bystanders on a sidewalk glimpse a shimmering purple light, which suddenly expands into tall pillar that reaches up to the sky. Screams erupt from the people as the pillar of light takes flight, absorbing everything in its destructive path. A tower clock dings the hour of 4 o'clock as the pillar desintigrates, leaving behind a trail of cybernetic residue and utter emptyness. \n'The Program of Light and Dark'\n\n(Source: Official Site)","img":"https://cdn.myanimelist.net/images/anime/1/2203.webp"},{"title":"Watashitachi, Luck Logic-bu!","synopsis":"The comedy shorts follow four girls who are members of the Luck Logic Club, whose activity is playing the Luck &amp; Logic card game. Watashitachi, Luck Logic-bu! will air approximately one minute before each episode of the main series.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/7/77128.webp"},{"title":"Monster Strike The Movie: Hajimari no Basho e","synopsis":"The Monster Strike film will feature a character named Lucifer.","img":"https://cdn.myanimelist.net/images/anime/1085/93874.webp"},{"title":"Yu☆Gi☆Oh! Zexal Second: Midokoro Tenkomori Special","synopsis":"Recap of first 8 episodes of the second season, narrated by Yuma and Astral.","img":"https://cdn.myanimelist.net/images/anime/9/44712.webp"},{"title":"Chihayafuru 3: Ima Hitotabi no","synopsis":"Recap of first fifteen episodes of Chihayafuru 3.","img":"https://cdn.myanimelist.net/images/anime/1014/105666.webp"},{"title":"Kaito x Ansa","synopsis":"Second season of Nazotokine.","img":"https://cdn.myanimelist.net/images/anime/5/85063.webp"},{"title":"Monster Strike The Animation","synopsis":"The Angelic Guard, who call the heavens their home, have been tasked with collecting the orbs scattered across the world. Lucifer—a leader of the Angelic Guard with a rebellious streak, said to wield power rivaling the Almighty—carries out her duty along with Uriel, also a leader of the guard. Together, they go about executing their mission, until Holy Magistrate Keter—the one who leads the heavens under the Almighty's will—tells Uriel of Lucifer's planned rebellion. Initially in disbelief, Uriel then learns that the accusations against Lucifer may be connected to an event that once threatened to shatter the heavens.\n\n(Source: Official YouTube Channel)","img":"https://cdn.myanimelist.net/images/anime/1415/101689.webp"},{"title":"Monster Strike Anime: Kieyuku Uchuu-hen","synopsis":"Second Part to Monsuto Anime, it is not animated in full CG like its predecessor.\n\n\"When the red moon rises, the apocalypse shall visit the world...\"\n\nAfter many monster battles, Ren and his friends finally set all of the energy points free. But immediately afterward, Nostradamus gave a prophecy warning of a bleak future, enveloping all who heard it in indescribable anxiety. As the gang mulls over the prophecy, Mana is still struggling to understand Miroku's declaration that she holds \"the power to change the world.\" After watching her for some time, Walpurgis tells Mana a truth she had been hiding from her. Meanwhile, Madarame is preparing to announce a new project to the world. What are his plans? And what did Walpurgis tell Mana? Are Ren and his friends headed for the dark future in the prophecy? The story finally reaches its exciting climax!\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/7/88000.webp"},{"title":"Ken to Mahou no Logres: Inishie no Megami x Fate/Extella","synopsis":"A collaboration between the mobile game Ken to Mahou no Logless Inishie no Megami and the video game Fate/Extella (which takes place in the Fate/Extra and Fate/Extra CCC world). Advertising that Nero Claudius (and others) from the latter are now playable characters in the former. Along with limited edition equipment and prizes the even ran from December 07-21, 2016. The commercial features some live-action imagery of the phone app but is predominately unique animated footage.","img":"https://cdn.myanimelist.net/images/anime/1926/97011.webp"},{"title":"Future Card Buddyfight Hundred","synopsis":"While Tasuku is off training and getting rest in the world of the monsters, the Buddy Police sees the need to deputize some of the champions to help protect the Earth. Gao, Tetsuya, and Zanya Kisaragi are among those deputized, and it's just in time. A new enemy arrives, Ikazuchi, with the deadly 100 demons, all rogue monsters. Now the new trainees and the Great 8 monsters must fight to protect Earth from being consumed by these new rogues.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/74881.webp"},{"title":"Ku Pao Ying Xiong","synopsis":"The animation tells the story of Xiao Shuai who has gone into a cool running world by accident and is embroiled in a dispute between parkour colleges.","img":"https://cdn.myanimelist.net/images/anime/3/87942.webp"},{"title":"Sakura Taisen: Ecole de Paris","synopsis":"An unseen evil lurks in the streets of Paris. Unless something is done, the darkness will unleash its destruction and consume all that is good. The City of Love will be lost to her people forever. All hope rests within the hearts of five young ladies. The only problem is, they don't even know it yet. But will an apprenticed nun, a reserved aristocrat, a hardened criminal, a traveling circus emcee and a Japanese girl experiencing loss set aside their unique differences and come together as one for the defense of many. The Paris Fighting Troup is born. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/25434.webp"},{"title":"Baku Tech! Bakugan","synopsis":"Bakugan is the card game for a new generation. In \"Baku TECH\" passionate warriors fight each other and risk their life for Bakugan.","img":"https://cdn.myanimelist.net/images/anime/3/36805.webp"},{"title":"God Eater 3","synopsis":"The opening promotional animation to Bandai Namco's God Eater 3. The game is slated to be released next month for PS4 and the following year for PC. The story is a sequel to God Eater 2 Rage Burst, just like Resonant Ops. There was a disaster of tremendous proportions, referred to as \"Ash Area\" that devoured Fenrir, and is apparently still ongoing.","img":"https://cdn.myanimelist.net/images/anime/1508/96233.webp"},{"title":"Battle Spirits: Burning Soul","synopsis":"In the near future, a battle card game called \"Battle Spirits\" has gained enormous popularity. Players of the game—known as \"Battlers\"—start duelings everywhere using their color-coded cards with different attributes, creating a \"Sengoku (Warring States) period\" for the game.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/74933.webp"},{"title":"Yu☆Gi☆Oh! The Dark Side of Dimensions Special: Eien no Rival - Yuugi to Kaiba!","synopsis":"A summary special hosted by Jounouchi and Mokuba discussing the rivalry between Yuugi and Kaiba. They introduce the setting of the series, recap the best quotes from both Yuugi and Kaiba and their ace monsters, show highlights of their duel in Battle City, and lastly showcase the first 3 minutes of the film a week before it is released in theaters.","img":"https://cdn.myanimelist.net/images/anime/11/81859.webp"},{"title":"Xiao Lu He Xiao Lan","synopsis":"\"I've been holding a few words back for a long time — I like you!\"\n\"Beryl and Sapphire\" is a popular manhua created by artist Ocarina. Here includes protagonists with the most random names in history  — the mild-mannered Beryl (Green) and the easily-embarrassed Sapphire (Blue). At times the closest of friends, at others the worst of enemies… In this donghua where each episode is set in a different world, how would they encounter each other time and again?? Only angst? Too painful! Nothing but fluff? Too sugary! Come watch B&amp;S, the show where you'll never guess the ending…\n\n(Source: Guodong Subs)","img":"https://cdn.myanimelist.net/images/anime/1670/93590.webp"},{"title":"Bishoujo Yuugi Unit Crane Game Girls Galaxy","synopsis":"Second season of Bishoujo Yuugi Unit Crane Game Girls.","img":"https://cdn.myanimelist.net/images/anime/3/81924.webp"},{"title":"Yume Oukoku to Nemureru 100-nin no Ouji-sama: Short Stories","synopsis":"Short Stories of Anime series Yume Oukoku to Nemureru 100-nin no Ouji-sama.","img":"https://cdn.myanimelist.net/images/anime/12/84446.webp"},{"title":"Sheng Shi Zhuang Niang","synopsis":"A beauty blogger has been sent to a VR reality game, where she has to stand firm in a catfight in boudoir. But how so? She is given numerous comestic products that she can arm herself up with. Based on the popular online novel published on the famous female-oriented online novel website \"Jinjiang\", this animation is strongly recommended to those who love all kinds of cosmetics.\n\n(Source: Guodong Subs)","img":"https://cdn.myanimelist.net/images/anime/1705/90278.webp"},{"title":"Battle Spirits: Brave","synopsis":"Dan now desires more exciting battles and stronger opponents. Thus it is that when Mai appears before him, offering the two, and Dan leaps at the chance.\n\nHe is transported into the future, a time when Earth is threatened by demons from another dimension. Now, the fate of all humanity rests on Dan's shoulders. The price of failure is a re-set of Earth's entire timeline. ","img":"https://cdn.myanimelist.net/images/anime/7/72210.webp"},{"title":"Hero Bank","synopsis":"In Big Money City, players participate in \"Hero Battles\" using Bankfon Gs, which allows them to rent powerful hero suits and fight battles against other players, receiving power boosts from the system's public domain feature. Kaito Goushou, a young elementary school student who is always eager to help others, ends up hastily signing a contract to rent the powerful unlisted hero suit, \"Enter the Gold,\" from a mysteriously seedy priest named Sennen; however, he soon learns that the suit comes with a debt of 10 billion yen, and Kaito must now clear his dues by winning Hero Battles.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/13/59089.webp"},{"title":"Yu☆Gi☆Oh! Zexal Second: Iza! Saishuu Kessen e!! Special","synopsis":"Recap aired between episodes 58 and 59.","img":"https://cdn.myanimelist.net/images/anime/9/62897.webp"},{"title":"Future Card Buddyfight Triple D","synopsis":"Third season of Future Card Buddyfight.","img":"https://cdn.myanimelist.net/images/anime/4/78622.webp"},{"title":"Cardfight!! Vanguard: Zoku Koukousei-hen","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1334/100989.webp"},{"title":"Bakegyamon","synopsis":"Sanshirou's chances of having an adventure are slim to none in his tiny island hometown, until the day a mysterious stranger invites him to play a game... Without warning, Sanshirou is taken to a backwards universe to play BakéGyamon—a game pitting monsters against monsters. Along the way he meets other players who have a particular reason for being there—to obtain the wish that is granted to the winner. But how far can Sanshirou get when the monsters he's been paired with are a bunch of little mud balls?!\n\n(Source: VIZ Media)","img":"https://cdn.myanimelist.net/images/anime/10/21146.webp"},{"title":"Battle Spirits: Shounen Toppa Bashin","synopsis":"Meet Toppa Bashin, a hero sixth-grader's favorite trading card. Bashin Kadobatora got a special ability. The legend is a rumor at school Reakado X. Bashin actually know that there are rivals with the pyroxene in the same way, the X over the Reakado, intense card battle we protest. Stocked all the time Reakado X, say the battle to achieve the strongest and legendary champion. The ultimate battle and win the world champion's best put to everyone. \n\n(Source: ANN, edited)","img":"https://cdn.myanimelist.net/images/anime/7/21150.webp"},{"title":"Monster Strike: Mermaid Rhapsody","synopsis":"The episode follows Ren on his vacation in Okinawa. There, he meets a mysterious girl.","img":"https://cdn.myanimelist.net/images/anime/8/80678.webp"},{"title":"Sword Art Online","synopsis":"In the year 2022, virtual reality has progressed by leaps and bounds, and a massive online role-playing game called Sword Art Online (SAO) is launched. With the aid of \"NerveGear\" technology, players can control their avatars within the game using nothing but their own thoughts.\n\nKazuto Kirigaya, nicknamed \"Kirito,\" is among the lucky few enthusiasts who get their hands on the first shipment of the game. He logs in to find himself, with ten-thousand others, in the scenic and elaborate world of Aincrad, one full of fantastic medieval weapons and gruesome monsters. However, in a cruel turn of events, the players soon realize they cannot log out; the game's creator has trapped them in his new world until they complete all one hundred levels of the game.\n\nIn order to escape Aincrad, Kirito will now have to interact and cooperate with his fellow players. Some are allies, while others are foes, like Asuna Yuuki, who commands the leading group attempting to escape from the ruthless game. To make matters worse, Sword Art Online is not all fun and games: if they die in Aincrad, they die in real life. Kirito must adapt to his new reality, fight for his survival, and hopefully break free from his virtual hell.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/39717.webp"},{"title":"No Game No Life","synopsis":"No Game No Life is a surreal comedy that follows Sora and Shiro, shut-in NEET siblings and the online gamer duo behind the legendary username \"Blank.\" They view the real world as just another lousy game; however, a strange e-mail challenging them to a chess match changes everything—the brother and sister are plunged into an otherworldly realm where they meet Tet, the God of Games.\n\nThe mysterious god welcomes Sora and Shiro to Disboard, a world where all forms of conflict—from petty squabbles to the fate of whole countries—are settled not through war, but by way of high-stake games. This system works thanks to a fundamental rule wherein each party must wager something they deem to be of equal value to the other party's wager. In this strange land where the very idea of humanity is reduced to child's play, the indifferent genius gamer duo of Sora and Shiro have finally found a real reason to keep playing games: to unite the sixteen races of Disboard, defeat Tet, and become the gods of this new, gaming-is-everything world.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/65187.webp"},{"title":"Sword Art Online II","synopsis":"A year after escaping Sword Art Online, Kazuto Kirigaya has been settling back into the real world. However, his peace is short-lived as a new incident occurs in a game called Gun Gale Online, where a player by the name of Death Gun appears to be killing people in the real world by shooting them in-game. Approached by officials to assist in investigating the murders, Kazuto assumes his persona of Kirito once again and logs into Gun Gale Online, intent on stopping the killer.\n\nOnce inside, Kirito meets Sinon, a highly skilled sniper afflicted by a traumatic past. She is soon dragged in his chase after Death Gun, and together they enter the Bullet of Bullets, a tournament where their target is sure to appear. Uncertain of Death Gun's real powers, Kirito and Sinon race to stop him before he has the chance to claim another life. Not everything goes smoothly, however, as scars from the past impede their progress. In a high-stakes game where the next victim could easily be one of them, Kirito puts his life on the line in the virtual world once more.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/65185.webp"},{"title":"Death Parade","synopsis":"After death, there is no heaven or hell, only a bar that stands between reincarnation and oblivion. There the attendant will, one after another, challenge pairs of the recently deceased to a random game in which their fate of either ascending into reincarnation or falling into the void will be wagered. Whether it's bowling, darts, air hockey, or anything in between, each person's true nature will be revealed in a ghastly parade of death and memories, dancing to the whims of the bar's master. Welcome to Quindecim, where Decim, arbiter of the afterlife, awaits!\n\nDeath Parade expands upon the original one-shot intended to train young animators. It follows yet more people receiving judgment—until a strange, black-haired guest causes Decim to begin questioning his own rulings.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/71553.webp"},{"title":"Overlord","synopsis":"The final hour of the popular virtual reality game Yggdrasil has come. However, Momonga, a powerful wizard and master of the dark guild Ainz Ooal Gown, decides to spend his last few moments in the game as the servers begin to shut down. To his surprise, despite the clock having struck midnight, Momonga is still fully conscious as his character and, moreover, the non-player characters appear to have developed personalities of their own!\n\nConfronted with this abnormal situation, Momonga commands his loyal servants to help him investigate and take control of this new world, with the hopes of figuring out what has caused this development and if there may be others in the same predicament.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/88019.webp"},{"title":"Log Horizon","synopsis":"In the blink of an eye, thirty thousand bewildered Japanese gamers are whisked from their everyday lives into the world of the popular MMORPG, Elder Tale, after the game's latest update—unable to log out. Among them is the socially awkward college student Shiroe, whose confusion and shock lasts only a moment as, a veteran of the game, he immediately sets out to explore the limits of his new reality.\n\nShiroe must learn to live in this new world, leading others and negotiating with the NPC \"natives\" in order to bring stability to the virtual city of Akihabara. He is joined by his unfortunate friend Naotsugu, having logged in for the first time in years only to find himself trapped, and Akatsuki, a petite but fierce assassin who labels Shiroe as her master. A tale of fantasy, adventure, and politics, Log Horizon explores the elements of gaming through the eyes of a master strategist who attempts to make the best of a puzzling situation.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/84004.webp"},{"title":"Accel World","synopsis":"Haruyuki Arita is an overweight, bullied middle schooler who finds solace in playing online games. But his life takes a drastic turn one day, when he finds that all his high scores have been topped by Kuroyukihime, the popular vice president of the student council. She then invites him to the student lounge and introduces him to \"Brain Burst,\" a program which allows the users to accelerate their brain waves to the point where time seems to stop. Brain Burst also functions as an augmented reality fighting game, and in order to get more points to accelerate, users must win duels against other players. However, if a user loses all their points, they will also lose access to Brain Burst forever.\n\nKuroyukihime explains that she chose to show Haruyuki the program because she needs his help. She wants to meet the creator of Brain Burst and uncover the reason of why it was created, but that's easier said than done; to do so, she must defeat the \"Six Kings of Pure Color,\" powerful faction leaders within the game, and reach level 10, the highest level attainable. After the girl helps Haruyuki overcome the bullies that torment him, he vows to help her realize her goal, and so begins the duo's fight to reach the top.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/38155.webp"},{"title":"Kakegurui","synopsis":"Unlike many schools, attending Hyakkaou Private Academy prepares students for their time in the real world. Since many of the students are the children of the richest people in the world, the academy has its quirks that separate it from all the others. By day, it is a normal school, educating its pupils in history, languages, and the like. But at night, it turns into a gambling den, educating them in the art of dealing with money and manipulating people. Money is power; those who come out on top in the games stand at the top of the school.\n\nYumeko Jabami, a seemingly naive and beautiful transfer student, is ready to try her hand at Hyakkaou's special curriculum. Unlike the rest, she doesn't play to win, but for the thrill of the gamble, and her borderline insane way of gambling might just bring too many new cards to the table.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/86578.webp"},{"title":"Overlord II","synopsis":"Ainz Ooal Gown, the undead sorcerer formerly known as Momonga, has accepted his place in this new world. Though it bears similarities to his beloved virtual reality game Yggdrasil, it still holds many mysteries which he intends to uncover, by utilizing his power as ruler of the Great Tomb of Nazarick. However, ever since the disastrous brainwashing of one of his subordinates, Ainz has become wary of the impending dangers of the Slane Theocracy, as well as the possible existence of other former Yggdrasil players. Meanwhile, Albedo, Demiurge and the rest of Ainz's loyal guardians set out to prepare for the next step in their campaign: Nazarick's first war…\n\nOverlord II picks up immediately after its prequel, continuing the story of Ainz Ooal Gown, his eclectic army of human-hating guardians, and the many hapless humans affected by the Overlord's arrival.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/89562.webp"},{"title":"No Game No Life: Zero","synopsis":"In ancient Disboard, Riku is an angry, young warrior intent on saving humanity from the warring Exceed, the sixteen sentient species, fighting to establish the \"One True God\" amongst the Old Deus. In a lawless land, humanity's lack of magic and weak bodies have made them easy targets for the other Exceed, leaving the humans on the brink of extinction. One day, however, hope returns to humanity when Riku finds a powerful female Ex-machina, whom he names Schwi, in an abandoned elf city. Exiled from her Cluster because of her research into human emotions, Schwi is convinced that humanity has only survived due to the power of these feelings and is determined to understand the human heart. Forming an unlikely partnership in the midst of the overwhelming chaos, Riku and Schwi must now find the answers to their individual shortcomings in each other, and discover for themselves what it truly means to be human as they fight for their lives together against all odds. Each with a powerful new ally in tow, it is now up to them to prevent the extinction of the human race and establish peace throughout Disboard!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1085/90759.webp"},{"title":"Sword Art Online: Alicization","synopsis":"The Soul Translator is a state-of-the-art full-dive interface which interacts with the user's Fluctlight—the technological equivalent of a human soul—and fundamentally differs from the orthodox method of sending signals to the brain. The private institute Rath aims to perfect their creation by enlisting the aid of Sword Art Online survivor Kazuto Kirigaya. He works there as a part-time employee to test the system's capabilities in the Underworld: the fantastical realm generated by the Soul Translator. As per the confidentiality contract, any memories created by the machine in the virtual world are wiped upon returning to the real world. Kazuto can only vaguely recall a single name, Alice, which provokes a sense of unease when mentioned in reality.\n\nWhen Kazuto escorts Asuna Yuuki home one evening, they chance upon a familiar foe. Kazuto is mortally wounded in the ensuing fight and loses consciousness. When he comes to, he discovers that he has made a full-dive into the Underworld with seemingly no way to escape. He sets off on a quest, seeking a way back to the physical world once again.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1993/93837.webp"},{"title":"Log Horizon 2nd Season","synopsis":"After being trapped in the world of Elder Tale for six months, Shiroe and the other Adventurers have begun to get the hang of things in their new environment. The Adventurers are starting to gain the trust of the People of the Land, and Akiba has flourished thanks to the law and order established by Shiroe's Round Table Alliance, regaining its everyday liveliness. Despite this success, however, the Alliance faces a new crisis: they are running out of funds to govern Akiba, and spies from the Minami district have infiltrated the city.\n\nAs formidable forces rise in other districts, there is also a need to discover more about the vast new world they are trapped in—leading Shiroe to decide that the time has come to venture outside the city. Accompanied by his friend Naotsugu and the Sage of Mirror Lake Regan, the calculative Shiroe makes his move, hoping to unravel new possibilities and eventually find a way home.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/68097.webp"},{"title":"Overlord III","synopsis":"Following the horrific assault on the Re-Estize capital city, the Guardians of the Great Tomb of Nazarick return home to their master Ainz Ooal Gown. After months of laying the groundwork, they are finally ready to set their plans of world domination into action.\n\nAs Ainz's war machine gathers strength, the rest of the world keeps moving. The remote Carne Village, which Ainz once saved from certain doom, continues to prosper despite the many threats on its doorstep. And in the northeastern Baharuth Empire, a certain Bloody Emperor sets his sights on the rising power of Nazarick.\n\nBlood is shed, heroes fall, and nations rise. Can anyone, or anything, challenge the supreme power of Ainz Ooal Gown?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1511/93473.webp"},{"title":"Sword Art Online Movie: Ordinal Scale","synopsis":"In 2026, four years after the infamous Sword Art Online incident, a revolutionary new form of technology has emerged: the Augma, a device that utilizes an Augmented Reality system. Unlike the Virtual Reality of the NerveGear and the Amusphere, it is perfectly safe and allows players to use it while they are conscious, creating an instant hit on the market. The most popular application for the Augma is the game Ordinal Scale, which immerses players in a fantasy role-playing game with player rankings and rewards.\n\nFollowing the new craze, Kirito's friends dive into the game, and despite his reservations about the system, Kirito eventually joins them. While at first it appears to be just fun and games, they soon find out that the game is not all that it seems...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/83811.webp"},{"title":"3-gatsu no Lion","synopsis":"Having reached professional status in middle school, Rei Kiriyama is one of the few elite in the world of shogi. Due to this, he faces an enormous amount of pressure, both from the shogi community and his adoptive family. Seeking independence from his tense home life, he moves into an apartment in Tokyo. As a 17-year-old living on his own, Rei tends to take poor care of himself, and his reclusive personality ostracizes him from his peers in school and at the shogi hall.\n\nHowever, not long after his arrival in Tokyo, Rei meets Akari, Hinata, and Momo Kawamoto, a trio of sisters living with their grandfather who owns a traditional wagashi shop. Akari, the oldest of the three girls, is determined to combat Rei's loneliness and poorly sustained lifestyle with motherly hospitality. The Kawamoto sisters, coping with past tragedies, also share with Rei a unique familial bond that he has lacked for most of his life. As he struggles to maintain himself physically and mentally through his shogi career, Rei must learn how to interact with others and understand his own complex emotions.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/82898.webp"},{"title":"Sword Art Online Alternative: Gun Gale Online","synopsis":"Clad in desert pink and the size of a mere child, the infamous \"Pink Devil\" mercilessly hunts down other players in the firearm-centered world of the virtual reality game Gun Gale Online. But in real life, this feared player killer is not quite who anyone would expect.\n \nA shy university student in Tokyo, Karen Kohiruimaki stands in stark contrast to her in-game avatar—in fact, she happens to stand above everyone else too, much to her dismay. Towering above all the people around her, Karen's insecurities over her height reach the point where she turns to the virtual world for an escape. Starting game after game in hopes of manifesting as a cute, short character, she finally obtains her ideal self in the world of Gun Gale Online. Overjoyed by her new persona, she pours her time into the game as LLENN, garnering her reputation as the legendary player killer.\n \nHowever, when one of LLENN's targets gets the best of her, she ends up meeting Pitohui, a skilled yet eccentric woman. Quickly becoming friends with Karen, Pitohui insists that LLENN participates in Squad Jam, a battle royale that pits teams against one another, fighting until only one remains. Thrust into the heated competition, LLENN must fight with all her wit and will if she hopes to shoot her way to the top.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1141/93288.webp"},{"title":"Netoge no Yome wa Onnanoko ja Nai to Omotta?","synopsis":"After mustering up the courage to propose to a girl in an online game, naïve otaku Hideki \"Rusian\" Nishimura is devastated when she flat out rejects him. To make matters worse, the girl reveals that she is actually an older man in real life. With his dreams crushed and his heart broken, Rusian comes to an abrupt decision in the midst of his raging fit: he will never trust another girl in an online game again.\n\nYears later, Rusian is now in a guild with three other players, one of whom possesses a female avatar by the name of \"Ako.\" Ako is deeply in love with Rusian and wants to marry him. Although he entertains the possibility that she might be a guy, Rusian accepts her proposal, claiming that her gender doesn't matter as long as she is cute in the game. However, after a discussion between guild members that led to all of them having an offline meeting, Rusian finds out that Ako, along with the other members, are not just girls, but also his schoolmates.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/79414.webp"},{"title":"Chihayafuru","synopsis":"Chihaya Ayase, a strong-willed and tomboyish girl, grows up under the shadow of her older sister. With no dreams of her own, she is contented with her share in life till she meets Arata Wataya. The quiet transfer student in her elementary class introduces her to competitive karuta, a physically and mentally demanding card game inspired by the classic Japanese anthology of Hundred Poets. Captivated by Arata's passion for the game and inspired by the possibility of becoming the best in Japan, Chihaya quickly falls in love with the world of karuta. Along with the prodigy Arata and her haughty but hard-working friend Taichi Mashima, she joins the local Shiranami Society. The trio spends their idyllic childhood days playing together, until circumstances split them up.\n\nNow in high school, Chihaya has grown into a karuta freak. She aims to establish the Municipal Mizusawa High Competitive Karuta Club, setting her sights on the national championship at Omi Jingu. Reunited with the now indifferent Taichi, Chihaya's dream of establishing a karuta team is only one step away from becoming true: she must bring together members with a passion for the game that matches her own.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/35749.webp"},{"title":"Net-juu no Susume","synopsis":"For the first time since graduating high school, 30-year-old Moriko Morioka is unemployed—and she couldn't be happier. Having quit her long-standing job of over 11 years, Moriko quickly turns to online games to pass her now-plentiful free time, reinventing herself as the handsome and dashing male hero \"Hayashi\" in the MMO Fruits de Mer. With the pesky societal obligations of the real world out of the way, she blissfully dives headfirst into the realm of the game, where she promptly meets the kind and adorable healer Lily. Befriending each other almost instantly, the two become inseparable just as Moriko herself becomes more and more engrossed in her new \"life\" as Hayashi. Eventually, Moriko adopts the reclusive lifestyle in its entirety, venturing out from the safety of her apartment only when absolutely necessary.\n\nMeanwhile, unbeknownst to Moriko, a timid 28-year-old corporate worker named Yuuta Sakurai has also logged onto Fruits de Mer from the other side of town. Coincidentally bumping into each other at the convenience store one night, both write off their meeting as no more than just another awkward encounter with a stranger—however, fate has more in store for them than they think.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/87463.webp"},{"title":"New Game!","synopsis":"Since childhood, Aoba Suzukaze has loved the Fairies Story game series, particularly the character designs. So when she graduates from high school, it is no surprise that she applies to work at Eagle Jump, the company responsible for making her favorite video game. On her first day, she is excited to learn that she will be working on a new installment to the series: Fairies Story 3—and even more so under Kou Yagami, the lead character designer.\n\nIn their department are people who share the same passion for games. There is Yun Iijima, whose specialty is designing monsters; the shy Hifumi Takimoto, who prefers to communicate through instant messaging; Hajime Shinoda, an animation team member with an impressive figurine collection; Rin Tooyama, the orderly art director; Shizuku Hazuki, the game director who brings her cat to work; and Umiko Ahagon, the short-tempered head programmer.\n\nNew Game! follows Aoba and the others on their adventure through the ups and downs of game making, from making the perfect character design to fixing all the errors that will inevitably accumulate in the process.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/80417.webp"},{"title":"D-Frag!","synopsis":"The Kazama Family—a gang of three wannabe delinquents and close friends, spearheaded by Kenji Kazama, is trying to make a name for themselves at Fujou Academy. On the first day of the term, the gang finds themselves putting out a fire in the Game Development Club. Instead of thanking them, the eccentric club members attack and knock out Kenji's two friends, forcing Kenji to fight for his life. Failing to escape, the gang leader is coerced into joining the Game Development Club.\n\nAs he settles in, Kenji gets to know the four girls responsible for his provisional membership—student council president and general tyrant Chitose Karasuyama, spirited tomboy Sakura Mizukami, negligent club advisor Minami Oosawa, and the school's infamous shadow leader Roka Shibasaki. Throughout the Game Development Club's constant shenanigans and his desperate attempts to leave the club, Kenji begins to realize that he may be actually enjoying himself.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/53407.webp"},{"title":"Sword Art Online: Alicization - War of Underworld","synopsis":"Despite the defeat of Quinella—the pontifex of the Axiom Church—things have not seemed to calm down yet. Upon contacting the real world, Kazuto \"Kirito\" Kirigaya finds out that the Ocean Turtle—a mega-float controlled by Rath—was raided. Due to a sudden short-circuit caused by the raiders, Kirito's fluctlight is damaged, leaving him comatose. Feeling insecure about the people at the Axiom Church, Alice brings the unconscious Kirito back to their hometown—Rulid Village, disregarding her banishment due to an unabsolved crime. Now, Alice is living an ordinary and peaceful life close by the village, wishing for Kirito to wake up.\n\nHowever, tragedy strikes when Alice notices that the Dark Territory has already started to invade the Human Empire. Reassuming her previous alias, Alice Synthesis Thirty, she promises to defeat the Dark Territory in order to defend the world that Kirito and Eugeo worked so hard to protect.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1630/103417.webp"},{"title":"Kakegurui××","synopsis":"As Yumeko Jabami's fame grows and the reputation of the student council dwindles, Kirari Momobami decides to revolutionize the group. To this end, she announces an election for its next president. The rules are simple: each student in the school receives one chip. Whoever has the most chips by the end of thirty days becomes both the new president and the head of the Momobami clan.\n\nUpon receiving news of this development, the Momobami branch families spring into action. Eleven transfer students arrive at Hyakkao Private Academy, each aiming to lead both the school and the Momobami clan. Equipped with unique talents, they will compete to get as many chips as possible—but their chips are not the only things on the line.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/1496/96519.webp"},{"title":"Yu☆Gi☆Oh! Duel Monsters","synopsis":"Legend says that the enigmatic Millennium Puzzle will grant one wish to whoever deciphers its ancient secrets. Upon solving it, high school student Yuugi Mutou unleashes \"another Yuugi,\" a peculiar presence contained inside. Now, whenever he is faced with a dilemma, this mysterious alter ego makes an appearance and aids him in his troubles.\n\nWishing to unravel the mystery behind this strange spirit, Yuugi and his companions find themselves competing with several opponents in \"Duel Monsters,\" a challenging card game used by people seeking to steal the Millennium Puzzle in a desperate attempt to harness the great power within. As the questions pile on, it is not long before they figure out that there is more than pride on the line in these duels.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/77055.webp"},{"title":"Quanzhi Gaoshou","synopsis":"Widely regarded as a trailblazer and top-tier professional player in the online multiplayer game Glory, Ye Xiu is dubbed the \"Battle God\" for his skills and contributions to the game over the years. However, when forced to retire from the team and to leave his gaming career behind, he finds work at a nearby internet café. There, when Glory launches its tenth server, he throws himself into the game once more using a new character named \"Lord Grim.\"\n\nYe Xiu's early achievements on the new server immediately catch the attention of many players, as well as the big guilds, leaving them to wonder about the identity of this exceptional player. However, while he possesses ten years of experience and in-depth knowledge, starting afresh with neither sponsors nor a team in a game that has changed over the years presents numerous challenges. Along with talented new comrades, Ye Xiu once again dedicates himself to traversing the path to Glory's summit!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/81892.webp"},{"title":"Sword Art Online: Extra Edition","synopsis":"Yui wants to see a whale so Kirito suggests a quest where she can meet them. However, it turns out that Leafa cannot swim so Asuna and the other female characters decide to train Suguha in a real-world pool in preparation for the aforementioned quest. Meanwhile, Kirito meets a certain someone. ","img":"https://cdn.myanimelist.net/images/anime/6/64747.webp"},{"title":"Gyakkyou Burai Kaiji: Ultimate Survivor","synopsis":"Kaiji Itou is a good-for-nothing loiterer who spends his days drinking beer and stealing hubcaps—that is, until he ends up being tricked by his former co-worker. Unable to suddenly repay his friend's huge debt all by himself, Kaiji is offered a shady deal to participate in an illegal underground gamble on a cruise ship. This turns out to be nothing more than the beginning of his new life of hell—thrown headlong into a life-threatening roller coaster of mind games, cheating, and deceit.\n\nBased on the first entry of the famous gambling manga series by Nobuyuki Fukumoto, Gyakkyou Burai Kaiji: Ultimate Survivor follows our unlucky protagonist as he is forced to fight not only other people, but also the mysteries of their psyches. Kaiji finds out the hard way that the worst sides of human nature surface when people's backs are against the wall, and that the most fearsome dangers of all are greed, paranoia, and the human survival instinct itself.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/80032.webp"},{"title":"3-gatsu no Lion 2nd Season","synopsis":"Now in his second year of high school, Rei Kiriyama continues pushing through his struggles in the professional shogi world as well as his personal life. Surrounded by vibrant personalities at the shogi hall, the school club, and in the local community, his solitary shell slowly begins to crack. Among them are the three Kawamoto sisters—Akari, Hinata, and Momo—who forge an affectionate and familial bond with Rei. Through these ties, he realizes that everyone is burdened by their own emotional hardships and begins learning how to rely on others while supporting them in return. \n\nNonetheless, the life of a professional is not easy. Between tournaments, championships, and title matches, the pressure mounts as Rei advances through the ranks and encounters incredibly skilled opponents. As he manages his relationships with those who have grown close to him, the shogi player continues to search for the reason he plays the game that defines his career.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/88469.webp"},{"title":"Death Billiards","synopsis":"Two men have just arrived at a location known as Quindecim and are unable to remember how they got there. They are immediately greeted by a young woman who escorts them to a small bar, where a bartender awaits them. They are told that they will have to participate in a game, randomly chosen by roulette, and will be unable to leave until its completion; if they refuse, the consequences will be dire. In addition to the rules of the game, the two men are told to play as if their lives are at stake.\n \nThe game that has been chosen is billiards. But there's more to it than just pocketing pool balls, as the two are about to find out the outcome could mean life or death.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/48721.webp"},{"title":"New Game!!","synopsis":"​It has been a year since Aoba Suzukaze started working at the Eagle Jump game company. In that time, she and her eccentric coworkers in the character design department have worked hard to release the company's newest game: Fairies Story 3. With their latest title now complete, a new project must begin—starting with a contest to decide the character designs for the upcoming game. Through hard work, dedication, and some guidance from the previous character designer, Kou Yagami, Aoba wins the contest and begins her new role as lead character designer.\n\nHowever, her new job is not an easy one. In addition to having extra work and longer hours, Aoba questions whether she is the right fit for the job. New Game!! continues as Aoba overcomes her inexperience with the help of her friends and coworkers, willing to face any challenge to make Eagle Jump's newest creation, a cutesy game called Peco.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/86790.webp"},{"title":"Chihayafuru 2","synopsis":"Chihaya Ayase is obsessed with developing her school's competitive karuta club, nursing daunting ambitions like winning the national team championship at the Omi Jingu and becoming the Queen, the best female karuta player in Japan—and in extension, the world. As their second year of high school rolls around, Chihaya and her fellow teammates must recruit new members, train their minds and bodies alike, and battle the formidable opponents that stand in their way to the championship title. Meanwhile, Chihaya's childhood friend, Arata Wataya, the prodigy who introduced her to karuta, rediscovers his lost love for the old card game.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/47435.webp"},{"title":"Yu☆Gi☆Oh!","synopsis":"Bullies often target someone frail and weak—someone exactly like Yuugi Mutou. His beautiful childhood friend, Anzu Mazaki, is always there to stand up for him, but he can't depend on her forever. Katsuya Jonouchi, who is almost always accompanied by his verbal sparring partner Hiroto Honda, doesn't seem like a bad person either, despite always bringing Yuugi trouble. But most of all, Yuugi wishes for a true friend who understands him and would never betray him.\n\nYuugi treasures his Millennium Puzzle, an ancient Egyptian artifact that was brought into his grandfather's game shop. Believing that solving the puzzle will grant him his wish, he completes the puzzle, unleashing a new personality within him—the soul of the \"King of Games.\"\n\nDark, twisted, strong, and reliable, the new personality named Yami Yuugi is the exact opposite of Yuugi. Upon any injustice toward him, Yami Yuugi takes over Yuugi's body and forces the opponent into a \"Shadow Game.\" The stakes are high as whoever loses shall have a taste of the darkness that resides within their own heart.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/47487.webp"},{"title":".hack//Sign","synopsis":"A young wavemaster, only known by the alias of Tsukasa, wakes up in an MMORPG called The World, with slight amnesia. He does not know what he has previously done before he woke up. In The World, the Crimson Knights suspects him of being a hacker, as he was seen accompanying a tweaked character in the form of a cat. Unable to log out from the game, he wanders around looking for answers, avoiding the knights and other players he meets along the way.\n\nAs Tsukasa explores The World, he stumbles upon a magical item that takes the form of a \"guardian,\" which promises him protection from all harm. Subaru, the leader of the Crimson Knights, along with several other players who became acquainted with Tsukasa, set out to investigate why Tsukasa is unable to log out, and attempt to get to the bottom of the problem before it gets out of hand.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1443/94665.webp"},{"title":"Yu☆Gi☆Oh!: Duel Monsters GX","synopsis":"Duel Academy, one of the most prestigious schools in Duel Monster's history. There students learn the fundamentals of becoming not just duelists, but large business owners.\n\nYuki Judai is a new student with only one thing on his mind, to become the next King Of Games. Judai meets several friends, teachers, and even enemies at the large Dueling school. There he'll have to face off against several different Dorms to become number one duelist. Slifer Red, Ra Yellow, and Obelisk Blue are the three dorms. Will Judai be able to pass all of them?\n\nBased on Kazuki Takahashi's world famous anime and manga Yu-Gi-Oh!.\n\n(Source: Otakufreakmk2)","img":"https://cdn.myanimelist.net/images/anime/6/20873.webp"},{"title":"No Game No Life Specials","synopsis":"Picture drama specials included on the Blu-ray/DVD volumes.","img":"https://cdn.myanimelist.net/images/anime/7/71783.webp"},{"title":"High Score Girl","synopsis":"The year is 1991, and arcade video games are the latest craze. Becoming a professional gamer is a far-fetched dream in an industry that has yet to spread its influence. Yet, that is the path sixth-grader Haruo Yaguchi wants to pursue. His aptitude for video games has earned him respect in local arcades and bestowed him with confidence and pride, both of which are shattered when fellow classmate Akira Oono easily defeats him in Street Fighter 2.\n\nAkira is rich, pretty, and smart—as close as can be to a perfect girl. But Haruo had never cared about these things as, despite his multiple shortcomings as a person, his supremacy in video games was, in his mind, undisputed. So, now that someone has appeared who can rival him, part of Haruo cannot help but loathe her. Another part, however, itches for somebody who can compete with him on equal terms, and Akira is more than capable.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1668/91345.webp"},{"title":"Selector Infected WIXOSS","synopsis":"Things are not always what they seem. This is especially true for Ruuko Kominato, when she receives a deck of cards for the popular card game WIXOSS, only to find a girl trapped inside her LRIG, or avatar card. Upon meeting others in the same situation, Ruuko discovers that she has now become a \"Selector,\" a player in a special version of WIXOSS where girls can battle each other for a chance to have their deepest desires come true. However, there is a catch. In contrast to the glory that awaits them after their victories, there is a cruel fate: if they lose three times, their lives will be destroyed.\n\nIn an ominous game filled with lies and deceit, Ruuko and her newfound friends must uncover the secrets behind WIXOSS and realize what is truly most important to them before it is too late.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/70147.webp"},{"title":"Gyakkyou Burai Kaiji: Hakairoku-hen","synopsis":"Owing to an increasing debt, Kaiji Itou ends up resuming his old lifestyle. One day, while walking on the street, he stumbles upon Yuuji Endou, who is hunting Kaiji due to the money he owes to the Teiai Group. Unaware of this, Kaiji eagerly follows Endou, hoping for a chance to participate in another gamble, but soon finds out the loan shark's real intentions when he is kidnapped.\n\nGiven that Kaiji is unable to pay off his huge debt, the Teiai Group instead sends him to work in an underground labor camp. He is told that he will have to live in this hell for 15 years, alongside other debtors, until he can earn his freedom. His only hope to put an early end to this nightmare is by saving enough money to be able to go back to the surface for a single day. Once he is there, he plans to obtain the remaining money needed to settle his account by making a high-stakes wager. However, as many temptations threaten his scarce income, Kaiji may have to resort to gambling sooner than he had expected.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/30599.webp"},{"title":"Ryuuou no Oshigoto!","synopsis":"Shogi, a Japanese game similar to chess, is one of the most popular board games in the country, played by everyone from children to the elderly. Some players are talented enough to take the game to a professional level. The title of Ryuuou, meaning \"the dragon king,\" is only awarded to the person who reaches the pinnacle of competitive shogi.\n\nYaichi Kuzuryuu has just become the youngest Ryuuou after winning the grand championship. However, the shogi community is unwelcoming to his victory, some even calling him the worst Ryuuou in history. Moreover, he forgets about the agreement he made with Ai Hinatsuru, a little girl he promised to coach if he won. After she shows up at his doorstep, he reluctantly agrees to uphold his promise and makes Ai his disciple.\n\nTogether, they aim to improve and exceed the limits of their shogi prowess: Ai, to unlock her hidden talents; Yaichi, to prove to the world that he deserves his accomplishments.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/89979.webp"},{"title":"Hikaru no Go","synopsis":"While searching through his grandfather's attic, Hikaru Shindou stumbles upon an old go board. Touching it, he is greeted by a mysterious voice, and soon after falls unconscious. When he regains his senses, he discovers that the voice is still present and belongs to Sai Fujiwara no, the spirit of an ancient go expert. A go instructor for the Japanese Emperor in the Heian Era, Sai's passion for the game transcends time and space, allowing him to continue playing his beloved game as a ghostly entity. Sai's ultimate goal is to master a divine go technique that no player has achieved so far, and he seeks to accomplish this by playing the board game through Hikaru.\n\nDespite having no interest in board games, Hikaru reluctantly agrees to play, executing moves as instructed by Sai. However, when he encounters the young go prodigy Akira Touya, a passion for the game is slowly ignited within him. Inspired by his newfound rival, Hikaru's journey into the world of go is just beginning.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/78317.webp"},{"title":"Sword Art Online: Alicization - War of Underworld 2nd Season","synopsis":"Second part of Sword Art Online: Alicization - War of Underworld.","img":"https://cdn.myanimelist.net/images/anime/1438/105106.webp"},{"title":"Accel World EX","synopsis":"OVA bundled with the Accel World simulation and action games. The Blu-ray OVA discs came with the PS3 limited edition versions and the DVD with the PSP limited edition versions.\n\nThe project was split into two PSP and PS3 titles, and one episode was released with each game:\n#EX01: Reverberation;Zankyou (bundled with Stage:01 Ginyoku no Kakusei)\n#EX02: Vacation;Onsen (bundled with Stage:02 Kasoku no Chouten)","img":"https://cdn.myanimelist.net/images/anime/10/41815.webp"},{"title":"Phi Brain: Kami no Puzzle","synopsis":"Kaito Daimon would be a completely average high school student except for one thing: he's a 'demon' at solving puzzles. Kaito is so brilliant, in fact, that when he's asked to take some 'special' tests of his unique ability, he immediately suspects that the test itself is a test. Kaito suddenly finds himself caught up in a lethal Philosopher's Puzzle made by the sinister group POG, a murderous maze of trap upon trap, where failing to solve the secret correctly will result in death! Fortunately, Kaito's skills prove up to the first test, both for himself and his childhood friend Nanoha, who is also caught up in the deadly scheme. But now that he has been designated as a Solver, he is pulled into a new life where he must travel the world with other Solvers, attempting to solve the latest deadly riddles left by POG. There's a new conundrum around every corner and each deception could lead to death, but once a riddle has been posed, you can count on Kaito to unfold, unravel and unlock it!\n\n(Source: Sentai Filmworks)","img":"https://cdn.myanimelist.net/images/anime/12/34045.webp"},{"title":"Yu☆Gi☆Oh! 5D's","synopsis":"Yuusei Fudou is out to get back what was stolen from him.\n\nThe world of dueling has evolved, with Riding Duels becoming the peak of entertainment for the residents of Neo Domino City. They are played on D-Wheels, a hybrid between Duel Disks and motorbikes. After the mechanically skilled Yuusei managed to build his own D-Wheel, his former friend Jack Atlas stole it alongside Yuusei's best card, Stardust Dragon; ditching their decrepit hometown of Satellite, he escaped to Neo Domino City.\n\nIn the two years since then, Jack has risen to the top of the dueling world, while Yuusei has been making preparations thanks to the help of his friends. With his new D-Wheel finished, he now sets off to Neo Domino City, his only goal to find Jack. Unbeknownst to either of them, there are far bigger things at stake than they can imagine, with puppeteers pulling the strings behind the scenes.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1667/103658.webp"},{"title":"Shichisei no Subaru","synopsis":"Asahi's life in reality ended simultaneously when she died playing Union, a world-renowned online RPG. The members of Subaru went separate ways when Union shut down due to Asahi's death. Six years later, Haruto logs onto a renewed version of Re'Union and reunites with Asahi who had died. Is it really her or just an electronic ghost? The former team members reunite and enter the mysterious and deadly online game to find out.\n\n(Source: TBS Global Business)","img":"https://cdn.myanimelist.net/images/anime/1956/94914.webp"},{"title":"Infinite Dendrogram","synopsis":"In the year 2043, &lt;Infinite Dendrogram&gt;, the world's first successful full-dive VRMMO was released. In addition to its ability to perfectly simulate the five senses, along with its many other amazing features, the game promised to offer players a world full of infinite possibilities. Nearly two years later, soon-to-be college freshman, Reiji Mukudori, is finally able to buy a copy of the game and start playing. With some help from his experienced older brother, Shuu, and his partner Embryo, Reiji embarks on an adventure into the world of &lt;Infinite Dendrogram&gt;. Just what will he discover and encounter in this game world known for its incredible realism and infinite possibilities?\n \n(Source: J-Novel Club)","img":"https://cdn.myanimelist.net/images/anime/1715/104281.webp"},{"title":"Sword Art Online II: Debriefing","synopsis":"Recap episode of the Phantom Bullet arc, also known as Episode 14.5.","img":"https://cdn.myanimelist.net/images/anime/10/67587.webp"},{"title":"Saki","synopsis":"Due to childhood circumstances, first-year high school student Saki Miyanaga hates anything related to mahjong. When she does play the game, she keeps a low profile to avoid standing out. One day, her friend Kyoutarou Suga drags her along to the school's mahjong club. There, she meets Nodoka Haramura, the champion of the previous year's national middle school mahjong championship, and Yuuki Kataoka, a fellow club member.\n\nAs the club play a few rounds, Saki attempts to hide her talent. However, the club president, Hisa Takei, notices Saki's unusual playstyle. Realizing her potential, she puts Saki's real ability to the test—proving her to be more talented than expected. This revelation damages Nodoka's pride, and their relationship gets off to a rocky start.\n\nSaki ends up joining the club, and after clearing up the misunderstandings between her and Nodoka, friendship blooms between them. As Saki slowly warms up to mahjong once again, she and the rest of her club only have one goal—to win nationals!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/73933.webp"},{"title":"Touhai Densetsu Akagi: Yami ni Maiorita Tensai","synopsis":"While mahjong is a game that is often played with family and friends, it is also a game that is played in the darkest corners of society. Nangou is a compulsive gambler who has accumulated debt over three million yen. In a last ditch attempt to clear his record, he decides to wager his life on a game of mahjong with the mafia. Unfortunately, as the game progresses, Nangou only moves further from the prize and closer to death.\n\nWhen all hope seems lost, the game parlor is suddenly intruded upon by Shigeru Akagi, a young boy on the run from the police. Desperate to turn the game around, Nangou hands the game over to Akagi after teaching him a few of the rules. The mafia can only smirk as Akagi sits down to play. However, they soon come to learn that Akagi is a natural-born gambler. An imposing figure who does not fear death. One who is destined to become a legend.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/53587.webp"},{"title":"Net-juu no Susume Special","synopsis":"An unaired 11th episode included with the Blu-ray BOX set release of the TV series.\n\nThe episode is divided into two parts. Part A consists of Sakurai going over to Morioka's apartment in order to build her a new computer. In part B, Morioka has a dream where she and all her real life friends are characters in Fruits de Mer.","img":"https://cdn.myanimelist.net/images/anime/7/90115.webp"},{"title":"Selector Spread WIXOSS","synopsis":"Get ready for the thrilling second season of the WIXOSS series! Immerse yourself in a game where special cards called LRIGs—cards that possess personalities and wills of their own—can change your life forever. Teenager Ruko holds one of these rare cards, and if she wins, her wish will be granted. But what happens if she loses?\n\n(Source: FUNimation)","img":"https://cdn.myanimelist.net/images/anime/5/75495.webp"},{"title":".hack//Roots","synopsis":"After the termination of the incredibly popular virtual reality MMORPG \"The World,\" a new version of the game—The World R:2—is brought online. On his first day in the game, newcomer Haseo thinks he has made some friends to quest with. However, as if mocking his sentiments, they kill his character just for fun. Luckily, he is saved by a mysterious, one-armed player named Ovan who offers to show him around The World. \n\nAlongside Ovan and his cleric friend Shino, Haseo enjoys a wonderful first year in the game. But this peaceful life is shattered when Shino's character is killed by a familiar figure notoriously known as Tri-Edge, whose victims have all fallen into comas in the real world. In a fit of rage, Haseo vows to find the elusive Tri-Edge and kill him.\n\nTaking place during Haseo's first year in The World, .hack//Roots explores the friendships Haseo built in the game before Tri-Edge ripped them away.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/13050.webp"},{"title":"Quanzhi Gaoshou Specials","synopsis":"The All-Star Tournament is a three-day event that allows e-sports participants from various professional clubs to display their skills, while also giving casual Glory players the chance to interact with pros in the flesh.\n\nRetired top-tier Glory player Ye Xiu agrees to watch the tournament together with Tang Rou and Chen Guo after the latter manages to get ahold of three tickets. It is a strange sensation for Ye Xiu, as unlike previous occasions, this time he attends the tournament as a spectator, not a participant. However, despite his attempts to keep a low profile, events in the All-Star Tournament may force the former Glory legend back into the limelight.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1825/91514.webp"},{"title":"Chihayafuru 3","synopsis":"Winning the high school team tournament was a great accomplishment for the Mizusawa members. Each of them has made great strides in improving themselves, and the victory symbolizes how far they've come. But after accomplishing one goal, their individual aims are within reach. Chihaya Ayase has her sights set on Wakamiya Shinobu and the title of Queen, and now that Taichi Mashima has made it into Class A, he can finally compete against Arata Wataya. Everyone in Mizusawa wants to get better, and there's no telling what the future holds if they keep trying.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1590/102068.webp"},{"title":"Nakanohito Genome [Jikkyouchuu]","synopsis":"Iride Akatsuki has unlocked hidden content in the game he's playing, 'Nakanohito Genome,' and it turns out that this content is a real-life game!\nHe soon wakes up to find that he has been kidnapped and taken to a strange place, along with a number of other teammates. Each of them specializes in a certain sort of game, like cultivation games, fighting games, puzzle games, etc.\nA llama-headed 'teacher' gathers them after level 1 is cleared to explain how the game will proceed.\nWill this group of gamers succeed, and make it back to their real lives?\n\n(Source: MangaHelpers)","img":"https://cdn.myanimelist.net/images/anime/1725/102251.webp"},{"title":"Naruto Narutimate Hero 3: Tsuini Gekitotsu! Jounin vs. Genin!! Musabetsu Dairansen Taikai Kaisai!!","synopsis":"A contest is made by the Fifth Hokage called Jonin vs Genin. The point is to collect crystals for points, with the higher-ranked Chunin and Jonin holding crystals worth more points. The Genin have blue crystals, while the Chunin and Jonin have red crystals.\n\nThe video shows various fights between the Genin and Jonin, which each instance ending in the Jonin unknowingly losing their crystal (or discarding it).\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/10/11244.webp"},{"title":"Bakugan Battle Brawlers","synopsis":"Mysterious cards came down from the sky one day. Capable of summoning powerful creatures from another dimension, they became the centerpiece of a new game called Bakugan. The game gained instant popularity among children and teenagers, with the best of them competing in a worldwide ranking.\n\nMeanwhile, war for domination over Vestroia, the homeland of Bakugan cards, rages on. Invaded by the White Dragon Naga and his servants, the Doom Beings, the realm becomes increasingly destabilized. Dimensions begin to merge and many Bakugan players come to realize that their pastime is not merely a game.\n\nDanma Kuusou, one such Bakugan player, intends to become the World Ranking's leader someday. However, during one of his fights he experiences a vision of a clash in Vestroia. The fight suddenly moves to Earth, where Danma comes into possession of a talking, mighty fire Bakugan, Pyrus Dragonoid.\n\nHe soon gets dragged into the conflict, and together with his Bakugan Brawlers team, must traverse the dimensions and restore balance in a ravaged world.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/21568.webp"},{"title":"Nana Maru San Batsu","synopsis":"As soon as he entered high school, the first year student Koshiyama Shiki was invited to the mysterious Quiz Study Group led by his senpai. What will Shiki run into when being dragged along by his class mate Mari into the dazzling world of competitive quizzes?!\n\n(Source: Comic Walker)","img":"https://cdn.myanimelist.net/images/anime/9/86731.webp"},{"title":".hack//Tasogare no Udewa Densetsu","synopsis":"Winning the legendary characters \"Kite\" and \"Black Rose\" from an event held by the creators of the MMORPG \"The World,\" Shugo and his twin sister Rena steps into \"The World.\" Together they completed events and quests, along with their new friends Ouka, Mirelle, Hotaru, and Sanjuro. Soon after, mysterious monsters appeared, and death by these monsters caused players to slip into a coma in the real world. Only Shugo and Rena can solve this problem, but why are they being targeted, and what secrets is the game hiding?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/78321.webp"},{"title":"Yu☆Gi☆Oh!: Hikari no Pyramid","synopsis":"Anubis, an ancient Egyptian evil that was defeated by Yugi's alter ego centuries ago, has returned to exact revenge. Wielding the power of the Eighth Millennium Item, Anubis is determined to destroy Yugi and take over the world.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/76911.webp"},{"title":"Phantasy Star Online 2 The Animation","synopsis":"In the year 2027, the video game Phantasy Star Online 2 is all the rage at Seiga Academy. Every student is on board the fad—except for Itsuki Tachibana, a well-rounded student who doesn't play video games. Due to its popularity, the game is currently under review at Seiga Academy to see if it has a negative impact on the students. Consequently, this causes Itsuki to catch the attention of Rina Izumi, the perfectionist student council president who aims to prove that the game is not to blame. \n\nTo accomplish her objective, Rina recruits Itsuki as the student council vice president and tasks him with learning to play the game while keeping his grades up. Now obliged to report his daily findings of the game to Rina and analyze its merits, Itsuki carries the fate of Phantasy Star Online 2 in his hands.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/78120.webp"},{"title":"Accel World: Infinite∞Burst","synopsis":"In 2046, many aspects of life are carried out on a virtual network. No matter how advanced the time becomes, however, bullying never disappears. Haruyuki is one of the bullied students. However, one day he is contacted by Kuroyukihime, the most famous person in the school. \"Wouldn't you like to 'accelerate' and go further ahead, boy?\" Haruyuki is introduced to the \"Accel World\" and decides to fight as Kuroyukihime's knight.\n\n(Source: Official site)","img":"https://cdn.myanimelist.net/images/anime/5/87145.webp"},{"title":"High Score Girl II","synopsis":"The year is 1996, and second-year high school students Haruo Yaguchi, Akira Oono, and Koharu Hidaka live their lives as passionately about video games as they were five years ago. Brought together by arcade games, what began as a healthy rivalry and friendship has turned into something more. As they endeavour towards understanding their unfamiliar feelings, they work with allies, navigate high school, and find that, although life has its many challenges, there's always a game or two they can rely on.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1560/99904.webp"},{"title":"Pokemon Sun &amp; Moon","synopsis":"After his mother wins a free trip to the islands, Pokemon trainer Satoshi and his partner Pikachu head for Melemele Island of the beautiful Alola region, which is filled with lots of new Pokemon and even variations of familiar faces. Eager to explore the island, Satoshi and Pikachu run wild with excitement, quickly losing their way while chasing after a Pokemon. The pair eventually stumbles upon the Pokemon School, an institution where students come to learn more about these fascinating creatures.\n\nAt the school, when he and one of the students—the no-nonsense Kaki—have a run-in with the nefarious thugs of Team Skull, Satoshi discovers the overwhelming might of the Z-Moves, powerful attacks originating from the Alola region that require the trainer and Pokemon to be in sync. Later that night, he and Pikachu have an encounter with the guardian deity Pokemon of Melemele Island, the mysterious Kapu Kokeko. The Pokemon of legend bestows upon them a Z-Ring, a necessary tool in using the Z-Moves. Dazzled by his earlier battle and now in possession of a Z-Ring, Satoshi and Pikachu decide to stay behind in the Alola Region to learn and master the strength of these powerful new attacks.\n\nEnrolling in the Pokemon School, Satoshi is joined by classmates such as Lillie, who loves Pokemon but cannot bring herself to touch them, Kaki, and many others. Between attending classes, fending off the pesky Team Rocket—who themselves have arrived in Alola to pave the way for their organization's future plans—and taking on the Island Challenge that is necessary to master the Z-Moves, Satoshi and Pikachu are in for an exciting new adventure.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/84673.webp"},{"title":"Overlord Movie 1: Fushisha no Ou","synopsis":"First Overlord recap film.","img":"https://cdn.myanimelist.net/images/anime/12/87759.webp"},{"title":"D-Frag!*","synopsis":"After Sakura Mizukami shows up at the Kazama household to ask for a favor, Kenji Kazama and his sister Noe end up unwillingly participating in a footrace at the local shrine. Intent on winning the prize—spring water that only appears once per year—Sakura recruited the Kazama siblings to guarantee her victory. But when Sakura's clubmates, Chitose Karasuyama and Roka Shibasaki, enter the race as well, the girls' competitive energy is unleashed and the contest immediately develops into an all out battle where no victor is certain. What's more, Noe, fed up with Sakura's constant teasing, has no interest in helping her win, and the battle rages not only on the field, but between the divided team members.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/67077.webp"},{"title":"Quanzhi Gaoshou 2nd Season","synopsis":"A continuation of Quanzhi Gaoshou series.","img":"https://cdn.myanimelist.net/images/anime/1296/101468.webp"},{"title":"Lostorage Incited WIXOSS","synopsis":"High school student Homura Suzuko has returned to Ikebukuro, the town where she grew up.\n\n\"We're friends forever!\" She treasures her memories of her old friend from when she was little, Morikawa Chinatsu, and she's excited at the prospect of meeting her again.\n\nBut when she gets to school, she finds she has trouble fitting in with the rest of the class.\n\nOne day, she decides that if she learns to play the card game WIXOSS, she might be able to make some friends. She stops at a card shop on her way home and buys a deck set. When she takes the set home and opens it, the girl on one of the cards begins to move, and speak.\n\n\"Welcome, Selector.\"\n\nHumans chosen as Selectors must battle for control of the five coins that hold all their memories.\n\nIf they can retake all the coins, they win, and can leave the game. But if they lose, as a penalty—\n\n\"Lostorage\"—What will become of Suzuko as she's caught up in this insane game?\n\nAnd just like Suzuko, Chinatsu finds herself drawn into the game as well...\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/3/82289.webp"},{"title":"Yu☆Gi☆Oh! Zexal","synopsis":"Yu☆Gi☆Oh! Zexal follows the adventures of Yuuma Tsukumo in his hometown, the futuristic city of Heartland. Yuuma is an amateur duelist who wants to become the world's greatest Duel Monsters champion, having learned the basics of dueling from his father who disappeared long ago under mysterious circumstances. Always pushing himself to the limit in order to prove himself, Yuuma soon finds himself outmatched when dueling a bully to recover his friend's stolen cards. Just as hope seems lost, a mysterious spirit named Astral appears and helps Yuuma to win the duel.\n\nAstral explains that his memories have been lost and split into 99 cards called Numbers that have been scattered all over the world. These Numbers are extremely dangerous; each card has a will of its own and can possess any duelist who uses it by bringing out the deepest, and often darkest, desires of that person's heart. Seeing that Astral is a skilled duelist and wanting to better himself, Yuuma reluctantly agrees to assist Astral in recovering the Numbers. But Yuuma and Astral are not the only Number Hunters out there and many of the other parties seeking these powerful cards have much more malicious desires than recovering lost memories.","img":"https://cdn.myanimelist.net/images/anime/4/40295.webp"},{"title":"Log Horizon: Entaku Houkai","synopsis":"Third season of Log Horizon.","img":"https://cdn.myanimelist.net/images/anime/1072/105551.webp"},{"title":"Yu☆Gi☆Oh! The Dark Side of Dimensions","synopsis":"Set six months after the events of the original Yu-Gi-Oh! manga, Yuugi Mutou and his friends are in their final year of high school and are talking about what they will do in the future. Meanwhile, Seto Kaiba has commissioned an excavation to retrieve the disassembled Millennium Puzzle from the ruins of the \"Shrine of the Underworld.\" The item had previously housed the soul of his rival, Atem, whom he hopes to revive in order to settle their score. The excavation is interrupted by a mysterious man, who faces Kaiba in a game of \"Magic &amp; Wizards\" and steals two pieces of the recovered Puzzle. What is his ulterior motive?\n\n(Source: Wikipedia, edited)","img":"https://cdn.myanimelist.net/images/anime/12/77614.webp"},{"title":"Overlord Movie 2: Shikkoku no Eiyuu","synopsis":"Second Overlord recap film.","img":"https://cdn.myanimelist.net/images/anime/5/87758.webp"},{"title":"Phi Brain: Kami no Puzzle - Orpheus Order-hen","synopsis":"The puzzles get tougher and even more deadly as Kaito Daimon continues his battle against the power hungry Givers of the POG. And with one team member already switching sides, will Kaito have what it takes to keep solving the deadly puzzle traps put before him and reach the fabled Puzzle of God? More importantly, will he be able to solve the puzzles AND maintain his sanity? \n\n(Source: Sentai Filmworks) ","img":"https://cdn.myanimelist.net/images/anime/11/39033.webp"},{"title":"Yu☆Gi☆Oh! (Movie)","synopsis":"\"Blue Eyes White Dragon will bring victory\" while \"Red Eyes Black Dragon will bring the potential of victory\". A shy duelist stumbles upon the legendary Red Eyes Black Dragon, with that card in his possession, he must learn to bring out his confidence to duel.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/2114.webp"},{"title":"Yu☆Gi☆Oh! Arc-V","synopsis":"Action Duels, which allow duelists to soar and swing alongside their Duel Monsters, are taking the world by storm. Due to an evolutionary breakthrough, the \"Solid Vision\" system is now able to provide Duel Monsters with mass.\n\nYuuya Sakaki is Yuusho Sakaki's son, the latter being the founder of You Show Duel School in Miami City. Yuusho insists that duels are not a tool of war, but rather are to bring smiles to people and thus introduced the concept of Entertainment Dueling. However, at the height of his fame, Yuusho disappears and fails to attend his duel with Strong Ishijima, the Action Duel champion. Although scarred by this sudden leave, Yuuya vows to become an Entertainment Duelist like his father.\n\nSeveral years later, in the midst of a battle with Strong Ishijima, Yuuya's desperation to win brings forth a miracle. His pendant begins glowing, turning his cards into Pendulum Cards, which enables him to perform a Pendulum Summon—a summoning method unknown to the world and himself—gaining him fame overnight. As a result, Reiji Akaba, CEO of Leo Corporation and founder of the elite Leo Duel School, starts producing new Pendulum Cards to incorporate Pendulum Summoning into the system. Thus, the mysteries that surround Pendulum Summoning and Yuuya's father start to unravel, and Yuuya learns bit by bit what it takes to become an Entertainment Duelist.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/62939.webp"},{"title":"Cardfight!! Vanguard","synopsis":"Cardfight!! Vanguard features a world where the game Cardfight!! Vanguard is becoming the latest craze among trading card games, becoming a part of everyday life for people all over the world. The game is not limited to Earth alone; battles between the creatures used by the players take place on another planet called Cray.\n\nThe story begins with Aichi Sendou, a timid middle schooler whose meek attitude often leaves him a target for bullies. Aichi was given a very rare card, \"Blaster Blade\", when he was very young. It's his one treasure that gives him hope. That is, until it gets taken from him. Although Aichi has never played Cardfight!! Vanguard before, he challenges the thief to a game in order to win the \"Blaster Blade\" back. This high-stakes game quickly draws Aichi into the world of Vanguard battles, which will test and change his worth as both a player and a person. ","img":"https://cdn.myanimelist.net/images/anime/11/41625.webp"},{"title":"High Score Girl: Extra Stage","synopsis":"Four years after they first met, Haruo Yaguchi , Akira Oono, and Koharu Hidaka remain the best of friends. Tensions start to build up as Akira's teacher, Gouda Moemi, becomes stricter than ever before, and Hidaka develops feelings for Haruo. Though he may not be the most composed and thoughtful person around, he has within him the one thing that started it all: his unconditional love for video games.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1387/98053.webp"},{"title":"Bakugan Battle Brawlers: New Vestroia","synopsis":"After the final downfall of the rogue Bakugan Naga, peace was brought back to Vestroia. With the help of Danma Kuusou, his companion Pyrus Dragonoid, and other Battle Brawlers, the Infinity and Silent Cores were combined and the realm was recreated.\n\nHowever, New Vestroia will not be given any respite as humanoid alien invaders, the Vestals, arrive and conquer the Bakugan world in one fell swoop. Armed with a fearsome machine capable of restricting Bakugan into their ball forms, they aim to enslave the race as a form of entertainment.\n\nNow, the only force standing in their way is the Bakugan Battle Brawlers Resistance—a group of humans, Bakugan, and Vestals who oppose the idea of annihilating a sentient race. Led by Danma, they must venture into enemy-occupied New Vestroia and repel the invaders, to assure the survival of the entire world.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/17258.webp"},{"title":"Z/X: Ignition","synopsis":"The story is set in the not-so-distant future. Five \"Black Points\" suddenly appeared around the world as portals to parallel worlds. Immediately after, strange creatures began their invasion from these portals. These creatures are the inhabitants of five worlds—the same worlds in different timeframes. In order to ensure their own future timeframe survives, each of the five invasion forces battle to wipe the other future timeframes out. The key is one card-shaped device.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/56797.webp"},{"title":".hack//Quantum","synopsis":"Tobias, Mary, and Sakuya challenge the impregnable \"The One Sin\", but they lose their way in the maze and unintentionally trap other guild members. A mysterious cat is watching their blunder. Is it another player character or NPC? ","img":"https://cdn.myanimelist.net/images/anime/5/28371.webp"},{"title":"Yu☆Gi☆Oh! Movie: Chou Yuugou! Toki wo Koeta Kizuna","synopsis":"While riding with Jack Atlas and Crow Hogan, Yuusei Fudou's Stardust Dragon is captured by Paradox, a mysterious Turbo Duelist from the future, during a Turbo Duel and turned into a Sin Monster. With the help of the Crimson Dragon, Yuusei chases after Paradox as he enters a time slip, ending up in the past. During this time, Paradox duels against Jaden Yuki, who is still able to use the powers of Yubel and The Supreme King. However, by this time Paradox had also captured Cyber End Dragon and Rainbow Dragon and overwhelms Jaden. He is saved thanks to Yuusei and the Crimson Dragon. Jaden informs Yuusei of Paradox's true intentions. By stealing various monsters from across time and turning them dark, he plans to kill Maximillion Pegasus, the creator of Duel Monsters, preventing the game from being created and causing the events of all three series to never happen.\n\nYuusei and Jaden agree to pursue Paradox, which leads them to the past and causes a meeting with the King of Games, Yuugi Mutou. However, by the time Yuusei and Jaden arrive, Paradox had already attacked his time, supposedly killing both Pegasus and Yuugi's grandpa, and had also managed to steal Blue-Eyes White Dragon and Red-Eyes Black Dragon. After explaining everything to Yuugi, he agrees to fight with Yuusei and Jaden against Paradox in the ultimate three-on-one duel to free the trapped monsters and save both the world and time itself before it's too late.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/3/30085.webp"},{"title":"Stella no Mahou","synopsis":"Upon enrolling in high school, Tamaki Honda joins a club for making doujin games known as the SNS Club. Joined by programmer Shiina, writer Ayame, and composer Kayo, Tamaki begins working as an illustrator for the club's next game.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/3/81471.webp"},{"title":"Rio: Rainbow Gate!","synopsis":"The \"Howard Resort Hotel\" is an entertainment destination where people gather from around the world to grab huge fortunes. In the casino is a beautiful female dealer named Rio Rollins, known far and wide as the \"Goddess of Victory\".\n\nIn order to approach closer to her mother, one of history's greatest dealers, she does battle to gather up the legendary cards called \"gates\". Those who gather all 13 gate cards are presented with the title MVCD (Most Valuable Casino Dealer), proof that they are a top dealer.\n\nSet in a vast resort, an exciting battle begins with rival dealers that'll take your breath away! Throw in some \"supreme comedy\" and a story that makes you cry when you least expect it, these cute and sexy girls will explode off your screen! With everyone's cheer of \"Leave it to Rio!\", Lady Luck'll be with you, too!","img":"https://cdn.myanimelist.net/images/anime/6/27707.webp"},{"title":"Phi Brain: Kami no Puzzle - Shukuteki! Rätsel-hen","synopsis":"\"Are puzzles really necessary in this world?\"\n\nIn order to restore Jin's memory, Kaito and his friends go on a puzzle-viewing journey to England. As they're walking through the underground maze beneath the church, where young Kaito and Rook first met Jin, a mysterious girl appears in front of them.\n\nJin calls the girl by the name \"Raetsel\". It seems they know each other. However, she suddenly disappears and takes Jin with her. What's more, the traps in the underground maze are activated and start coming after Kaito and his friends.\n\n(Source: www9.nhk.or.jp)","img":"https://cdn.myanimelist.net/images/anime/12/54099.webp"},{"title":"Pokemon Generations","synopsis":"Pokémon Generations revisits each generation of the Pokémon video game series to shed new light on some timeless moments. From the earliest days in the Kanto region to the splendor of the Kalos region, go behind the scenes and witness Pokémon history with new eyes!\n\n(Source: Official site)","img":"https://cdn.myanimelist.net/images/anime/11/83210.webp"},{"title":".hack//Liminality","synopsis":"While playing the newly released MMORPG \"The World,\" Minase Mai and Tomonari Kasumi collapsed in the real world and were sent to the hospital after hearing a mysterious sound. Only Mai had recovered while her friend Kasumi had slipped into a mysterious coma. Mai is later approached by the creator of \"The World,\" Tokuoka Junichiro, who unveils to her that, just like her friend, six other players across the country had also collapsed while playing \"The World\" and are now in mysterious comas. What exactly is \"The World,\" what is this mysterious sound Mai keeps on hearing, and why are people slipping into comas from this game? Minase, Junichiro and their acquaintances set off to get to the bottom of this problem before any further harm happens.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/23079.webp"},{"title":"Saki Achiga-hen: Episode of Side-A","synopsis":"The Achiga Girls' Academy in Nara once defeated regional mahjong powerhouse Bansei High School. It advanced into the national team semifinals but lost to the eventual champion, and the mahjong club was later disbanded.\n\nSix years later, elementary school student Shizuno Takakamo befriends transfer student Nodoka Haramura. The two eventually enter Achiga Girls', but Nodoka transfers out of the school in the second year.\n\nWhen Shizuno sees Nodoka on television the following year as the national middle school individual mahjong champion, she decides to revive Achiga's mahjong club.","img":"https://cdn.myanimelist.net/images/anime/8/75513.webp"},{"title":"Rockman.EXE","synopsis":"In the year of 20XX, a young boy by the name of Netto Hikari receives a very special gift as he enters the 5th grade. His very own customized net navi, Rockman! Despite Rockman's small size and far more responsible personality, the two boys quickly become the best of friends. A net navi is designed to guide his operator from the inside of his or her PErsonal Terminal, or simply PET for short. Children and adults alike enjoy friendly \"Net Battles\", where they spar their navis against each other to prove their worth. \n \n(Source: Official Site)","img":"https://cdn.myanimelist.net/images/anime/2/26575.webp"},{"title":".hack//G.U. Trilogy","synopsis":"Based on the CyberConnect2 HIT GAME, now will be released in a CG Movie!\n\nThe Movie will be placed in the storyline of each .hack//G.U. games trilogy. The story follows Haseo, a player in the online MMORPG called The World:R2 at first depicted as a PKK (Player Killer Killer) known as the \"Terror of Death\", a former member of the disbanded Twilight Brigade guild. Haseo encounters Azure Kite (believing him to be Tri-Edge and blaming him for what happened to Shino) but is hopelessly outmatched. Azure Kite easily defeats Haseo and Data Drains him, reducing his level from 133 to 1 and leaving him without any items, weapons, or member addresses. He is left with a mystery on his hands as to the nature of the Data Drain and why Azure Kite is in possession of such a skill.\n\nEventually Haseo gains the \"Avatar\" of Skeith. Acquiring the ability to call Skeith and wield his abilities, such as Data Drain. With Skeith as his strength, Haseo begins the quest for a way to save Shino.\n\nHe is seen seeking out a PK (Player Killer) known as Tri-Edge, whose victims supposedly are unable to return to The World after he PKs them. Haseo's friend, Shino, was attacked six months prior to the events of the game by Tri-Edge, and the player herself, Shino Nanao, was left in a coma.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/4/23083.webp"},{"title":"Sword Art Online: Alicization - War of Underworld Reflection","synopsis":"Recap of Sword Art Online: Alicization, aired one week before Sword Art Online: Alicization - War of Underworld.","img":"https://cdn.myanimelist.net/images/anime/1072/103398.webp"},{"title":"Houkago Saikoro Club","synopsis":"Miki Takekasa is an introverted high schooler who does not socialize with her classmates. However, she wants to know what \"fun\" really is, waiting for someone who could help her understand its true meaning. One day after school, she crosses paths with her classmate Aya Takayashiki, who takes her on a little adventure. Miki discovers wonders she had never seen before, opening a way to change her withdrawn life.\n\nOn their way home, Miki and Aya see their class representative Midori Oono entering Saikoro Club, a store specializing in board games. After trying out a German board game, Miki soon understands the kind of fun she had been looking for: playing various games after school along with the friends and acquaintances she makes from her newfound pleasure.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1757/102526.webp"},{"title":"Yu☆Gi☆Oh! VRAINS","synopsis":"In the city of Den City, thousands of duelists take part in a virtual reality space known as Link Vrains, where users can create unique avatars and participate in games of Duel Monsters with each other. As a mysterious hacker organisation known as the Knights of Hanoi threaten this world, a high-school student named Yusaku Fujiki battles against them under the guise of Playmaker. \n\nOne day, Yusaku encounters a peculiar artificial intelligence program, which he names Ai, who sets off a digital maelstrom in Link Vrains known as the Data Storm. As the appearance of this storm gives birth to Speed Duels, in which duelists surf the wind as they duel, Yusaku battles against Hanoi in order to uncover the truth concerning an incident that happened to him years ago.\n\n(Source: ASCII.jp)","img":"https://cdn.myanimelist.net/images/anime/1789/101971.webp"},{"title":"Saki Zenkoku-hen","synopsis":"Sequel to the Saki series covering the Inter High School Mahjong Championships.","img":"https://cdn.myanimelist.net/images/anime/12/57979.webp"},{"title":"Shion no Ou","synopsis":"Shion no Ou follows the story of Yasuoka Shion, a 13-year-old Shougi player with a past of tragedy. Shion's parents were brutally murdered in front of her when she was 5 years old. The murderer sat down with her and challenged her to a game of Shougi, after telling her that if she wanted to stay alive she should forget how to speak, and forget what happened that night. \n\nNow Shion has entered the realm of female pro Kishi, mute but strong. As her playing gathers more and more attention, so do the questions about her past and the brutal murder she witnessed. Shion's memories slowly come back, and the mystery begins to unravel, thread by thread. ","img":"https://cdn.myanimelist.net/images/anime/5/74050.webp"},{"title":"Bakugan Battle Brawlers: Gundalian Invaders","synopsis":"Bakugan Interspace is a virtual reality system, where players can brawl against each other and take part in tournaments. Initially designed to help practice and enhance Bakugan skills, it quickly became a meeting place for many enthusiasts. During one of Danma Kuusou's duels, the Interspace crashes, and he gets knocked out cold. Before regaining consciousness, he experiences a vision of Bakugan at war with each other once again.\n\nThe explosion of energy that accompanied Danma's fight and caused the shutdown of the system sends shock waves across the galaxy, attracting the attention of the Twelve Orders, a Gundalian organization. They infiltrate Bakugan Interspace, looking for strong brawlers to join them in their upcoming war with another alien race, the Neathians.\n\nDanma and his companions—Shun Kazami and Chouji Marukura—soon find themselves caught up in an extraterrestrial war. However, distant as it may seem, the conflict threatens the very sovereignty of Earth and the future of the Bakugan race as well.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/32189.webp"},{"title":"Bakugan Battle Brawlers: Mechtanium Surge","synopsis":"After returning from the feuding realms of Gundalia and Neathia, Danma Kuusou and his companions continue their lives on Earth. Now, a year later, the virtual reality world of Bakugan Interspace has finally recovered from the alien invasion and has once again become a place for brawlers to gather and challenge themselves.\n\nIt turns out, however, that whenever Danma's Bakugan, Pyrus Dragonoid, unleashes his might in battle, the Interspace experiences new disruptions. Unable to harness the incredible powers granted to him by Code Eve—the Bakugan Mother spirit—he struggles to maintain control over the Mechtogan contained within him. When it goes out of control, the mysterious mechanical entity wreaks havoc on the battlefield, attacking friends and foes alike.\n\nTo make matters worse, Bakugan Interspace is at risk of being infiltrated again. An unknown mastermind is sending mutated Chaos Bakugan into the system in order to brainwash brawlers and take control of the virtual realm. In anticipation of the inevitable confrontation, Danma must find a way to keep the Mechtogan's destructive force at bay and rally the Battle Brawlers once again.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/82083.webp"},{"title":"Sword Art Online Alternative: Gun Gale Online - Refrain","synopsis":"Following the conclusion of the first ever Squad Jam, Pitohui is eager to see what she missed, dying to know how everything went down. To satiate her desires, M reviews footage of the competition with her, commentating on the trials that he and LLENN faced together.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1736/92711.webp"},{"title":"Yu☆Gi☆Oh! Zexal Second","synopsis":"The continuation of Yu-Gi-Oh! Zexal. \n\nA new enemy has been revealed - Barian. They wish to gather the \"Numbers\" and destroy the Astral World to avoid their own world's destruction. As such, Yuma and his friends are their prime target, and the Barian begin to slowly enter Heartland City.","img":"https://cdn.myanimelist.net/images/anime/5/43491.webp"},{"title":"Lostorage Conflated WIXOSS","synopsis":"The peaceful days turn out to be short-lived as the shadow of another Selector Battle looms large. Kiyoi Mizushima is the first to notice that things are amiss, and she makes her move to put an end to the cycle of darkness.The Battle this time includes a new card, \"Key,\" and has been set up with rules different than before. With both the mastermind and their motive shrouded in mystery, the darkness grows ever deeper and more menacing. Suzuko Homura, Chinatsu Morishita, Hanna Mikage, Ruuko Kominato, Yuzuki Kurebayashi, Hitoe Uemura, and Akira Aoi, the Selectors gather once again.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1558/90899.webp"},{"title":".hack//Unison","synopsis":"Somewhere in the MMORPG called \"The World,\" a group is gathered at a pub, awaiting the start of an event. There, old friends and acquaintances are reunited, including those who rarely log on. Some are even forging new relationships for the first time. Together, invited by the hacker Helba, the group leaves for the event in the Net Slums where a celebration awaits them all.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/23078.webp"}]