[{"title":"Sweet Home: H na Oneesan wa Suki Desu ka?","synopsis":"Ryuichi is a university student. He used to live alone and enjoyed his school life. But one day, his apartment was destroyed by a fire.... He reluctantly comes back to his house. But his house has been changed to a boarding house for girls...! It seems there is no place for him to live. But they all allow him to stay there together! His new life begins like this....\n\n(Source: Himeya Shop)","img":"https://cdn.myanimelist.net/images/anime/10/36317.webp"},{"title":"_Summer","synopsis":"“Is there any girl you love?”\n\nBy this word his friend asked during the school excursion, the protagonist, Kaizu Takumi, begins to aware of his interest in opposite sex. Of course, there are girls around him, for example, his childhood friend, Hatano Konami, his classmate, Ebizuka Shino, a school idol, Shimazu Kakana, etc. However, he himself hasn’t noticed his feelings until he is asked by his friend. He becomes anxious seeing his friend try to find his girl friend, and he resolves his mind to find a girl friend during the last summer of his high school life.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/75131.webp"},{"title":"Peter Grill to Kenja no Jikan","synopsis":"Peter Grill is known throughout the land as the world's strongest fighter. He has a girlfriend who he's steadily trying to get closer with. Life is good for him. Until he realizes that dozens of women, who want to bear strong children, are all vying for his seed.\n\n(Source: LHTranslation)","img":"https://cdn.myanimelist.net/images/anime/1076/106693.webp"},{"title":"Lime-iro Senkitan","synopsis":"Around the the 37th year of the Meiji Era (1904), in the midst of the Russo-Japanese war, the small Japanese army, in need of assistance, uses its special flying (thanks to a benevolent demon) ship, the Amanohara, to attack Russia's major base at Port Arthur (Lushun).\n\nUmakai Shintaro, a Russian diplomat originally from Japan, defects and goes to Sapporo to teach at a girls academy. However, that girls academy is not typical—it is on board the Amanohara, and the five girls Shintaro teaches are known as the Raimu Unit—girls with the ability to summon powerful beings to fight for them. Shintaro eventually becomes their teacher and general in battle, and so the six embark on a weird and excessively erotic journey, as Shintaro helps the girls overcome their weaknesses, become stronger for the final stand at Lushun, and also understand the motives of the \"Russian Spiritual Corps\" that assist the opponent, which, unfortunately, has one member whom Shintaro knew well...\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/75503.webp"},{"title":"Koisuru Tenshi Angelique: Kagayaki no Ashita","synopsis":"Ange is now trapped in the Seijuu Universe, and cannot leave until she awakens Seijuu's Queen. In order to do this, she must gather nine new guardians. It sounds like a fairly simple task, but how can she convince these men to tear away from their own lives and protect the life of another?","img":"https://cdn.myanimelist.net/images/anime/11/76296.webp"},{"title":"Ore ga Suki nano wa Imouto dakedo Imouto ja Nai Specials","synopsis":"Special episodes bundled on the first 2 BD/DVD of the anime \"Ore ga Suki nano wa Imouto dakedo Imouto ja Nai\".","img":"https://cdn.myanimelist.net/images/anime/1642/100344.webp"},{"title":"Hanaukyou Maid-tai OVA","synopsis":"In this three-episode OVA, Taro learns more about Cynthia`s life as herself and her alter-ego Grace. He also undergoes training with his bodyguard Konoe. And finally, Ikuyo dupes Taro in spending a whole day disguised as a maid.  \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/3800.webp"},{"title":"Tayu Tayu","synopsis":"Anime adaptation of an adult manga by Yamatogawa.\n\nSince his parents moved abroad for business, Reiji was forced to live at his old place in the country side. When he decided to enjoy an open air bath, 2 female childhood friends notice him. That's where the story begins... \n\n(Source: BakaBT)","img":"https://cdn.myanimelist.net/images/anime/7/53203.webp"},{"title":"Happy☆Lesson: The Final","synopsis":"When Mitsuki learns that the highschool is going to destroy the old school building, she is saddened at the thought of so many memories being erased. Chitose and the rest of the moms spring into action to stop the demolition. During their efforts, Fumitsuki, Chitose, and Mitsuki finally realize their true feelings.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/75578.webp"},{"title":"Honoo no Haramase Tenkousei","synopsis":"The main character, Tatsuya Tagami, has an ambition of World Conquest, and the first step of his plan is to make every female classmate pregnant. Unfortunately, his dream is rather impossible in his all-boys school. Hence, he transfers himself to the newly reorganized Hakuka Co-Ed Academy, which was previously an all-girls school. \n\n(Source: ANN) \n","img":"https://cdn.myanimelist.net/images/anime/1198/104004.webp"},{"title":"Reunion","synopsis":"Yuji is on summer holiday, but he works hard at his uncle's house every day. There is a girl who often comes to the house. Her name is Saki and he soon falls in love with her.... Days later, he tells Saki that he loves her and they start dating. However, their relationship suddenly ends.... She does not appear in front of him anymore.... On the last day at his uncle's house, he sees a girl being chased by some men. He tries to ignore it, but she asks him for help. They somehow run away from them and rush into a deserted house. She is wet through.... To warm their bodies up, they finally sleep together.... After summer holiday, he meets two girls again.... One of them is a rookie teacher and the other is a classmate after suspension....\n\n(Source: ErogeShop)","img":"https://cdn.myanimelist.net/images/anime/13/29184.webp"},{"title":"Mashiro-iro Symphony: The Color of Lovers Picture Drama","synopsis":"DVD/BD specials of Mashiroiro Symphony: The Color of Lovers.","img":"https://cdn.myanimelist.net/images/anime/9/38265.webp"},{"title":"Shocking Pink!","synopsis":"A boy named similar to Zhuge Liang, from Romance of Three Kingdoms meets a girl who believe that she's a desendant of Liu Bei. She wants him to become her strategist. \n\n(Source: MU) ","img":"https://cdn.myanimelist.net/images/anime/6/62091.webp"},{"title":"Hand Maid May: Akiramemasen","synopsis":"Special episode.","img":"https://cdn.myanimelist.net/images/anime/3/34485.webp"},{"title":"To Heart: Remember My Memories","synopsis":"Time flies by; Hiroyuki and Akari are 12th-graders now. Both of them and their friends have grown up gradually in someway, physically or mentally, but one of their best friends is missing: the lifelike android Multi. To their surprise, Multi is brought to their campus again without notice, yet she is no longer the same Multi they have known. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/75475.webp"},{"title":"Uta no☆Prince-sama♪ Maji Love Kingdom Movie","synopsis":"Movie of Uta no☆Prince-sama♪ planned for 2019 release.","img":"https://cdn.myanimelist.net/images/anime/1685/102221.webp"},{"title":"Shinmai Maou no Testament Departures: Maria no Hizou Eizou","synopsis":"A special included on the Blu-ray/DVD volume. Super deformed versions of Mio and Maria narrate Basara's various erotic encounters.","img":"https://cdn.myanimelist.net/images/anime/1846/99644.webp"},{"title":"Tsuki wa Higashi ni Hi wa Nishi ni: Operation Sanctuary","synopsis":"Naoki Kuzumi, a junior in high school, had lost his parents in an accident five years ago, and is living with his aunt, uncle, and cousin Matsuri. He always thought his life was ordinary, besides the fact that he can't remember what happened in his youth. One sunny day as he is taking a nap on a bench, a redheaded girl -- Mikoto -- literally falls on him from the sky. For some reason, she thinks he's her younger brother. Naoki's time period is a temporal shelter for those in the future, when many are suffering from an incurable disease. When she heard her younger brother Yuusuke had been taken to Naoki's time, Mikoto herself had gone back in time.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/648.webp"},{"title":"1+2=Paradise","synopsis":"When Yuusuke awakens from a nightmare in which a demon warns him that women will be his downfall, he discovers that real life isn’t any better! Having a gynaecologist as a father, the poor boy is under pressure to overcome his irrational fear of women, and feisty twin sisters Yuka and Rika are on hand to give a helping hand. Using any method they can think of to seduce the red-faced boy, the racy competition soon heats up as busty Barako bounces onto the scene with an equal determination to seduce Yuusuke. Which of the horny heroines will win his heart, and more importantly, will he survive a non-stop onslaught of naked breasts, panties and bondage?\n\n(Source: anime-planet)","img":"https://cdn.myanimelist.net/images/anime/2/3679.webp"},{"title":"Gift: Eternal Rainbow - Ki no Saka Ryokan Kiki Ippatsu!!","synopsis":"Haruhiko, Riko, Yukari, Chisa and Rinka are trying to help Kirino save her family's inn from bankruptcy due to their newest rival, Hotel Moonstone. As a result, they decided that creating high-class cuisine was the best method in order to help the Konosaka Inn attract customers. However, in the process of creating this high-class cuisine Yukari, Chisa and Rinka mysteriously and instantaneously develop overpowering feelings towards Haruhiko and end up vigorously competing for him. Unfortunately, for Haruhiko this harem contains mixes of both heaven and hell.","img":"https://cdn.myanimelist.net/images/anime/13/25446.webp"},{"title":"Honoo no Haramase Oppai: Ero Appli Gakuen The Animation","synopsis":"Masato Majime has never been the popular type. Addicted to pornography, he has always been perceived as a weirdo and avoided by most people. Everything changes, however, when he saves a mysterious stray cat. It turns out that the cat is able to speak, and as a token of gratitude, she gives Majime the \"Smartphone of Love.\" Equipped with dozens of Ero-apps, the phone is able to activate events in real life, fulfilling every sex fantasy of its owner.\n\nArmed with his new powers, Majime seduces girls that would otherwise never even grace him with a look. He builds a harem of horny lovers, head-over-heels for their new master.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1809/104002.webp"},{"title":"Saber Marionette R","synopsis":"Jr., the heir of Romana and his battle sabers Cherry and Lime, who have girl circuits are enjoying their peaceful life in Romana. Suddenly, the evil Star-Face and his sexadolls attack Romana in order to take over so Star-Face can become the next High Official. In order to truly become the next High Official and ruler of Romana, he must first eliminate Jr. This begins a battle for, not only Jr.'s life, but for all of Romana.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/61075.webp"},{"title":"Honoo no Haramase Doukyuusei","synopsis":"Kazuya is a high school student. He is forced to move to a school dormitory because his parents have gone abroad on business, and they sold their house before leaving Japan. But, his school has no boys' dormitory, so he begins to live at a girls' dormitory. One day, he secretly peeks into the school sick-room while girls are under regular physical checkup, and he is surprised at their erotic breasts. He makes a vow to get their bodies and breasts....","img":"https://cdn.myanimelist.net/images/anime/10/13159.webp"},{"title":"Demon Busters: Ecchi na Ecchi na Demon Taiji The Animation","synopsis":"Kou is a member of the public morals committee at Moriyaji Gakuen, along with his childhood friend Ai and kouhai Karen. One day while he was making the rounds after school, he was attacked by a weird being. He was frozen in fear and could not evade its attack, but he was saved by two girls, Konoka and Lizera. They were ‘daemon busters’ who fight against daemons borne from the lust and cravings of humans. They told him that he was a kyuumashi who could absorb the desires that create daemons, and they asked for his help since his special ability makes their battles much easier. When he uses his ability, it causes him to be able to see girls naked and also makes them horny. If the daemons aren’t defeated, then their lust will cause the whole school to become an orgy. As part of the public morals committee, he can’t let that happen!\n\n(Source: Hau~ Omochikaeri!)","img":"https://cdn.myanimelist.net/images/anime/1112/104314.webp"},{"title":"Shoujo x Shoujo x Shoujo The Animation","synopsis":"After running away from his eccentric and cruel father and cutting all ties with his family, Kengo receives a desperate plea for help from the daughters of his father's concubines seven years later. He decides to return home to help them and face his past.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/39425.webp"},{"title":"Anata dake Konbanwa","synopsis":"Shougo has just arrived  town after he was ordered to do so since his grandfather has just died, her parents are busy with work so they told him to go first. Shougo will be the one to inherit all family assets.  Shougo arrives at the residence that will be his new home and he receives a great welcome by the beautiful maid Youko-san. A strange event happens at night, he dreams with someone but cannot really tell who it is, all he knows is that her face looks familiar... Next day he goes to his new school, her fiancé Ayano introduces to him telling him that it was something their parents decided on their own and that she has not accepted him yet, Shougo is in shock since he didn't know about this and many people are now jealous and angry at him since Ayano is the school's idol. Not everything is bad as he has a very warm welcome by a voluptuous beautiful teacher. \n\nLater a ghost appears before him, is the girl he saw in his dream last night, what does this means? All Shougo knows is that he has seen that girl before but where? ","img":"https://cdn.myanimelist.net/images/anime/7/15375.webp"},{"title":"To Heart 2 OVA","synopsis":"A collection of stories involving the girls of To Heart 2, with each episode focusing on a different character.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/74024.webp"},{"title":"D.C.S.S: Da Capo Second Season Omake","synopsis":"Based on the D.C.S.G. game/manga.\n\nThe story takes place 2 years after the happenings in the first series. A new, mysterious girl appears and attaches herself to Jun'ichi. Who is this new girl and which connection does she have to the Sakura on Hatsune Island.","img":"https://cdn.myanimelist.net/images/anime/9/8620.webp"},{"title":"Tensei Kendo no Harem Colosseo","synopsis":"Based on the light novel by Hisasi and Habara Tetsu.","img":"https://cdn.myanimelist.net/images/anime/11/88080.webp"},{"title":"Ikkyuu Nyuukon","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/7/88614.webp"},{"title":"Harukoi Otome","synopsis":"Based on the eroge visual novel Harukoi Otome ~En de Gokigenyou~ by BaseSon.","img":"https://cdn.myanimelist.net/images/anime/3/26846.webp"},{"title":"D.C. I&amp;II P.S.P. Re-Animated","synopsis":"An OVA bundled with a PSP game Da Capo: D.C. I &amp; II P.S.P. It features animated confession scenes for the four main heroines of the two games, Nemu, Kotori, Yume, and Otome. ","img":"https://cdn.myanimelist.net/images/anime/12/26017.webp"},{"title":"Haramasete Seiryuu-kun!","synopsis":"It seems that everyone is fighting over the main character Seiryu-kun's genes!! They've even made a competition out of it! However, little do they know of the suspicious plot behind the whole situation. In any case this is a crazy school love comedy adventure! An adventure of an upperclassman and her friend trying to be impregnated!\n\n(Source: dlsite)","img":"https://cdn.myanimelist.net/images/anime/11/29797.webp"},{"title":"Bakuretsu Hunters OVA","synopsis":"On the \"Spooner Continent\", a valiant group of Sorcerer Hunters are the people's last line of defense against the evil dark magiks unleashed periodically by those who can't control it. Saving the world and looking sexy while doing it!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1267/97321.webp"},{"title":"Kakyuusei 2: Hitomi no Naka no Shoujo-tachi","synopsis":" Many people have fond memories of meeting a certain teenage boy in their younger years. However, their ages vary widely, and each remembers him as a teen. This story follows the intricate intertwining of their various stories and how this young man, who apparently lives outside of time, has affected each of them. \n","img":"https://cdn.myanimelist.net/images/anime/11/3527.webp"},{"title":"Angelique","synopsis":"Angelique Limoges and Rosalia de Catargena have been chosen as candidates in a Queen Examination - a test to see who is better qualified to be the next Queen of the cosmos. For this special examination, both girls are given their own continent on a planet. The girls must raise the continents into thriving civilizations and environments. Nine Guardians (who control various elements, such as fire, wind, and water) have been chosen to help the girls raise their continents during the Queen Examination.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1479/94792.webp"},{"title":"Shina Dark: Kuroki Tsuki no Ou to Souheki no Tsuki no Himegimi","synopsis":"Music video based on a seinen manga by Nakayama Bunjuurou serialised in Dengeki Daioh.\n\nThe series revolves around the legendary demon lord Exoda Zero Crown whom has been revived when an eclipse forms the Exoda Ring and the demonic island, Shina Dark, rises once again. Kingdoms and villages from around the world send over a thousand sacrificial maidens to the island in an attempt to satisfy the demon lord's legendary lust and protect their lands from the unspeakable destruction he will bring. However, the legends are false, Exoda does not possess such lust, and is not interested in destroying the world. He's quite happy to live in peace and go fishing on the weekends. More than one thousand girls on his island are now unable to return to their homelands, as by coming to Shina Dark, they are seen to be tainted brides of Exoda by others. As a result, Exoda decided to create a nation to give the abandoned girls a new life in a new country, Shina Dark. \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/11/6288.webp"},{"title":"Tenchi Muyou! Ryououki 4th Season","synopsis":"The entire Jurai and Masaki family is in a celebratory mood as Nobuyuki and Rea are finally tying the knot! In the days leading up to his father's wedding, Tenchi reunites with those he met throughout his journey as well as gets acquainted with some new family members. Though this is a blissful time where everyone is finally together, there is one major bump in the road: Rea holds a major secret that will change the fate of her future child and disturb the balance of the Masaki family. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/81932.webp"},{"title":"Love♥Love? Specials","synopsis":"DVD Special containing:\n\nRhapsody of July (DVD Episode 2.5)\nIf it becomes September (DVD Episode 3.5)\nBitch Actress dropped into Hell (DVD Episode 5.5)\nHistory is Made Through Women (DVD Episode 9.5)","img":"https://cdn.myanimelist.net/images/anime/7/36569.webp"},{"title":"Dual! Parallel Runrun Monogatari Special;","synopsis":"Peace has been brought to both earths, and everyone is living out their lives as normal citizens. But how normal could life be for war hero Kazuki living with five beautiful women under the same roof... Apparently, he doesn't need to wait long to find out. An ancient artifact that is the key to their adventures in the parallel universes forces Kazuki to hop in the saddle yet again, but this time it's outer space or bust. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/26319.webp"},{"title":"Guren","synopsis":"In a world where demons lurk behind every shadow, ready to ravage any woman who crosses their path, murder and bloodshed are a way of life. A team of feisty female fighters known as the Crimson Lotus is humanity's last hope for survival. When tragedy strikes and one of their members is slaughtered, it's time for the Crimson Lotus to destroy the demons at their source, and bathe the underworld in the blood of vengeance!","img":"https://cdn.myanimelist.net/images/anime/4/24440.webp"},{"title":"Honoo no Haramase Motto! Hatsuiku! Karada Sokutei 2","synopsis":"Kazama is a lewd, stupid but a good young man who loves fighting.\nHe is suddenly entrusted with the public health doctor, on behalf of the original fighting girls school, St. Versus Institute.\nWeapons, physical fitness, it's only 1 school that specializes in such fighting, and development management has also been a school regulations.\nIn other words, he must perform a sexual harassment based on ''body measurements'', in the name of the school rules.\nSt. Versus a institute that is miraculously running through many childhood friends.\nWe want to control the school to stand on top of the fighting world in body measurement.\nIf whether ''resistance'', like conquered the fighting community and school.\nSwinging a page of boobs idol photo book, which has just been watching.\nTo back the setting sun coming through the curtain, Finally vowed to firmly resolve to hot meat stick of groin!!\n\nBut the question is.. will it actually work?\n\n(Source: VNDB)","img":"https://cdn.myanimelist.net/images/anime/11/75972.webp"},{"title":"Makai Tenshi Djibril 3","synopsis":"Naoto lives a peaceful life after he saved Rika. But one day, the Misty May suddenly appears and Hikari is abducted by her. They are depressed because they can do nothing.... When he has a bath at night, a girl, Nagi, suddenly appears in front of him. Actually, Nagi is an android. One the next day, the Misty May appears again. Rika has a battle against her and Naoto makes up his mind to have sex with Nagi to save Rika...?\n\n(Source: Himeya Shop)","img":"https://cdn.myanimelist.net/images/anime/2/16872.webp"},{"title":"Koihime","synopsis":"When Musashi returns to his childhood home, he rekindles friendships with four beautiful young women from his youth that he'd totally forgotten about. Hidden desires give way to supernatural secrets, though, as Musashi discovers that the village he remembers hides a terrible secret that he never even imagined. Can love really conquer all? \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/12/3658.webp"},{"title":"Madonna: Kanjuku Body Collection","synopsis":"Huge breasts are justice! Mature women are my fantasy!\n\nWhy make them so erotic?\nScattering their pheromones as they walk.\n\"Do as you please\" is their catchphrase.\n\nMy body won't be able to last any longer if this continues everyday.\nIf that's the case I'll better move out of this apartment and start living the life of a proper student.\nAnd the day I made up my mind on this, a new manager for the apartment arrived.\n\n(Source: Getchu)","img":"https://cdn.myanimelist.net/images/anime/1830/104259.webp"},{"title":"To Heart 2 Adnext","synopsis":"The first and the second volume will feature Komaki Manaka and Kusakabe Yuuki, respectively.","img":"https://cdn.myanimelist.net/images/anime/8/75477.webp"},{"title":"Joshi Luck!","synopsis":"A guy by the name of Kuroda-sensei is given a job as the new coach/adviser of the girls lacrosse club in a all female school called Felinus Academy for Girls but... it turns out to be a bumpy ride as he encounters sex fiends among the squad, and his adventures begins as he attempts to gain their respect as adviser.\n \n(Source: MU)","img":"https://cdn.myanimelist.net/images/anime/1619/103703.webp"},{"title":"Ane Chijo♥Max Heart","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1530/103704.webp"},{"title":"Kindan no Byoutou The Animation","synopsis":"Based on the erotic game by Atelier Kaguya Team Heartbeat.","img":"https://cdn.myanimelist.net/images/anime/1820/104143.webp"},{"title":"Jaku-Chara Tomozaki-kun","synopsis":"Tomozaki is one of the best gamers in Japan, and in his opinion, the game of real life is one of the worst. No clear-cut rules for success, horribly balanced, and nothing makes sense. But then he meets a gamer who's just as good as him, and she offers to teach him a few exploits...\n\n(Source: Yen Press)","img":"https://cdn.myanimelist.net/images/anime/1078/103503.webp"},{"title":"Kakyuusei (TV)","synopsis":"When Tsuyoshi rushed to school as usual, he found a girl who tried to help a kitten which couldn't get down from a tree. It was Minamizato Ai who had loved Tsuyoshi secretly for a long time.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/8/84837.webp"},{"title":"Yobai Suru Shichinin no Harame","synopsis":"Based on the adult game by Guilty.","img":"https://cdn.myanimelist.net/images/anime/13/67761.webp"},{"title":"Lime-iro Ryuukitan X","synopsis":"It was Meiji 38 (1905), the Russo-Japanese War that had begun since the previous year was getting hard. In this severe circumstance, they reorganized the Raimu Squad. The members of the Raimu Squad were the girls. They were just like other ordinary girls who went to schools and yearned for love, except that they had \"Raimu.\"\n\nInukai Tsuyoshiro was a young man who was newly chosen to be the leader of the squad. He was ambitious to fight for Japan.\n\nWhen the young man met the five girls, the new chapter of \"Raimu\" began.\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/6/75504.webp"},{"title":"Maid-san to Boin Damashii","synopsis":"The head maid of a rich household wants to retire and choose someone else to replace her. Before she goes however, she decides to give her young master a farewell gift in the form of a hot sex session, followed by interviewing new potential maid recruits with another sex session. Can't complain.","img":"https://cdn.myanimelist.net/images/anime/1184/104289.webp"},{"title":"Guardian Hearts-Power UP!","synopsis":"Sequel to the madcap Guardian Hearts OVA series, continuing with Kazuya's misadventures. ","img":"https://cdn.myanimelist.net/images/anime/5/5175.webp"},{"title":"Happy☆Lesson: Hoka Hoka★Kanna to Futari Kiri","synopsis":"Special episode.\n\nKanna strikes back with her plan to capture Chitose, this time getting rid off all the obstacles (mothers, sisters, Fumitsuki) - sending them off on trip to hot springs. Now, what will happen to Chitose when he is alone in home with Kanna?","img":"https://cdn.myanimelist.net/images/anime/3/18198.webp"},{"title":"Sakura Taisen: Ecole de Paris","synopsis":"An unseen evil lurks in the streets of Paris. Unless something is done, the darkness will unleash its destruction and consume all that is good. The City of Love will be lost to her people forever. All hope rests within the hearts of five young ladies. The only problem is, they don't even know it yet. But will an apprenticed nun, a reserved aristocrat, a hardened criminal, a traveling circus emcee and a Japanese girl experiencing loss set aside their unique differences and come together as one for the defense of many. The Paris Fighting Troup is born. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/25434.webp"},{"title":"Binetsukko ♭37℃ The Animation","synopsis":"Mutsumi Kagidou finds herself being blackmailed by a perverted student, Inuhiko. The blackmail material? An embarrassing photo of her. In order to get the photo back, she becomes Inuhiko's sex slave and they have all kinds of debauched sex. After a while though, Mustumi tells Inuhiko to forget about the photo since she doesn't mind being his sex slave anymore. And so, a 'unique' relationship is formed between the two of them. \n\n(Source: BakaBT)","img":"https://cdn.myanimelist.net/images/anime/1946/103888.webp"},{"title":"_Summer Specials","synopsis":"Short specials involving the characters from the main series.","img":"https://cdn.myanimelist.net/images/anime/3/75133.webp"},{"title":"Elf-ban Kakyuusei: Anata dake wo Mitsumete...","synopsis":"High school students Mizuho Yuuki and Miko Kamiyama are best friends. Miko likes fellow classmate Tohru Nagase. Mizuho is determined not to get in the way of their budding relationship. But underclassmate Ai Minamizato also likes Tohru. Tohru must decide which girl he likes the most. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/20194.webp"},{"title":"To Heart Omake","synopsis":"Six short \"Special Broadcasts\" (omake) were produced and aired after selected episodes. They lasted around five minutes and followed the general style of the main anime, although the characters are drawn as chibis.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/9/29923.webp"},{"title":"Angelique: Shiroi Tsubasa no Memoire","synopsis":"Angelique...\n...started as a dating simulation game for girls back in 1994 on the Super Famicom. The player took on the role of Angelique Limoges, an ordinary schoolgirl summoned to the Sanctuary of the Queen of the Cosmos. She had been chosen to compete in a contest to determine the next Queen. Angelique was clumsy and foolish in comparison to her rival, Rosalia de Cartagena, a refined girl who had been training since birth to compete in the Queen Examination.\n\nWhat was this Examination, anyway? The girls had to use the powers, or Sacrea, of the Queen's nine Guardians to cultivate a barren continent. The girl whose population reached the center island connecting the two continents would become the next Queen. But with the nine handsome Guardians around, it was hard to decide between power or love...\n\nMade up of 4 OVAs, each of which has multiple parts.\n\n(Source: Neo-Romance)","img":"https://cdn.myanimelist.net/images/anime/5/17872.webp"},{"title":"Wu Dong Qian Kun","synopsis":"The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\n\nHailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.\n\nWith a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\n\nArmed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\n\n(Source: Novel Updates)","img":"https://cdn.myanimelist.net/images/anime/1857/98299.webp"},{"title":"Meiji Tokyo Renka Movie 2: Hanakagami no Fantasia","synopsis":"Sequel to Meiji Tokyo Renka: Yumihari no Serenade, which follows Mei Ayazuki as she travels back in time and falls in love with historical figures.","img":"https://cdn.myanimelist.net/images/anime/9/79862.webp"},{"title":"Zoku Koihime","synopsis":"Musashi had come back to his village again. He had lost his memory about the four princesses who had been his childhood friends, and also forgot that he had sexual intercourse with them. Though he lost his memory, the village and his grand mother's house made him regain familiarity. He was welcomed at his grandmother's home, and met a girl named Tamamo. She said she was his childhood friend, but he couldn't recall her at all. At night, he was lured by a strange smell, and did things with Tamamo. However it was the beginning of the plot of a person who wanted to get revenge on the village leader using Musashi.\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/4/23814.webp"},{"title":"Kakyuusei 2: Anthology","synopsis":"Childhood friends, Rouma and Tamaki, are not just friends. Actually, they have sexual intercourse, but they're not lovers, either. One day, Tamaki gets angry with Rouma and announces to break with him because he didn't take contraception measure while they were doing things.\n\nHowever, because they belong to the same club, they have to meet. Seeing their cold attitudes, Yuuri tries to make them friends again. However, she can't hide her love toward Rouma, and confesses her love. Then, they make love, but...\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/12/37405.webp"},{"title":"** Kouhai","synopsis":"Elven Princess Iris, who has been transferred to a human school as a goodwill ambassador for interaction between humans and demi-humans.\n \nShe is an ideal honor student at school, but requires \"aid\" for the breeding of elves...","img":"https://cdn.myanimelist.net/images/anime/1839/104009.webp"},{"title":"Doukyuusei (OVA): Natsu no Owari ni","synopsis":"Using state of the art animation End Of Summer tells the story of one young man's relationship with five women in a frank and sensual manner seldom explored in even the most daring of live action films.\n\nAlthough the hero, Wataru, wants only to score with Mai, the girl of his dreams, he must first deal with four other young women scattered in his path like land mines. There is infatuated and juvenile Miho, tomboyish athlete Misa, naive Kurumi, and the caustic Satomi, who works in the restaurant where Wataru hangs out and whose personal life become hopelessly intertwined with Wataru's.\n\nThe inevitable liaison between Satomi and Wataru sets a new standard in the rendering of animated erotica and may forever change the way animation is viewed in North America.","img":"https://cdn.myanimelist.net/images/anime/6/5969.webp"},{"title":"Dousou Kai","synopsis":"A young group of friends meet up for the first time in a very long time after finishing high-school. One of them remembers how once ago a girl left him Daisies and a love letter inside his locker, back in the high-school days. He has three suspects of who this secret lover could be and so there is only one way to know... by having sex with all of them.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/6/24759.webp"},{"title":"Kakyuusei","synopsis":"This is an older four episode light hentai anime that was originally released in 1995. The first two episodes were brought out in English under the title of \"First Loves\" and bears no relationship to the \"Elf version Kakyuusei OAV\" and \"Kakyuusei TV series\" that were released in 1997-1998 and 1999 respectively. \n\nFirst Loves/Kakyuusei OAV (1995) is mainly centered on Kakeru and his relationship with four girls from his high school. It focuses on one girl per episode - the cute and friendly Urara in the first, the forsaken tennis girl Rie in the second, the dog-owning painter Hikari in the third and the tough-fighting motorcycle girl in the final episode. Which girl will Kakeru choose to be with by the end of the fourth episode? \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1179/106233.webp"},{"title":"Tokimeki Memorial 4 OVA","synopsis":"OVA added to new PSP game Tokimeki Memorial 4.","img":"https://cdn.myanimelist.net/images/anime/12/21756.webp"},{"title":"Lovedol: Lovely Idol OVA","synopsis":"This is a special episode of Lovedol. It's also called episode 13 of the series.\n\nLovedol, or Lovely Idol, is a girl group consisting of two generations of idols. The 3rd Generation is about to make its debut, but to their surprise, they have been delayed! The vague reason is only that \"they lack something.\" The manager, and the 3rd Gen. girls too, must find the answer.\n","img":"https://cdn.myanimelist.net/images/anime/12/65169.webp"},{"title":"Genjitsu Shugi Yuusha no Oukoku Saikenki","synopsis":"O, Hero!\n\nWhen Kazuya Souma is unexpectedly transported to another world, he knows the people expect a hero. But Souma's idea of heroism is more practical than most—he wants to rebuild the flagging economy of the new land he's found himself in! Betrothed to the princess and abruptly planted on the throne, this realist hero must gather talented people to help him get the country back on its feet—not through war, or adventure, but with administrative reform! \n\n(Source: Seven Seas Entertainment)","img":"https://cdn.myanimelist.net/images/anime/1591/107076.webp"},{"title":"Tenchi Muyou! Ryououki 5th Season","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1026/106375.webp"},{"title":"Aishen Qiaokeli-ing: Wanjie Jinian","synopsis":"Recap episode of the first season of Aishen Qiaokeli-ing posted on the official Tenecent biibili channel.","img":"https://cdn.myanimelist.net/images/anime/1083/104669.webp"},{"title":"Tower of Etruria","synopsis":"A brave knight named Albion has been sent to recover a princess named Cecelia from a monster-infested tower held by the witch Etruria. Winning her safety (and her company in bed) from a nefarious (but inexperienced) beholder, they must learn to cooperate to face other threats, such as the ninja spy Palmyra and the seductive and deadly Sirena.\n\n(Source: THEM Anime Reviews)","img":"https://cdn.myanimelist.net/images/anime/4/8260.webp"},{"title":"W: Wish Omake","synopsis":"DVD only Extras.","img":"https://cdn.myanimelist.net/images/anime/13/27554.webp"},{"title":"Doukyuusei 2 (OVA) Special: Sotsugyousei","synopsis":"Based on the game by ELF.","img":"https://cdn.myanimelist.net/images/anime/8/11674.webp"},{"title":"Tsuki wa Higashi ni Hi wa Nishi ni: Operation Sanctuary OVA","synopsis":"Episodes based on Mikoto scenario.","img":"https://cdn.myanimelist.net/images/anime/2/36177.webp"},{"title":"KisKis! Wo de Nanyou Shi Bohe Tang","synopsis":"A promotional animation for mint candies.","img":"https://cdn.myanimelist.net/images/anime/1487/99812.webp"},{"title":"Cocktail Prince: Making Love!!","synopsis":"An animated music video of the song Making Love!!. The Cocktail Prince mobile game reimagines various alcoholic beverages as human males.","img":"https://cdn.myanimelist.net/images/anime/13/83533.webp"},{"title":"Ikenai Boy","synopsis":"An anime adaptation of the erotic manga \"Ikenai Boy\" by Yoshihiro Suma, serialized in Business Jump.\n\nOur hero is the typical young energetic college boy, but he got a special gift. He has \"magic hands\" that puts all women in ecstasy. Obviously he is taking advantage of this gift by meeting one bishoujo after the other! \n\n(Source: MU)","img":"https://cdn.myanimelist.net/images/anime/10/47465.webp"},{"title":"Cocktail Prince: Shaking Night!!","synopsis":"New animated music video for the mobile game Cocktail Prince.","img":"https://cdn.myanimelist.net/images/anime/1977/90573.webp"},{"title":"Asobi ni Iku yo!: Asobi ni Oide","synopsis":"Catian Eris is now on a mission to learn about Earth games and how they are played, but she seems to think that bets have to be placed every time. And while some bets are material items, eventually the Catians learn about betting items of clothing...","img":"https://cdn.myanimelist.net/images/anime/7/26653.webp"},{"title":"Akaneiro ni Somaru Saka: Hardcore","synopsis":"Everybody goes on vacation to Ayanokouji's private island for fun in the sun. Hilarity ensues.","img":"https://cdn.myanimelist.net/images/anime/11/12090.webp"},{"title":"Hayate no Gotoku! Cuties","synopsis":"Taking place after the events that occurred in Hayate no Gotoku! Can't Take My Eyes off You. Hayate, Nagi and Maria return to their daily lives at the Sanzenin Mansion and the Violet Mansion.\n\n(Source: Hayate no Gotoku! Wikia)","img":"https://cdn.myanimelist.net/images/anime/10/48953.webp"},{"title":"Kono Naka ni Hitori, Imouto ga Iru!: Ani, Imouto, Koibito","synopsis":"Unaired 13th episode of the TV series.","img":"https://cdn.myanimelist.net/images/anime/11/51459.webp"},{"title":"Gokukoku no Brynhildr: Kara Sawagi","synopsis":"Unaired episode 11.5 included with the second Blu-ray/DVD volume.","img":"https://cdn.myanimelist.net/images/anime/9/68045.webp"},{"title":"Hayate no Gotoku!!: Atsu ga Natsuize - Mizugi-hen!","synopsis":"To encourage Nagi to swim and enjoy summer, Maria invites various friends to their Sanzenin family's private beach. While everyone is having fun, Nagi hesitates to wear swimsuits and come out because of her small breasts, and refuses to join...","img":"https://cdn.myanimelist.net/images/anime/3/13634.webp"},{"title":"Kishin Houkou Demonbane (TV)","synopsis":"Kurou Daijuuji is a poor detective living in Arkham City. One day, he was requested by Ruri Hado of Hado Financial Group, to search for a magic book. While he initially refused, Ruri offered him a large sum of money upon completion of her request, in which bribed Kuro to accept. As Kurou searches for the book, he unexpectedly runs into Al, a pretty girl that is actually a powerful grimoire. \n\nThey forge a contract with each other, bestowing Kuro with powerful magic. Soon afterwards, Al also activates Demonbane, a deus machina owned by the Hado Financial Group, to combat the mechanical menace from the Black Lodge. With this, the war between the Hado Financial Group and the Black Lodge begins.... \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/1067.webp"},{"title":"Tokimeki Memorial: Only Love","synopsis":"Aoba Riku has just transferred to a new high school because of his father's job, and things aren't quite what he expected. The headmaster's secretary controls the school while espousing the virtues of academic freedom, the teachers are even stranger than normal teachers, and half the student body is walking around with animal ears on. On his very first day, Riku is unfortunate enough to find himself at the center of the student council's latest event, which has him running for his life. All this on top of the normal high school rigour of popularity contests, crushes, and homework makes it unsure whether Riku will be able to survive this new school.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/21080.webp"},{"title":"Neo Angelique Abyss","synopsis":"While the young Angelique lives out her days peacefully in her school, attacks from the monstrous Thanatos has been increasing everywhere else. Two Purifiers show up one day, men with the power to exterminate the Thanatos. One of them, Nyx, attempts to convince Angelique to join them in their work, as she has the power to be the only female Purifier. As Angelique hesitates, a Thanatos shows up in their school. Nyx and the other Purifier, Rayne, fight a losing battle. With her classmates falling prey to the Thanatos, and the Purifiers beaten to submission, Angelique's desire to save everyone awakens. She became the only female Purifier in their land of Arcadia, the one known as the \"Queen's Egg\".","img":"https://cdn.myanimelist.net/images/anime/3/20960.webp"},{"title":"Isekai Maou to Shoukan Shoujo no Dorei Majutsu Ω","synopsis":"Second season of Isekai Maou to Shoukan Shoujo no Dorei Majutsu.","img":"https://cdn.myanimelist.net/images/anime/1705/106918.webp"},{"title":"Kanojo x Kanojo x Kanojo: Sanshimai to no DokiDoki Kyoudou Seikatsu","synopsis":"Haruomi Shiki's peaceful life on a small island was shattered when a volcano erupted and destroyed his home. He goes to stay with a relative, where he meets the sexy sisters Natsumi, Akina, and Mafuyu Orifushi, who he immediately finds himself attracted to. \n\nWhile staying there, he finds out that the father of the Orifushi household has died, and that Natsumi inherited their ice cream business, MinMin. Their district holds an annual competition involving all ice cream stores, which MinMin always wins. But this year, a new ice cream shop called 101 opens a branch in the district, and they are a competitor that could beat MinMin. On top of that, the quality of the ice cream produced by MinMin has been significantly reduced since their father died. Will they be able to overcome such a handicap? Only time will tell, but with Haruomi helping the sisters with the ice cream shop, and also fulfilling his more salacious desires with them, he will have his hands full in more ways than one!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/17720.webp"},{"title":"Happiness!","synopsis":"Kamizaka Haruhi having been rescued when she was young by a mage, longed to be a mage herself, so she enrolled into a special school that allows regular and magic classes into two different sections. Together with her rival/best friend, Hiiragi Anri, they study magic together while she is searching for the boy that saved her years ago, to give him a Valentines' chocolate.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/75250.webp"},{"title":"Bokutachi wa Benkyou ga Dekinai OVA","synopsis":"Bundled with the limited edition volume 14 and volume 16. \n\nThe first episode will cover the chapter 48-49 where it centers on Yuiga and Asumi faking a date on the beach, and later Yuiga meets his teacher Mafuyu Kirisu hiding since she accidentally lost her bikini top.\n\nThe second episode will feature all five main female leads in a wedding ceremony.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1530/102782.webp"},{"title":"Hayate no Gotoku! Heaven Is a Place on Earth","synopsis":"Hayate, Nagi and the gang spend the last days of summer break at Nishizawa's countryside vacation home. But a mysterious spirit has concocted a scheme to separate the butler from his young mistress. \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/13/29542.webp"},{"title":"Yuragi-sou no Yuuna-san OVA","synopsis":"Bundled with the 11th, 12th, and 13th volumes of the Yuragi-sou no Yuuna-san manga. The first episode will adapt the manga's 12th chapter.","img":"https://cdn.myanimelist.net/images/anime/8/89469.webp"},{"title":"Kiniro no Corda: Secondo Passo","synopsis":"The story continues after the intraschool music competition of the first game and anime series. The budding music student Kahoko meets the brusque boy Etō, the new youthful school board director Akihiko Kira, and the mysterious transfer student Aoi Kaji. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/13179.webp"},{"title":"Shin Tenchi Muyou!","synopsis":"Tenchi Masaki heads out to tackle the big world, setting off to school in Tokyo! But not everyone is happy to hear he is moving away, as his female friends sulk and complain at the prospect of him being alone. However, Tenchi is not by himself for very long, as he soon meets a kind and compassionate girl named Sakuya Kumashiro who helps him get used to life in Tokyo.\n\nThe two become close friends, but Sakuya wants more than just that, so she proclaims her love for Tenchi. This confession comes as a shock not only to Tenchi, but also the girls back home. In response, the girls decide to step up their game, and they immediately flock to Tokyo to take Tenchi for themselves. \n\nWith the girls competing for his love, Tenchi must decide once and for all who the most important woman in his life is. However, he is going to have a hard time deciding, as strange events start happening that drive Tenchi further apart from his friends.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/61149.webp"},{"title":"Magikano","synopsis":"Ayumi Mamiya is a witch cursed to lose her powers and only one boy can break the spell. Haruo Yoshikawa thinks he is a normal boy but unknown to him his three sisters have magical powers and keep him protected and ignorant about the exsistence of magic. Now Ayumi must wake up Haruo's latent powers to save herself but his sisters will have none of that. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/75539.webp"},{"title":"D.C.S.S: Da Capo Second Season","synopsis":"Hatsune-Jima was once well-known for its cherry trees, which would bloom no matter what time of year it was. Two years ago, the island's cherry trees lost this ability and all became ordinary cherry trees that bloom only in the spring. Jun'ichi Asakura is now a graduating senior at Kazami Academy, and is surrounded by many close friends, old and new alike. On a stormy summer day, a mysterious young girl, Aisia, arrives at Jun'ichi's door. She is looking for Sakura's grandmother to study magic, ultimately hoping to bring happiness to everyone. When she discovers that grandmother Yoshino had long since passed away, she joyfully assumes (thanks to his error in judgment) that Jun'ichi is able to teach her. Even though she finally understands that the only magic he's capable of is conjuring Japanese confections, Aisia continues her search for magic on Hatsune-Jima. Amid the chaos of her search, Kazami Academy hires new medical staff.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/73937.webp"},{"title":"Uta no☆Prince-sama♪ Maji Love Legend Star","synopsis":"The anime's story will start where the third season left off, at the competition for who will open the Triple S international sporting event. Raging Entertainment's HE★VENS idol group had hijacked the competition between QUARTET NIGHT and ST☆RISH, causing chaos. However, after the QUARTET NIGHT members suggest a certain idea, the three groups aim toward a new stage, with HE★VENS swearing to get their revenge on the other two groups.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/79194.webp"},{"title":"Gift: Eternal Rainbow","synopsis":"Amaumi Haruhiko is a high school student who attends Shimano Academy in a town called Narasakicho. Narasakicho contains an unknown rainbow which constantly overlooks the town and is related to granting a magical wish called \"Gift.\" Gift is a once-in-a-lifetime present between two people.\n\nAs a child, Haruhiko has been close with his childhood friend, Kirino, until he obtains a new non-blood sister by the name of Riko. Haruhiko develops a strong relationship with Riko until they sadly depart due to the fact Haruhiko's father could no longer support the two of them.\n\nAfter some times passes by, Riko finally returns to the town of Narasakicho, and along with Kirino, starts to attend Shimano Academy with Haruhiko. The series revolves around the relationship among these main protagonists and slowly reveals the story behind both Gift and the rainbow.","img":"https://cdn.myanimelist.net/images/anime/2/75540.webp"},{"title":"Love Hina Final Selection","synopsis":"Love Hina Final Selection, tells the story of Love Hina. \nThen gives Keitaro's final selection of girl, for those unfamiliar with Love Hina, Keitaro is the main character, surrounded by girls in an all girl dorm, he is 20 unlucky and eventually becomes a cool, respected hero to the girls, they all end up having a crush on him and he must choose, this OVA features his decision.","img":"https://cdn.myanimelist.net/images/anime/10/82633.webp"},{"title":"Heart no Kuni no Alice: Wonderful Wonder World","synopsis":"The girly but bloody otome game re-imagining of Lewis Carroll's classic fantasy novel Alice's Adventures in Wonderland with bishounen characters and added romance.\n\nA parody of Alice's Adventures in Wonderland where Alice is smart and non-doormatlike.\n\nIn this story, Alice is not all what she seems. She is practical, strong, yet darkly cynical. Instead of the tradition story, Alice is kidnapped unwillingly by a mysterious (yet somewhat bishie-looking) man with bunny ears into a place call Heartland. Stuck in Heartland due to a trick by the mysterious bunny eared man, she meets the residents of this world. Along the way, Alice meets Blood, handsome mafia leader; Ace, the psycho yet charming knight and more... What should Alice do in such a world!?\n\n(Source: MU)","img":"https://cdn.myanimelist.net/images/anime/10/28748.webp"},{"title":"Shukufuku no Campanella","synopsis":"The story takes place in a trading city Ert'Aria. Leicester Maycraft is an item engineer belonging to an adventurer guild \"Oasis.\" One night, he is at a party with his friends to see a meteor stream on the rooftop of a chapel. One meteor grazes them and hits the steeple of the chapel. There he finds a secret room and a sleeping girl. The girl wakes up and says \"You must be my father!\" The encounter with the mysterious girl brings an unexpected adventure to Leicester.","img":"https://cdn.myanimelist.net/images/anime/3/75556.webp"},{"title":"D.C.II S.S.: Da Capo II Second Season","synopsis":"The story continues where it left off at season 1, but now we start to get to know the people we already know a little more in detail.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/75306.webp"},{"title":"Mahou Sensei Negima!: Shiroki Tsubasa Ala Alba","synopsis":"OVA episodes that are bundled with the limited edition of the manga volumes 23-25. First episode to cover chapters 176 and 177 of the manga. Second episode to cover chapters 178-180. And third episode to cover chapters 182 and 183.","img":"https://cdn.myanimelist.net/images/anime/5/9329.webp"},{"title":"Hanaukyou Maid-tai","synopsis":"After losing his mother, 14-year-old Taro journeys to Tokyo to live with his grandfather. But he gets the biggest surprise when he discovers that his grandfather's home is a huge mansion with hundreds of beautiful maids ready to serve him. Making matters worse (at least for Taro, but not for our viewing) is that not only does he inherit the Hanaukyo mansion, he gets the services of all of the maids 24 hours a day, 7 days a week.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/3066.webp"},{"title":"Amnesia OVA","synopsis":"Animate Tokuten for purchasing all 6 volumes of TV Anime Series.\n\nThe contents of the OVA are from the Drama CDs.","img":"https://cdn.myanimelist.net/images/anime/9/54853.webp"},{"title":"Diabolik Lovers OVA","synopsis":"OVA of Diabolik Lovers included with the upcoming game Diabolik Lovers DARK FATE.","img":"https://cdn.myanimelist.net/images/anime/12/74238.webp"},{"title":"Saber Marionette J","synopsis":"In the distant future, since the Earth has become overpopulated, efforts to find and colonize on other planets have begun. However, one of the ships, the \"Mesopotamia\" malfunctions and all but 6 of its inhabitants are all killed. the remaining 6 manage to escape to a nearby planet named \"Terra ll \", which is similar to Earth in many respects. However, all of them are male. Therefore, as to not let their efforts go to waste, they begin to set up 6 countries and to reproduce through cloning and genetic engineering. however, there are still no women, and to make up for it they create lifelike advanced female androids called \"Marionettes\" which do everyday chores and work. However, they are all emotionless machines. But one day, a ordinary boy named Otaru finds and awakens 3 special battle type Marionettes that have emotions due to a \"Maiden Circuit\" within them. It's up to him then to teach them and allow their emotions to grow, and when a nearby country threatens with world domination, it's up to to Otaru and his \"human\" Marionettes to protect their country.","img":"https://cdn.myanimelist.net/images/anime/1754/97053.webp"},{"title":"Tenchi Muyou! GXP","synopsis":"From crashing his bike to falling in lakes, Seina Yamada just cannot shake the bad luck that follows him. But his fortune begins to change when he is forcibly recruited into the Galaxy Police and ends up capturing the most pirates in the force. \n\nNow, Seina is no longer just the unfortunate boy from Earth; he is a man that pirates have come to fear. Despite his reputation, Seina is still the same clumsy guy, but at least he has Amane Kaunaq, a former model, and Kiriko Masaki, his long time friend, to keep him together. With their help, Seina sets out on an adventure in the hopes of becoming a great Galaxy Police Officer.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/20295.webp"},{"title":"Date A Live IV","synopsis":"Fourth season of Date A Live.","img":"https://cdn.myanimelist.net/images/anime/1057/106493.webp"},{"title":"Baby Princess 3D Paradise 0 [Love]","synopsis":"A high school senior named Yotaro thought he was an only child—until he met his real mother and discovered that she has 19 daughters, from 0 to 18 years old. He ends up living with his \"true family.\"","img":"https://cdn.myanimelist.net/images/anime/9/85043.webp"},{"title":"Hand Maid May","synopsis":"Saotome Kazuya is a computer whiz. One day his friend Nanbara, threatens him with a computer virus. Trying to stop the virus, Kazuya ends up making a special order. May is a cyberdoll that arrives at his door a few minutes later and she is 1/6th the size of a normal person, which makes for many awkward situations. Not to mention the fact Kazuya can't even afford to keep May. Cyberdyne is not satisfied with Kazuya's non-payments and will do anything to retrieve CBD May.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/60995.webp"},{"title":"To LOVE-Ru: Multiplication - Mae kara Ushiro kara","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/3/87158.webp"},{"title":"Fortune Arterial: Akai Yakusoku - Tadoritsuita Basho","synopsis":"After the school festival, Kohei and friends head to a small cottage out of town and enjoy themselves after working hard.","img":"https://cdn.myanimelist.net/images/anime/6/25892.webp"},{"title":"Yumeria","synopsis":"On his 16th birthday, Tomokazu Mikuri had a realistic dream where he sees a girl battling a giant floating monstrosity. When he wakes up, he is surprised that the girl is actually sleeping next to him... Whenever he sleeps from now on, he ends up back at the dream world, and more and more people that he knows keep showing up there too. He finds out from a mysterious masked woman in the dream world named Silk that they are fighting against one named Faydoom, and he is the one who provides the powers to those girls so that they can fight these monsters. And so it goes...\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/16782.webp"},{"title":"Ichigo 100% OVA","synopsis":"Further continuation from the Ichigo 100% TV series. Four episodes in length, comprised mostly of side-story elements such as a Spring Festival featuring Cosplay, Junpei's adventure to return a notebook to Yui's friend who atteneds the All-Girl Oumi Academy, summer work at Sawayaka to help cover production costs and last, but not least.. the Strawberry 'Pantsu' Invaders. This OVA features two new characters. \n\n(Note: Best if viewed after the Jump Festa 2004 OVA, or in other words.. \"last\", but could be substituted and watched prior to the Jump Festa OVA.)","img":"https://cdn.myanimelist.net/images/anime/3/23595.webp"},{"title":"Rescue Me!","synopsis":"The story centers on Mizutani Masayuki, an ordinary high school boy. His classmate Shimizu Sayaka lives in his home as a zealously intrusive maid, leading to uncomfortably erotic situations.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/52033.webp"},{"title":"Eiken: Eikenbu yori Ai wo Komete","synopsis":"To some people, Densuke Mifune looks like the luckiest man in the world. Thanks to a chance encounter with the brilliant, beautiful, busty, but extremely shy Chiharu Shinonome, Eiken: Eikenbu yori Ai wo Komete sees Densuke being forcibly invited to join the mysterious Eiken Club. Led by Kirika Misono, she recruited Densuke both for his completely boring, unassuming nature and his completely accidental groping of Chiharu’s chest.\n\nDespite the fact that he’s now surrounded by insanely busty women, Densuke can’t catch a break to save his life. All of his attempts to get closer to Chiharu end up backfiring, making him look like a deviant pervert. His situation is made more complicated by the rest of the Eiken Club’s overly sexual antics and Chiharu’s younger sister intentionally trying to get Densuke into some…compromising positions.\n\nIt doesn’t help matters that Chiharu has expressed fondness for Densuke in return, but all of the accidental circumstances keep pushing her away. Densuke needs to act fast if he wants to find his way back into Chiharu’s good graces. A beauty like her doesn’t go unnoticed, and he may very well find that he’s not the only one trying to win Chiharu’s heart.","img":"https://cdn.myanimelist.net/images/anime/8/42861.webp"},{"title":"DearS: Kin no Tama Desu no?","synopsis":"Miu wins the grand prize in the local shopping district raffle, which is a free pass for up to four people to Yuniataru Studio, a spa resort. She decides to take Takeya, Ren and Neneko since her grandparents couldn't attend. ","img":"https://cdn.myanimelist.net/images/anime/7/83451.webp"},{"title":"Happy☆Lesson (TV)","synopsis":"Hitotose Chitose was always alone and untrusting of people but when 5 female teachers appear and started living together with him in his family's house as his mothers, things started to change and pick up, together with Hazuki-nee and Minazuki (his 2 sisters) everyday is a lesson. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/75576.webp"},{"title":"Tenchi Muyou! Ryououki 2nd Season","synopsis":"While the galaxy remains at peace, Tenchi Masaki continues to live on Earth with Ryouko and Washuu Hakubi, Aeka and Sasami Jurai Masaki, Mihoshi Kuramitsu, and the cat-like creature Ryo-Ohki. Though it sounds great to be surrounded by so many women, they always end up making things difficult for Tenchi by constantly fighting for his attention, and their attempts at household chores always end in disaster.\n\nAlthough life has become more chaotic since they moved in, Tenchi begins to form a strong bond with his roommates and gains more insight into their respective struggles and history.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1/2437.webp"},{"title":"Kiniro no Corda: Blue♪Sky","synopsis":"Soon after transferring to Seisou Gakuin, Kanade finds the orchestra club in the middle of preparing for the National concur. Teaming up with the other members, she will improve her skills, meet new rivals and create memories for what will become an unforgettable summer...\n\n(Source: La Corda D'oro Wikia)","img":"https://cdn.myanimelist.net/images/anime/2/59779.webp"},{"title":"To Heart","synopsis":"For as long as Akari can remember, she and Hiroyuki have always been friends. But with time, everything changes, and her feelings have turned into something more. As a new semester of high school begins, will the two childhood friends come closer together or drift further apart? Join Hiroyuki, Akari and all their friends—the bubbly Shiho, the quiet Serika, the lovely Kotone, and more—in this heartwarming tale of love, relationships and friendship!\n\n(Source: RightStuf)","img":"https://cdn.myanimelist.net/images/anime/8/29922.webp"},{"title":"Arifureta Shokugyou de Sekai Saikyou Specials","synopsis":"Unaired episodes included with the Blu-ray releases of Arifureta Shokugyou de Sekai Saikyou.  ","img":"https://cdn.myanimelist.net/images/anime/1634/102577.webp"},{"title":"Uta no☆Prince-sama♪ Maji Love 2000%: Shining Star Xmas","synopsis":"Unaired episode included in the seventh Blu-ray and DVD volumes.\n\nHaruka is busy working at the agency so she can't help the idols with the preparations for the Christmas Party held by Shining Agency. A lot of memories and information are revealed while Starish is preparing for the party.","img":"https://cdn.myanimelist.net/images/anime/9/56553.webp"},{"title":"Kiniro no Corda: Primo Passo - Hitonatsu no Encore","synopsis":"Hino Kahoko goes to a summer training camp to play the violin with all the members who participated in the concours.\n\nAlso known as \"La Corda d'oro - Special Episode 26\"","img":"https://cdn.myanimelist.net/images/anime/6/10567.webp"},{"title":"Sister Princess","synopsis":"Wataru Minakami is a top student who failed his high school entrance exam because of a computer glitch. He later discovered that he was accepted to Stargazer Hill Academy, which is located at a mysterious place called Promised Island. At the request of his father, Wataru is whisked away to the island, and before he can settle in, a dozen of cute and charming girls start to flock him and claim to be his younger sisters. As Wataru gets closer to his newfound siblings, a deeper mystery as to why they were sent to the island comes to play. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/23692.webp"},{"title":"IS: Infinite Stratos 2 - Infinite Wedding","synopsis":"Picture drama included on the IS: Infinite Stratos 2 Blu-ray BOX.","img":"https://cdn.myanimelist.net/images/anime/12/81040.webp"},{"title":"Masou Gakuen HxH Specials","synopsis":"Masou Gakuen HxH specials included with the volumes of the DVD/BD.","img":"https://cdn.myanimelist.net/images/anime/11/83016.webp"},{"title":"Kyonyuu Fantasy","synopsis":"An OVA based on the WAFFLE game. The story follows Ryuuto Hende, a soldier with unbelievable luck who was assigned to the province where a succubus is drying out men to death, and the local \"first lady\", who happens to be sexually frustrated. The H-parts show mostly a big-breasts theme and mutual love/appreciation. ","img":"https://cdn.myanimelist.net/images/anime/1319/103850.webp"},{"title":"Hanaukyou Maid-tai: La Verite","synopsis":"After his mother passes away, Taro Hanaukyo is invited to his grandfather's home. There, he meets a beautiful maid named Mariel and finds out that his grandfather has retired to a remote island and has given him ownership of his estate. Taro also discovers that not only is the estate a colossal mansion, it has hundreds of gorgeous maids ready to serve him 24 hours a day, seven days a week. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/10518.webp"},{"title":"15 Bishoujo Hyouryuuki","synopsis":"Centers on Kazuma and 15 beautiful girls who are stranded on a deserted Pacific island by a tumultuous storm.","img":"https://cdn.myanimelist.net/images/anime/13/31333.webp"},{"title":"Brothers Conflict OVA","synopsis":"Two Brothers Conflict OVAs about Christmas and Valentine's Day. New OP and ED songs by the same singers were presented in these two OVAs.\n\n(Source: MAL News, edited)","img":"https://cdn.myanimelist.net/images/anime/13/66551.webp"},{"title":"Love♥Love?","synopsis":"Naoto Ooizumi is the writer of the CosPrayers TV show, although this is a secret known only to the producer of the show, Mitsuki Ikuta. He has a crush on one of the actresses in the show, Natsumi Yagami. As the show proceeds so does their relationship, with many wacky twists and turns along the way. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/75454.webp"},{"title":"Kanojo ga Flag wo Oraretara: Christmas? Sonna Mono ga Boku ni Tsuuyou Suru to Omou no ka?","synopsis":"Bundled with the 11th volume of Kanojo ga Flag wo Oraretara light novel.","img":"https://cdn.myanimelist.net/images/anime/3/69591.webp"},{"title":"Seitokai no Ichizon Lv.2: Watasu Seitokai","synopsis":"An OVA bundled with the eighth volume of the Seitokai Series Spinoff novel. \n\nThe story itself takes place on Valentine's Day where you could see how the second season's heroines handle the awkward situation of giving a gift to the main character, Sugisaki Ken.","img":"https://cdn.myanimelist.net/images/anime/9/62845.webp"},{"title":"Scared Rider Xechs","synopsis":"The Blue World, which symbolizes reason, is under constant attack by the creatures called the Nightfly O'Note originating from the Red World, symbolizing instinct. Akira Asagi, the 17-year-old protagonist who is a researcher at Blue World, is nominated to lead the war at Ryuukyuu LAG, a proud defense facility on the islands of Ishigaki and Iriomote. She meets the sixth combat unit \"IS,\" which was formed four years after a fierce battle that annihilated the fifth unit. Akari must lead these six riders, also called the Scared Rider Xechs, to fight against the other world while at the same time deepening the relationship among them.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/2/79983.webp"},{"title":"To Heart 2","synopsis":"Following her graduation from middle school, Konomi Yuzuhara enters the same high school as Takaaki Kono, her childhood friend. As the new school year begins, they meet their childhood friend Tamaki Kosaka, as well as many new accquaintances. Unbeknownst to the group, their encounters with each other will soon lead to many memorable adventures. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/57423.webp"},{"title":"Kono Aozora ni Yakusoku wo: Youkoso Tsugumi Ryou e","synopsis":"One morning, Wataru Hoshino found a sleeping girl—in nothing but her underwear—in his room. When she woke up, she quickly escaped by jumping out of the window, but not without punching Wataru in the face first. This girl, Rinna Sawaki, ends up being a transfer student of Wataru's school, as well as the new roommate of Wataru's dormitory.\n\nWataru lives with four other girls and their school teacher, but due to Temizugawa Heavy Industry's cancellation of their aviation branch—South Sakojima Island's major company—the families involved with the corporation have to be evacuated in one year. As a result of this, the four girls have to leave the island in one year's time.\n\nKnowing this, Rinna refuses to become friends with Wataru and the other girls, because of the pain that she might experience as a result of their eventual separation; however, Wataru disagrees with her, and over the course of the year, tries to convince her otherwise.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/75248.webp"},{"title":"Negima!? Haru Special!?","synopsis":"Sometime after all the events which took place during Negi's first year as a teacher, Class 2-A goes on a school trip to a beautiful island for Spring break. Everything is fine now, but troubles continue for Negi, because he's still the main atraction of the class. But he has something else to worry about, Asuna is angry at him because he told her she had nothing to do with his studies as a wizard. During the trip, the situation gets intense as Asuna's friends try to help Negi make up with her.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/23632.webp"},{"title":"Room Mate","synopsis":"Another One Room series telling \"another story\" featuring male characters. ","img":"https://cdn.myanimelist.net/images/anime/10/85196.webp"},{"title":"Ore ga Ojousama Gakkou ni \"Shomin Sample\" Toshite Gets♥Sareta Ken Specials","synopsis":"Kujou-san no Do-S Soudanshitsu Anime-ban short anime specials bundled with the Blu-ray and DVD releases of Ore ga Ojousama Gakkou ni \"Shomin Sample\" Toshite Gets♥Sareta Ken.","img":"https://cdn.myanimelist.net/images/anime/13/80488.webp"},{"title":"Brothers Conflict: Setsubou","synopsis":"Ema finds a special lamp that her father left for her. Ema and the brothers rub the lamp to find that something peculiar happens in front of them.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/59141.webp"},{"title":"Neo Angelique Abyss: Second Age","synopsis":"Continuing where the first season left off, the sudden increase of Thanatos with the disappearance of the Aube Hunters has now left Arcadia in ruin. Desperation reigns high as the Religious Organization fights to battle the Thanatos. Six months had already past since Hidamari mansion burned to ashes, the Aube Hunters, once hailed as heroes, is now blamed for the appearance of Thanatos. Nevertheless, hope still exists for the reappearance of the Queen's Egg one day, who will become the savior of Arcadia. Unknown to many however, the Aube Hunters have actually been silently waiting for the awakening of Angelique, who has been asleep the entire time.","img":"https://cdn.myanimelist.net/images/anime/8/27592.webp"},{"title":"Aishen Qiaokeli-ing...II","synopsis":"Jiang Hao Yi, a normal, high school student who is extremely scared of getting into trouble, suddenly becomes the Harem King of his school when a bunch of beautiful girls confess to him! Unfortunately for Jian Hao, he doesn't know any of the girls who have confessed to him... What on Earth is happening?","img":"https://cdn.myanimelist.net/images/anime/5/89258.webp"},{"title":"Tenchi Muyou! Ryououki 3rd Season","synopsis":"Ever since his powers awakened, Tenchi Masaki has attracted the attention of many powerful galactic beings, including the mysterious Lady Takami who dispatches her best warrior, Z, to observe him. Though he is under strict orders not to harm Tenchi, Z has no intention of playing by the rules and begins plotting his demise. \n\nMeanwhile, on Earth, Tenchi tries to piece together more information about his family and the universe. But as usual, his life won't be getting any easier, as his entire household enters a state of panic when Noike Kamiki Jurai—a woman claiming to be Tenchi’s fiancée—shows up out of the blue.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/31587.webp"},{"title":"Hyakka Ryouran: Samurai After","synopsis":"OVA bundled with Niθ Art Works Vol. 2, featuring a new character named Kagekatsu Uesugi.","img":"https://cdn.myanimelist.net/images/anime/6/73391.webp"},{"title":"R-15: R15 Shounen Hyouryuuki","synopsis":"According to Kadokawa, an OVA of R-15 will be bundled with the tenth volume of the novel.","img":"https://cdn.myanimelist.net/images/anime/5/30175.webp"},{"title":"Ozmafia!!","synopsis":"The anime will feature an original story from the game on which it is based. ","img":"https://cdn.myanimelist.net/images/anime/9/80549.webp"},{"title":"Mouse","synopsis":"Teacher Sorata Muon carries on his family's centuries-old old tradition of being the master thief Mouse who can steal anything after properly alerting authorities of his intentions so they can be there yet fail to stop him. He is assisted by 3 nubile female assistants who also use the teaching cover and who, in typical Satoru Akahori, favor tight/skimpy/bondage outfits over their ample curves as they constantly pursue Sorata much more than he pursues them, although the girls do get some attention from their master. Not only is Mouse pursued by the girls &amp; the local law enforcement authorities, there is also a secret art protection society employing the services of a former ally of Sorata's after his pretty little hide, all in 15 minute episodes.","img":"https://cdn.myanimelist.net/images/anime/5/75507.webp"},{"title":"Harem Time The Animation","synopsis":"Based on a manga by tosh. \n\nSatou Reiji's life changed when his real lineage was discovered. He is the son of a rich man who passed away recently, and now Reiji is the new master of the Kamiyama house. But there is a catch! In order for him to be accepted into the house legally, he needs to provide an heir, and in order to do that, he must choose a wife from his very own harem! \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/1545/103853.webp"},{"title":"Tsugou no Yoi Sexfriend?","synopsis":"Yuu Arahama has a girlfriend named Misako Shimizu. She has a great body and loves him greatly. One night, after having sexual intercourse, Misako proposes to Yuu. However, he rejects her proposal, revealing that Misako isn't his only partner. He has four other partners: Ryouko Yanagi, Kotori Hoshino, Makiko Endou, and Aina Kamishima.\n \nMisako makes Yuu call all four of them at once, only to find out that each girl is not aware that Yuu has sexual relationships with the others. Another problem arises when the girls decide to compete with each other so as to determine whom Yuu is going to choose as his wife. However, Yuu is reluctant to marry anyone, fearful of the possibility that he will lose his freedom when he gets married.\n \nNow, Yuu has to go through various situations which forces him to go through sexual activities with the girls to sate their lustful desires and settle their feud.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/66751.webp"},{"title":"Shuffle! Prologue","synopsis":"Shuffle! Prologue is a short OVA teaser for the Shuffle! anime series based on the visual novel of the same name. While some of the animation was reused for the first episode of the anime series, most of Shuffle! Prologue is unique animation not repeated in the series, although the story itself is retold. \n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/8/17744.webp"},{"title":"Dual! Parallel Lun-Lun Monogatari","synopsis":"Kazuki Yotsuga is your regular average nerd in high-school, except he isn't smart. He has this website which relates to his visions that only he can see. His vision's are about robots who keep fighting each other battle after battle. One day he is sent to a, \"parallel world\" where these visions exist and he joins a company to fight back against the devious RaRa, who want to take over the world. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/31223.webp"},{"title":"Arifureta Shokugyou de Sekai Saikyou Recap","synopsis":"Recap of the first five episodes of Arifureta Shokugyou de Sekai Saikyou.","img":"https://cdn.myanimelist.net/images/anime/1056/102575.webp"},{"title":"D.C.if: Da Capo if","synopsis":"This two episode OVA retelling of the first Da Capo series with the \"what if\" Junichi Asakura were to return Kotori Shirakawa's feelings.","img":"https://cdn.myanimelist.net/images/anime/2/25445.webp"},{"title":"Koi Koi 7","synopsis":"Tanaka Tetsuro is excited at getting a full scholarship at a new high school, far away from his family. What he does not know is that he will be the only boy in an all girl school, and that there is a girl head-over-heels in love with him, waiting for his arrival. But his special friendship with the very cute and dynamic Asuka also causes him to get into a lot of trouble with the powerful student council leadership, as they are at open war with Asuka and her five friends, a group of super amazon warriors called the Koi Koi Seven. \n","img":"https://cdn.myanimelist.net/images/anime/6/75896.webp"},{"title":"W: Wish","synopsis":"Based on a game by Princess Soft\n\nThe main character, Junna has a twin sister Senna. He is an ordinal student of an elite school. However, in the past, a traffic accident deprived him of his parents and his memory. Junna survived the accident, and he has lived only with his sister though he has been looked after by his relatives.\n\nAnd present...\nThe life with Senna in the same high school is so pleasant that he can forget the severe past. Because he has been in the world where there is only Senna, his lives in this town, such as the beginning of a new life, new environments, and the meetings, are so refreshing.\n\nHowever, he begins to recall the memories he lost in the accident. Though he enjoys happy and pleasant days, he is tossed by the past, the present, and the future. What is the truth hidden in his memory?\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1/346.webp"},{"title":"Happy☆Lesson: Advance","synopsis":"Hitotose Chitose is now living together with his 5 teachers as his mothers when a mysterious girl appears and becomes their neighbor which turns out that that person is Nagatsuki Kuron who wants Mu-chan to be her mother so another sibling rivalry ensues as to who would end up as Mu-chan's child. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/75575.webp"},{"title":"Boy Meets Harem The Animation","synopsis":"An unfortunate accident befalls Naoki Shindou and his whole class when lightning strikes the airplane they were traveling in for their overseas trip. The only ones able to survive are himself, his classmates Momoka Kiriyama and Kana Miyamura, their teacher Sanae Nakazono, and the flight attendant Asami Kakinuma. Now stranded on an island and far from rescue, it might prove to be too challenging to keep their sexual instincts at bay.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1634/103891.webp"},{"title":"Dance with Devils: Fortuna","synopsis":"Ritsuka Tachibana. She lives a calm and unchanging life. Ritsuka's older brother Lindo returns from studying abroad in the United Kingdom. Shikou Academy student council president Rem Kaginuki calls on the girl, and she begins having mysterious encounters with the student council members. Her life changed a little from that day, but Ritsuka expected nothing more. \n\nHowever, she comes home to find her mother collapsed with suspicious hooded men nearby. They were not human but devils, vampires, and exorcists seeking the Forbidden Grimoire. Ritsuka's former daily life crumbles around her, and she finds herself slowly becoming attracted to Rem, who helps her in her predicament. On the other hand, confusion deepens with regard to her brother who carries a secret. Ritsuka is unsure what path to choose as she finds herself at the center of a love story.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/86240.webp"},{"title":"Tenchi Muyou! Ryououki: Omatsuri Zenjitsu no Yoru!","synopsis":"After his recent battle in space, Tenchi Masaki believes that his fighting days are over. Unfortunately, his life is far from peaceful since Aeka Jurai Masaki and Ryouko Hakubi—the two women giving him the most grief—cannot seem to get along, continuing to fight over who gets to be Tenchi's lover. \n\nSince their usual romantic strategies fail, Aeka and Ryouko decide to research how to woo a man. After spending hours going through shoujo manga, the two decide to act like the girls they've read about and put Tenchi through various scenarios, with the hope that he will fall in love with one of them.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/61969.webp"},{"title":"Otogi Story Tenshi no Shippo","synopsis":"Goro's down on his luck. He keeps losing jobs and has little money. One day he meets a fortune-teller outside of a pet store who predicts that his luck will change. That night three girls appear in his appartment claiming to be his guardian angels. Soon a total of twelve girls appear to help him, each one a reincarnation of a deceased pet once owned by Goro. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/21092.webp"},{"title":"Saber Marionette J to X","synopsis":"Taking place mere months after the Saber Marionette J OVA series, this newest installment in the Saber Marionette line follows the continuing adventures of Otaru and his clan of selfless, obsessive marionette girls. This time, the evil Faust is back, and again toying with Marionette technology that was never meant to be explored. The Saber Dolls are back, and torn between their newfound love for Otaru and their undying loyalty to Faust; Will Otaru, Lime, Cherry and Bloodberry be able to stop Faust again, or are they all headed for the scrap heap?\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1773/94167.webp"},{"title":"Hakuouki Hekketsuroku Episode 0","synopsis":"Summary of the first season of Hakuouki Shinsengumi Kitan. Aired the week before the second season began. ","img":"https://cdn.myanimelist.net/images/anime/9/26949.webp"},{"title":"Oretachi ni Tsubasa wa Nai: Hadairo Ritsu Kyuuwari Zou!?","synopsis":"An OVA bundled with the non-adult version of the OreTsuba PC game. The OVA has more fan service than the TV series (what they call, \"nakedness plus 90%\").","img":"https://cdn.myanimelist.net/images/anime/3/64495.webp"},{"title":"Idol☆Sister","synopsis":"Former members of the idol group IKB31, Ayaka Takano, Maki Kamii and Maina Ooizumi, form a new group called Platinum Kiss. One of the biggest reasons for their success onstage would be their manager, Ayaka's older brother, despite his perverted nature. \n\nOn the day before their next concert, he informs the girls that he might not be able to attend, causing them to feel very anxious. In the girls' desperate effort to find him, he turns out to be peeping at their every action. With one hour left before their performance, he helps them in \"calming their nerves”.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/70015.webp"},{"title":"Zettai Junpaku♡Mahou Shoujo","synopsis":"Doujinshi anime Blu-ray Disc offered at the Comic Market 82 event on August 2012.","img":"https://cdn.myanimelist.net/images/anime/9/65213.webp"},{"title":"Youkoso! Sukebe Elf no Mori e","synopsis":"Alfheim, a world of elves where women only exist. The world Shrine, the source of all the elves' magical power, has started to fade and the race was in danger of extinction. Then there is a prophecy that a man from another world is destined to be the savior of the elven race. And it was not too long the hero is now brought to the world of Elves...\n\nThe elves ruled they must survive by child-making with the hero. But many of the other elves refused this vulgar decision and so the elves divided into groups: Those who disdain child-making with a man and those who choose to accept the fact. But those who accepted have discovered something: It turns out if they have sex with the hero and acquire semen into their bodies, their magic powers increases. So they proceed to milk him dry...\n\n(Source: DLsite)","img":"https://cdn.myanimelist.net/images/anime/1406/91062.webp"},{"title":"Princess Lover! Picture Drama","synopsis":"Specials included on the Princess Lover! Blu-ray/DVD volumes.","img":"https://cdn.myanimelist.net/images/anime/4/18207.webp"},{"title":"Hayate no Gotoku! OVA","synopsis":"New OVA series of Hayate no Gotoku!, which is part of the manga's 10th anniversary project.  One episode each will be bundled with volumes 41 to 43 of the manga.","img":"https://cdn.myanimelist.net/images/anime/2/70353.webp"},{"title":"Happy☆Lesson","synopsis":"One guy. Five girls. One roof. It's a recycled idea, but it never gets old. Happy Lesson is a kinetic take on an old genre.\n\nChitose shares his house with five ladies. One might think the continued attention of this many girls would be a good thing, but too much attention can prove to be painful. Did I mention they're also instructors at his school (hence the title)? Not only is he the subject of their abuse at home, but at school as well. Even when things finally calm down at night, all the rooms are taken so Chitose must sleep on the couch.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/6/15349.webp"},{"title":"Mahou Sensei Negima!: Introduction Film","synopsis":"Before the beginning of the series, three OVAs were produced for the sole purpose of introducing the characters. The first two were released on DVD bundled with two drama CDs, with the third being sold separately. It is unknown if these will ever be released outside of Japan.\n\nThe first OVA is a re-enactment of the first chapter, where Negi first learns of his job as a teacher and is introduced to the students of Mahora Academy 2-A. It ends with profiles of the Baka Rangers (Asuna, Makie, Yue, Ku Fei and Kaede) as well as Ayaka. Asuna is the only girl in the class that doesn't have romantic feelings for Negi.\n\nThe second OVA is a re-enactment of the \"love potion\" incident of chapter 2, with profiles at the end of Nodoka, Konoka, the cheerleaders (Misa, Madoka, Sakurako) as well as Kazumi.\n\nThe third OVA is a re-enactment of chapter 13: Negi's Mahora tour with the Narutaki twins. The tour shows Negi to several of the students (Yuna, Akira, Chao, Satsuki, Satomi, Chizuru, Natsumi, Zazie) as well as others that he ends up missing (Sayo, Evangeline, Chachamaru, Chisame, Misora, Ako). After being chewed out by Haruna for completely skipping her, a final scene introduces Setsuna and Mana, keeping watch from something on campus.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/5/8864.webp"},{"title":"Saber Marionette J Again","synopsis":"Lime, Cherry, and Bloodberry, female-like androids called marionettes, have returned to Otaru`s side. The somewhat reformed marionettes of Faust (Tiger, Luchs, and Panther) are sent to stay with Otaru and friends to learn more about being human. Enter a seventh marionette named Marine, who has a mysterious power -- and they all possess the special maiden circuit that allows a marionette to feel emotions!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/61135.webp"},{"title":"Tenchi Muyou! Ryououki 3rd Season: Tenchi Seirou naredo Namitakashi?","synopsis":"After a 'modified' ending to the Choubimaru incident, the punishments for the offending parties is metted-out, as well as a surprise marriage proposal by Misao to Mashisu. It almost didn't happen... until Mihoshi and Misao's mother Mitoto steps in and gives her and her family's approval, much to the dismay of FORMER G.P. Marshall Minami Kuramitsu. Otherwise, life goes on as usual for the Masaki clan. But soon when the question of how Tenchi's mother had died is presented, the answer nearly causes a rift between Tenchi, his father and his grandfather, for which only Tenchi's future mother-in-law Rea can solve... as well as the resolution of Noike's unusual secret. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/23557.webp"},{"title":"Meiji Tokyo Renka Movie 1: Yumihari no Serenade","synopsis":"On an evening lit by a crimson full moon, an ordinary high school girl named Mei Ayazuki meets a self-proclaimed magician named Charlie at a festival. Through Charlie's magic, she time-travels to the Meiji era in Tokyo, where she meets and falls in love with various great historical figures from that time period.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/73855.webp"},{"title":"Ai Yori Aoshi: Yumegatari","synopsis":"Kaoru and the girls have a picnic in Spring and talk about their dreams for the future.","img":"https://cdn.myanimelist.net/images/anime/2/15405.webp"},{"title":"Mashiro-iro Symphony: Airi ga Anata no Kanojo ni!?","synopsis":"An alternate ending to the anime with Airi being the chosen girl. This is not animated in a normal anime fashion, it is more of a gal game animation.","img":"https://cdn.myanimelist.net/images/anime/3/38799.webp"},{"title":"Hyakka Ryouran: Samurai Girls","synopsis":"With its gorgeous landscape and prosperous people, Great Japan is the envy of all other nations. But a serious threat hovers over the country.  Mysterious guardians known as Master Samurai are Great Japan's only defense.\n\nAt the behest of the student council, young samurai Muneakira Yagyuu arrives at Buou Academic School. Run by the Tokugawa Shogunate, here children of warriors are given aristocratic education required to run the country. The school is led by the student council president Yoshihiko Tokugawa and his sister Sen, who also happens to be Muneakira's childhood friend.\n\nUpon arriving at the academy, Muneakira finds himself in the midst of a terrible fight. During the chaos, the sky fills with a peculiar white light and a mysterious girl named Juubei Yagyuu appears and suddenly kisses Muneakira. With his kiss, she awakens an unknown power that protects them.\n\nJust who is this girl, and where did she come from? Muneakira finds himself entangled in the fate of the country and a threat that will shake Great Japan to its core. He must learn the secret behind the Master Samurai and the kiss that awakened Juubei's power in order to protect his country.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/27705.webp"},{"title":"Yuragi-sou no Yuuna-san","synopsis":"Once a hot springs inn, now a boarding house with extraordinarily cheap rent, Yuragi-sou is virtually uninhabited save for a few peculiar residents. As rumor has it, it is haunted by a vile ghost which scares away all potential tenants. Therefore, it is the perfect refuge for Fuyuzora Kogarashi—a broke, homeless psychic seeking an affordable roof to stay under and ghosts to exorcise.\n\nKogarashi prepares for a face-off against the ghost, only to find out it is not as malicious as the rumors made it out to be. Instead, it is the ghost of a beautiful, silver-haired girl whose only recollection of her life before death is her name: Yuuna. Even more baffling is that the other tenants of Yuragi-sou not only are able to see Yuuna as well, but each has their own supernatural ability.\n\nAmidst the chaos caused by his quirky fellow residents, Kogarashi attempts to uncover the regret that keeps Yuuna anchored to the world of the living, lest she become an evil spirit sentenced to spend her afterlife in hell.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1483/93141.webp"},{"title":"Isekai no Seikishi Monogatari","synopsis":"Kenshi Masaki has been kidnapped and brought to the world of Geminar by a mysterious group. To get back home, he agrees to help them assassinate the newly crowned empress of the Shtrayu Empire, Lashara Aasu XXVIII, using a giant robot called a Sacred Mechanoid.\n \nAs her army fights them off, Lashara takes note of Kenshi's abilities and demands that her attacker be captured alive, only to find out that the pilot is male which is extremely rare on Geminar. Believing it to be a waste to kill him, she makes Kenshi her attendant.\n \nAs the empress' new servant, Kenshi is required to accompany Lashara to the Holy Land, an academy where Sacred Mechanoid pilots hone their skills. His arrival attracts attention, but Kenshi is unaware that something sinister is brewing within the academy and it could plunge the entire world into war.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/20345.webp"},{"title":"Rokujouma no Shinryakusha!? (TV)","synopsis":"After Koutarou Satomi's father is suddenly relocated for his job, the first-year high school student is faced with finding a cheap place to live by himself. Naturally, he jumps at the chance to move into Corona House's Room 106 for a mere five thousand yen a month. But while everything goes well at first, Koutarou soon gets a lot more than he bargained for after stumbling upon a mysterious cave while working his part-time job.\n\nThe following night, Koutarou is visited by various seemingly mythical figures, all of whom claim ownership of the poor student's apartment. Among the invaders are Sanae Higashihongan, a ghost supposedly haunting the room, magical girl Yurika, alien princess Theiamillis Gre Fortorthe, and Kiriha Kurano, a direct descendant of the Earth People. But more importantly, each of these four girls needs Koutarou's apartment for her own reasons and won’t back down without a fight!\n\nRokujouma no Shinryakusha!? is a comedic battle royale over a six-tatami mat apartment involving supernatural beings, romantic high school hijinks, and a deceptively cordial landlady.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/62655.webp"},{"title":"High School DxD Specials","synopsis":"A series of 3-5 minute specials that were bundled with the HighSchool DxD DVD and Blu-rays. They are a stand alone set of episodes that are not a part of any story line in particular.\n\nSpecial 1: Going Sunbathing! - The Occult Research Club goes on a beach outing.\n\nSpecial 2: Issei's Private Training! - Issei is being given lessons in magic by Akeno.\n\nSpecial 3: A Little Bold, Koneko-Chan... Nyan! - Koneko accidentally has her personality reversed magically, making her incredibly sexually active and reversing her sexual preference.\n\nSpecial 4: The Untold Story of The Dress Break's Birth! - A few flashbacks of how Issei first found out and eventually perfected his special move, Dress Break.\n\nSpecial 5: Making Udon! - As part of a penalty for losing a bet, Sona and Tsubaki make udon for the Occult Research Club but the udon comes to life in a peculiar way...\n\nSpecial 6: Asia Transforms! - Asia wants to prove she is just as bad as any demon by using ideas found in Issei's magazines, going as far as dressing up like a harlot and seducing him.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/10/38449.webp"},{"title":"Hoshizora e Kakaru Hashi","synopsis":"Kazuma Hoshino is preparing himself for a new stage of his life as a teenager. Because of his brother Ayumu’s weaker than average health, their parents thought it best for the family to move out from the city to a more rural environment. Now the two brothers are off to the Yorozuyo Inn where they’ll be staying until their parents can settle affairs back in the city and set up their new home.\n\nTheir arrival to the inn doesn’t go as planned though when they catch the wrong bus, wind up in the middle of nowhere, Ayumu gets his hat stolen by a wild monkey, and Kazuma gets lost in the woods trying to track the animal down. It all leads to a chance encounter with a spirited young girl named Ui, who Kazuma ends up accidentally falling onto and kissing while she tries leading him back to the bus stop. This hardly sits well with Ui’s friend Ibuki who swiftly kicks Kazuma and sends him on his way. Much to Kazuma’s continued horror, his bad luck is perpetuated at the inn thanks to its landlady Senka and her slightly perverted sense of humor, and then finding out that two of his classmates are the girls he embarrassed himself in front of back in the woods!\n\nHoshizora e Kakaru Hashi finds Kazuma adapting to his new school, dealing with the multiple women who have entered his life, providing emotional support for his younger brother, and coping with living with his new landlady. However, for some reason, something about this place is bringing whispers of the past into Kazuma's mind. Small flashes back to a more innocent time and a friendship long forgotten. What could this déjà vu mean?","img":"https://cdn.myanimelist.net/images/anime/3/73521.webp"},{"title":"Kanojo ga Flag wo Oraretara","synopsis":"In visual novels, an imaginary flag is defined as an event that serves as a turning point for the whole story. A player triggering the romance flag for a heroine will proceed to her route, or a death flag will signify that a certain character will die afterwards.\n\nHigh school student Souta Hatate can see these flags above a person's head, and has the ability to bring them down to stop certain events from happening. Using this power, he has prevented other people's deaths. But, after a past accident with him as a sole survivor, he ended up believing that only misfortune will befall those who are near him, and has refrained from making friends or having relationships ever since.\n\nHowever, everything starts to change after transferring to a new school. After toppling another death flag, his classmate Nanami Knight Bladefield notices his powers and tries to learn more about him, promising that she will remain at his side no matter what may happen. Thus begins Souta's journey as he meets new friends and acquaintances while uncovering the mysteries of his ability... which might run deeper than what anyone expects.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/63363.webp"},{"title":"To LOVE-Ru OVA","synopsis":"Episode 01: Rito becomes a Woman\nLala invents a gizmo to make her bust bigger. However, this invention of hers accidentally turns Rito into a woman.\n\nEpisode 02: Rito and Mikan\nFeeling lonely because Rito is always spending time with Lala, Mikan storms out of the house. While Rito and Lala are out looking for her a few flashbacks from the past, showing Rito and Mikan as kids, are shown.\n\nEpisode 03: Welcome to the Southern Resort!!\nHaruna wins an island resort trip for ten females. Rito gets turned into a dog by one of Lala's inventions and somehow ends up on the island as well.\n\nEpisode 04: Trouble Quest\nRito and the girls become trapped inside an RPG game where the objective is to save Lala and defeat the evil witch Kyouko.\n\nEpisode 05: Nana and Momo\nLala's sisters cause mischief for Rito and his harem at a cherry blossom viewing.\n\nEpisode 06: Draft, Metamorphose, Hand &amp; Tail\nYami and Yui confront with a senior, causing Yui to lose her panties.\n\nMikan finds Peke taking snapshots of new clothing while shopping. Suddenly, a stranger steals her bag.\n\nAs Rito tries to explore Lala's cleaned-up bedroom, he accidentally activates one of Lala's invention, fusing his hand to Lala's tail. ","img":"https://cdn.myanimelist.net/images/anime/2/17923.webp"},{"title":"Freezing Vibration","synopsis":"Ever since the 10th NOVA clash, the Chevalier had concluded that the NOVA have been appearing at a steadier rate and they are losing more Pandoras than they can produce. Their solution is the E-Pandora Project which involves normal humans being given the power to become Pandoras. Inviting Pandora from around the world to their Alaskan base witness the unveiling of their new project, Satellizer, Kazuya and Rana are among those who have been summoned. However, as time goes the E-Pandora Project starts to become fishier and the Pandoras start to grow more and more concerned...","img":"https://cdn.myanimelist.net/images/anime/3/68195.webp"},{"title":"Date A Live: Date to Date","synopsis":"Bundled with the 9th volume of the original novel, it is the unaired 13th episode of the TV series. ","img":"https://cdn.myanimelist.net/images/anime/3/59777.webp"},{"title":"Akaneiro ni Somaru Saka","synopsis":"Yuuhi Katagiri is not your average girl – she's the treasured daughter of the Katagiri family. She's generally kept under strict supervision, but one day ends up walking home from school on her own. This proves to be instant trouble when a group of boys start harassing her. Junichi Nagase, who was on his way home from a convenience store, sees the troubled Yuuhi and comes to her rescue. One of the boys recognized Junichi as the famed \"Geno Killer\" and they dash off. Yuuhi thanks Junichi and when she asked for his name, he just waves and leaves. Of course, he regrets trying to act cool in front of the beautiful girl right away, wishing he asked her name.\n\nThe following day, a transfer student joins Junichi's class – it's Yuuhi! She calls Junichi out as the \"Geno Killer\", the only name she remembers him by, and rumors about the two spread quickly. Matters are made worse when Junichi kisses Yuuhi due to a misunderstanding. And on top of all that, it turns out that Junichi is Yuuhi's fiancé!\n\nYuuhi doesn't see Junichi as someone worthy. But, she could not go against her father's wishes. The only thing that Yuuhi can do is live with Junichi in the house he shares with his little sister Minato, and prove that Junichi is not worthy to be her husband. Will she succeed in proving his unworthiness, or will she fall in love on the way?","img":"https://cdn.myanimelist.net/images/anime/9/21525.webp"},{"title":"Brothers Conflict","synopsis":"Ema Hinata is a sweet girl with only her father to call family. One day, she learns that he will be remarrying Miwa Asahina, a wealthy fashion designer. Though she's glad she has a new place to call home, the family she gains is greater than she could ever imagine—Ema now has 13 step-brothers!\n\nWishing to give her father space, she moves into the Sunrise Residence where her brothers live . As she settles in, Ema realizes she may not experience the loving kinship of a family that she has always longed for, as many of her new brothers exhibit feelings toward Ema that aren't just familial.\n\nWith each brother desiring Ema's attention in his own way, will she be able to work toward a happy ending for all, or will she choose one brother that has stolen her heart?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/51409.webp"},{"title":"DearS","synopsis":"One year ago, a UFO containing 150 aliens crash-landed off the shores of Kasai. Because no one could fix their ship, the Japanese Government decided to bestow upon them the designation \"DearS\" and make them into Japanese citizens, teaching them the language, customs, and culture of Japan. However, in order for them to become more familiar with human society, a home-stay program has been enacted to allow them to mingle with other humans.\n\nOne misty morning, a truck carrying a capsule that housed one of these aliens ends up dropping it into the riverbank, releasing her from her confinement. She is eventually found by a high school student named Takeya Ikuhara, who saves her from being hit by a truck and takes pity on her, despite being extremely distrustful of their race and wanting nothing to do with them. Upon being named Ren, she imprints upon him as her \"Master\" and serves as his personal \"Slave,\" leaving him with a \"DearS\" who wants to remain with him no matter what and bringing his ordinary, alien-free days to an end.","img":"https://cdn.myanimelist.net/images/anime/7/23426.webp"},{"title":"Mashiro-iro Symphony: The Color of Lovers","synopsis":"When boys suddenly get into places where they've never been allowed before, some girls tend to get upset. So when the decision is made to merge the elite Yuihime Girls' Private Academy and the coeducational Kagamidai Private Academy, everyone wants to take extra care in avoiding trouble while bringing the two Privates together. Therefore, rather than just bringing the Kagamidai boys into the Yuihime girls' school all at once, a plan is concocted in which a group of test males will be inserted into the Girls' Private Academy first.\n\nThus, poor young Shingo finds himself being thrown as a sacrificial lamb to the lionesses of Yuihime, who aren't exactly waiting for him with open arms. Will Shingo manage to survive the estrogen soaked death pit that is Yuihime? Can the girls learn to be more receptive to the boys? And just how long until something involving panties will cause emotions to flare, sparks to fly and the battle of the sexes to explode?\n\n(Source: Sentai Filmworks, edited)","img":"https://cdn.myanimelist.net/images/anime/9/39303.webp"},{"title":"Kawaikereba Hentai demo Suki ni Natte Kuremasu ka?","synopsis":"As far as it goes, many boys, especially in their teenage years, want to have a girlfriend. Keiki Kiryuu is no exception. One eventful afternoon, his days of yearning for a lover seem to come to an end when he receives a love letter from an anonymous sender—along with a pair of white panties. \n\nTo determine the identity of his secret admirer, referred to as Cinderella, he proceeds to investigate several possible candidates including his senior Sayuki Tokihara, his underclassman Yuika Koga, and his classmate Mao Nanjou. However, as Keiki seeks to uncover who this mystery girl might be, he comes to know about the perverted fetishes hidden behind each candidate's innocent exteriors...\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/1430/102439.webp"},{"title":"Date A Live Movie: Mayuri Judgment","synopsis":"The movie adaptation announced at the end of the final episode of Date A Live II. ","img":"https://cdn.myanimelist.net/images/anime/9/75466.webp"},{"title":"Girls Bravo: First Season","synopsis":"Small for his age, Yukinari has been bullied and abused by girls all his life. Now in high school, he has developed a rare condition: whenever girls touch him, or even come close, he breaks out in hives. Imagine his surprise, when he is suddenly transported to the city of Seiren on a mystic world invisibly orbiting the Earth, and populated with vast numbers of women and very few men. Fortunately, he has a new friend, Miharu-chan, whose touch inexplicably doesn't affect him.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/241.webp"},{"title":"Mahou Sensei Negima!","synopsis":"10-year-old Negi Springfield is a wizard-in-training, and needs only to pass one more test in order to become a Master Wizard. Unfortunately, his final task is a bizarre one—to become a English teacher at an all-females boarding school. As soon as he arrives, he completely embarrasses one of his students, Asuna Kagurazaka, and replaces the teacher she loves, which garners her hatred. To make matters worse, Asuna learns that Negi is a wizard, and promises to tell unless he helps her out. But unfortunately, circumstances force them to work together to do many things, from fighting evil wizards to helping the class pass their final exam, with a lot of humor, magic, and romances thrown in.\n\n(Source: ANN, edited)","img":"https://cdn.myanimelist.net/images/anime/12/89535.webp"},{"title":"Juuou Mujin no Fafnir","synopsis":"Midgar, all-girl academy, would have been notable just for the action of accepting its first and only male student, Yuu Mononobe. But Midgar stands out for much more than that: it's a school exclusive to a group of girls known as D's. Each of them have extremely powerful abilities in generating dark matter and manipulating it into powerful weaponry.\n\nThe D's didn't exist twenty-five years ago, and only appeared after a number of mysterious, destructive monsters known as \"Dragons\" started appearing around the world. Strangely, just as suddenly as they appeared, they vanished. In their destructive wake, some girls started being born with symbols on their bodies and powers similar in nature to those wielded by the Dragons themselves.\n\nNow the D's attend this school, hoping to harness and utilize their powers against the Dragons. Yuu is their latest member and is extraordinary for being the only known male D in existence. Now he must forge relationships with the girls around him, including his long separated sister who attends the school as well, and work with them to investigate and eliminate the threat of the powerful Dragons.","img":"https://cdn.myanimelist.net/images/anime/11/69085.webp"},{"title":"Nisekoi OVA","synopsis":"Episodes released on DVDs bundled with the 14th, 16th, and 17th volumes of the Nisekoi manga.","img":"https://cdn.myanimelist.net/images/anime/2/71754.webp"},{"title":"Bokutachi wa Benkyou ga Dekinai!","synopsis":"Under Nariyuki Yuiga's devoted tutelage, his classmates Rizu Ogata, Fumino Furuhashi, and Uruka Takemoto are finally pulling average test scores on their worst subjects. But time is ticking, and there is still a long way to go before the three geniuses of Ichinose Academy are ready for their upcoming university exams. Meanwhile, the girls still struggle to balance the pursuit of their dreams with their growing affections for their unsuspecting tutor.\n\nJoining them are Mafuyu Kirisu, a teacher with strong views about education and talent because of her past as a rising figure skater, and Asumi Kominami, a graduate from their school aiming to attend a national medical university. With these two additions, the group of six is livelier than ever before. Completely caught up in hilarious antics with his new friends, Yuiga finds that his last year of high school now includes a lot more than just going to class and studying.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1974/102960.webp"},{"title":"Mayoi Neko Overrun!","synopsis":"Takumi Tsuzuki is a high school student who attends the Umenomori Private Academy, free of charge, alongside Fumino Serizawa, a childhood friend of his whom always says the opposite of what she feels. He spends most of his time at school fending off Chise Umenomori, the granddaughter of the board chairman and a pampered princess, who is constantly roping him into her eccentric hobbies. After school, he goes to work at the \"Stray Cats\" confectionery, a cake shop run by his adoptive older sister, Otome Tsuzuki, until it's time to go to bed. This is the average routine in the day and the life of Takumi.\n\nMayoi Neko Overrun follows another seemingly average day in the life of Takumi. With his sister away from the shop, having gone to save someone else in need of help, Fumino takes it upon herself to wake him up so that he won't be late for their usual walk to school together, giving him a glimpse of her blue and white striped panties in the process. What a nice way to start the day.\n\nWhen Otome returns home, she brings with her a girl named Nozomi Kiriya, whose hair and mannerisms resemble that of a large cat. It turns out that she is a runaway that Otome can't help but take in. Takumi's ordinary days are transformed into splendid chaos as he tries to unravel who this mysterious beauty is and what she's running away from...","img":"https://cdn.myanimelist.net/images/anime/10/23770.webp"},{"title":"Kore wa Zombie Desu ka? OVA","synopsis":"Two OVAs released with the 8th and 10th volumes of the original novel. They fall chronologically between the first and second seasons.","img":"https://cdn.myanimelist.net/images/anime/12/36243.webp"},{"title":"Sora no Otoshimono: Tokeijikake no Angeloid","synopsis":"Movie adaptation of the Sora no Otoshimono manga, based on Kazane Hiyori's arc.","img":"https://cdn.myanimelist.net/images/anime/8/28729.webp"},{"title":"Kami nomi zo Shiru Sekai: Tenri-hen","synopsis":"It is summer break and Keima intends to spend all his time on video games. An old acquaintance, the timid girl Tenri, comes back into the neighborhood—and apparently has a lost soul inside her. It is up to Keima and Elysia to unravel the secrets of her heart.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/43359.webp"},{"title":"Kamigami no Asobi","synopsis":"After discovering a mysterious sword in the storehouse of her home, third-year high school student Yui Kusanagi finds herself suddenly transported to a different world. While exploring her new surroundings, she meets five strange yet handsome men before coming face to face with Zeus: the king of the gods. \n\nIn order to restore the deteriorating relationship between the gods and humans, Zeus has created the Academy of the gods and has chosen Yui to be its one and only instructor. She has one year to educate the young and reluctant deities—including the five strangers she met earlier—on what it means to be human while learning about the gods herself; otherwise, they will all be trapped in Zeus' realm forever.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/60703.webp"},{"title":"Trinity Seven Movie 1: Eternity Library to Alchemic Girl","synopsis":"The film's story begins when Arata inadvertently touches \"Hermes Apocrypha,\" Lilith's Grimoire. Suddenly, he is enveloped by a bright white light, and a girl appears before him. She calls herself Lilim, and treats both Arata and Lilith as her parents. At the same time she appears, something changes in the world. The forbidden Eternal Library awakens. In the Library is sealed the ultimate culmination of Alchemy, the White Demon Lord. The White Demon Lord plots to eliminate Arata and the Trinity Seven to usurp the position of Demon Lord. Bristling with untold power, the White Demon Lord attacks Arata, and triggers a desperate crisis where Arata and the Trinity Seven must save the world in this last battle.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/83172.webp"},{"title":"Hyakuren no Haou to Seiyaku no Valkyria","synopsis":"Some urban legends are best left untested! Yuuto Suou gets more than he bargained for when he joins his childhood friend Mitsuki Shimoya in testing out an urban legend. When he uses his phone to take a picture of himself with the local shrine's divine mirror, he is whisked off into another world—one heavily steeped in the lore of the old Norse myths.\n\nUsing his knowledge gained from school and from his solar-powered smartphone, he has the chance to bring the Wolf Clan, the same people who cared for him, to prominence, all while earning the adoration of a group of magic-wielding warrior maidens known as the Einherjar.\n\n(Source: J-Novel Club)","img":"https://cdn.myanimelist.net/images/anime/1585/95225.webp"},{"title":"Maken-Ki! Two","synopsis":"Takeru continues his education at Tenbi Academy as part of the newly formed Security Committee. As a team with the other members, they battle unscrupulous individuals who use their Maken for evil purposes. In the meantime, his libido and the conflicting romantic interests of the girls surrounding him complicate matters considerably.\n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/10/58191.webp"},{"title":"Walkure Romanze","synopsis":"Taking place at Winford Academy located in an old town called Helen's Hill, the story is all about knights and the sport of jousting. At this school, students learn how to become knights, ride horses and joust properly. The main character is a young man named Takahiro Mizuno who was training to become a knight and jouster but after suffering an injury he dropped out of the knight program and joined the begleiter (assistant) program instead. Due to his animal handling skills and former experience as a jouster, this makes him a hot commodity. Multiple beautiful girls in the school want him to become their personal begleiter, though Takahiro always refuses their offers.\n\nOne day a bizarre accident causes his friend, Mio Kisaski, to be challenged to a jousting duel despite her not actually being a knight. Takahiro agrees to become her temporary begleiter, but that ends up only being the beginning of their partnership as she enrolls in the annual tournament. ","img":"https://cdn.myanimelist.net/images/anime/7/54969.webp"},{"title":"To LOVE-Ru Darkness OVA","synopsis":"Bundled with the 5th, 6th, 8th, 9th, 12th and 13th limited-edition volume of the manga.","img":"https://cdn.myanimelist.net/images/anime/9/41251.webp"},{"title":"Kimi ga Aruji de Shitsuji ga Ore de","synopsis":"Based On a Visual Novel developed by Minato Soft.\n\nDue to family troubles, Ren Uesugi and his sister, Mihato, leave their home. They end up moving to the city but find themselves with a lack of money. Somehow they are able to find work in the form of the Kuonji family's mansion, being employed as servants to the three sisters of the Kuonji family: Shinra, Miyu, and Yume. Being a servant also associates Ren with the mansion's additional servants and the Kuonji sisters' friends.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/5/21532.webp"},{"title":"Hayate no Gotoku!!","synopsis":"Hayate Ayasaki's misfortune continues to hand him the short end of the stick. Now settled into his routine at the Sanzenins' mansion and Hakuou Academy, the butler continues to work as hard as ever in caring for his young mistress Nagi while studying the school's grueling curriculum—all on top of trying his best to survive the multitude of troubles that life relentlessly pushes onto him.\n\nThe unintentional chick magnet's life is far from quiet, forced to deal not only with Nagi's yet unnoticed infatuation with him, but also the evergrowing string of accidentally seduced girls—most notably, the exceptionally plain Ayumu Nishizawa, a friend of his before he became a butler, and the diligent Hinagiku Katsura, Hakuou's student council president. While one struggles to gain his affection and the other desperately tries to deny her own, both the girls are going to make the boy's life a little more complicated than it already is.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/75212.webp"},{"title":"Daitoshokan no Hitsujikai","synopsis":"\"The Shepherd,\" an urban legend of Shiomi Academy, is said to appear before hardworking students to grant them a wish. \n\nWhile engrossed in a book inside the school's renowned Great Library, Kyoutarou Kakei, a second year student and the Library Club's de facto president, receives an email from the Shepherd foretelling an event that will change his fate. Worried by the message, Kyoutarou rushes over to a nearby train station and encounters fellow student Tsugumi Shirasaki, whom he saves from being hit by a derailing train. Grateful for his heroic actions, Tsugumi joins the Library Club and invites Kyoutarou to participate in her mysterious \"Shiomi Happy Project.\" Together with other new members of the club, they strive to make the academy a better place and uncover the identity of the enigmatic Shepherd.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/75230.webp"},{"title":"Boku wa Tomodachi ga Sukunai: Relay Shousetsu wa Ketsumatsu ga Hanpanai","synopsis":"Unaired 13th episode of Boku wa Tomodachi ga Sukunai.","img":"https://cdn.myanimelist.net/images/anime/3/39215.webp"},{"title":"Trinity Seven: Nanatsu no Taizai to Nana Madoushi","synopsis":"Arata is set to be expelled! The only way to save himself is to be taught more about the magic archives from the Trinity Seven themselves.","img":"https://cdn.myanimelist.net/images/anime/3/74066.webp"},{"title":"IS: Infinite Stratos Encore - Koi ni Kogareru Rokujuusou","synopsis":"On a hot day of summer vacation, Charlotte's plan to spend time alone with Ichika at his house is somewhat ruined when Cecilia gets the same idea, later followed by Houki, Lingyin and Laura. The next day, Houki helps out at a summer festival being held at her family's shrine and is surprised when Ichika shows up.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/4/56161.webp"},{"title":"Ai Yori Aoshi","synopsis":"Kaoru Hanabishi, a college student who lives alone, met a beautiful but bewildered girl dressed in a kimono at a train station. He volunteered to guide her way to the address she was looking for, which happened to be in his neighborhood, but turned out to be an empty lot. Not knowing what to do next, Kaoru invited the devastated girl to his apartment and asked for any additional clues to her destination. She supplied him with a photo of two children whom Kauru immediately identified as himself and Aoi Sakuraba, his childhood friend. It turned out that the girl in front of him is Aoi Sakuraba herself, his betrothed fiancee who came all the way to Tokyo to marry him. Her revelation was not only surprising but also reminded the deepest part of Kaoru's memory for why he left the Hanabishi family in the first place.","img":"https://cdn.myanimelist.net/images/anime/7/10172.webp"},{"title":"Ichigo 100%","synopsis":"One day, Manaka Junpei walks to the roof of his school and encounters a beautiful girl falling down from above him and accidentally exposing her strawberry panties. The embarrassed girl runs away before Junpei can find out whom she is. He wishes to become a filmmaker, and this whole experience seemed like it would make the perfect scene in a movie. And so he goes on a search for the girl with the strawberry panties in order to reenact it all on film. But he will soon discover that finding that one girl will not be that easy... \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/20036.webp"},{"title":"Sora no Otoshimono: Project Pink","synopsis":"The gang goes to an indoor swimming pool for some fun in the sun.  As expected, all hell breaks loose when Tomoki goes on one of his perverted missions.\n\nMeanwhile, Nymph is having some issues with the loss of her master and considers asking Tomoki to be her replacement master.\n\nThis episode was not aired on TV because it was deemed too dangerous...","img":"https://cdn.myanimelist.net/images/anime/2/19135.webp"},{"title":"Uta no☆Prince-sama♪ Maji Love 2000%","synopsis":"Entering her Master's course, Nanami Haruka is facing an even more difficult time. And she isn't the only one. The main six members of Starish are assigned new seniors to watch over them! But the seniors aren't having the best attitudes about it. \n\nWatch Uta no☆Prince-sama♪ Maji Love 2000% and find yourself completely engaged in a whole new adventure mixed in with comedy and romance!","img":"https://cdn.myanimelist.net/images/anime/12/44019.webp"},{"title":"Kore wa Zombie Desu ka? of the Dead: Hai, Minotake ni Attemasu","synopsis":"An unaired OVA episode of Kore wa Zombie Desu ka? of the Dead. It is the 11th episode and was bundled with the sixth volume of the manga. ","img":"https://cdn.myanimelist.net/images/anime/4/43515.webp"},{"title":"White Album","synopsis":"Can a relationship between a regular college student and an idol singer survive? That is the question that White Album tries to answer. Touya Fujii is a normal college student with normal worries—namely balancing his classes and his job he works to pay for school. He is also concerned about the amount of time he has to spend with Yuki Morikawa, or rather, the lack of it.\n\nBeing an up and coming idol singer, Yuki has concerns of her own. Even though she's not yet as popular as experienced veteran Rina Ogata, Yuki is turning heads and landing interviews on television. This should be a good thing, but not everyone is happy about the attention she receives from the media and from Rina. The idol industry is surprisingly cutthroat, and rival singers have their eyes on Yuki.\n\nWhile it may seem exciting to watch your girlfriend on television, how does Touya really feel about all this? Between the challenges associated with Yuki's career and other people that Touya meets at his university, their relationship may not last…","img":"https://cdn.myanimelist.net/images/anime/12/43537.webp"},{"title":"Goshuushou-sama Ninomiya-kun","synopsis":"Shungo Ninomiya is just an ordinary, run-of-the-mill high school student who lives at home with his older sister Ryoko—at least when she's not away doing her job as a mercenary. However, Shungo's life ceases to be normal the moment a cute girl named Mayu Tsukimura descends into the middle of his school's campus in a military-grade helicopter. It turns out Ryoko sent this girl, along with her older brother Mikihiro, to live at the Ninomiya household.\n\nBut the newly-arrived siblings are a little special: Mayu is, in fact, a succubus and her brother, an incubus! And as if the circumstances are not problematic enough, Mayu is crippled with androphobia—the fear of men—and it's up to Shungo to help her overcome this at the behest of his sister. Ryoko plans to force Mayu to be closer to Shungo, and to do this, she’ll employ some questionable methods such as having them share the same bed and even take baths together. \n\nThe situation further complicates when student council president Reika Houjou arrives as the new maid of the Ninomiya family, and she will stop at nothing to thwart Shungo and Mayu’s sexually-geared training. With the sudden arrival of all these oddities, Shungo's ordinary life is about to be thrown into utter turmoil.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/75603.webp"},{"title":"H2O: Footprints in the Sand","synopsis":"Takuma Hirose is a blind young male high school student, though the cause for his blindness is undetermined. In order to heal his medical condition, he is sent to live in a village with his uncle. There, he meets several girls, three of which stand out more than any of the others. They are Hayami Kohinata, Hinata Kangura, and Otoha. Otoha temporarily heals his blindness and Hirose uses his sight to help others. He finds out that, for some reason, Hayami Kohinata is hated in the village, and he tries his best to help her out. Meanwhile, many sad secrets unfold in the village...","img":"https://cdn.myanimelist.net/images/anime/2/5962.webp"},{"title":"Kiniro no Corda: Primo Passo","synopsis":"Seiso Academy is a prestigious high school that sorts students into two majors: General Studies, characterized by distinct grey uniforms, and Music Studies, characterized by pristine white uniforms. While rushing to class one morning, General Studies student Kahoko Hino has a chance encounter with Lili, a small fairy searching for someone with the ability to see her. Lili flies away, and Kahoko, puzzled by their meeting, continues on her way.\n\nLater that day, the participants of a school-wide music competition are announced, and all of them are, unsurprisingly, Music Studies students—at least until Kahoko's name is read out. Immediately tracking down Lili, the small fairy gifts Kahoko a magical violin and convinces her to participate in the competition.\n\nKiniro no Corda: Primo Passo follows Kahoko's endeavors alongside Lili, as the young student must now face the challenges of competition and go head-to-head against her competitors while navigating a new world of classical music.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/7228.webp"},{"title":"Diabolik Lovers More,Blood","synopsis":"Yui Komori, still held captive by the Sakamaki brothers—pureblood vampires after her blood—experiences yet more bizarre twists to her life following her stay at their household. Though haunted by enigmatic dreams, Yui soon deciphers their meaning when caught in a car crash, which subsequently leads to meeting four new vampires: the Mukami brothers, Ruki, Azusa, Kou, and Yuuma, who themselves capture the bewildered girl.\n\nYui later awakens in the Mukami mansion, where the brothers reveal their plans for her: she is their \"Eve,\" and her blood will find the \"Adam\" among them; together, they will have the power to rule the world. However, with the Sakamaki brothers hot on their heels, things might not go quite as smoothly as they had imagined.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/73657.webp"},{"title":"Maburaho","synopsis":"In the world of Maburaho, everyone is born with the ability to use magic and are thus labeled magicians. However, the magical ability of each person is not equal. The number of times you can use magic determines the amount of respect you receive, and since one’s magical power is determined at birth by traits and genetics, those who have a bloodline stemming from famous magicians are highly sought after.\n\nHaving the lowest magic count in Aoi Academy, Kazuki Shikimori is looked down upon by his classmates and seen as a nearly worthless magician. However, his bloodline consists of many great magicians throughout the ages, meaning that while he may not be a great magician, his offspring could be. This leads to him being sought after by three different young women: Yuna Miyama, a transfer student who declares herself his wife upon arrival, Rin Kamishiro, a prideful swordswoman of a traditional family who wants to kill him so she will be free to pursue her own desires, and Kuriko Kazetsubaki, a member of an influential family who bluntly tries to seduce him for his genes.\n\nNow he has to deal with not only the jealousy of all the guys in his school, but also various women chasing after him!","img":"https://cdn.myanimelist.net/images/anime/9/79204.webp"},{"title":"Saenai Heroine no Sodatekata: Ai to Seishun no Service-kai","synopsis":"Tomoya Aki, Megumi Katou, Eriri Spencer Sawamura, Utaha Kasumigaoka and Tomoya's cousin Michiru Hyoudou (all members of a doujin circle called Blessing Software) go out location scouting for their project, a video game. As Eriri attempts to get Megumi to act out a scenario for the main heroine, Utaha lures Tomoya away and forces him to act out a romantic scenario with her.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/6/70493.webp"},{"title":"5-toubun no Hanayome ∬","synopsis":"Second season of 5-toubun no Hanayome. \n","img":"https://cdn.myanimelist.net/images/anime/1234/106118.webp"},{"title":"Dance with Devils","synopsis":"Ritsuka Tachibana has always been a good student, so she is completely shocked when she is suddenly summoned by the student council. Even more, they seem to think of Ritsuka as a troublemaker. Led by the handsome Rem Kaginuki, the student council—also consisting of Urie Sogami, Shiki Natsumizaka and Mage Nanashiro—tries to question her, but it soon becomes clear that they have ulterior motives. \n\nHowever, this is only the beginning. When her mother gets kidnapped, her life is turned upside down, and Ritsuka gets drawn into a world of vampires and devils. Both groups are searching for the \"Grimoire,\" a forbidden item allowing its owner to rule the world. The return of her brother Lindo from overseas gives her hope, but even he appears to be hiding something. In a world filled with secrets, Ritsuka questions whom she can trust in this dark musical tale, while the handsome and dangerous members of the student council compete for her attention. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/75640.webp"},{"title":"Hyakka Ryouran: Samurai Bride","synopsis":"Second season of Hyakka Ryoran: Samurai Girls. ","img":"https://cdn.myanimelist.net/images/anime/5/45248.webp"},{"title":"Shinmai Maou no Testament: Toujou Basara no Hard Sweet na Nichijou","synopsis":"An unaired episode of Shinmai Maou no Testament, bundled with the eighth light novel volume.","img":"https://cdn.myanimelist.net/images/anime/12/69911.webp"},{"title":"R-15","synopsis":"R-15 is about a boy, Taketo Akutagawa, who attends a school for geniuses: Inspiration Academy Private High School. Taketo is a genius novelist and writes erotica. Despite negative perceptions many people have of him, he aims to be at the top of his class and be recognized as the world's greatest writer.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/9/33029.webp"},{"title":"Girls Bravo: Second Season","synopsis":"Small for his age, Yukinari has been bullied and abused by girls all his life. Now in high school, he has developed a rare condition: whenever girls touch him, or even come close, he breaks out in hives. Imagine his surprise, when he is suddenly transported to the city of Seiren on a mystic world invisibly orbiting the Earth, and populated with vast numbers of women and very few men. Fortunately, he has a new friend, Miharu-chan, whose touch inexplicably doesn't affect him.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/20149.webp"},{"title":"High School DxD BorN: Yomigaeranai Fushichou","synopsis":"Unaired anime episode bundled with the limited edition of High School DxD DX.2.","img":"https://cdn.myanimelist.net/images/anime/7/77358.webp"},{"title":"Onegai☆Twins","synopsis":"Maiku Kamishiro's past has always been somewhat of a mystery to him. The only clue he has to who his family might be is an old photograph showing two young children, a boy and a girl, playing in a small pool outside of a blue house. In an attempt to find his family, he moves to this blue house and begins working as a programmer. He's living a comfortable life until the day two very different girls show up at his door, both in possession of the same photograph, and both claiming to be his twin. With no way to prove who is a relative and who is a stranger, Maiku allows both girls to move in with him until they know for sure. \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/5/7090.webp"},{"title":"Sora no Otoshimono Final: Eternal My Master","synopsis":"The second movie of Sora no Otoshimono that concludes the anime series.","img":"https://cdn.myanimelist.net/images/anime/3/58059.webp"},{"title":"Zero no Tsukaima: Princesses no Rondo - Yuuwaku no Sunahama","synopsis":"DVD beach episode of Zero no Tsukaima: Princesses no Rondo. Also known as episode #6.5.","img":"https://cdn.myanimelist.net/images/anime/6/12370.webp"},{"title":"Nagasarete Airantou","synopsis":"Ikuto Touhohin just had a fight with his old man, one that led him to make a rash decision to run away from home. He boards a ship, deciding to take a vacation, but the ship is suddenly hit by a huge storm—one that sends Ikuto overboard! When he regains consciousness, he realizes he is still alive on some island. An isolated island. An isolated island with nothing but girls. Beautiful girls. Stranded on an island with only girls, no electricity, gas, radio, television, like he was back in the stone age.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/7/75254.webp"},{"title":"Oretachi ni Tsubasa wa Nai: Under the Innocent Sky.","synopsis":"Haneda Takashi has a secret he cannot speak of. To leave his dull school-life, he was supposed to have escaped to another world. However, he is reeled in by certain ties on his heart. One of these is Kobato, his awkward younger sister. The other is Watarai Asuka, his negligent girlfriend.\n\nChitose Shuusuke is a poor freeloader. He passes his days working at various part-time jobs. One day, he has a disastrous first encounter with Tamaizumi Hiyoko. The next time they meet, Shuusuke discovers that they are fellow employees at his part-time job.\n\nNarita Hayato sees himself as a \"hard-boiled\" person. Back-breaking jobs are nothing to him. Hayato shuns normal human contact, but, during the nights, he would get together with delinquents and other denizens of the night. One such night, he meets the cheerful and oblivious Otori Naru.\n\nThe relationships with these girls will greatly affect these 3 young men. But what, exactly, is the relationship these young men have with each other?\n\n(Source: AnimeNFO)","img":"https://cdn.myanimelist.net/images/anime/9/75449.webp"},{"title":"Negima!?","synopsis":"A remake of the Negima anime with its own original story.\n\nWizard Negi Springfield may be a boy, but he has a man-sized job to do! Fresh from the Academy of Magic, Negi continues his training as an instructor at Mahora Academy in Japan. But before he can get his Masters in magic, the 31 schoolgirls of Class 3-A are gonna keep him up all night cramming for a final exam in will power. Temptation aside, Negi has more on his syllabus than flirting and spells. Darkness is closing in, and Negi is gonna need help from his lovely student bodies to drive the ghouls from their school. These girls want to prove that they're the best in class, and extra credit is available to the cuties that aren't afraid of after-hours phantom fighting!\n\n(Source: DVD case)","img":"https://cdn.myanimelist.net/images/anime/8/73997.webp"},{"title":"Oniichan no Koto nanka Zenzen Suki ja Nai n da kara ne!!","synopsis":"Junior High student Nao's brother complex is so strong, it's almost at the point of incest. She's determined to make her brother, High School student Shuusuke, see her as a woman. So determined, that she goes as far as going into his room to throw away all his non-incest related porn. But as she's looking for his porno stash, she finds a photo album... and she's not in any of his childhood pictures. What is going on?\n\n(Source: MU)","img":"https://cdn.myanimelist.net/images/anime/3/75499.webp"},{"title":"Conception","synopsis":"On his high school graduation day, Itsuki's cousin, Mahiru, tells him that she's pregnant. Just then, a gate of light emerges and transports the two into the world of Granvania. In this land, \"Impurities\" have been causing a disturbance to the Stars, ultimately plunging Granvania into chaos and disorder. And Itsuki, now revealed to be one who is fated to meet with the \"Star Maidens\", is seen as Granvania's last hope and was thus given the task to produce \"Star Children\" and combat the \"impurities\". And unless the task is complete, Itsuki may never be able to return home.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/1849/95019.webp"},{"title":"D.C.: Da Capo","synopsis":"Every year the flowers bloom. Mysterious Cherry Blossoms blooming all over a crescent shaped island. That island is the island of Hatsune...\n\nThe main character who goes to Kazami Academy, Asakura Junnichi, has the power to see the dreams of other people in his sleep. He was also taught magic by an old lady that allows him to create sweets.\n\nOne day, Junnichi seems to have seen someone's dream again while he was sleeping. Inside that dream, a girl who was a childhood friend of his appeared. But, he was woken up by his sister Asakura Nemu, forcing him to come back to his regular life. Nemu doesn't actually have any blood relation to Junnichi but their bond is deeper than other real brothers and sisters. So deep that it gives the illusion that they're lovers.\n\nIt was another peaceful normal day waking up early in the morning and going to Kazami Academy. Together with childhood friend Amakase Miharu, the academy idol Shirakawa Kotori, the two sisters Mizukoshi Moe and Mako who prefer eating nabe on the school roof for lunch. Going through their day as usual, their childhood friend, Yoshino Sakura, who they thought had moved to America suddenly appears. It was a surprise for Junnichi and Nemu. Sakura tells them, \"I came to finish the promise we made during our childhood\"...\n\n(Source: AnimeNfo and AniDB) ","img":"https://cdn.myanimelist.net/images/anime/4/73936.webp"},{"title":"Saenai Heroine no Sodatekata ♭: Koi to Junjou no Service-kai","synopsis":"Episode 0 of Saenai Heroine no Sodatekata ♭ which premiered on Amazon Prime. \n\nThe team has come to the pool of a luxury hotel to do research for a swimsuit event for their game. As always, Utaha and Eriri are fighting, Michiru is doing her own thing, and of course Megumi is being aloof. Episode zero is here to bring you the swimsuit episode fans have been waiting for!\n\n(Source: Amazon)","img":"https://cdn.myanimelist.net/images/anime/12/85115.webp"},{"title":"Monster Musume no Iru Nichijou OVA","synopsis":"During a physical exam, Miia, Centorea, and Mero discover that they have gained too much weight due to Kimihito Kurusu's delicious cooking. To remedy this, Polt offers them first use of her new pool and gym facility before its grand opening. However, it's not all fun and games, as the three girls' competitive spirits start to flare up!\n\nMeanwhile, when Rachnera Arachnera receives a letter from her previous host family, she finds out that they would like to meet with her and apologize for the events that caused her transfer. But, as it turns out, not only do they want to apologize, they want her back as well! When the family's daughter, Ren Kunanzuki, shows up at the front door, the gang must convince her to let Rachnera stay at Kimihito's house. \n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/2/83661.webp"},{"title":"Amaenaide yo!!","synopsis":"Satonaka Ikkou, a 16 year old boy, is a first year trainee at the Saienji Buddhist Temple. He was sent there by his parents to be trained by his grandmother, the Saienji Priestess. At the temple he finds himself surrounded by beautiful female priestesses-in-training. Upon seeing a girl naked, Ikko has the ability to turn into a super-monk, performing massive exorcisms for the good of the temple.\n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/2/32071.webp"},{"title":"To LOVE-Ru Darkness 2nd Specials","synopsis":"Extra episodes of To LOVE-Ru Darkness 2nd bundled with the seventh Blu-ray and DVD volume.","img":"https://cdn.myanimelist.net/images/anime/9/79330.webp"},{"title":"Seitokai no Ichizon Lv.2","synopsis":"Sugisaki Ken, through diligence and academic excellence, had successfully entered the paradise that is the Hekiyou Private Academy's Student Council. There, he boldly embarks on his plan to create his personal harem with the 4 girls who are the other council members, namely: The incredibly youthful president Sakurano Kurimu; The cool and kindly yet super-sadistic secretary Akaba Chizuru; Tomboyish and hot-blooded vice-president Shiina Minatsu; and The ephemerally beautiful yet complicated treasurer Shiina Mafuyu. While every day since then has been non-stop fun, Graduation Day now looms near. Could this spell the end of their carefree days?\n\n(Source: translated and adapted from official site by Cranston)","img":"https://cdn.myanimelist.net/images/anime/13/75645.webp"},{"title":"Tayutama: Kiss on My Deity","synopsis":"Yuuri Mito is a typical, normal Japanese teenager.  He goes to school, works on people's motorcycles and performs exorcisms.  Okay, that last part's a little bit unusual, but his family lives in a shrine and they do that sort of thing.  Still, you would think he'd know enough to be careful with an ancient relic he finds in the woods, especially when a mysterious goddess appears and tells him to leave it alone.  Unfortunately, despite Mito's best efforts, the seal gets broken anyway and a number of dangerous \"tayuti\" that it held in stasis get loose.  This is bad.  Mito also ends up with a beautiful goddess girl who decides that she's going to marry him.  This might not be so bad. if he wasn't already caught up in the middle of a war between the entities he's released.  The flesh may be weak but the spirit's more than willing to compensate. \n\n(Source: Sentai Filmworks)","img":"https://cdn.myanimelist.net/images/anime/2/11972.webp"},{"title":"Tenchi Muyou!","synopsis":"Tenchi Masaki's life changes forever when the ship of an infamous space pirate, Ryouko Hakubi, is shot down and crashes near his family's temple. Little did Tenchi know that by saving Ryouko, he would spark a series of events that would lead alien women from all walks of life to inhabit his home. This includes the delicate Princess Aeka of Jurai and her playful younger sister Princess Sasami; the scatterbrained first-class detective Mihoshi Kuramitsu and her more capable partner Kiyone Makibi; and the eccentric, mad scientist Washuu Hakubi.\n\nThe six women do their best to adapt to their new lives, but their more advanced and exotic lifestyle does not mesh well with the simplistic customs on Earth. As a result, they just end up making a mess and causing trouble for poor Tenchi. Though the girls are a pain, Tenchi begins to form a close relationship with each of them, and through their bond, he begins to gain a better understanding of his role in the universe.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/61663.webp"},{"title":"Ore no Nounai Sentakushi ga, Gakuen Love Comedy wo Zenryoku de Jama Shiteiru OVA","synopsis":"Unaired TV episode bundled with the light novel's volume eight.","img":"https://cdn.myanimelist.net/images/anime/6/63023.webp"},{"title":"IS: Infinite Stratos 2 - World Purge-hen","synopsis":"A program called \"World Purge\" sends illusions to all the girls about their ideal fantasies.\n\n(Source: AICW)","img":"https://cdn.myanimelist.net/images/anime/9/67545.webp"},{"title":"To LOVE-Ru Darkness 2nd OVA","synopsis":"A scan of Jump SQ's September issue, to be released on August 4, revealed that the fifteenth volume of To LOVE-Ru Darkness will bundle a new OVA, which will be released on January 4. Consisting of two episodes, the OVA will run for a total of 25 minutes. One episode, titled Ghost Story Kowai no wa Ikaga (How about something scary?), will adapt a side-story from volume nine. The second episode, titled Clinic Sunao ni Narenakute (Without becoming obedient), will adapt chapter 38.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/13/76320.webp"},{"title":"Nisekoi: OVA","synopsis":"Bundled with the 21st volume of the Nisekoi manga.","img":"https://cdn.myanimelist.net/images/anime/8/78149.webp"},{"title":"Shinmai Maou no Testament Burst: Toujou Basara no Shigoku Heiwa na Nichijou","synopsis":"An OVA that will be bundled with the seventh volume of the Shinmai Maou no Testament manga, to be released January 2016. ","img":"https://cdn.myanimelist.net/images/anime/1568/95614.webp"},{"title":"Ai Yori Aoshi: Enishi","synopsis":"Two years after meeting Aoi, Kaoru and gang are still up to their normal habits. Kaoru now in grad school and the tenants being as rowdy as ever what will become of Aoi and Kaoru's love.\n\nTwo years has passed since Aoi and Kaoru were freed from the bonds of their families. They continue to live their normal lives with their usual friends in their house.","img":"https://cdn.myanimelist.net/images/anime/10/71425.webp"},{"title":"Gakuen Heaven","synopsis":"Itou Keita, an average guy, is shocked when he's invited to attend the elite institution, \"Bell Liberty Academy.\" Unnerved by the mystery, he's further distracted by the school's social dynamics. In a sea of amazing young men, Keita struggles to find out what makes him unique, and how he can possibly deserve to be treated as an equal by the boys of BL. Lacking any particular ability, just why has Itou been welcomed into the privileged world of the talented and the beautiful? \n\nAlong the way, he develops intense relationships with the almost everyone at school but he is terribly drawn to the friendly, over-caring but very mysterious classmate, Kazuki Endou.","img":"https://cdn.myanimelist.net/images/anime/12/70143.webp"},{"title":"Trinity Seven Movie 2: Heavens Library to Crimson Lord","synopsis":"Heavens Library to Crimson Lord brings back Arata, Lilith, and the rest of the Trinity Seven to face off against the greatest enemy in the history of the Trinity Seven; Lilith's own father, who is revealed to be the strongest Demon Lord, challenges Arata who is now a Demon Lord candidate.\n\n(Source: Avex Pictures, edited)","img":"https://cdn.myanimelist.net/images/anime/1215/100764.webp"},{"title":"High School DxD Hero: Taiikukan-ura no Holy","synopsis":"Alternative version of final three episodes of High School DxD BorN.","img":"https://cdn.myanimelist.net/images/anime/1879/91882.webp"},{"title":"Masamune-kun no Revenge OVA","synopsis":"Bundled with the limited edition 10th volume of the Masamune-kun no Revenge manga.","img":"https://cdn.myanimelist.net/images/anime/1062/92517.webp"},{"title":"Starry☆Sky","synopsis":"The protagonist, Tsukiko Yahisa, enrolled to a school that was recently changed from all-boys school to co-ed. Since the area where the school is conveniently rural and the rather exclusive curriculums the school has, up until now the protagonist is the only one female who enrolled to the school.\n\nIn Starry Sky, the 13 constellations of the Zodiac are personified into handsome young men. The anime will be directed by Kiyomo Sayaka who worked with Vampire Knight. Similar to Hetalia - Axis Powers, Starry Sky's anime will be distributed through the Animate.tv website and other means.","img":"https://cdn.myanimelist.net/images/anime/7/27459.webp"},{"title":"Aishen Qiaokeli-ing...","synopsis":"Jiang Hao Yi, a normal, high school student who is extremely scared of getting into trouble suddenly becomes the Harem King of his school and gets confessed to by a bunch of beautiful girls! The worst thing is, Jiang hao doesn't know any of the girls who confessed to him! What on earth is happening?\n\n(Source: Overworld Scans)","img":"https://cdn.myanimelist.net/images/anime/6/78011.webp"},{"title":"Saenai Heroine no Sodatekata Fine","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1681/104034.webp"},{"title":"Arifureta Shokugyou de Sekai Saikyou 2nd Season","synopsis":"Second season of Arifureta Shokugyou de Sekai Saikyou.","img":"https://cdn.myanimelist.net/images/anime/1198/103431.webp"},{"title":"Shuffle! Memories","synopsis":"A recap of the Shuffle world, set ten years in the future. Gods, Demons, and Humans freely visit the other worlds as if traveling overseas, and romance is in the air. Demons, Gods, And Humans together have been falling in love and creating new families, breaking down the wall that once seperated them. Past memories are visited by Rin Tsuchimi and the events that occured between him and Lisianthus, Nerine, Kaede, Asa, and Primula. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/19624.webp"},{"title":"Nobunaga-sensei no Osanazuma","synopsis":"\"One day, a girl who loves me will suddenly appear before me\"—Middle school teacher Nobunaga has always been dreaming of such a gal game-like situation. However, the one who appeared before him was Kichou, a 14-year-old girl who proclaims herself as his wife. Appears to have arrived from the Sengoku era, she mistakes Nobunaga as Nobunaga Oda and urges him to conceive a child with her. Thus begins the age-difference love comedy between a gal game-loving teacher and a Sengoku era expert princess.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1524/97286.webp"},{"title":"Shinmai Maou no Testament Departures","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1395/95778.webp"},{"title":"Uta no☆Prince-sama♪ Maji Love Revolutions","synopsis":"The third anime adaptation of the otome game Uta no☆Prince-sama♪.\n\nStarish are given new assignments in newly divided teams, and they do their best in order to try and impress Shining Saotome into allowing their entry to SSS, a top level music contest. Meanwhile, Haruka works with the Quartet Night. ","img":"https://cdn.myanimelist.net/images/anime/2/73328.webp"},{"title":"Val x Love","synopsis":"High-schooler Akutsu Takuma has learned to accept his lonely lot in life and is content surrounded by his studies, but when the god Odin taps him to save the world alongside nine Valkyries fueled by intimacy, Takuma can say good-bye to his solitary existence!\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1238/102067.webp"},{"title":"Hayate no Gotoku! Can't Take My Eyes Off You","synopsis":"Taking place one month after the events that occurred in the movie Heaven is a Place on Earth. Living at the Sanzenin Mansion once again, Nagi returns to her old ways of life, until she receives word from American authorities informing her that she has a week to pick up her late father's belongings that was indefinitely delayed due to various circumstances. After receiving news of her father whom she doesn't remember, Nagi then meets a mysterious girl (with a hidden agenda) claiming to be Nagi's little sister.\n\nThe series tells a new story that is original to the anime and not directly based on the manga. The main author of the original series Kenjiro Hata personally created the original concept for the story of this anime. \n\n(Source: Hayate no Gotoku! Wikia)","img":"https://cdn.myanimelist.net/images/anime/10/73952.webp"},{"title":"IS: Infinite Stratos 2 - Hitonatsu no Omoide","synopsis":"An extended version of the second season's first episode, which is under the same title.","img":"https://cdn.myanimelist.net/images/anime/7/56159.webp"},{"title":"Amaenaide yo!! Katsu!!","synopsis":"In this sequel, a girl named Kazusano Kazuki joins up with the 6 girls and Ikko. With Kazuki around, Ikko will find himself in more embarrassing situations with these priestesses-in-training.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/15153.webp"},{"title":"Maken-Ki! OVA","synopsis":"OVA episodes bundled with the 8th and 11th volumes of the manga.","img":"https://cdn.myanimelist.net/images/anime/7/36929.webp"},{"title":"Bonjour♪Koiaji Pâtisserie","synopsis":"Sayuri Haruno dreams of becoming a pastry chef and enrolls in Fleurir Confectionary Academy, an elite school located in Tokyo's trendy Aoyama district. At Fleurir, she finds herself surrounded by charming boys, each one distinctly unique. Out of the entire class, Ryou Kouzuki's desire to become a pastry chef is the strongest. Blessed with unparalleled technique, instructor Mitsuki Aoi acts like a prince and is hugely popular at the school. Gilbert Hanafusa, the mood maker of the bunch, is a student from France. Yoshinosuke Suzumi is not very good at expressing his feelings, but underneath his stony exterior lies a wholehearted passion for wagashi (Japanese sweets).\n\nAs Sayuri pours her heart and soul into making her dream a reality, she encounters many happenings...\n\n(Source: NTV)","img":"https://cdn.myanimelist.net/images/anime/5/66059.webp"},{"title":"Sekirei: Pure Engagement Episode 0","synopsis":"Episode 0, consisting of two subepisodes: \"Sekirei Shindan\" (鶺鴒診断) and \"Sekirei Yoka\" (鶺鴒余暇), of Sekirei: Pure Engagement included on the first DVD/BD volume.","img":"https://cdn.myanimelist.net/images/anime/9/25948.webp"},{"title":"Mangaka-san to Assistant-san to The Animation Specials","synopsis":"Specials released with the Blu-ray/DVD volumes.","img":"https://cdn.myanimelist.net/images/anime/9/63827.webp"},{"title":"Zero no Tsukaima: Princesses no Rondo Picture Drama","synopsis":"Picture Drama episodes included in each DVD volumes of Zero no Tsukaima: Princesses no Rondo.\n\nEpisode Titles:\nvol.1 「Maid's Afternoon: Whip of Love」(メイドの午後　愛のムチ編)\nvol.2 「Maid's Afternoon: Afternoon for Two」(メイドの午後　二人きりの昼下がり編)\nvol.3 「Maid's Afternoon: The Last Night」 (メイドの午後　最後の夜編)\nvol.4 「Countess Butterfly's Graceful Day」 Prologue (バタフライ伯爵夫人の優雅な一日 序章)\nvol.5 「Countess Butterfly's Graceful Day」 Chapter 1 (バタフライ伯爵夫人の優雅な一日 第1章)\nvol.6 「Countess Butterfly's Graceful Day」 Chapter 2 (バタフライ伯爵夫人の優雅な一日 第2章)\nvol.7 「Countess Butterfly's Graceful Day」 The Last Chapter (バタフライ伯爵夫人の優雅な一日 最終章)","img":"https://cdn.myanimelist.net/images/anime/12/22142.webp"},{"title":"White Album 2nd Season","synopsis":"The second season of White Album, also known as episodes 14-26.","img":"https://cdn.myanimelist.net/images/anime/7/43541.webp"},{"title":"High School DxD","synopsis":"High school student Issei Hyoudou is your run-of-the-mill pervert who does nothing productive with his life, peeping on women and dreaming of having his own harem one day. Things seem to be looking up for Issei when a beautiful girl asks him out on a date, although she turns out to be a fallen angel who brutally kills him! However, he gets a second chance at life when beautiful senior student Rias Gremory, who is a top-class devil, revives him as her servant, recruiting Issei into the ranks of the school's Occult Research club.\n\nSlowly adjusting to his new life, Issei must train and fight in order to survive in the violent world of angels and devils. Each new adventure leads to many hilarious (and risqué) moments with his new comrades, all the while keeping his new life a secret from his friends and family in High School DxD!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/32527.webp"},{"title":"Nisekoi","synopsis":"Raku Ichijou, a first-year student at Bonyari High School, is the sole heir to an intimidating yakuza family. Ten years ago, Raku made a promise to his childhood friend. Now, all he has to go on is a pendant with a lock, which can only be unlocked with the key which the girl took with her when they parted.\n\nNow, years later, Raku has grown into a typical teenager, and all he wants is to remain as uninvolved in his yakuza background as possible while spending his school days alongside his middle school crush Kosaki Onodera. However, when the American Bee Hive Gang invades his family's turf, Raku's idyllic romantic dreams are sent for a toss as he is dragged into a frustrating conflict: Raku is to pretend that he is in a romantic relationship with Chitoge Kirisaki, the beautiful daughter of the Bee Hive's chief, so as to reduce the friction between the two groups. Unfortunately, reality could not be farther from this whopping lie—Raku and Chitoge fall in hate at first sight, as the girl is convinced he is a pathetic pushover, and in Raku's eyes, Chitoge is about as attractive as a savage gorilla. \n\nNisekoi follows the daily antics of this mismatched couple who have been forced to get along for the sake of maintaining the city's peace. With many more girls popping up his life, all involved with Raku's past somehow, his search for the girl who holds his heart and his promise leads him in more unexpected directions than he expects.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/75587.webp"},{"title":"Ouran Koukou Host Club","synopsis":"Haruhi Fujioka is a bright scholarship candidate with no rank or title to speak of—a rare species at Ouran Academy, an elite school for students of high pedigree. When she opens the door to Music Room #3 hoping to find a quiet place to study, Haruhi unexpectedly stumbles upon the Host Club. Led by the princely Tamaki Suou, the club—whose other members include the \"Shadow King\" Kyouya Ootori; the mischievous Hitachiin twins, Kaoru and Hikaru; the childlike Mitsukuni Haninozuka, also known as \"Honey\"; and his strong protector Takashi \"Mori\" Morinozuka—is where handsome boys with too much time on their hands entertain the girls in the academy.\n\nIn a frantic attempt to remove herself from the hosts, Haruhi ends up breaking a vase worth eight million yen and is forced into becoming the eccentric group's general errand boy to repay her enormous debt. However, thanks to her convincingly masculine appearance, her naturally genial disposition toward girls, and fascinating commoner status, she is soon promoted to full-time male host. And before long, Haruhi is plunged into a glitzy whirlwind of elaborate cosplays, rich food, and exciting shenanigans that only the immensely wealthy Host Club can pull off.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/71992.webp"},{"title":"Date A Live","synopsis":"Thirty years ago, the Eurasian continent was devastated by a supermassive \"spatial quake\"—a phenomenon involving space vibrations of unknown origin—resulting in the deaths of over 150 million people. Since then, these quakes have been plaguing the world intermittently, albeit on a lighter scale.\n\nShidou Itsuka is a seemingly average high school student who lives with his younger sister, Kotori. When an imminent spatial quake threatens the safety of Tengu City, he rushes to save her, only to be caught in the resulting eruption. He discovers a mysterious girl at its source, who is revealed to be a \"Spirit,\" an otherworldly entity whose appearance triggers a spatial quake. Soon after, he becomes embroiled in a skirmish between the girl and the Anti-Spirit Team, a ruthless strike force with the goal of annihilating Spirits.\n\nHowever, there is a third party that  believes in saving the spirits: \"Ratatoskr,\" which surprisingly is commanded by Shidou's little sister!  Kotori forcibly recruits Shidou after the clash, presenting to him an alternative method of dealing with the danger posed by the Spirits—make them fall in love with him. Now, the fate of the world rests on his dating prowess, as he seeks out Spirits in order to charm them.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/44844.webp"},{"title":"Zero no Tsukaima","synopsis":"Louise Françoise Le Blanc de La Vallière is a self-absorbed mage in a world of wands, cloaks, and royalty. Although she studies at Tristain Academy, a prestigious school for magicians, she has a major problem: Louise is unable to cast magic properly, earning her the nickname of \"Louise the Zero\" from her classmates.\n\nWhen the first year students are required to perform a summoning ritual, Louise's summoning results in a catastrophic explosion! Everyone deems this to be yet another failure, but when the smoke clears, a boy named Saito Hiraga appears. Now Louise's familiar, Saito is treated as a slave, forced to clean her clothes and eat off the ground. But when an unfamiliar brand is found etched on Saito's hand from the summoning ritual, it is believed to be the mark of a powerful familiar named Gandalfr.\n\nWild, adventurous, and explosive, Zero no Tsukaima follows Saito as he comes to terms with his new life and as Louise proves that there is more to her than her nickname suggests.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/20680.webp"},{"title":"Boku wa Tomodachi ga Sukunai","synopsis":"When Kodaka Hasegawa finds out that he will be transferring to a new school, he is determined to make a positive impression, and maybe even some friends. However, Kodaka discovers he is out of luck when he immediately gets labeled as a violent delinquent due to his blond hair and intimidating expression. Although a month has passed, Kodaka is still alone thanks to his notorious reputation. However, his life begins to change when he finds fellow loner Yozora Mikazuki talking to her imaginary friend in an empty classroom.\n\nAfter sharing stories of their lonely high school life, Kodaka and Yozora decide to overcome the difficulties of making friends together by starting the Neighbor's Club. Created for people who don't have friends, daily activities involve learning social skills and how to fit in, which will hopefully allow them to make friends. Joined by the eroge-loving Sena Kashiwazaki, and other eccentric outcasts, Kodaka may finally have managed to find people he can call friends, in this club filled with hilarious oddballs.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/32873.webp"},{"title":"High School DxD New","synopsis":"The misadventures of Issei Hyoudou, high school pervert and aspiring Harem King, continue on in High School DxD New. As the members of the Occult Research Club carry out their regular activities, it becomes increasingly obvious that there is something wrong with their Knight, the usually composed and alert Yuuto Kiba. Soon, Issei learns of Kiba's dark, bloody past and its connection to the mysterious Holy Swords. Once the subject of a cruel experiment, Kiba now seeks revenge on all those who wronged him.\n\nWith the return of an old enemy, as well as the appearance of two new, Holy Sword-wielding beauties, it isn't long before Issei and his Devil comrades are plunged into a twisted plot once more.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/47729.webp"},{"title":"Trinity Seven","synopsis":"One day, the bright red sun stopped shining, causing the \"Breakdown Phenomenon\"—the destruction of Arata Kasuga's town and the disappearance of the people inhabiting it. All, however, is not yet lost; by utilizing the magical grimoire given to him by his childhood friend and cousin Hijiri Kasuga, Arata's world gets artificially reconstructed.\n\nIn order to investigate the phenomenon, Lilith Asami appears before Arata, whose artificial world suddenly disintegrates. He is given two choices: hand over the book, or die. However, Arata chooses the third option—enrolling in the top-secret magic school Royal Biblia Academy, where six other magical users await him. Together with Lilith, these six form the Trinity Seven, the elite of the school who each bolster their own power and skill.\n\nWith the ambition to save Hijiri and the help of his newfound friends, Arata stops at nothing to prevent the destruction of his beloved hometown and to bring his best friend back.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/67795.webp"},{"title":"Rosario to Vampire","synopsis":"Youkai Academy is a seemingly normal boarding school, except that its pupils are monsters learning to coexist with humans. All students attend in human form and take normal academic subjects, such as literature, gym, foreign language, and mathematics. However, there is one golden rule at Youkai Academy—all humans found on school grounds are to be executed immediately!\n\nTsukune Aono is an average teenager who is unable to get into any high school because of his bad grades. His parents inadvertently enroll him into Youkai Academy as a last-ditch effort to secure his education. As Tsukune unknowingly enters this new world, he has a run-in with the most attractive girl on campus, Moka Akashiya. Deciding to stay in the perilous realm in order to further his relationship with Moka, he does not realize that beneath her beauty lies a menacing monster—a vampire.\n\nRosario to Vampire is a supernatural school comedy that explores Tsukune's romantic exploits, experiences, and misadventures with a bevy of beautiful but dangerous creatures.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/75242.webp"},{"title":"Kore wa Zombie Desu ka?","synopsis":"Ayumu Aikawa is a 16-year-old high school student who is tragically murdered while investigating a suspicious house. However, he soon awakens next to a strange armored girl called Eucliwood Hellscythe. She reveals herself to be a necromancer who has revived Ayumu, consequently turning him into a zombie! \n\nNow immortal, Ayumu sets out to hunt down his killer. One day, while searching in a cemetery, he encounters a boisterous young girl named Haruna, who is fighting a bear with a chainsaw while dressed as a magical girl. After she kills the beast, Haruna attempts to erase Ayumu's memories of her, but he instead absorbs her magic for himself. Stripped of her powers, Haruna now orders Ayumu to take up her role of hunting strange creatures known as \"Megalo,\" monsters that roam the human world and terrorize the population.\n\nKore wa Zombie Desu ka? follows the daily antics of the human-turned-zombie Ayumu as he begins his new, ludicrous life where the supernatural becomes the norm.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/75521.webp"},{"title":"Yamada-kun to 7-nin no Majo (TV)","synopsis":"When Ryuu Yamada entered high school, he wanted to turn over a new leaf and lead a productive school life. That's why he chose to attend Suzaku High, where no one would know of his violent delinquent reputation. However, much to Ryuu's dismay, he is soon bored; now a second year, Ryuu has reverted to his old ways—lazy with abysmal grades and always getting into fights.\n\nOne day, back from yet another office visit, Ryuu encounters Urara Shiraishi, a beautiful honors student. A misstep causes them both to tumble down the stairs, ending in an accidental kiss! The pair discover they can switch bodies with a kiss: an ability which will prove to be both convenient and troublesome.\n \nLearning of their new power, Toranosuke Miyamura, a student council officer and the single member of the Supernatural Studies Club, recruits them for the club. Soon joined by Miyabi Itou, an eccentric interested in all things supernatural, the group unearths the legend of the Seven Witches of Suzaku High, seven female students who have obtained different powers activated by a kiss. The Supernatural Studies Club embarks on its first quest: to find the identities of all the witches.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/73700.webp"},{"title":"High School DxD BorN","synopsis":"The Red Dragon Emperor, Issei Hyoudou, and the Occult Research Club are back in action as summer break comes for the students of Kuoh Academy. After their fight with Issei’s sworn enemy, Vali and the Chaos Brigade, it is clear just how inexperienced Rias Gremory's team is. As a result, she and Azazel lead the club on an intense training regime in the Underworld to prepare them for the challenges that lie ahead.\n\nWhile they slowly mature as a team, Issei will once again find himself in intimate situations with the girls of the Occult Research Club. Meanwhile, their adversaries grow stronger and more numerous as they rally their forces. And with the sudden appearance of Loki, the Evil God of Norse Mythology, the stage is set for epic fights and wickedly powerful devils in High School DxD BorN!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/73642.webp"},{"title":"Kami nomi zo Shiru Sekai","synopsis":"Keima Katsuragi, known online as the legendary \"God of Conquest,\" can conquer any girl's heart—in dating sim games, at least. In reality, he opts for the two-dimensional world of gaming over real life because he is an unhealthily obsessed otaku of galge games (a type of Japanese video game centered on interactions with attractive girls).\n\nWhen he arrogantly accepts an anonymous offer to prove his supremacy at dating sim games, Keima is misled into aiding a naïve and impish demon from hell named Elucia \"Elsie\" de Lute Ima with her mission: retrieving runaway evil spirits who have escaped from hell and scattered themselves throughout the human world. Keima discovers that the only way to capture these spirits is to conquer what he hates the most: the unpredictable hearts of three-dimensional girls! Shackled to Elsie via a deadly collar, Keima now has his title of \"God of Conquest\" put to the ultimate test as he is forced to navigate through the hearts of a multitude of real-life girls.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/43361.webp"},{"title":"School Days","synopsis":"High school student Makoto Itou first notices Kotonoha Katsura at the start of his second semester, freshman year. Immediately, he becomes entranced by her beauty, but his bashfulness doesn't allow him to approach her, even though they ride the same train every day. Instead, he snaps a photo of her in secret and sets it as his cell phone's wallpaper: a charm that, if kept under wraps, would supposedly help you realize your love. However, classmate Sekai Saionji spots the picture, but instead of ratting him out, she offers to help set him up with Kotonoha—going so far as befriending her just for him. Thus, the trio begins a rather impromptu friendship.\n\nSchool Days follows the lives of these three teenagers as they traverse the joys and hardships that come with being a high schooler. In a story alive and brimming with romance and melancholy, the tale of these three students will linger in memory long after the momentous conclusion. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/86373.webp"},{"title":"Monster Musume no Iru Nichijou","synopsis":"With his parents abroad, Kimihito Kurusu lived a quiet, unremarkable life alone until monster girls came crowding in! This alternate reality presents cutting-edge Japan, the first country to promote the integration of non-human species into society. After the incompetence of interspecies exchange coordinator Agent Smith leaves Kimihito as the homestay caretaker of a Lamia named Miia, the newly-minted \"Darling\" quickly attracts girls of various breeds, resulting in an ever-growing harem flush with eroticism and attraction.\n\nUnfortunately for him and the ladies, sexual interactions between species is forbidden by the Interspecies Exchange Act! The only loophole is through an experimental marriage provision. Kimihito's life becomes fraught with an abundance of creature-specific caveats and sensitive interspecies law as the passionate, affectionate, and lusty women hound his every move, seeking his romantic and sexual affections. With new species often appearing and events materializing out of thin air, where Kimihito and his harem go is anyone's guess!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/75104.webp"},{"title":"IS: Infinite Stratos","synopsis":"An exoskeleton weapon engineered by Japan, Infinite Stratos (IS) can be piloted only by women. Its power and combat prowess are so immense that an international treaty has been signed banning its use as a military asset. \n\nWhen it is discovered that 15-year-old Ichika Orimura is the only male capable of steering an IS, he is forcibly enrolled in the Infinite Stratos Academy: an all-female boarding school, the students of which graduate to become IS pilots. At this training school, Ichika is reunited with two of his childhood friends, Houki Shinonono and Lingyin Huang, and befriends Cecilia Alcott, an IS representative from the United Kingdom.\n\nGuided by the legendary pilot Chifuyu Orimura—their strict homeroom teacher and Ichika's older sister—Ichika and the girls will need to use everything at their disposal to defend themselves and their academy against the dangers that will arise during the course of their thrilling school life.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/74045.webp"},{"title":"Strike the Blood","synopsis":"Kojou Akatsuki's days as an ordinary high school student in the Demon District of Itogami Island come to an abrupt end after a fateful encounter leaves him with the remarkable abilities of a vampire.\n\nIt isn't long before he is thrust into the center of attention when it is discovered that he is the fourth primogenitor, an immensely powerful vampire whom most consider to be merely a legend. Fearing Kojou's destructive potential, the Lion King Organization sends in an apprentice sword-shaman, Yukina Himeragi, to monitor, and should he become a threat, kill the boy deemed the world's most powerful vampire. Forced together by circumstance, the two form an unlikely alliance as Kojou comes to terms with his abilities and they both struggle to protect the city from various emerging chaotic forces.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/56163.webp"},{"title":"Masamune-kun no Revenge","synopsis":"When Masamune Makabe was a child, he was rejected by a rich, beautiful girl named Aki Adagaki, who gave him the nickname ''Piggy'' for being overweight. Devastated, Masamune put great effort into working out to improve his appearance. Now a handsome yet narcissistic high school student, Masamune is determined to exact revenge—he will have Aki fall madly in love with him and ultimately reject her the next time they meet.\n\nTo his surprise, Masamune discovers he has transferred into Aki's school. Setting his plan into motion, Masamune first begins to form a relationship with the ''Brutal Princess'' but, despite his efforts, fails miserably at his initial attempts. Shockingly, when Masamune finally progresses towards his vengeance, he receives a mysterious letter addressing him by his old nickname. Unless Masamune discovers the sender's identity, his plan is doomed before it even starts!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/83709.webp"},{"title":"To LOVE-Ru","synopsis":"Timid 16-year-old Rito Yuuki has yet to profess his love to Haruna Sairenji—a classmate and object of his infatuation since junior high. Sadly, his situation becomes even more challenging when one night, a mysterious, stark-naked girl crash-lands right on top of a bathing Rito.\n\nTo add to the confusion, Rito discovers that the girl, Lala Satalin Deviluke, is the crown princess of an alien empire and has run away from her home. Despite her position as the heiress to the most dominant power in the entire galaxy, Lala is surprisingly more than willing to marry the decidedly average Rito in order to avoid an unwanted political marriage.\n\nTo LOVE-Ru depicts Rito's daily struggles with the bizarre chaos that begins upon the arrival of Lala. With an evergrowing legion of swooning beauties that continuously foil his attempted confessions to Haruna, To LOVE-Ru  is a romantic comedy full of slapstick humor, sexy girls, and outlandishly lewd moments that defy the laws of physics.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/22544.webp"},{"title":"Nisekoi:","synopsis":"Despite having seemingly quelled the war between their respective gangs, Raku Ichijou and Chitoge Kirisaki still carry on with their fake relationship. Eventually, as Chitoge's perception of Raku slowly changes, she even begins to see him as a little charming. \n\nChitoge struggles to come to terms with her newfound feelings for Raku, as a new girl joins the slew of Raku's admirers and the competition among those vying for the yakuza heir's attention grows even fiercer. And amidst all this, Raku's search for his first love and the contents of the mysterious sealed locket continues in Nisekoi:, which picks up where the first season left off.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/72626.webp"},{"title":"Gakusen Toshi Asterisk","synopsis":"In the previous century, an unprecedented disaster known as the Invertia drastically reformed the world. The powers of existing nations declined significantly, paving the way for a conglomerate called the Integrated Empire Foundation to assume control. But more importantly, the Invertia led to the emergence of a new species of humans who are born with phenomenal physical capabilities—the Genestella. Its elite are hand-picked across the globe to attend the top six schools, and they duel amongst themselves in entertainment battles called Festas.\n\nAyato Amagiri is a scholarship transfer student at the prestigious Seidoukan Academy, which has recently been suffering from declining performances. Through a series of events, he accidentally sees the popular Witch of Resplendent Flames, Julis-Alexia von Riessfeld, half-dressed! Enraged, Julis challenges him to a duel for intruding on her privacy. After said duel is voided by the student council president, Ayato reveals that he has no interest in Festas. Instead, he has enrolled in the academy to investigate the whereabouts of his missing elder sister. But when a more devious plot unravels, Ayato sets out to achieve victory, while being surrounded by some of the most talented Genestella on the planet.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/5/76034.webp"},{"title":"Shinmai Maou no Testament","synopsis":"Running into your new stepsister in the bathroom is not the best way to make a good first impression, which Basara Toujou learns the hard way. When his father suddenly brings home two beautiful girls and introduces them as his new siblings, he has no choice but to accept into his family the Naruse sisters: busty redhead Mio and petite silver-haired Maria.\n\nBut when these seemingly normal girls reveal themselves as demons—Mio the former Demon Lord's only daughter and Maria her trusted succubus servant—Basara is forced to reveal himself as a former member of a clan of \"Heroes,\" sworn enemies of the demons. However, having begun to care for his new sisters, Basara instead decides to protect them with his powers and forms a master-servant contract with Mio to keep watch over her.\n\nWith the Heroes observing his every move and the constant threat of hostile demons, Basara has to do the impossible to protect his new family members. Moreover, the protector himself is hiding his own dark secret that still haunts him to this day...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1240/94749.webp"},{"title":"Grisaia no Kajitsu","synopsis":"Yuuji Kazami is a transfer student who has just been admitted into Mihama Academy. He wants to live an ordinary high school life, but this dream of his may not come true any time soon as Mihama Academy is quite the opposite. Consisting of only the principal and five other students, all of whom are girls, Yuuji becomes acquainted with each of them, discovering more about their personalities as socialization is inevitable. Slowly, he begins to learn about the truth behind the small group of students occupying the academy—they each have their own share of traumatic experiences which are tucked away from the world.\n\nMihama Academy acts as a home for these girls, they are the \"fruit\" which fell from their trees and have begun to decay. It is up to Yuuji to become the catalyst to save them from themselves, but how can he save another when he cannot even save himself?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/73591.webp"},{"title":"Zero no Tsukaima: Futatsuki no Kishi","synopsis":"Revered as heroes for their role in defending Tristain, Louise Françoise and her familiar Saito Hiraga face heavy pressure to continue protecting the Kingdom. With an uneasy peace now established within Albion, the newly crowned Queen Henrietta must deal with a political struggle brewing on the horizon. To make matters worse, a new villain has begun plotting in the shadows against the Crown.\n\nWith the continuing threats that face the Kingdom, Louise and Saito are compelled to work together once more. No longer \"Louise the Zero,\" the young mage's newfound aptitude for Void magic gives her enough power to wipe out an entire village; however, wielding these abilities comes with its share of challenges. As more conflicts arise, the idea of placing honor above oneself is put into question—regardless of their answer, their only choice is to see it through until the end.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/22740.webp"},{"title":"Kiss x Sis (TV)","synopsis":"After Keita Suminoe's mother passed away, his father promptly remarried, introducing two step-sisters into Keita's life: twins Ako and Riko. But since their fateful first encounter, a surge of incestuous love for their younger brother overcame the girls, beginning a lifelong feud for his heart.\n\nNow at the end of his middle school career, Keita studies fervently to be able to attend Ako and Riko's high school. While doing so however, he must resolve his conflicting feelings for his siblings and either reject or succumb to his sisters' intimate advances. Fortunately—or perhaps unfortunately for Keita—his sisters aren't the only women lusting after him, and there's no telling when the allure of temptation will get the better of the boy as well.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/25518.webp"},{"title":"Date A Live II","synopsis":"Spirits are otherworldly entities with immense power, capable of creating spatial quakes whenever they appear. One way of dealing with them is through brute force and killing them... or making them fall in love and sealing their powers. \n\nHaving sealed three Spirits, Shidou Itsuka continues his mission with Ratatoskr in locating more spirits and dating them, to ensure the world's safety from further destruction. However, this time around, their problems will not be limited to Spirits as a more imposing threat seems to have noticed their activities.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/5/76003.webp"},{"title":"Boku wa Tomodachi ga Sukunai Next","synopsis":"The Neighbor's Club—a club founded for the purpose of making friends, where misfortunate boys and girls with few friends live out their regrettable lives.\n\nAlthough Yozora Mikazuki faced a certain incident at the end of summer, the daily life of the Neighbor's Club goes on as usual. A strange nun, members of the student council and other new faces make an appearance, causing Kodaka Hasegawa's life to grow even busier.\n\nWhile they all enjoy going to the amusement park, playing games, celebrating birthdays, and challenging the \"school festival\"—a symbol of the school life normal people live—the relations amongst the members slowly begins to change...\n\nLet the next stage begin, on this unfortunate coming-of-age love comedy!!\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/44724.webp"},{"title":"Saenai Heroine no Sodatekata","synopsis":"Tomoya Aki, an otaku, has been obsessed with collecting anime and light novels for years, attaching himself to various series with captivating stories and characters. Now, he wants to have a chance of providing the same experience for others by creating his own game, but unfortunately, Tomoya cannot do this task by himself.\n\nHe successfully recruits childhood friend Eriri Spencer Sawamura to illustrate and literary elitist Utaha Kasumigaoka to write the script for his visual novel, while he directs. Super-group now in hand, Tomoya only needs an inspiration to base his project on, and luckily meets the beautiful, docile Megumi Katou, who he then models his main character after.\n\nUsing what knowledge he has, Tomoya creates a new doujin circle with hopes to touch the hearts of those who play their game. What he does not realize, is that to invoke these emotions, the creators have had to experience the same feelings in their own lives.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/68783.webp"},{"title":"Absolute Duo","synopsis":"Individuals who can materialize weapons from their soul are called \"Blazers,\" and they attend Kouryou Academy High School in order to harness their abilities. Each student is required to partner with another, in the hopes that one day, the pair can attain the power of Absolute Duo.\n\nTooru Kokonoe hopes to attend this academy in order to gain power after his sister and friends were slain by a mysterious man. However, at the opening ceremony, he is forced to duel against the person sitting next to him, with the loser being expelled. As Tooru prepares to give the match his all, it is not a weapon that manifests from his soul, but a shield, an irregularity which catches the attention of a foreign student named Julie Sigtuna.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/68839.webp"},{"title":"Sora no Otoshimono","synopsis":"Ever since he was a child, Tomoki Sakurai has always woke up with tears after a dream of an angel. His childhood friend Sohara Mitsuki worries about this and decides to seek the help of Eishirou Sugata, an eccentric sky maniac. He concludes that Tomoki's dream is undoubtedly connected to what is known as the New World, a floating anomaly that scientists have failed to understand.\n \nRecruiting the New World Discovery Club's first members, Eishirou schedules a time to meet up in order to observe the mystery in the sky. That day, Tomoki's peaceful life is changed forever when a strange girl falls from the sky and begins to call him master.\n \nSora no Otoshimono follows the daily activities of the New World Discovery Club as they begin to learn more about the Angeloids that have arrived on Earth.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/50307.webp"},{"title":"Ichiban Ushiro no Daimaou","synopsis":"Dreaming of changing the world for good, Akuto Sai transfers to Constant Magic Academy where he befriends a virtuous ninja clan member, Junko Hattori. On the way to the academy, they vow to make the world a better place together; however, the situation suddenly takes a turn for the worse upon his arrival—it is prophesied that he will become the Demon King!\n\nAs word of his destiny spreads, the school begins to fear him, and Junko's trust in him falters. While Akuto is determined to not let his predicted future control his fate, it seems as though everything he says and does only serve to reinforce the fact that he is destined to be the Demon King. Moreover, he is surrounded by a harem of beautiful girls who each have their own plans for him, ranging from bringing him to justice to simply showering him with love. With his newly awakened powers, Akuto must cope with his constantly growing list of misfortune and fight to prove that his fate is not set in stone.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/75554.webp"},{"title":"Mayo Chiki!","synopsis":"Due to his mother and sister, who both love professional wrestling, Kinjirou Sakamachi developed a resilient body that could take hard punches, aggressive kicks, and even deadly vehicle bumps, in order to survive their various grappling positions and locks. However, he also developed gynophobia, an abnormal fear of women. With just one touch from a girl, his nose bleeds uncontrollably, he sweats excessively, and in rare cases, faints abruptly.\n\nHis life changes for the worse because of a fated meeting in the restroom. While trying to escape from a girl, he discovers that the most popular student in their school, Subaru Konoe—the butler of the headmaster’s daughter, Kanade Suzutsuki—is actually female! Surprised, Subaru violently assaults Kinjirou, dealing significant damage and knocking him unconscious. When he comes to, he meets Kanade. In exchange for his silence, she promises to help cure his phobia.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/29971.webp"},{"title":"Zero no Tsukaima: Princesses no Rondo","synopsis":"Following his brave sacrifice in the war against Albion, Saito Hiraga is knighted and treated as an aristocrat, something that proves difficult for Louise Françoise Le Blanc de La Vallière. With their relationship no longer defined as the mighty Void mage and clueless familiar, she wonders what exactly this means for them.\n\nWhile venturing to a castle, Louise is ambushed by a powerful mage named Sheffield. Battling alone, the young mage nearly faces defeat until Saito makes his appearance. The mystical and unknown nature of Void magic seems to be at work in the battle, and Louise begins to believe in the possibility of another Void user. Moreover, she realizes that Saito's magical rune is fading, and so a new adventure begins as they search for the elf who revived Saito in the past. The relationship between former master and servant faces a new challenge as they work to restore the runes and redefine the bond which holds them together.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/10256.webp"},{"title":"Hentai Ouji to Warawanai Neko.","synopsis":"Youto Yokodera wants to be seen in a way different from most men: as a pervert. However, his lewd actions are often misinterpreted as good intentions, and people cannot see his true nature. Upon hearing rumors of a cat statue that can banish an unwanted trait, he searches for it and prays for his façade to be removed. But each wish comes at a price: those unwelcomed traits are transferred to someone else who desires them!\n\nAfter realizing that vocalizing his dirty thoughts is not the best thing, Youto decides to regain his lost traits by seeking out the person who received them. Unfortunately, he was not alone in praying to the cat statue, and now he must not only fix his life, but the lives of others as well.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/75788.webp"},{"title":"Ore no Kanojo to Osananajimi ga Shuraba Sugiru","synopsis":"The infidelity of Eita Kidou's parents not only made his family fall apart, but also made him skeptic of love. Having no intention to delve into romance, Eita devotes his entire high school life to his studies in order to become a doctor.\n\nIt did not take long for the beautiful and popular Masuzu Natsukawa to notice Eita's apathy. Tired of being the object of people's affection, she asks him to pretend to be her boyfriend, as she too feels disgusted at the notion of love. Eita, however, refuses—yet Masuzu has one trick left up her sleeve: Eita’s journal and threatening to post the embarrassing content online if he does not comply.\n\nNow entangled in a fake romance with the most desired girl at school, Eita's life is turned upside down. Whether envied by his peers or receiving a confession, he must cope with his newfound relationship and all the troubles that come along with it.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/44187.webp"},{"title":"Isekai Maou to Shoukan Shoujo no Dorei Majutsu","synopsis":"When it comes to the fantasy MMORPG Cross Reverie, none can match the power of the Demon King Diablo. Possessing the game's rarest artifacts and an unrivaled player level, he overpowers all foolish enough to confront him. But despite his fearsome reputation, Diablo's true identity is Takuma Sakamoto, a shut-in gamer devoid of any social skills. Defeating hopeless challengers day by day, Takuma cares about nothing else but his virtual life—that is, until a summoning spell suddenly transports him to another world where he has Diablo's appearance! \n\nIn this new world resembling his favorite game, Takuma is greeted by the two girls who summoned him: Rem Galeu, a petite Pantherian adventurer, and Shera L. Greenwood, a busty Elf summoner. They perform an Enslavement Ritual in an attempt to subjugate him, but the spell backfires and causes them to become his slaves instead. With the situation now becoming more awkward than ever, Takuma decides to accompany the girls in finding a way to unbind their contract while learning to adapt to his new existence as the menacing Demon King.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1649/93412.webp"},{"title":"Rosario to Vampire Capu2","synopsis":"It has been one year since Tsukune Aono enrolled at Youkai Academy, and since then his life has taken an interesting turn. In addition to being the only human at a school for monsters, he has attracted a bevy of beautiful women who want him all for themselves: the sexy succubus Kurumu Kurono; Yukari Sendou, a witch; stalker and yuki-onna Mizore Shirayuki; and Moka Akashiya, a kind vampire who, when her rosary is removed, reveals a darker personality.\n\nBut soon, trouble visits Youkai Academy in the form of Moka's younger sister, Kokoa Shuzen. She is furious that her \"true older sister\" is sealed within Moka's rosary, and vows to bring out Moka's darker self. However, Kokoa's thoughtless actions may affect more than just her sister...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/25093.webp"},{"title":"Yosuga no Sora: In Solitude, Where We Are Least Alone.","synopsis":"Haruka and Sora Kasugano are coming home, to a place filled with memories.\n\nHaving lost their parents in a tragic car accident, the twins resolve to return to the countryside and start life anew at their grandfather's house, the haunt a constant reminder of moments from their past. Greeting them are childhood friends Nao Yorihime and  Akira Amatsume, and newcomer Kazuha Migiwa. It is a warm welcome, symbolic of the days that should come.\n\nTheir peace is merely ephemeral, however, as suppressed emotions, born from vows both newfound and forgotten, start exerting their influence on the twins' new lives. And deep down, a dark secret, only known to them, begins to unshackle.\n\nBased on the visual novel by Sphere, Yosuga no Sora not only explores the power of lost memories and true love when the bonds of many become intertwined, but also raises the questions of morality and social acceptance.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/76216.webp"},{"title":"Ore no Nounai Sentakushi ga, Gakuen Love Comedy wo Zenryoku de Jama Shiteiru","synopsis":"For Kanade Amakusa, life as a high schooler should have been normal, and it would have been—if he wasn't living with the most ridiculous curse imaginable. “Absolute Choice,\" a system forced upon him by a self-proclaimed god, randomly presents a mental selection of actions that he must act out based on his choice. To add to his dilemma, it tends to occur in the most public of places, and his options never seem to deviate from the rude and crude in nature.\n\nAs a result, the helpless boy stresses through each day, fumbling to repair his already tarnished reputation while desperately praying to avoid the next spontaneous episode of Absolute Choice. To his dismay, the one in charge is always one step ahead of him and proceeds to not-so-subtly \"choice\" him into the lives of several girls at his school. Just when Kanade's school life can’t seem to be doomed any further, a decision that he reluctantly selects on the way home sends a beautiful girl crashing down from the sky, along with the promise of more hysterically hellish choices.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/53235.webp"},{"title":"Sekirei","synopsis":"Struggling yet brilliant teenager Minato Sahashi has failed his college entrance exams for the second time, resulting in him being regarded as worthless by those around him. However, the course of his seemingly bleak future is altered dramatically when a beautiful, supernatural woman falls from the sky and into his life. That woman, Musubi, is a unique being known as a \"Sekirei,\" a humanoid extraterrestrial with extraordinary abilities. These aliens are known for kissing humans carrying the Ashikabi gene in order to awaken additional latent powers deep within.\n\nRecognizing the potential within the seemingly insignificant youth, Musubi kisses the bewildered Minato, initiating a bond between the two of them. This drags him into the high-stakes world of the Sekirei, where he and his new partner must compete against others in a battle for survival called the \"Sekirei Plan.\" However, unbeknownst to the contestants, there is far more at risk that what the competition initially entailed.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/15182.webp"},{"title":"Kami nomi zo Shiru Sekai II","synopsis":"Keima Katsuragi, the \"God of Conquest,\" returns to his quest of expelling runaway spirits that have possessed the hearts of women. Still stuck in his contract with the demon Elsie, he must continue to utilize the knowledge he has gained from mastering multitudes of dating simulators and chase out the phantoms that reside within by capturing the hearts of that which he hates most: three-dimensional girls.\n\nHowever, the God of Conquest has his work cut out for him. From exorcising karate practitioners and student teachers to the arrival of Elsie's best friend from Hell, he is up against a wide array of girls that will test his wit and may even take him by surprise. Though he would much rather stick to the world of 2D, he is trapped in lousy reality, and so Keima must trudge forward in his conquest of love.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/30030.webp"},{"title":"Kore wa Zombie Desu ka? of the Dead","synopsis":"Aikawa Ayumu was revived as a zombie by the cute necromancer Eucliwood Hellscythe. After the zany, madcap adventures in the first season of Is This a Zombie? ended, Ayumu thought his life might finally get back to normal, or as normal as it can be for a zombie. However, destiny has other plans for him. Some guys just can't catch a break. \n\n(Source: FUNimation) ","img":"https://cdn.myanimelist.net/images/anime/4/37451.webp"},{"title":"Inou-Battle wa Nichijou-kei no Naka de","synopsis":"During a Literature Club meeting, the four club members—along with their faculty adviser's niece—suddenly find themselves with supernatural powers. Now capable of fabricating black flames, resident chuunibyou Jurai Andou is the most ecstatic about their new abilities; unfortunately, his own is only for show and unable to accomplish anything of substance. Moreover, he is completely outclassed by those around him: fellow club member Tomoyo Kanzaki manipulates time, Jurai's childhood friend Hatoko Kushikawa wields control over the five elements, club president Sayumi Takanashi can repair both inanimate objects and living things, and their adviser's niece Chifuyu Himeki is able to create objects out of thin air.\n\nHowever, while the mystery of why they received these powers looms overhead, very little has changed for the Literature Club. The everyday lives of these five superpowered students continue on, albeit now tinged with the supernatural.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/67047.webp"},{"title":"Death March kara Hajimaru Isekai Kyousoukyoku","synopsis":"Ichirou Suzuki, a programmer nearing his thirties, is drowning in work. Worn out, he eventually has a chance to catch up on sleep, only to wake up and discover himself in a fantasy RPG world, which is mashed together from the games he was debugging in reality. In this new place, he realizes that not only has his appearance changed to a younger version of himself, but his name has also changed to Satou, a nickname he used while running beta tests on games. \n\nHowever, before Satou can fully grasp his situation, an army of lizardmen launch an assault on him. Forced to cast a powerful spell in retaliation, Satou wipes them out completely and his level is boosted to 310, effectively maximizing his stats. Now, as a high-leveled adventurer armed with a plethora of skills and no way to return to reality, Satou sets out to explore this magical new world.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/4/88911.webp"},{"title":"Campione!: Matsurowanu Kamigami to Kamigoroshi no Maou","synopsis":"Some people suddenly find religion, but for 16-year-old Kusanagi Godou, it's that REALLY old time religion that's found him! As the result of defeating the God of War in mortal combat, Godou's stuck with the unwanted position of Campione!, or God Slayer, whose duty is to fight Heretical Gods whenever they try to muscle in on the local turf. Not only is this likely to make Godou roadkill on the Highway to Heaven, it's also a job that comes with a lot of other problems. Like how to deal with the fact that his \"enhanced status\" is attracting a bevy of overly-worshippy female followers. After all, they're just there to aid him in his demi-godly duties, right? So why is it that their leader, the demonically manipulative sword-mistress Erica Blandelli, seems to have such a devilish interest in encouraging some VERY unorthodox activities? Get ready for immortal affairs, heavenly harems and lots of dueling deities taking pious in the face as the ultimate smash, bash and thrash of the Titans rocks both Heaven and Earth.\n\n(Source: Sentai Filmworks) ","img":"https://cdn.myanimelist.net/images/anime/13/75662.webp"},{"title":"Isekai wa Smartphone to Tomo ni.","synopsis":"In a thoughtless blunder, God accidentally strikes down Touya Mochizuki with a stray bolt of lightning! As an apology, God offers him one wish and the chance to live again in a magical fantasy world. Touya happily accepts the offer and, for his one wish, asks only to keep his smartphone with him as he begins his journey into this mysterious world.\n\nStarting over in this new world, Touya finds it is filled with magic—which he has an affinity for—and cute girls vying for his attention. These girls—the twins Linze and Elze Silhoueska, Yumina Urnea Belfast, Leen, and Yae Kokonoe—provide Touya with no end of romantic frustrations, but also companionship as he discovers the secrets of this new world.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/86794.webp"},{"title":"IS: Infinite Stratos 2","synopsis":"Second season of Infinite Stratos.","img":"https://cdn.myanimelist.net/images/anime/12/49359.webp"},{"title":"Gakusen Toshi Asterisk 2nd Season","synopsis":"Gakusen Toshi Asterisk 2nd Season continues the story of Genestella students Ayato Amagiri and Julis-Alexia von Riessfeld, who have progressed to the next round of the Phoenix Festa after a long and strenuous battle with sisters Irene and Priscilla Urzaiz.\n\nDespite Julis and Ayato's best attempts, the fact that Ayato's powers have been sealed is no longer a secret. Now at a major disadvantage, the duo must come up with a plan if they are to have any hope of winning the Phoenix Festa. Only one thing is for sure: the troubles heading their way are only going to get more insurmountable from here on.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/79107.webp"},{"title":"Grisaia no Rakuen","synopsis":"Grisaia no Rakuen begins right at the end of the previous installment, Grisaia no Meikyuu. Kazami Yuuji is arrested under suspicion for terrorism. A video showing apparently concrete proof that Yuuji committed these acts, and he is held in custody by Ichigaya.\n\nIchigaya knows full well that Yuuji didn't commit the crimes he has been accused of. But he did fail to assassinate Heath Oslo, who is the leader of the terrorist organization with an extremely devastating weapon in their possession. In fact, Ichigaya have their own plans for Yuuji... \n\nBut all may not be lost for Yuuji. The girls of the Mihama Academy are not about to let Yuuji be used for political gain, and neither may the mysterious new figure which appears before them.","img":"https://cdn.myanimelist.net/images/anime/8/72855.webp"},{"title":"5-toubun no Hanayome","synopsis":"Fuutarou Uesugi is an ace high school student, but leads an otherwise tough life. His standoffish personality and reclusive nature have left him friendless, and his father is debt-ridden, forcing his family to scrape by.\n\nOne day during his lunch break, Uesugi argues with a female transfer student who has claimed \"his seat,\" leading both of them to dislike each other. That same day, he is presented with a golden opportunity to clear his family's debt: a private tutoring gig for a wealthy family's daughter, with a wage of five times the market price. He accepts the proposal, but is horrified to discover that the client, Itsuki Nakano, is the girl he confronted earlier! \n\nAfter unsuccessfully trying to get back on Itsuki's good side, Uesugi finds out that his problems don't end there: Itsuki is actually a quintuplet, so in addition to her, he must also tutor her sisters—Miku, Yotsuba, Nino, and Ichika—who, despite the very real threat of flunking, want nothing to do with a tutor. However, his family's livelihood is on the line so Uesugi pushes on, adamant in his resolve to rid the sisters of their detest for studying and successfully lead them to graduation.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1819/97947.webp"},{"title":"Outbreak Company","synopsis":"Shinichi Kanou is a shut-in otaku with a vast knowledge of anime, manga, and video games. One day, after applying for a job in hopes of escaping his secluded lifestyle, he is kidnapped and transported to the Eldant Empire—a fantasy world filled with elves, dragons, and dwarves. Trapped in this strange land, Shinichi is given an unlikely task by the Japanese government: to spread otaku culture across the realm by becoming an \"Otaku Missionary.\"\n\nTo accomplish his mission, Shinichi has the full support of the Japanese government, as well as the half-elf maid Myucel and Princess Petralka of the Eldant Empire. Together with this ragtag bunch, he will overcome the obstacles of politics, social classes, and ethnic discrimination to promote the ways of the otaku in this holy land.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/54343.webp"},{"title":"To LOVE-Ru Darkness","synopsis":"As close encounters of the twisted kind between the residents of the planet Develuke (represented primarily by the female members of the royal family) and the inhabitants of Earth (represented mainly by one very exhausted Rito Yuki) continue to escalate, the situation spirals even further out of control. When junior princesses Nana and Momo transferred into Earth School where big sister LaLa can (theoretically) keep an eye on them, things SHOULD be smooth sailing. But when Momo decides she'd like to \"supplement\" Rito's relationship with LaLa with a little \"sisterly love,\" you know LaLa's not going to waste any time splitting harems. Unfortunately, it's just about that point that Yami, the Golden Darkness, enters the scene with all the subtleness of a supernova, along with an army of possessed high school students! All of which is certain to make Rito's life suck more than a black hole at the family picnic. Unless, of course, a certain semi-demonic princess can apply a little of her Develukean Whoop Ass to exactly that portion of certain other heavenly bodies! \n\n(Source: Sentai Filmworks) ","img":"https://cdn.myanimelist.net/images/anime/8/42217.webp"},{"title":"Seireitsukai no Blade Dance","synopsis":"Seireitsukai no Blade Dance takes place at a very prestigious school for holy shrine princesses called Areishia Spirit Academy. At this school, the girls train to be elementalists and try to form slave contracts with spirits so that they can compete in battles against one another. Only females have this privilege... at least until now.\n\nKamito Kazehaya is a normal guy in pretty much all respects except for the fact that he's the first man in 1,000 years to be able to form a contract with a spirit (which he \"stole\" from a shrine princess named Claire Rouge). Additionally, the headmaster of the school, Greyworth, has summoned him to enroll and is forcing him to participate in a special tournament that will take place two months down the road. With Claire demanding that he become her contracted spirit, will Kamito even manage to survive the entire two months until the tournament takes place?","img":"https://cdn.myanimelist.net/images/anime/7/63031.webp"},{"title":"Freezing","synopsis":"Decades into the future, humanity is under siege by an alien race known as the Novas. These inhuman beings leave devastation in their wake whenever they appear, with the efforts to stave them off becoming known as Nova Clashes. Young women known as \"Pandoras\" and young men known as \"Limiters\" are implanted with stigmata to give them superhuman powers and are trained in military academies, where they must learn to work together if humanity is to have a chance of surviving.\n\nFreezing tells the story of Kazuya Aoi as he sets out for his first day at the West Genetics military academy, right when a battle royale is being undertaken by the Pandoras. It is here that he mistakes Satellizer el Bridget—a powerful Pandora known as the \"Untouchable Queen\"—as his deceased sister and embraces her. Though he costs her the match, she finds that his touch doesn't drive her away and decides to take him as her Limiter. The only question is whether or not their partnership can survive the machinations of their upperclassmen and the impending battle with the Novas…","img":"https://cdn.myanimelist.net/images/anime/10/28535.webp"},{"title":"ChäoS;HEAd","synopsis":"Throughout Shibuya, a series of murders dubbed the \"New Generation Madness\" gained widespread attention As these crimes gained infamy, they became a hot topic of discussion among the people of the area. Nonetheless, these \"New Gen\" murders do not capture the interest of Takumi Nishijou, a high school otaku who frequently experiences delusions and feels that he is constantly being watched. \n\nHaving no concern for the real world, Takumi spends his time playing online games and watching anime. However, his ordinary life is disrupted when he receives a horrifying image of a man staked to a wall from a user named Shogun. After calming himself at an internet cafe, Takumi sees the exact same murder scene as the image portrayed happen right before his eyes, along with a pink-haired girl covered in blood calling out his name.\n\nConflicted with the nature of reality, Takumi finds it difficult to judge where to place his trust as he gets caught up in the \"New Gen\" murders, believing that the murderer is out to get him.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/15443.webp"},{"title":"Kami nomi zo Shiru Sekai: Megami-hen","synopsis":"Having freed a myriad of women from the runaway spirits possessing their hearts, the \"God of Conquest\" Keima Katsuragi is confronted with a new task: find the Jupiter Sisters, the goddesses that sealed Old Hell in the past. Diana, the goddess that resides inside his childhood friend Tenri Ayukawa, explains that they have taken shelter in the hearts of the girls he had assisted previously. Moreover, once Diana and her sisters are reunited, their power can seal the runaway spirits away for good and relieve Keima of his exorcising duties. Though he is initially reluctant to get involved in yet another chore, everything changes when tragedy befalls one of the hosts.\n\nDiscovering that the goddesses are being targeted by a mysterious organization known as Vintage, Keima is caught in a race against time to reunite the sisters and rescue the girl who has already fallen prey. With deeper resolve than ever before, Keima works together with demons Elsie and Haqua to recapture the hearts of the girls he had charmed in the past. However, the road ahead is a difficult one, as he is soon met with the consequences of his previous conquests.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/51949.webp"},{"title":"Arifureta Shokugyou de Sekai Saikyou","synopsis":"The ordinary life of 17-year-old otaku Hajime Nagumo is disrupted when he and his classmates are summoned to a fantasy world and tasked with saving mankind. While his classmates are gifted with impressive abilities useful in combat, Hajime is belittled for only gaining an inferior transmutation skill that lacks any real offensive power. \n\nDuring an expedition in the Great Orcus Labyrinth, Hajime is betrayed by one of his classmates, plummeting him to the bottom of an abyss. Though he survives the fall, Hajime is faced with menacing monsters and misfortunes that send him spiraling into a grim nightmare. Desperate to live and return home one day, he resolves to fight for his survival—only to meet an imprisoned vampire he names Yue, who is also seeking to escape the labyrinth. Taking an interest in him, Yue and a few others along the way accompany Hajime on his journey to find a way back home, while steadily transforming from commonplace to the world's strongest. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1799/101266.webp"},{"title":"High School DxD Hero","synopsis":"The fourth season of High School DxD.","img":"https://cdn.myanimelist.net/images/anime/1189/93528.webp"},{"title":"Madan no Ou to Vanadis","synopsis":"In a fantasy version of Europe, a war between enemy countries is brewing. One of these countries, Zhcted, has its seven regions ruled by War Maidens, known as Vanadis. Equipped with powerful dragon-carved weapons, Eleonora \"Elen\" Viltaria, one of the Vanadis, launches an invasion against their neighboring rival country of Brune. Eventually, Tigrevurmud \"Tigre\" Vorn, a young archer and an earl for Brune's region of Alsace, has his entire army decimated at Elen's hands. In a strange twist of events, Elen spares Tigre, and gives him the order, \"Become mine!\" What could be the meaning behind this new alliance?\n\nAdapted from the light novel written by Tsukasa Kawaguchi, Madan no Ou to Vanadis is an epic adventure filled with complex war tactics and beautiful women. Trapped in a multinational conflict, Tigre and Elen are swept up in a war filled with dark secrets, conspiracies, and corruption.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/64911.webp"},{"title":"Shinmai Maou no Testament Burst","synopsis":"Basara Toujou has a hard life. He is the older step-brother to two demonic sisters, Mio and Maria Naruse, whom he protects from entitled demons looking to claim Mio's power for themselves. On top of that, rising political tension within the demon realm only makes his job more difficult.\n\nWhen a messenger arrives with summons for Mio to the demon realm, she and her friends go in spite of the danger. Now on the enemy's turf, Basara will have to grow stronger through erotic pleasure in order to do the impossible and protect everyone.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1151/94750.webp"},{"title":"Saijaku Muhai no Bahamut","synopsis":"Lux, a former prince of an empire named Arcadia that was overthrown via a rebellion five years earlier, accidentally trespasses in a female dormitory's bathing area, sees the kingdom's new princess Lisesharte naked, incurring her wrath. Lisesharte then challenges Lux to a Drag-Ride duel. Drag-Rides are ancient armored mechanical weapons that have been excavated from ruins all around the world. Lux used to be called the strongest Drag-Knight, but now he's known as the \"undefeated weakest\" Drag-Knight because he will absolutely not attack in battle. After his duel with Lisesharte, Lux ends up attending the female-only academy that trains royals to be Drag-Knights.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/76664.webp"},{"title":"Motto To LOVE-Ru","synopsis":"Rito Yuuki never gets a break—he's always finding himself in lewd accidents with girls around him. Although his heart still yearns for Haruna, his childhood love, Rito can't help but question his feelings for Lala, the alien princess who appeared in front of him and declared she would marry him. But now, it's not just Lala he has to deal with: her younger twin sisters, Momo and Nana, have also travelled to Earth, wanting to meet their older sister’s fiancé, and just as luck would have it, they end up staying at Rito's home.\n\nMeanwhile, amidst the bustle of his new family members, Yami, the human weapon girl, begins her pursuit for Rito. It's not an easy life for Rito as he deals with uncertain love, punishment for being a pervert, and a girl dead set on murdering him.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/59875.webp"},{"title":"Sora no Otoshimono: Forte","synopsis":"Sakurai Tomoki has settled into his life with the two angeloids, Ikaros and Nymph, and is enjoying himself immensely.  However, he keeps having weird dreams and asks all of his friends to help him investigate the cause.\n\nNymph conjures up a device that enables people, but not angeloids, to enter other people's dreams.  The device malfunctions at first but eventually they get to what was supposed to be Tomoki's dream but discover that something is very wrong with it.\n\nLater, a meteor comes crashing down from the skies at the site of the large cherry blossom tree where Tomoki first discovered Ikaros.  An extremely well endowed blonde angeloid with a huge sword emerges from the meteor and sets off in search of Tomoki!","img":"https://cdn.myanimelist.net/images/anime/11/50309.webp"},{"title":"Hundred","synopsis":"When an extraterrestrial organism known as \"Savage\" attacks mankind, the only technology capable of combating the enemy is a weapon known as “Hundred.” A survivor of a Savage attack, Hayato Kisaragi is a teenager boasting the highest compatibility level with the aforementioned technology and as a result, is invited to master his skills at Little Garden, a prestigious military academy aboard a battleship.\n\nOver the course of his intense training for the battle ahead, he immediately attracts the interest of multiple female peers and gets drawn into a number of incidents as he tries to fight against the creatures that now inhabit Earth and threaten its safety.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/78858.webp"},{"title":"Shuffle!","synopsis":"In present times, Gods and Demons coexist together with Humans after the door between each of these worlds had opened. Tsuchimi Rin is a normal young high school student attending Verbena Academy, spending his days living peacefully with his childhood friend Kaede. Unexpectedly, one day the King of Gods, the King of Demons and their families move into be Rin's next door neighbors. Apparently the daughter of the Gods, Sia, and the daughter of the demons, Nerine, are both deeply in love with Rin after having met him in the past. Along with his playful friendship with upperclassmen Asa and his encounter with the silent but cute Primula, Rin has much on his hands dealing with the affections of each of these girls. Based on the eroge by Navel.","img":"https://cdn.myanimelist.net/images/anime/10/19622.webp"},{"title":"Kiss x Sis","synopsis":"When Keita Suminoe's father remarried, not only did he gain a new mother, but elder twin sisters as well. Distinct yet similar, the homely and mature Ako is a former student council president, while the athletic and aloof Riko is the previous disciplinary president. The three of them have been together since kindergarten, resulting in a deep bond between the siblings. However, over time, their relationship developed into something more romantic—and erotic .\n\nNow in his last year of middle school, Keita has already received a sports recommendation, but it's from a different high school than his two sisters. Disappointed, both sisters try to change his mind, and he agrees, giving in to their desperate pleas. Unaware of the consequences, he now has to attempt to study for his high school exams while warding off the advances of his lust-driven sisters. With their parent's blessings, Ako and Riko strive to be Keita's future wife, leaving him to try his best to keep the relationship between them strictly platonic. However, with two beautiful girls vying for his attention, will Keita be able to withstand the endless temptations?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/22223.webp"},{"title":"Watashi ga Motete Dousunda","synopsis":"Kae Serinuma is a very kind second-year high school student and a devoted otaku. A little known fact about her, though, is that she's obsessed with BL, or Boy's Love. Serinuma can't help but to fantasize about her male classmates falling for each other and enjoys imagining them together. A more known fact about Serinuma, however, is that she’s noticeably overweight. \n\nWhile watching her favorite show one day, Serinuma witnesses the death of her most beloved character. Utterly depressed, she can't muster up the energy to eat her meals, let alone attend school. After an entire week, she finally recovers. But now there's something unusual about her—during the time she refused to leave her room, she ended up losing a large amount of weight and has somehow become strikingly beautiful!\n\nNow catching the eye of everyone who sees her, she finds herself at the center of attention of four boys she has always known at her school. Though they all wish to spend time with her, Serinuma would much rather they spend time falling in love with one another. How will Serinuma deal with the four boys pursuing her BL-obsessed self?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/81953.webp"},{"title":"Renai Boukun","synopsis":"When a strange girl named Guri comes knocking at Seiji Aino's door, he quickly finds himself thrust into a world of romantic troubles. Claiming that she will die if he doesn't kiss someone within 24 hours, Guri's pleas of desperation are misunderstood as pleas for love, leading Seiji to kiss the cute stranger that came barging into his house. In actuality, it turns out that this cosplaying cupid is the wielder of a Kiss Note, in which any pairing of names she writes will kiss and become a couple. Guri explains that she misspelt and accidentally wrote Seiji's name while indulging in her yaoi fantasies, but because she had yet to pair him with anyone, their kiss was meaningless. Even worse, Guri reveals that if Seiji is not coupled with anyone soon, not only will she die, but Seiji will remain a virgin for eternity!\n\nEager to escape his fate, Seiji sets his sights on the beautiful and popular Akane Hiyama. But after Akane hears that he kissed Guri, she reveals the obsessive and psychopathic feelings that she holds for the unfortunate boy and proceeds to viciously attack them. In the ensuing confusion, Guri is able to pair Seiji with Akane in the Kiss Note, temporarily saving Seiji from any further bodily harm. But to complicate matters, Guri's newfound feelings lead her to also pair the two of them with herself. Just when the situation could not get any more convoluted, this new coupling with Guri has turned Seiji and Akane into temporary angels, forcing them into assisting the cupid with her work of pairing humans, lest they be cast into hell. With all semblance of normality snatched from his life, Seiji gets to work at matchmaking with these eccentric girls by his side.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/84266.webp"},{"title":"Amnesia","synopsis":"After fainting at work, a young lady awakens in the back room of the café she works at with no memory of her life or those around her. Two of her friends, whom she soon learns are named Shin and Toma, are called to help her get home safely. Once she is alone, she meets a spectral boy named Orion that only she can see and hear. He explains that she lost her memories because of his chance visit to her world, so he vows to help her remember who she is.\n\nHowever, regaining her departed memories without worrying those around her may be more difficult than she realizes. In addition to the gloomy Shin and the protective Toma, she must be wary of arousing the suspicions of the captivating Ikki, the quick-witted Kent, and a mysterious man who lurks in the distance. As her amnesia entangles her in the lives of each of these men, her fragmented memories return piece by piece, and the mysteries of her circumstances slowly come to light.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/45308.webp"},{"title":"Love Hina","synopsis":"Keitaro Urashima promised a girl when he was young that they would meet up again at Tokyo University in the future. Sadly, in the National Practice Exam, Keitaro ranked 27th from the bottom. Knowing his grandmother owned a hotel, Keitaro intended to stay there while continuing his studies for Tokyo U, only to find out the hotel had long been transformed into an all-girls dormitory. Through an odd twist of fate, Keitaro eventually became the manager of the dorm, beginning his life of living with five other girls.","img":"https://cdn.myanimelist.net/images/anime/1725/94697.webp"},{"title":"Oniichan dakedo Ai sae Areba Kankeinai yo ne!","synopsis":"After their parents' deaths, brother and sister Akito and Akiko Himenokouji were forced to live with separate families for six years. But now they have finally reunited and begin to live together. It quickly becomes apparent that Akiko harbors romantic feelings for her brother; however, Akito only sees her as a sibling.\n\nWhen three more girls—Anastasia Nasuhara, Arashi Nikaidou, and Ginbei Haruomi Sawatari—move into their apartment, Akiko's hopes of living alone with her brother vanish. Moreover, these girls also like Akito in one way or another, making it even more difficult for Akiko to gain her brother's undivided attention. As the girls fight over who should take care of Akito, they display various eroticisms that may be a little too much for a normal man to handle.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/6/42111.webp"},{"title":"Taimadou Gakuen 35 Shiken Shoutai","synopsis":"In a world plagued by magical dangers and threats, there exist special warriors—known as Inquisitors—who are tasked with non-violently preventing these threats and nefarious actions. The Anti-Magic Academy is a specialized school built to educate and train these Inquisitors, which splits its students into small squads in order to train them to work together. Among these talented squads is the 35th Test Platoon, also known as the \"Small Fry Platoon\" due to its low ranking and incompetent members. \n\nHowever, everything changes when Ouka Ootori, a powerful yet rebellious former Inquisitor, is forced into joining due to her tendency to break rules and committing a serious violation: the killing of a witch. Tempers flare upon her arrival, as she clashes with their clumsy captain Takeru Kusanagi and argues with the rest of the squad over her views on witches. This eclectic group has a long way to go if they wish to succeed and climb the ranks at the Anti-Magic Academy: they must first set aside their differences and come to work together as a team.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/76211.webp"},{"title":"Nyan Koi!","synopsis":"Junpei Kousaka is a second-year high school student who has an allergy for cats—a predicament that has made him hate cats and everything related to them. Unfortunately for him, though, he is surrounded by cat lovers: his family, his estranged childhood friend, and even his crush Kaede Mizuno.\n\nOne day, while returning home from school, Junpei nonchalantly attempts to kick an empty can into the trash, but miserably misses. Instead of making it to the garbage, the can ends up breaking off the head of a cat deity statue. That fateful day, he is cursed with the ability to understand cat speech. However, he must keep his curse a secret from everyone else, because anyone who finds out will become more accident-prone and share the same fate as him.\n\nWith the guidance of his cat Nyamsus and with no other choice left, Junpei now has to do a hundred good deeds for cats to lift the curse. If he is unable to complete this task, he will turn into a cat, and considering his allergy, that would be a death sentence for him!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/18299.webp"},{"title":"Seiken Tsukai no World Break","synopsis":"Seiken Tsukai no World Break takes place at Akane Private Academy where students who possess memories of their previous lives are being trained to use Ancestral Arts so that they can serve as defenders against monsters, called Metaphysicals, who randomly attack. Known as saviors, the students are broken up into two categories: the kurogane who are able to use their prana to summon offensive weapons and the kuroma who are able to use magic.\n\nThe story begins six months prior to the major climax of the series during the opening ceremonies on the first day of the school year. After the ceremony is over, the main character, Moroha Haimura, meets a girl named Satsuki Ranjou who reveals that she was Moroha's little sister in a past life where Moroha was a heroic prince capable of slaying entire armies with his sword skills. Soon afterwards he meets another girl, Shizuno Urushibara, who eventually reveals that she also knew Moroha in an entirely different past life where he was a dark lord capable of using destructive magic but saved her from a life of slavery. Can those whose minds live in both the present and the past truly reach a bright future? Delve into the complex world of Seiken Tsukai no World Break to find out!","img":"https://cdn.myanimelist.net/images/anime/7/71769.webp"},{"title":"Maji de Watashi ni Koi Shinasai!","synopsis":"The samurai are a very important part of Japan's history, and to be related to them in any way is probably one of the most inspiring things that a young high school student could hope for.\n\nKawakami City is well-known for having many samurai ancestors among its citizens, and is generally surrounded by an atmosphere of fighting spirit, loyalty, and dedication to work. In Maji de Watashi ni Koi Shinasai!, the students of Kawakami Academy use this knowledge on a daily basis, whether they are studying for exams, competing in sports competitions, or making sure that they take very good care of their traditions. Yamato Naoe is one such student, and his six closest friends (three boys and three girls) make up the perfect team for friendship, rivalry, and motivation. However, even samurai have weaknesses.\n\nAlthough the balance and long friendship of their group has been undisturbed for a long time, when two new girls enter the group, things start to get a lot more interesting. Not only must they maintain what they think is the samurai tradition, but they must now also do it with a lot of \"distractions.\"","img":"https://cdn.myanimelist.net/images/anime/4/32541.webp"},{"title":"Diabolik Lovers","synopsis":"At the behest of her father, Yui Komori goes to live in a secluded mansion, home to the six Sakamaki brothers—Shuu, Reiji, Ayato, Kanato, Laito, and Subaru—a family of vampires. Though at first the siblings are confused as to why the girl has arrived, they soon realize that she is to be their new \"sacrificial bride,\" not to mention their other, more carnal intentions for her. After meeting the brothers, Yui quickly begins to question why her father would have sent her here and why she feels a strange, new pain in her chest. With each brother more sadistic than the last, Yui's life as a captive takes a harrowing turn in her new home. As her days turn into endless nights, and each brother vows to make her his own, Yui falls deeper and deeper into madness and ecstasy.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/51989.webp"},{"title":"Mangaka-san to Assistant-san to The Animation","synopsis":"The story depicts the work-life of a perverted mangaka, Aito Yuuki, and his assistant, Ashisu Sahoto. Constantly pressured by his editor and lacking experience with girls, Aito asks Ashisu to act as a reference.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/11/62219.webp"},{"title":"MM!","synopsis":"Taro Sado is a high school student who lives his day to day life with a big secret—he's a masochist! Encouraged by his cross-dressing best friend Tatsukichi Hayama, Taro asks the Second Voluntary Club for help with his problem and ends up joining the club after they vow to \"fix\" him.\n\nHowever, it turns out that all of the members of the club have some serious issues. The club leader Mio Isurugi is a self-designated god who is afraid of cats, Arashiko Yuuno has a severe fear of men, and the club advisor Michiru Onigawara is a sadist who enjoys making people cosplay. \n\nTogether with other wacky characters such as Yumi Mamiya, a talented masseuse and Yuuno's best friend, and Noa Hiiragi, the president of the invention club, they all learn about the importance of acceptance and kindness.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/85871.webp"},{"title":"Kanokon","synopsis":"Kouta has girl troubles of the supernatural sort. For some reason, he keeps attracting the attention (and affections) of animal spirits!\n\nHaving spent most of his life in the country, Kouta is understandably nervous when he moves in with his grandma to attend a high school in the big city. He hoped to make a good impression, but having Chizuru, a beautiful fox spirit, hanging off his arm didn't seem to be the sort of image he wanted to have. She's not alone in her love for Kouta, either. Nozomu, a wolf spirit, as well as other youkai have their sights set on the hapless country boy. ","img":"https://cdn.myanimelist.net/images/anime/11/9490.webp"},{"title":"Maken-Ki!","synopsis":"Based on the manga series by Hiromitsu Takeda, this romantic comedy is about Takeru Ohyama, a typical perverted teenage boy. His new school doesn't require entrance exams, and it just turned co-ed! Unfortunately, his dreams of a happy high school life are dashed when he finds out the school is much more than it seems. All of the students wield a special item—a Maken—to unleash their magical abilities in duels! Can Takeru find a Maken that works for him? Even while trying to fit in at a new school and dealing with all kinds of girl problems?\n\n(Source: FUNimation)","img":"https://cdn.myanimelist.net/images/anime/2/75234.webp"},{"title":"Saenai Heroine no Sodatekata ♭","synopsis":"After finally completing the first route of his visual novel, Blessing Software's producer Tomoya Aki is optimistic about the future of his team and achieving their goal of creating the best game of the season.\n\nHowever, they still have a long way to go. For one, Megumi Katou still has an incredibly flat personality and is unable to fit the role of Tomoya's ideal heroine. The other members of Blessing Software, Eriri Spencer Sawamura, Utaha Kasumigaoka, and Michiru Hyoudou, often forget she is even there due to her lack of presence and character. \n\nThroughout the development of their game, Blessing Software learns the struggles of working in an industry where deadlines must be met and edits are made constantly, and the hardships of working in a group setting.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/84797.webp"},{"title":"Omamori Himari","synopsis":"After the death of his parents, Yuuto Amakawa lives a pretty ordinary life in the city. The only problem he has to worry about while attending school alongside Rinko, his next-door neighbor, is his cat allergies. That all changes on his sixteenth birthday, when an Ayakashi—a supernatural creature—attacks him for the sins of his ancestors. Luckily, he is saved by Himari, a mysterious cat-woman with a sword, who explains that Yuuto is the scion of a family of demon-slayers, and she is there to protect him now that the charm that kept him hidden from the supernatural forces of the world has lost its power.\n\nOmamori Himari chronicles Yuuto's dealings with the various forces of the supernatural world, as well as the growing number of women that show up on his doorstep, each with their own dark desires. Will Yuuto be able to adjust to his new \"exciting\" environment? Or will the ghost of his (ancestor's) past catch up with him?","img":"https://cdn.myanimelist.net/images/anime/13/15393.webp"},{"title":"Bokutachi wa Benkyou ga Dekinai","synopsis":"Nariyuki Yuiga, an impoverished third-year high school student, works tirelessly to receive the VIP nomination, a scholarship that would cover all of his college tuition fees. In recognition of his hard work, the headmaster awards him the renowned scholarship.\n\nHowever, this scholarship is given under one condition: he must tutor the school's geniuses in their weakest subjects! Joining his new brigade of pupils are the math maestro Rizu Ogata, who wants to study humanities; the literature legend Fumino Furuhashi, who wants to study science; and Yuiga's sports-savvy childhood friend, Uruka Takemoto, who is hopeless at everything else.\n\nBokutachi wa Benkyou ga Dekinai follows Yuiga as he tries to teach his three eccentric tutees in a series of strange and comedic antics. But as Ogata's and Furuhashi's ambitions conflict with their talents, will Yuiga be able to help his students achieve their dreams?\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/1602/100510.webp"},{"title":"Ore wo Suki nano wa Omae dake ka yo","synopsis":"Amatsuyu \"Jouro\" Kisaragi is a completely average second-year high school student who has two dates over one weekend⁠—with the student council president Sakura \"Cosmos\" Akino on Saturday, then with his childhood friend Aoi \"Himawari\" Hinata on Sunday. Sadly for Jouro, both girls proclaim their love for his best friend Taiyou \"Sun-chan\" Ooga, the ace of the baseball team. Accepting each of their requests for advice and guidance, he is now responsible for helping the two girls win the heart of the same guy.\n\nUnbeknownst to his friends, Jouro's friendly and obtuse image is all but a ruse designed to cast himself as the clueless protagonist of a textbook romantic comedy. A schemer under his cheery facade, he makes the best of this unexpected turn of events with a new plan: get Sun-chan to fall for either Cosmos or Himawari and take the other as his own prize. But Jouro's last-ditch effort is threatened by the gloomy, four-eyed Sumireko \"Pansy\" Sanshokuin, who surprises Jouro with not only her knowledge of his secret personality but also a confession to the true self he hid for all this time.\n\nStuck in this hilariously messy situation, each of the five students must navigate countless lies, traps, and misunderstandings to come out on top.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1348/102797.webp"},{"title":"Hayate no Gotoku!","synopsis":"According to Murphy's Law, \"anything that can go wrong, will go wrong,\" and truer words cannot describe the unfortunate life of the hard-working Hayate Ayasaki. Abandoned by his parents after accumulating a debt of over one hundred fifty million yen, he is sold off to the yakuza, initiating his swift getaway from a future he does not want. On that fateful night, he runs into Nagi Sanzenin, a young girl whom he decides to try and kidnap to pay for his family's massive debt.\n\nUnfortunately, due to his kind-hearted nature and a string of misunderstandings, Nagi believes Hayate to be confessing his love to her. After saving her from real kidnappers, Hayate is hired as Nagi's personal butler, upon which she is revealed to be a member of one of the wealthiest families in Japan.\n\nHighly skilled but cursed with the world's worst luck, Hayate gets straight to work serving his employer all the while trying to deal with the many misfortunes that befall him. From taking care of a mansion to fending off dangerous foes, and even unintentionally wooing the hearts of the women around him, Hayate is in over his head in the butler comedy Hayate no Gotoku!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/73932.webp"},{"title":"Sekirei: Pure Engagement","synopsis":"The second stage of the battle royale known as the Sekirei Plan is underway. Tokyo has been closed off; no Sekirei or Ashikabi may leave. Minato Sahashi and his harem of Sekirei must now prepare to fight new battles as changes to the rules are put into place. However, not all groups will return to the battle: some Sekirei are loved very much by their Ashikabi partners, who would rather forfeit the prize than see them perish.\n\nIn the midst of the action, someone close to Minato may be more involved than he had ever imagined, and threats lurk around every corner. There are even rumors that the \"Single Numbers,\" the most powerful type of Sekirei, have entered the fray. In the eyes of the \"Game Master\" Minaka Hiroto, everything is proceeding according to plan.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/75178.webp"},{"title":"Ore ga Ojousama Gakkou ni \"Shomin Sample\" Toshite Gets♥Sareta Ken","synopsis":"Kimito Kagurazaka is a commoner with a fetish for men's muscles—or at least that's the lie he must keep telling if he wants to keep himself out of trouble at the elite all-girls school, Seikain Academy. Kidnapped by the school under the assumption that he prefers men, Kimito is made to be their \"commoner sample,\" exposing the girls to both commoner and man so that the transition to the world after school is not jarring. Threatened with castration should his sexual preferences not match the school's assumptions, Kimito keeps up the facade to protect his manhood.\n\nBut there are eccentric individuals around every corner who begin to make Kimito's life even more difficult. Among them are Aika Tenkuubashi, a social outcast who blurts out whatever comes to mind; Hakua Shiodome, a young genius; Karen Jinryou, the daughter of samurai who is obsessed with defeating Kimito; and Reiko Arisugawa, the perfect student who has delusions of marrying Kimito. Along with the commoner himself, these four girls make up the Commoner Club, which attempts to teach the girls more about life outside the school, while Kimito gradually learns about the odd girls surrounding him.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/76542.webp"},{"title":"Masou Gakuen HxH","synopsis":"Hida Kizuna possesses the HHG (Heart Hybrid Gear) ability, but it is not strong enough to make him particularly important. His older sister calls him to transfer to a strategic defense school, where many of the students (many of which are large-breasted girls) use their HHG abilities to fight invaders from another world while wearing extremely skimpy pilot outfits. Kizuna's fighting ability doesn't measure up, but his sister has another plan—apparently having erotic experiences with Kizuna will allow the girls to replenish their energy or power-up. It looks like his new school life is going to be full of embarrassment.\n\n(Source: MangaHelpers)","img":"https://cdn.myanimelist.net/images/anime/7/80262.webp"},{"title":"To LOVE-Ru Darkness 2nd","synopsis":"The dispassionate, transforming assassin Golden Darkness returns to peer deeper into the mysteries surrounding her new life, while a sinister Nemesis manipulates her younger sister Mea from the shadows. Along with their newly discovered mother, Tearju, this previously estranged family quickly becomes the center of everyone's attention. On the other hand, Princess Momo's Harem Plan stands on shaky ground amidst Rito's inability to confess to his longtime crush Haruna, who has grown feelings of her own.\n\nBut things aren't as peaceful as they seem; an evil force looms amidst the innocuous commotion, threatening to eclipse the love, happiness, and friendship of Rito and his harem. Only the light of love can hope to banish the shadow.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/69847.webp"},{"title":"Asu no Yoichi!","synopsis":"Yoichi Karasuma has spent all of his life in the mountains, training in the Soaring Wind, Divine Wind swordsmanship style. Under his father’s guidance, he is able to master the technique at the age of 17. With nothing left to learn, Yoichi is sent to a new dojo located in the city so he can continue to train and gain an understanding of modern society.\n\nUnfortunately, Yoichi has no idea how to act or speak to anyone in the present day and acts like a samurai, complete with odd speech and traditional clothing. As he goes to live with the Ikaruga sisters at the dojo, Yoichi, clueless on how to interact with others, is constantly hurtled in hilarious misunderstandings. Asu no Yoichi! follows Yoichi as he stumbles through his new life and tries to learn how to live in the modern world with his new family.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/20621.webp"},{"title":"Arcana Famiglia","synopsis":"​On the island of Regalo, a group of supernaturally powered mafia-like protectors called the Arcana Famiglia safeguard the people from any who would harm them. The members of their organization, having made contracts with tarot cards, each possess different abilities, such as overwhelming strength, invisibility, or the power to see into someone's heart. \n\nMondo, their leader and the \"Papa\" of their family, announces at his birthday party that he will be retiring soon. He plans to hold the Arcana Duello, a competition that, if won, will grant the winner the title of Papa and any wish they desire. But there is more at stake than just a title: Mondo also decides that the winner will marry his daughter, Felicità. Enraged by this, the strong-willed Felicità decides to enter the competition herself, in order to make her own way in the world. As Felicità battles for her freedom, her competitors battle for her heart.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/39495.webp"},{"title":"Princess Lover!","synopsis":"Following an automobile accident that claims the life of his parents, Teppei Arima is taken in by his grandfather and introduced to the world of the rich and the elite. Compared to his humble upbringing, Isshin Arima's lavish lifestyle surprises and stuns the young teenager. In return for the gracious hospitality, Teppei is expected to continue the family business by replacing his grandfather as the head of Arima Financial Combine, and to prepare him for these responsibilities, he is enrolled into an esteemed high school. Along with his recently acquired celebrity status and affluence, Teppei is informed of an arranged marriage with the equally prosperous Sylvia van Hossen, thus, beginning the thrilling escapades of his new life!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/75519.webp"},{"title":"Date A Live III","synopsis":"Shidou Itsuka carries on with his quest for Ratatoskr in finding Spirits and trying to seal their powers, all while maintaining his relationships with the ones he had already sealed. Moreover, as new Spirits appear, he must undergo more complicated trials—all to put a stop to further disasters as he discovers more about the Spirits' origin.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/1055/100468.webp"},{"title":"Seitokai no Ichizon","synopsis":"Imagine living life as the vice president of the student council, passing the days eating snacks, playing games, and bonding with a harem of beautiful girls. This is exactly the kind of life that high school student Ken Sugisaki leads, or so he thinks!\n\nUsually, the officers of Hekiyou Academy's student council are elected by popular vote, but an additional position is granted to the student who scores the highest on the exams. Ken, who historically has had below average grades, worked hard to improve them to be accepted into the student council, with the ultimate goal of surrounding himself with girls who fawn over him.\n\nUnfortunately for the vice president, things do not go quite as planned. Not only do the ladies of the council continually rebuff his advances, they also prefer to focus on more important and \"boring\" activities, such as organizing school events and managing the other clubs. But a few minor hurdles like these won't stop Ken from chasing after his dreams, even if they seem a bit ridiculous.  \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/19646.webp"},{"title":"Kono Naka ni Hitori, Imouto ga Iru!","synopsis":"Shougo Mikadono's father has just passed away, and now he must become the head of Mikadono Group, his father's company. After completing the training to take over, there is just one other stipulation he must adhere to: he will need to find a girl he loves at his new school and marry her by the time he graduates high school.\n\nShougo transfers to Miryuin Private Academy, and it seems like he has many girls to choose from, such as Konoe Suruma, the class representative as well as his first new friend; Miyabi Kannagi, a standoffish but kind girl; Rinka Kunitachi, the student council vice president; Mei Sagara, who runs a cafe and dresses like a witch; and Mana Tendou, the student council president. However, there is a complication: one of them is his long-lost half sister, and he has no idea which one, so how can he become romantically involved with any of them?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/75534.webp"},{"title":"Ladies versus Butlers!","synopsis":"Hino Akiharu lost his parents when he was small and was adopted into his uncle's family. He didn't want to be a burden on his uncle's family and decides to enter a free boarding school as a butler, Hakureiryou high school. However, his delinquent boy-like appearance frightens the girls, who make up the majority of the students. Unable to get along with the classmates, Akiharu meets his childhood crush Saikyou Tomomi. ","img":"https://cdn.myanimelist.net/images/anime/7/75252.webp"},{"title":"Uta no☆Prince-sama♪ Maji Love 1000%","synopsis":"Haruka Nanami, an aspiring composer from the countryside, longs to write music for her beloved idol, Hayato Ichinose. Determined to accomplish this goal, she enrolls into Saotome Academy, a highly regarded vocational school for the performing arts.\n\nUpon her arrival, Haruka soon learns that everyone on staff, including the headmaster, is either an idol, a composer, or a poet. To top it all off, she is surrounded by incredibly talented future idols and composers, and the competition among the students is fierce; with the possibility of recruitment by the Shining Agency upon graduation, the stakes are incredibly high. As she strives to reach her dream at the academy, one fateful night, a series of events lead Haruka to a mysterious man standing in the moonlight, and he seems a bit familiar...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/30248.webp"},{"title":"Asobi ni Iku yo!","synopsis":"Kio is just another boring, nice guy with a boring, nice life until he meets a beautiful, curvaceous cat-girl while attending a memorial service for one of his ancestors. Next thing he knows, he's lying in bed with this half-naked beauty next to him! Her name is Eris, and she has come to Earth to learn more about its inhabitants as a representative of the planet Catian. And she's decided to set up shop at Kio's home for her stay on Earth!\n\nUnbeknownst to Kio, there are quite a few organizations who will attempt to capture Eris, looking to keep her existence a secret by any means necessary. What's worse is when people around Kio turn out to secretly be a part of those organizations! Kio will have to work hard to keep Eris safe from these shady groups. Things are about to get mysterious, exciting, and most importantly sexy in Asobi ni Iku yo!","img":"https://cdn.myanimelist.net/images/anime/7/75583.webp"},{"title":"Boku no Kanojo ga Majimesugiru Sho-bitch na Ken","synopsis":"Haruka Shinozaki has been interested in the class representative, Akiho Kousaka, since his first year in high school. She is attractive, good at sports, and is an all-around model student. Since they are in the same class this year, Shinozaki decides to confess his feelings—and, to his shock, Kousaka agrees to be his girlfriend!\n\nHowever, he finds that Kousaka is a bit stranger than he first thought: this seemingly perfect girl has never been in a relationship. But even though she is inexperienced, she vows to please Shinozaki in every way she can... such as learning multiple sex positions or his fetishes. Shinozaki tries to assure her that her studies into such subjects aren't necessary, but Kousaka devotes herself to making him happy in more ways than one.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/87623.webp"},{"title":"Rail Wars!","synopsis":"Rail Wars! takes place in an alternate universe where the Japanese government remains in control of the nation's railway systems. Because of the stability afforded by the leadership of the government, the railway system is allowed to flourish.\n\nNaoto Takayama aspires to become an employee for Japan National Railways because of the comfortable life that it will enable him to live. In order to accomplish this he enters its training program, where students must demonstrate their knowledge of trains as well as their ability to be ready for any challenge that might arise.\n\nDuring this time period he will encounter other students such as the athletically gifted Aoi Sakura, the constantly hungry Sho Iwaizumi, and the human encyclopedia Haruka Komi. Together they will work towards surviving their trainee period, all the while taking on purse snatchers, bomb threats, and the looming specter of the extremist “RJ” group who wants to privatize the railway system.","img":"https://cdn.myanimelist.net/images/anime/13/65671.webp"}]