[{"title":"Akuma-kun: Youkoso Akuma Land e!!","synopsis":"No synopsis has been added for this series yet.\n\nClick here to update this information.","img":"https://cdn.myanimelist.net/images/anime/12/21277.webp"},{"title":"Oretacha Youkai Ningen G","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1954/91310.webp"},{"title":"Alice in Voodooland","synopsis":"Music video by Kousuke Sugimoto for the title track Alice In Voodooland by RoughSketch and featuring Aikapin.","img":"https://cdn.myanimelist.net/images/anime/1416/97880.webp"},{"title":"Je Bul Chal-ssi Iyagi","synopsis":"An unprecedented media show is on air at a TV broadcasting studio. The show is asking people whether a spider that drove an assemblyman crazy should be publicly executed or not. The spider in question is Je Bul-chal(meaning 'my mistake'), a hardworking young individual who became 'an ear cleaner' because of a precious memory he holds concerning his sister. In order to take a poll about his execution, the story of how Mr. Sorry became a spider is gradually revealed.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/3/19782.webp"},{"title":"Freaky Highschool","synopsis":"A cutesy horror anime. Everyone in town is monster but they're living their lives like normal while attending high school.","img":"https://cdn.myanimelist.net/images/anime/12/85047.webp"},{"title":"Chainsaw Bunny: Deleted Scene","synopsis":"A \"deleted scene\" from Chainsaw Bunny, where the monster becomes a giant pink faceless looming creature.","img":"https://cdn.myanimelist.net/images/anime/1282/95802.webp"},{"title":"Violence Voyager","synopsis":"Following an end-of-term school ceremony, the American boy Bobby decides to go with his friend Akkun into the mountains outside their village, to a place perfect for a secret base. On the way they stop into a mysterious amusement park. They have fun there, but are attacked and cannot leave. Falling in with some other children who are also lost there, they fend off a number of attacks, and gradually learn the truth behind the facility. It was put there by a man named Koike as a trap for passing children. His son Takashi needs to feed on human children in order to survive.\nAkkun is killed, and Bobby is captured with Tokiko, a girl they have met there. She disappears, and Koike goes to work on Bobby, trying to fatten him up. Bobby manages to escape. With the help of Saruyoshi, a mysterious old hermit, and the animals of the forest, Bobby builds up his strength and returns to the facility in an attempt to save Tokiko.\n\n(Source: Freestone.jp)","img":"https://cdn.myanimelist.net/images/anime/1424/97004.webp"},{"title":"Toki-iro Kaima","synopsis":"Anime adaptation of the same name horror manga by Suzumiya Wayu, serialized in Shogakuan's Weekly Shonen Sunday special issue.","img":"https://cdn.myanimelist.net/images/anime/2/52345.webp"},{"title":"Anime-ban Toukaidou Yotsuya Kaidan","synopsis":"An adaptation of Yotsuya Kaidan, a classic Japanese horror story about a ghost getting revenge.","img":"https://cdn.myanimelist.net/images/anime/9/82369.webp"},{"title":"Mechano: Scientific Attack Force","synopsis":"Three 10-minute videos present a trippy view into the minds of their creators. Brought together by Pierre Taki of Denki Groove, Mechano: Scientific Attack Force features three shorts done in very different styles.\n\nThe three short films are:\n\n\"Plastic Gun Man\" - a 3D Western spoof\n\"World Meccano Triangle\" - a music video reminiscent of '90s era screensavers\n\"Haiirogaoka no Soridaijin\" (translated as \"Prime Minister of Gray Hill\") - an anime-style animated video parody of Akira Mochizuki's famous 1977 manga, Yuuhi ga Oka no Souri Daijin","img":"https://cdn.myanimelist.net/images/anime/13/62687.webp"},{"title":"Zombie Clay Animation: Life of the Dead","synopsis":"Clay animation about a guy stuck in a room during zombie apocalypse.","img":"https://cdn.myanimelist.net/images/anime/2/72085.webp"},{"title":"Burning Village","synopsis":"Animal folk tales set in the titular community, in which local eccentric Ohahai retells several popular fairy tales with considerable license.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/8/77083.webp"},{"title":"Petit Petit Muse","synopsis":"Two twins, Ara and Ari, aspire into the world of fashion. Ara wants to become a fashion model, while her sister, Ari, wants to become a fashion designer. They meet a man named Yorang, who is the fashion designer in Heaven.","img":"https://cdn.myanimelist.net/images/anime/12/78380.webp"},{"title":"Monkey Peak","synopsis":"The anime centers on a group of pharmaceutical company employees who embark on a mountain-climbing trip together and who encounter tragedy at the hands of mysterious monkeys when they reach the top. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1654/95851.webp"},{"title":"Fujiko Fujio A no Mumako","synopsis":"Based on the horror novel by Fujio (A) Fujiko.","img":"https://cdn.myanimelist.net/images/anime/9/52375.webp"},{"title":"Ehon Yose","synopsis":"Anime rakugo of classic Japanese horror tales shown in a wide variety of art styles.","img":"https://cdn.myanimelist.net/images/anime/3/67979.webp"},{"title":"Shin Gakkou no Yuurei","synopsis":"Following the popularity of the original omnibus OVA, this release offers 4 more stories but in animation only. ","img":"https://cdn.myanimelist.net/images/anime/8/84713.webp"},{"title":"Kimoshiba","synopsis":"Kimoshiba is a weird type of life form with the shape of an oversize shiba inu, loves eating curry (particularly curry breads), and works at a funeral home. Similar life forms include yamishiba and onishiba.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/82366.webp"},{"title":"Kaibutsu-kun: Demon no Ken","synopsis":"Based on the shounen manga by Fujiko Fujio.\n\nNote: Screened as a triple feature with Doraemon: Nobita no Daimakyou and Ninja Hattori-kun: Nin Nin Ninpo Enikki no Maki.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/10/59587.webp"},{"title":"Heisei Matsue Kaidan: Ayashi","synopsis":"A Matsue City collaboration anime with Eagle Talon. Yoshida book-ends the story as horror tales, both modern and historical, originated within the city are narrated by another person. ","img":"https://cdn.myanimelist.net/images/anime/12/84746.webp"},{"title":"Yamiyo no Jidaigeki","synopsis":"Tales include:\n\nThe Hill of Old Age, which tells of a conspiracy hatched against Japan's unifier, Oda Nobunaga. \n\nSeeing the Truth, about the assassin sent to murder Nobunaga's successor leyasu Tokugawa.\n\nThe broadcast was a part of the Neo Hyper Kids program. \n\n(Source: Anime Encyclopedia)","img":"https://cdn.myanimelist.net/images/anime/10/61537.webp"},{"title":"Uchida Shungicu no Noroi no One-Piece","synopsis":"An omnibus horror TV special where three girls encounter a beautiful rose patterned yellow one-piece dress which curses them as they try to gain the attention of a man they like in their lives.","img":"https://cdn.myanimelist.net/images/anime/1815/106180.webp"},{"title":"3-bu de Wakaru Koizumi Yakumo no Kaidan","synopsis":"Stories from Patrick Lafcadio Hearn's book Kwaidan: Stories and Studies of Strange Things. The Greek-American author was known as Koizumi Yakumo in Japan and is renowned for collecting and publishing stories of Japanese folklore and legends. \n\nThe shorts were made for a Matsue City tourism promotion, as Hearn taught, lived, and married there. His home is a museum people can visit.","img":"https://cdn.myanimelist.net/images/anime/1781/91681.webp"},{"title":"Zombie Clay Animation: I'm Stuck!!","synopsis":"Spin-off series of Zombie Clay Animation: Life of the Dead.","img":"https://cdn.myanimelist.net/images/anime/3/78154.webp"},{"title":"Higanjima X: Aniki","synopsis":"A new episode of Higanjima X that was included in Blu-ray.","img":"https://cdn.myanimelist.net/images/anime/6/88803.webp"},{"title":"Kaibutsu-kun: Kaibutsu Land e no Shoutai","synopsis":"Based on the shounen manga by Fujiko Fujio.\n\nNote: Screened as a double feature with Doraemon: Nobita no Uchuu Kaitakushi.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/12/59885.webp"},{"title":"Ushiro no Hyakutarou","synopsis":"Horror OVA based on the manga by Jirou Tsunoda. The title roughly means \"Hyakutarou behind\". \n\nA boy named Ichitarou Ushiro deals with various horrifying phenomena with the help of his guardian spirit Hyakutarou. \n\n2 episodes: \"Kokkuri Satsujin Jiken\", \"Yuutai Ridatsu\". \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/7/36025.webp"},{"title":"Yamiyo no Jidaigeki (OVA)","synopsis":"A direct sequel that was put straight to video.\n\nThe Ear of Jinsuke, about a wandering swordsman saving a damsel in distress from evil spirits.\n\nPrints from the Fall of the Bakufu, features a tomboy from a woodcut works charged with making a print of the young warrior Okita Soji.\n\n(Source: Anime Encyclopedia)\n\n","img":"https://cdn.myanimelist.net/images/anime/10/61539.webp"},{"title":"Jigoku Koushien","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/13/68769.webp"},{"title":"Youkai Ningen Bem: Part II","synopsis":"For 1982 a 26-episode TV series sequel to Youkai Ningen Bem was planned. Because the original producers disbanded, the animation was done by Topcraft. 2 episodes were created and the project shut down without airing on television. The episodes were released to the public on a LD-Box Set a decade later. 2,000 units were printed and all were sold out.","img":"https://cdn.myanimelist.net/images/anime/1173/94675.webp"},{"title":"Hwasan Golae","synopsis":"In the year 2070, mankind faces a life threatening crisis due to huge earthquakes and volcanic eruptions. Korea is in a state of anarchy and Busan is swarming with refugees. Young street dealer Ha-jin has the ability to communicate with whales – a fact she keeps hidden from everyone. One day, a onearmed woman named Baek Sang-won asks Ha-jin to join her in the gules whale hunt. Painful memories lead Ha-jin to turn down the offer initially, but she eventually ends up joining Baek. As she makes friends on the ship, she grows curious about the gules whale and learns that every crew member has a sad gules story. The madness in the crews’ eyes as they try to kill the gules brings Ha-jin’s trauma to the forefront of her mind – and she experiences her own madness.\n\n(Source: Korean Film Biz Zone)","img":"https://cdn.myanimelist.net/images/anime/10/83639.webp"},{"title":"Matsue Kankou Taishi Sanri ga Iku! Matsue Ghost Tour","synopsis":"An accompaniment to Heisei Matsue Kaidan: Ayashi. This ghost tour takes a more realistic approach featuring Yoshia (the fictional Eagle Talon character), Kihara Hirokatsu (horror and mystery novelist), Chafurin (voice actor and Shimae Prefecture ambassador), and Frogman (Ryou Ono's caricature; real-life director of the anime studio DLE). The quartet travels around Matsue City exploring horror/haunted real life locations talking about the history and how it became a paranormal focus.\n\nThe end of the episode promotes ticket sale and times for a real ghost tour watchers can partake in.","img":"https://cdn.myanimelist.net/images/anime/12/84747.webp"},{"title":"Nanja Monja Obake","synopsis":"An anime made entirely in sumi-e following a child fox spirit and his morphing ability for haunting but he ends up getting scared himself.","img":"https://cdn.myanimelist.net/images/anime/4/70855.webp"},{"title":"Shou-chan Sora wo Tobu","synopsis":"An anime version of Ikkei Makina's horror novel of the same name. It aired at the same time as the live-action adaptation.","img":"https://cdn.myanimelist.net/images/anime/6/89108.webp"},{"title":"Echigo no Mukashibanashi: Attaten Ganoo","synopsis":"A collection of four folk tales from Koshiji (from 2005, part of Nagaoka), Niigata prefecture (Echigo is the old name of Niigata).\n\nEpisode 1: The Azuki Mochi and the Frog\nA mean old woman tells an azuki mochi to turn into a frog, if her daughter-in-law wants to eat it. The daughter-in-law hears this, and...\n\nEpisode 2: Satori\nA woodcutter warms himself at the fire of deadwood, when a spirit in the form of an eyeball appears in front of him. The spirit guesses each of the woodcutter's thoughts right...\n\nEpisode 3: The Fox's Lantern\nAn old man, who got lost in the night streets, finds a lantern with a beautiful pattern, which was lost by a fox spirit. The next day, he returns it reluctantly, and what he sees...\n\nEpisode 4: The Three Paper Charms\nAn apprentice priest, who lost his way, accidentally puts up at the hut of the mountain witch. To avoid being eaten, he uses three paper charms to get back to the temple...\n\n(Source: Official site)","img":"https://cdn.myanimelist.net/images/anime/11/68031.webp"},{"title":"Heisei Matsue Kaidan","synopsis":"A Matsue City collaboration anime with Eagle Talon. Yoshida book-ends the story as modern horror tales, originated within the city, are narrated by another person. The shorts are meant to promote the Patrick Lafcadio Hearn's Ghost Tour offered by the city.\n\nSome episodes feature biographical segments of the Matsue Kankou Taishi Sanri ga Iku! Matsue Ghost Tour group.","img":"https://cdn.myanimelist.net/images/anime/1285/91682.webp"},{"title":"Akuma no Organ","synopsis":"Music video for Devil's Organ by GREAT3. From Climax E.P. (2003)","img":"https://cdn.myanimelist.net/images/anime/1773/91871.webp"},{"title":"Inunaki-mura x Taka no Tsume-dan","synopsis":"A collaboration between the live-action horror film Inunaki-mura slated to be released in theaters February 7, 2020 and the Eagle Talon franchise. The film is based on the urban legend of the real-life abandoned Inunaki Village and the old tunnel that cut through the area.\n","img":"https://cdn.myanimelist.net/images/anime/1632/105513.webp"},{"title":"Kaibutsu-kun: Suna Majin wo Yattsukero no Maki / Kaibutsu-kun to Haniwa Kaishin no Maki","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/2/79851.webp"},{"title":"Kimoshiba 2","synopsis":"The second season of Kimoshiba.","img":"https://cdn.myanimelist.net/images/anime/10/87009.webp"},{"title":"Nihon no Obake-banashi","synopsis":"Classic Japanese ghost stories for children.","img":"https://cdn.myanimelist.net/images/anime/8/84591.webp"},{"title":"Yuurei Yashiki","synopsis":"An American ambassador and his family move into an old castle. They learn from the help that Simon, a man suffering for 300 years due to a heavy sin he committed, resides in the castle. The Americans are quite lighthearted and unfazed by the situation. The father gives the ghost a gift, the boys pillow fight and play tricks on him, and the daughter Virginia is kind and forgiving with him. The ghost is quite surprised because he's used to haunting and people hating him.","img":"https://cdn.myanimelist.net/images/anime/10/85539.webp"},{"title":"Witch Hat: Majo to Boushi no Waltz","synopsis":"A music video for Fake Type.'s song Witch Hat: Majo to Boushi no Waltz.","img":"https://cdn.myanimelist.net/images/anime/1645/102925.webp"},{"title":"Kaibutsu-kun (1980) Specials","synopsis":"TV specials of the 1980 colored Kaibutsu-kun series. The first three episodes aired after episode 25. The trio aired back to back on the same day, in honor of Taro Sagami who was the voice actor of Franken. He had passed away the day before. Shingo Kanemoto took over voicing the role after these three eps. The other three eps were all New Years specials aired after ep 57.\n\nEach Kaibutsu-kun story is ~15 minutes long. The TV series shows 2 stories per episode to fit into a half hour time slot. These specials are all 1 story each but ep 3 and 5 use the time slot for theirs.","img":"https://cdn.myanimelist.net/images/anime/1349/106619.webp"},{"title":"Kageyama Tamio no Double Fantasy","synopsis":"A 2-part TV special. The first part is a comedic bickering couple taking a sketchy plane for vacation. The second part is a horror a camera crew encounter while staying at the Hotel Southpacific after landing.","img":"https://cdn.myanimelist.net/images/anime/1523/106150.webp"},{"title":"Inma Youjo","synopsis":"Maya is a force of nature: wherever she goes, havoc and destruction follows. Men lose control, and become her playthings; while women become so jealous they are led to their doom. Each episode is a tale of a different Maya in a different world.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/7437.webp"},{"title":"Kiseichuu no Ichiya","synopsis":"Short experimental animation from 1972 by Yoji Kuri.","img":"https://cdn.myanimelist.net/images/anime/3/64693.webp"},{"title":"Maryuu Senki","synopsis":"Once upon a time, there was a certain family having strong influence on the rule of the Imperial Court. They had their own might called \"Kidou\" and yet got hated because of the might itself. At last, the patriarch of the family was entrapped to his death, and all the family was doomed to ruin... The present day — the survived descendants of this family, now calling themselves \"Kidousyuu\" schemed to resurrect their murdered patriarch once again, and the ferocious evil spell went into action.\n\n(Source: BakaBT)","img":"https://cdn.myanimelist.net/images/anime/3/13235.webp"},{"title":"Kaibutsu Oujo Specials","synopsis":"Specials of 4 minutes which recounts the adventures of Kerberotte-chan including characters of Princess Resurrection.","img":"https://cdn.myanimelist.net/images/anime/11/66099.webp"},{"title":"Kujakuou","synopsis":"A young mystic without a past, Kujaku was born under a dark omen possessed of incredible supernatural powers. Raised by priests, he has learned to use these powers for good. But the evil Siegfried von Mittgard seeks to steal his birthright, and rule the world as the Regent of Darkness. He has dispatched bloodthirsty minions to destroy Kujaku before he can awaken to his destiny. Now, Kujaku must unravel the riddle of his past, before the power within consumes him!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/10/82866.webp"},{"title":"Youjuu Sensen Adventure Kid","synopsis":"Episode 1: A young man named Norikazu finds a computer from World War II buried in his back garden. When he activates it, he and a girl named Midori are transported to Hell where erotic creatures and monsters of different kinds live. They meet some friends including a sexy elf type woman named Eganko who falls in love with Norikazu, and a perverted monster prince who is soon enslaved by Midori. Using their new friends the pair try to make the dangerous journey back home.\n\nEpisode 2: Having made their way back home the adventure duo find the world they knew is gone, and is now ruled by the demonic computer which first sent them to Hell. They travel back in time to World War II Japan in an attempt to stop the world from being changed. Notably, in doing so they witness the atomic bomb being dropped on Hiroshima, and there is an appearance of the Enola Gay, as well as numerous symbols of Japanese culture at the time.\n\nEpisode 3: This episode has a humorous love-quadrangle plot, where Eganko comes up with a plan to make Norikazu fall in love with her with a love potion, and simultaneously make Midori fall in love with an egotistical young man from her school. Unsurprisingly their plan backfires and everyone gets what they deserve.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/5/13158.webp"},{"title":"Choujin Densetsu Urotsukidouji 5: Kanketsu-hen","synopsis":"Only one episode of this was partially completed, the released version containing numerous examples of animation that is missing in-between frames. The story as such concerned the arrival of the real Chojin as he/she (a hermaphrodite) makes moves to wipe out all life on Earth.\n\nInterestingly, the setup for the show was far more heavily connected with the first two, more popular, chapters in the Urotsukidoji saga, with appearances by Nagumo and Akemi (unseen since the early episodes of Part III), and redesigned character models that more closely resembled the earlier episodes. Some of the less popular characters introduced in chapters III and IV, particularly Buju, were nowhere to be seen. Nevertheless, such strategies did little to get this final saga off the ground and the story was shelved.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/8/11745.webp"},{"title":"Dead Girl Trailer","synopsis":"Once upon a time, a girl was brutally murdered. Stabbed mercilessly and left for dead, she never received justice and her sadistic killer got away. That was until, through supernatural and unknown forces, she was brought back to life—as a zombie! Powerful, relentless, and hungry, Dead Girl is out for revenge!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/44744.webp"},{"title":"Jigoku Sensei Nube: Kyoufu no Natsuyasumi!! Ayashi no Umi no Densetsu!","synopsis":"When Nube and his class arrive at a small island to carry out beach activities, they heard a forbodding tale from an old man residing on the island. Legend has it that there is a creature known as the sea spider in the open seas around the island. When the creature is past 200 years old, it will turn into a monster and devour humans to satisfy its appetite. However, curiousity kills the cat and Yukime decides to pursue the authenticity of the legend. And then, a girl suddenly appears on the beach. Possessed with a strange charm, she immediately attracts Hiroshi's attention and overcomes him. Soon later, strange things start to happen to the others whereby Kyoko and Ritsuko-sensei got attacked under strange circumstances. The true identity behind the mysterious girl is questioned and the legend behind the sea creature seems to be true after all.","img":"https://cdn.myanimelist.net/images/anime/9/21282.webp"},{"title":"Xue Se Cang Qiong","synopsis":"Li Mingyang was originally an ordinary office worker. Because of a strange QR code, he was trapped in a killing city. Here everyone is forced to participate in a survival game that is going to kill or be killed. In the process of finding a way out of the city, the mastermind behind the whole incident surfaced step by step.","img":"https://cdn.myanimelist.net/images/anime/8/88891.webp"},{"title":"Chimera","synopsis":"The series follows Kou Ootori, an ordinary high school student who experiences a recurring nightmare of being eaten alive by a beast from within. However, when he meets Reiichi Kuki, an upperclassman who controls the school, the curtain of fate unravels.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1641/90996.webp"},{"title":"Inyouchuu Etsu Special","synopsis":"Special of Inyouchuu Etsu.","img":"https://cdn.myanimelist.net/images/qm_50.gif"},{"title":"Aru Zombie Shoujo no Sainan","synopsis":"Promotional video for an anime adaptation of the Aru Zombie Shoujo novel series. Though uploaded in July 2012, the proposed adaptation never came to fruition.","img":"https://cdn.myanimelist.net/images/anime/13/74565.webp"},{"title":"Ling Long: Incarnation","synopsis":"In the not-too-distant future, the human world has long been overpopulated. Humanity marched to the stars in search of a new home, and just as this was going on, the moon's alignment caused massive earthquakes to ripple across the world, lasting several decades. Humanity was demolished. When the land finally recovered, humanity reemerged to face this strange yet familiar world. Will we, who once lorded over this domain, still remain the masters of this world?\n\n(Source: Yu Alexius Anime Portal)","img":"https://cdn.myanimelist.net/images/anime/1757/100434.webp"},{"title":"Tezuka Osamu no Don Dracula","synopsis":"After living in Transylvania for several years, \"Earl Dracula\" (as Osamu Tezuka's official website calls him in English) has moved to Japan. In the Nerima Ward of Tokyo, he and his daughter, Chocola, and faithful servant Igor have taken up residence in an old-Western style house.\n\nWhile Chocola attends Junior High School, Earl Dracula is desperate to drink the blood of beautiful virgin women; an appropriate meal for a vampire of his stature. However, each night that Earl Dracula goes out on the prowl he finds himself getting involved in some kind of disturbance which leads to him causing various trouble for the local residents. With nobody in Japan believing in vampires, his very presence causes trouble amongst the people in town.","img":"https://cdn.myanimelist.net/images/anime/7/15129.webp"},{"title":"Jigoku Sensei Nube: Gozen 0 Ji Nube Shisu!","synopsis":"New student comes to Nube class. His name is Jun and he's a lonely boy who loves clowns very much. His only friend is a Pierre - clown in the mirror. And one night Pierre gives Jun a mask with strange abilities. At that point Jun starts to act strange and lot of accidents occur in the school.","img":"https://cdn.myanimelist.net/images/anime/3/74743.webp"},{"title":"Si Ling Bianma: Zhi Shijie Caozong Zhe","synopsis":"“Ghost” is an online mobile game that Ye Yinyi always dreamed of completing, and to that end, has poured his blood and tears into it, even missing a date with his girlfriend. However, he learns about an alarming monster attack on a young woman near his house, a photograph of which shows the monster to bear a resemblance to the monster he designed. Why is the world of his mobile game appearing in real life? ","img":"https://cdn.myanimelist.net/images/anime/11/81331.webp"},{"title":"Zonmi-chan: Meat Pie of the Dead","synopsis":"A heart-warming splatter comedy about a zombie in love!\n\nZonmi-chan is a clumsy, careless, but cute girl. Sometimes she takes a bite out of the guy she likes. Oh, that's right, Zonmi-chan is a zombie girl. \n\n(Source: Neft Film)","img":"https://cdn.myanimelist.net/images/anime/8/79602.webp"},{"title":"Youjuu Kyoushitsu","synopsis":"Demons take multiple forms, in this case there's one thats the mightest of all and has to be satisfied with the flesh of woman. He searches for his preys in the form of a woman, so they won't be feared. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/13156.webp"},{"title":"Oretacha Youkai Ningen","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/12/87310.webp"},{"title":"Shin Choujin Densetsu Urotsukidouji Mataiden","synopsis":"Nazi Germany, 1944: As American bombers soar towards Berlin, a revolting Satanic rite takes place below—Hitler and his minions are using the monstrous Nazi Death Rape Machine to render the dimensional boundaries separating the Human World from the World of Man-Beasts and the World of Monster Demons. Dr. Munhihausen Sr.'s life work is about to come to fruition—the conjuring of the Overfiend!\n\nCut to modern day Tokyo—Munhihausen Jr. searches for a monster with strength enough to conquer the omnipotent Overfiend. Since legend says that he who kills the Overfiend will rule all three worlds forever; Munhihausen is determined to slay the Overfiend and assume complete control over all three dimensions. His efforts seem fruitless—until Nagumo's cousin Takeaki, infused with Nagumo's blood after an accident, begins to develop monstrous powers.\n\nAs man-beast Amano Jyaku and his sister Megumi, together with faithful accomplice Kuroko attempt to thwart Munhihausen's evil plan, nothing seems likely to prevent Munhihausen, descendant of a race of brutal tyrants, from enslaving the world under his despicable rule!","img":"https://cdn.myanimelist.net/images/anime/10/13292.webp"},{"title":"Shin Kujakuou","synopsis":"A young mystic without a past, Kujaku was born under a dark omen possessed of incredible supernatural powers. Raised by priests, he has learned to use these powers for good. But the evil Siegfried von Mittgard seeks to steal his birthright, and rule the world as the Regent of Darkness. He has dispatched bloodthirsty minions to destroy Kujaku before he can awaken to his destiny. Now, Kujaku must unravel the riddle of his past, before the power within consumes him! \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/12/82865.webp"},{"title":"Hashi no Mukou","synopsis":"There are old stories of children disappearing by the river's edge. This has haunted Otoha ever since her friend Jiro disappeared  when she was seven years old and now she is back in her hometown covering the war between the government and the dissidents. When she gets separated from the squad, Otoha thinks someone seems to be leading her deeper into the back alleys of the town.","img":"https://cdn.myanimelist.net/images/anime/12/62825.webp"},{"title":"Youshou","synopsis":"Justice has never been so naked!\n\nA super-secret cult of lesbians performs erotic experiments on bodies from the local hospital! Their purpose: to revive the spirit of their ancient leader in a virile human form. Now it's up to the Midnight Strike Force, a team of busty justice fighters, to go undercover (and under the covers) to stop the nefarious acolytes before they succeed in their diabolically dirty schemes! \n\n(Source: Critical Mass Video)","img":"https://cdn.myanimelist.net/images/anime/13/5928.webp"},{"title":"Dead World","synopsis":"In the forest ...","img":"https://cdn.myanimelist.net/images/anime/4/82024.webp"},{"title":"Genma Taisen: Shinwa Zenya no Shou","synopsis":"In the distant future, monsters and inhumans roam the land, and the ruling Evil King seeks a human woman to bear him powerful, force-adept heirs. Non offers herself to the Evil King in order to save her village from Ape Clan raiders, and gives him twin sons, Loof and Jin. She and her sons are exiled by the ungrateful villagers, however, and Non's companion Nue (a Demon Clan member changed into a wolf for disobedience) takes Loof to be raised by his father, the Evil King. The Evil One's Queen Parome despises humans, however, and her malevolence towards Loof deepens...\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/1/1705.webp"},{"title":"Kyoufu Shinbun (2014)","synopsis":"Rei Kigata is a first year middle schooler at Ishido Middle School. He is not a believer of any paranormal phenomena such as existence of ghosts or spirits in any kind, but one day at midnight, while he is sleeping, a mysterious newspaper called \"Horror News\" is delivered to his room. The newspaper tells a story in which one of his teachers at the school will get killed in a car accident the following morning and Kigata will be a witness of the accident. The story turns into a fact in the following day and since then, the mysterious newspaper is delivered everyday. He realizes he is haunted by this newspaper and that his life span would be shortened in 100 days every time he reads it.\n\n(Source: Crunchyroll, edited)","img":"https://cdn.myanimelist.net/images/anime/4/72885.webp"},{"title":"Hell Target","synopsis":"A spaceship is lost near the forbidden planet of Inferno II. Some years later, a second ship with a crew of nine gets there and encounters a monster that rapidly makes mince meat of most of them. The sole survivor, Makurou Kitazato, must destroy the monster before it can surprise a third ship that is already en route.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/8/74341.webp"},{"title":"Gakkou no Kaidan Recaps","synopsis":"A new year special where Momoko stars to remember some of the adventures, she has had with her friends.","img":"https://cdn.myanimelist.net/images/anime/12/78468.webp"},{"title":"Gregory Horror Show: The Second Guest","synopsis":"The second series, The Second Guest is similarly set with 25 stories, except this time the main victim is a woman who has just taken a taxi home from her best friend's wedding ceremony.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/3/35057.webp"},{"title":"Tong Zhi Zhe","synopsis":"A Jack of All Trades is a person who can competently do all kinds of jobs. Loser Zhang Dabao is a professional Jack of All Trades, but his living conditions are, shall we say, less than satisfactory. One day, a beautiful woman who is being harassed by a pervert approaches him for help. He accepts, and soon embarks on a mission like nothing the world has seen before.","img":"https://cdn.myanimelist.net/images/anime/8/81483.webp"},{"title":"Nessa no Haou Gandalla","synopsis":"A dispute between young band members and an unfortunate choice of melody inadverdently draws them all into the demonic horror known as  the desert-god Gandalla. ","img":"https://cdn.myanimelist.net/images/anime/5/58541.webp"},{"title":"Usagi ga Kowai","synopsis":"Tetsuji Kurashige's nightmarish U-SA-GUI (2002) begins by citing a section from Brillat-Savarin's 1825 treatise, The Physiology of Taste, in which the renowned French epicure suggests that stimulating foods, meats in particular, can have an influence on one's dreams. The film depicts a macabre game played by two rabbits and a blindfolded woman. The rabbits face each other over an old-fashioned illustrated board game. When they land on a square, the woman must eat the food indicated in the illustration. If she has chosen correctly, a die pops out of her mouth and lands on the floor giving the rabbits their next move.\n\n(Source: Midnight Eye)","img":"https://cdn.myanimelist.net/images/anime/7/59765.webp"},{"title":"Gakkou no Kowai Uwasa: Hanako-san ga Kita!!","synopsis":"Based on the short story \"Ghost Toilet\" from Toru Tsunemitsu's urban myth collection \"School Ghost Stories.\" This was adapted into the children's book \"Hanako in the Toilet: Scary Stories of Your School\" (1993). Several artists then adapted this into the \"Here Comes Hanako\" manga; most of them also wrote the anime version, which was aired as a segment of the TV series \"Ponkikki Kids.\" Episodes, introduced by Hanako, included \"The Haunted Cinema\" and \"The Cursed Promise Ring.\" ","img":"https://cdn.myanimelist.net/images/anime/5/14726.webp"},{"title":"Shinsatsushitsu","synopsis":"In Kei Oyama's grim Consultation Room, a medical diagnosis triggers a wave of traumatic fantasies, portrayed in greyish pencil drawings that waver as if left out for too long in the rain.\n\n(Source: Sydney Morning Herald)","img":"https://cdn.myanimelist.net/images/anime/6/59761.webp"},{"title":"Kyoufu Densetsu Kaiki! Frankenstein","synopsis":"Airing on TV Asahi in 1981, with a running time of 111 minutes, Frankenstein is a reasonably standard retelling of the classic book by Mary Shelley. In a foreboding castle scientist Dr. Victor Frankenstein performs a hideous experiment which he hopes will bring the dead back to life. With the help of his assistant he is successful in reanimating a man recreated from parts gathered from corpses but the creature is unpredictable and horrifying. The doctor flees back to his home in Switzerland leaving his assistant in charge of destroying the monster. But Dr. Frankenstein soon finds that he cannot hide from his shameful secret forever as mysterious murders are committed around him forcing him to question if his creation really is dead and gone... ","img":"https://cdn.myanimelist.net/images/anime/10/16281.webp"},{"title":"Watashi no Kao","synopsis":"Abstract horror short film about a girl's face.","img":"https://cdn.myanimelist.net/images/anime/13/69661.webp"},{"title":"Rinkaku","synopsis":"Following the release of their 8th album \"DUM SPIRO SPERO,\" Japanese rock band Dir en Grey went into hiatus following a vigorous touring schedule in Japan and abroad, a year and a half later returning with their single \"RINKAKU\" released on December 19th, 2012.  Once again animator Keita Kurosaka was enlisted to create a hand drawn music video, that in many regards is much less shocking and grotesque than the band's previous collaboration with Kurosaka, the infamous \"Agitated Screams of Maggots\" music video. ","img":"https://cdn.myanimelist.net/images/anime/12/50283.webp"},{"title":"Injuu vs. Onna Spy","synopsis":"When the government develops a bio-engineered cyborg, named Dragon, as a secret weapon, a failure in gene manipulation turns the creature into a sex-crazed monster! The government assigns three very sexy agents to find the creature, and execute everyone involved. Will they be able to solve the case before even more women are abducted to fill the creature's sexual appetite? Or will they become Dragon's next conquests?","img":"https://cdn.myanimelist.net/images/anime/5/7665.webp"},{"title":"Youkai Ningen Bem","synopsis":"Three monsters, Bem, who looks like a gangster, Bero, who looks like a boy, and Bera, a witch, act as agents of justice, hoping that they will be allowed to become human. Several episodes involve them protecting a young boy. The style of animation is fairly distinctive, and the storylines not without interest. \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/10/64521.webp"},{"title":"Yami no Purple Eye","synopsis":"Based on a shoujo manga written and illustrated by Shinohara Chie serialised in Shoujo Comic.\n\nThe original story follows the struggles of a teenage girl after she finds herself turning into a lycanthropy-leopard and having to battle her newly found predatory instincts.\n\nIn 1987 an animated music video of 30 minutes length was made based on the award winning manga. \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/8/26389.webp"},{"title":"Youjuu Kyoushitsu Gaiden","synopsis":"From the radioactive emptiness of space comes the Demon Beast! A hideous alien monster, the Beast shares a psychic link with the beautiful Earth woman, Kayo. Bound by a forbidden past and a horrifying erotic encounter, she is destined to lure the Beast back to a helpless Earth. Her tortured soul cries out across dimensions, calling the Demon Beast to begin his reign of bloodlust, carnage, and terror!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/4/25887.webp"},{"title":"Devilman Memorial","synopsis":"Summary of the 1972 Devilman series. ","img":"https://cdn.myanimelist.net/images/anime/10/86910.webp"},{"title":"Neko Machi","synopsis":"A fantasy world with only cats as far as the eye can see. The awe and fear a person can feel in a world that doesn’t know mankind, the world of Cat City invented by HAGIWARA Sakutaro, is depicted with sense by the art of KANAIDA Etsuko. The commercial editor URAHAMA Shojiro edits the story narrated by the musician and poet MACHIDA Kou with a taste of fantastic for this new Ga-nime. \n\n(Source: Toei-anim.co.jp)","img":"https://cdn.myanimelist.net/images/anime/9/13999.webp"},{"title":"Umi no Yami, Tsuki no Kage","synopsis":"Ruka and Rumi Kobayakawa are twin sisters in love with the same man, athletic upperclassman Katsuyuki Touma. Rumi seems supportive of Ruka's fledgling romance with Katsuyuki, until the twins are infected with a strange bacterium that transforms Rumi's personality and gifts the twins with terrifying psychic powers. Now Rumi will stop at nothing - or no one,  that gets between her and Katsuyuki, including her own twin sister...\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/37269.webp"},{"title":"Gregory Horror Show: The Last Train","synopsis":"The third series, The Last Train is set with 26 stories during a bizarre train ride that Gregory embarks upon.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/2/35059.webp"},{"title":"Hengen Taima Yakou Karura Mau! Nara Onryou Emaki","synopsis":"Shoko and Maiko Ougi are apparently two ordinary schoolgirls in pursuit of graduating and having fun. Shii-chan is the more serious while Mai-chan is more fun-loving. In reality, the two sisters are powerful exorcists from the Karura temple. Each wields half the power...Shii-chan can \"see\" the spirits, and Mai-chan can banish them. This is the movie adaptation of a spooky series with heavy emphasis on traditionally Japanese occult themes. \n\n(Source: AnimeNfo's Karura Mau OVA description; modified)","img":"https://cdn.myanimelist.net/images/anime/6/38475.webp"},{"title":"Yonimo Osoroshii Grimm Douwa","synopsis":"The truth behind the well-known Grimm's Tales is cruel and full of blood and lust!\n\nEpisode 1: \"Hansel &amp; Gretel\": Two brothers lost in the woods were actually criminals...\n\nEpisode 2: \"The Blue Beard\": The true character of the Blue Beard was a cannibal who was unable to tolerate his wife's adultery. \n\nEpisode 3: \"Cinderella\": Actually Cinderella had abnormal affections toward the prince.","img":"https://cdn.myanimelist.net/images/anime/4/27232.webp"},{"title":"Chainsaw Bunny","synopsis":"Two bunny girls get in trouble.....\nFrom the creator of CHAINSAW MAID and PUSSYCAT,\nanother gory horror clay animation comes!!\nNever ending splatter carnival has begun!!","img":"https://cdn.myanimelist.net/images/anime/1817/93467.webp"},{"title":"Yonimo Osoroshii Nihon Mukashibanashi","synopsis":"The horrible truths behind Japanese Fairy Tales from the ancient times are finally revealed! This title includes three episodes: \"The Monkey and the Crab\", \"Click-Crack Mountain\" and \"Urashima and the Kingdom beneath the Sea\".\n\n(Source: Official Website)","img":"https://cdn.myanimelist.net/images/anime/6/27233.webp"},{"title":"Inuki Kanako Zekkyou Collection: Gakkou ga Kowai!","synopsis":"Based on the comic \"Inuki Kanako Queen's Collection\" by Inuki Kanako.\n\nBukida is disliked by all the students in his class because of his unpleasant face. However, he loves a girl named Matsuko and so he stalks her. Though Matsuko rejects him, Bukida fancies she likes him at heart. One day, Bukida is killed in a traffic accident. Matsuko feels relieved. But Bukida appeared to her as the living dead. Bukida says, \"I love you forever, even though I am dead!\".","img":"https://cdn.myanimelist.net/images/anime/8/24741.webp"},{"title":"Wo Jiao Bai Xiaofei","synopsis":"Bai Xiaofei lived a dull, boring life. That all changes when, on his way to find his girlfriend, he meets a mutant with unprecedented power. As an ordinary human being, Xiaofei felt totally out of his depth; there was no way he could defeat powerful enemies and track down the cause of these strange mutations. After giving himself a shot of body enhancer bought online, however, he gradually reaches his potential.\n\n(Source: Haoliners.net)","img":"https://cdn.myanimelist.net/images/anime/5/80257.webp"},{"title":"Gendai Kibunroku Kaii Monogatari","synopsis":"The horrid stories that remain in many conversations, the chilling urban legends come to life thanks to the Ga-nime.\n \nThe terrible anecdote of an old fridge thrown by a dried up river bed in “Refrigerator”.\n The grotesque encounter with an out of place sculpture standing on top of a building in “The Dharma Statue”.\n The ghost encounter experience by a boy on a long bridge at night in “The Night Bridge” \nA purchase at the flea market that brings a man to an ironic end in “US Army Surplus”\n The enigma of continuous deadly accidents near a railroad in “The Railroad Crossing” \nThe mysterious experience of a boy on summer vacation in a peaceful countryside in “I Want Friends”. \n\n6 pieces of horror put on 1 film. The Japanese urban legends, put on screen in the characteristic drawing of KIMURA Toshiyuki, whose fame reaches outside the borders of Japan, call for a scream, with the talented collaboration for the ending theme of an artist produced by SUDOH Akira, Leilani. \n\n(Source: Toei-anim.co.jp)","img":"https://cdn.myanimelist.net/images/anime/11/14000.webp"},{"title":"Mirai Choujuu Fobia","synopsis":"Iijima is no ordinary coed. She's a tempestuous time traveler from a future ruled by hideous replinoid monsters. She has come to this past to find a hero, a man strong enough to wield her futuristic sword and save the women of Earth from a grisly doom!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1164/104273.webp"},{"title":"Mugen Shinshi: Bouken Katsugeki-hen","synopsis":"When a strange group of men attempt to kidnap Atsuko Fukune, a dancer at a club, she seeks the help of Mamiya Mugen, a famous detective - who also happens to be a child. When it turns out that other girls have gone missing, Mamiya, with the help of his butler Alucard, springs into action to solve the mystery.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1138/94447.webp"},{"title":"Gegege no Kitarou (1968 Movie)","synopsis":"A retelling of episodes 5-6 from the 1968 TV anime.","img":"https://cdn.myanimelist.net/images/anime/1148/99306.webp"},{"title":"Chuumon no Ooi Ryouriten (1993)","synopsis":"Two gentlemen from the city go out hunting. After getting lost on a mountain road they found a cheap restaurant. But everything is not as it seems.","img":"https://cdn.myanimelist.net/images/anime/6/74516.webp"},{"title":"Gakkou no Kaidan (OVA)","synopsis":"OVAs included in the August and September issues of Comic Bun Bun between 2005 and 2009. In 2005 and 2006, the anime came on VHS tapes. It switched to DVD in 2007.","img":"https://cdn.myanimelist.net/images/anime/8/65195.webp"},{"title":"Kaibutsu-kun","synopsis":"The prince of Kaibutsu Land, Kaibutsu-kun, decides to go to the human world as part of his training to become the King.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/79850.webp"},{"title":"Gregory Horror Show: The Bloody Karte","synopsis":"The fourth series, The Bloody Karte (presented as a side series on the DVDs) is a set of 12 stories about Catherine working in a mysterious hospital.  \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/5/35061.webp"},{"title":"Yumemakura Baku Twilight Gekijou","synopsis":"Originally released as a feature part of Studio Pierrot's video magazine show Anime V Comic Rentaman (アニメ・V・コミック レンタマン) along with Abashiri Ikka, Eguchi Hisashi no Kotobuki Gorou Show and Akai Hayate. \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/6/35855.webp"},{"title":"Gegege no Kitarou: Nippon Bakuretsu","synopsis":"Movie based on the 2007 TV anime with an original plot.","img":"https://cdn.myanimelist.net/images/anime/8/20485.webp"},{"title":"Beluga","synopsis":"A horror spin on the classic tale of \"The Little Match Girl\".","img":"https://cdn.myanimelist.net/images/anime/1643/93895.webp"},{"title":"Qui Shui Yi Yun","synopsis":"A villa, involved in strange circumstances in the 1990s, is bulldozed and new homes are built on top. The ostensibly peaceful town and its inhabitants will soon have its cover blown wide open. Mysterious forces are at play, rooted in a disturbing truth.","img":"https://cdn.myanimelist.net/images/anime/2/81276.webp"},{"title":"Gegege no Kitarou: Daikaijuu","synopsis":"Movie based on the 1996 TV anime with an original plot.","img":"https://cdn.myanimelist.net/images/anime/4/20380.webp"},{"title":"Chuumon no Ooi Ryouriten","synopsis":"The oldest anime adaption of the famous short story, Chuumon no Ooi Ryouriten, originally written by Kenji Miyazawa. This stop-motion anime follows two British hunters as they venture deep into the thick woodlands and find themselves lost. It's not long till they stumble across a strangely located restaurant. They Decide it's best to take a break inside, though they quickly find that things in this restaurant may not be what they seem.","img":"https://cdn.myanimelist.net/images/anime/13/36605.webp"},{"title":"Jigokudou Reikai Tsuushin","synopsis":"Tetsushi, Ryouchin and Shiina are a youthful trio not to be trifled with; they have a fearsome reputation. One day they decide to enter Jingkudou, a store which is rumored to be the gateway to Hell, the storekeeper sure is creepy enough. He tells them a story and after that they decide, with a magical token provided by the storekeeper, to try and find the restless spirit of a murder victim in order to give her release. This is only the start of their supernatural career...\n\n(Source: BakaBT)","img":"https://cdn.myanimelist.net/images/anime/11/27198.webp"},{"title":"Timing","synopsis":"The Japanese-Korean horror movie should have been released in 2012, but the project got canceled after Korean investors could not be determined. A six-minute promotional video is what's left of it of this attempted co-production.\n\nTiming holds the story of four characters with abilities related with time, fighting to stop the tragedies occurring in a high school.\n\n(Source: Hancinema)\n","img":"https://cdn.myanimelist.net/images/anime/7/26766.webp"},{"title":"High School Mystery: Gakuen Nanafushigi","synopsis":"No synopsis has been added for this series yet.\n\nClick here to update this information.","img":"https://cdn.myanimelist.net/images/anime/5/27334.webp"},{"title":"Akuma-kun","synopsis":"The age of the demons has begun. Dr Faust has foreseen this rise of evil. Unfortunately, he is near death and is unable to personally battle this upcoming threat. Faust entrusts a young boy, Shingo Yamada, to take the responsibility of ridding the Earth of this new evil presence. Faust finds a birthmark on Shingo's forehead that signifies that he is the chosen demon fighter. Faust summons from hell what may be humanity's only hope of surviving: a less than enthusiastic devil named Mephisto rises. After signing a pact in blood to save humankind, Shingo and Mephisto set out to battle the supernatural world.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/8/61467.webp"},{"title":"Zonmi-chan: Halloween☆Special Movie!","synopsis":"A Halloween special starring Zonmi-chan. A soldier is being chased by several Zonmi-chan zombies. He shoots at them but is ultimately caught.","img":"https://cdn.myanimelist.net/images/anime/12/79267.webp"},{"title":"Gakkou no Yuurei","synopsis":"This OVA is a live-action/animation mixed collection of short school ghost stories.\n\n(Source: AniDB)\n","img":"https://cdn.myanimelist.net/images/anime/12/54087.webp"},{"title":"Gegege no Kitarou (1985 Movie)","synopsis":"Movie based on the 1985 TV anime with an original plot.","img":"https://cdn.myanimelist.net/images/anime/5/21017.webp"},{"title":"Higanjima X","synopsis":"Akira is in the midst of the final battle between the human race and vampires. He only has 47 days until Japan is turned into an island of vampires.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/82352.webp"},{"title":"Gakkou no Kowai Uwasa Shin: Hanako-san ga Kita!!","synopsis":"The story of the anime revolves around Hanako, a girl who lives in a supernatural world apart from our own. Hanako appears when schoolchildren are in trouble; she is a benevolent version of an enduring Japanese urban legend about Hanako, a ghost who lives in a toilet at the local school.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/26414.webp"},{"title":"Hengen Taima Yakou Karura Mau! Sendai Kokeshi Enka","synopsis":"Shoko and Maiko Ougi are apparently two ordinary schoolgirls in pursuit of graduating and having fun. Shii-chan is the more serious while Mai-chan is more fun-loving. In reality, the two sisters are powerful exorcists from the Karura temple. Each wields half the power... Shii-chan can \"see\" the spirits, and Mai-chan can banish them. This is a spooky series with heavy emphasis on traditionally Japanese occult themes. \n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/1539/97315.webp"},{"title":"Gegege no Kitarou: Youkai Tokkyuu! Maboroshi no Kisha","synopsis":"This film is sort of a mashup of Ghost Train (episode 7) and Great Yokai War (episodes 10-11) from the original 1968 TV series, but with a new spin on it to bring it towards the modernness of the 1996 TV series--essentially making an entirely original plot.\n\n(Source: TSHS)","img":"https://cdn.myanimelist.net/images/anime/9/27355.webp"},{"title":"Gegege no Kitarou: Jigoku-hen","synopsis":"The origins of Kitarou.","img":"https://cdn.myanimelist.net/images/anime/6/90097.webp"},{"title":"Gegege no Kitarou: Chisougan","synopsis":"An abbreviated 12 minute version of episode 37 from the 1971 TV anime. This was shown as part of the summer 1980 Toei Manga Matsuri and uses entirely recycled footage.\n\n(Source: TSHS)","img":"https://cdn.myanimelist.net/images/anime/5/84231.webp"},{"title":"Kaibutsu-kun (1980)","synopsis":"Kaibutsu-kun and his companions, Dracula, Wolfman, and Franken, travel from Kaibutsu Land to the Human Realm, where they encounter and battle several monsters, mainly assassins from the demon group Demonish.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/5/29925.webp"},{"title":"Chainsaw Maid Episode 0","synopsis":"A special episode included on the Chainsaw Maid DVD.","img":"https://cdn.myanimelist.net/images/anime/1206/93028.webp"},{"title":"Sougiya to Inu","synopsis":"A horror take on the classic tale of Snow White.","img":"https://cdn.myanimelist.net/images/anime/1249/93896.webp"},{"title":"Gift±","synopsis":"With the growing demand for high-quality organ transplants in Japan, many underground organizations have carried out kidnapping and murder operations to obtain organs for sale; surgeon doctors also started practicing. It even began to intervene in outside countries like China.\n \nOur protagonist, Tamaki Suzuhara, a beautiful but mysterious high school girl, tries to find someone very important to her who is currently missing. She joined an illegal organ trafficking network, which kidnapped those who were judged \"morally cure\" for morphological, surgical removal of organs.\n \nLet's see where this bloody journey and Tamaki Suzuhara's moral dilemma will lead. Can she find what she wants?","img":"https://cdn.myanimelist.net/images/anime/1688/93905.webp"},{"title":"Guilstein","synopsis":"The theatrical anime film is a full digital (3-D) action/horror film based on a manga by Tamaki Hisao, best known to Western fans for his manga adaptation of Star Wars: A New Hope. Characters were designed by Yasushi Nirasawa, a well acclaimed maker of creature action figures. Monkey Punch (Lupin III creator) served as the film's script superviser. Set in the year 2088, it depicts a dark future in which humans have been transformed into the \"Guilstein,\" creatures with no human souls in them...\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/3/33889.webp"},{"title":"Jiok","synopsis":"Jae-young, an ordinary woman in her mid-20s is sentenced to death by an angel, and ascends to Heaven. Going to Heaven means nothing to her because she assumes Heaven is devoid of reason and humanity. But she accepts her fate and proceeds to bid farewell to her mother and friend. During her farewells, the desire for life starts to torture her.\n\n(Source: KoBiz)","img":"https://cdn.myanimelist.net/images/anime/12/79620.webp"},{"title":"Gegege no Kitarou: Youkai Daisensou","synopsis":"Movie based on the 1985 TV anime with an original plot.","img":"https://cdn.myanimelist.net/images/anime/5/27354.webp"},{"title":"Gegege no Kitarou: Saikyou Youkai Gundan! Nippon Jouriku!!","synopsis":"Movie based on the 1985 TV anime with an original plot.","img":"https://cdn.myanimelist.net/images/anime/5/27356.webp"},{"title":"Nouryou Anime: Denkyuu Ika Matsuri","synopsis":"Death is the gateway to birth. The deceased crosses the line to join the kingdom of the dead. He sees there the dance of the sperm and the egg. He is drawn towards the sky. This is the path to the afterlife.\n\n(Source: starandshadow.org.uk)","img":"https://cdn.myanimelist.net/images/anime/13/73673.webp"},{"title":"Toilet no Hanako-san","synopsis":"A short movie based on Japanese urban legend.","img":"https://cdn.myanimelist.net/images/anime/7/23159.webp"},{"title":"Gegege no Kitarou: Gekitotsu!! Ijigen Youkai no Daihanran","synopsis":"Movie based on the 1985 TV anime with an original plot.","img":"https://cdn.myanimelist.net/images/anime/1383/100504.webp"},{"title":"Television","synopsis":"A man with his cat finds himself in a bizarre situation involving a television. A stop motion animation from the creator of Kotatsu Neko.","img":"https://cdn.myanimelist.net/images/anime/5/23924.webp"},{"title":"Youkaiden Nekome Kozou","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/4/60329.webp"},{"title":"Eko Eko Azarak","synopsis":" The worried owner of a luxury hotel hires high school student Kuroi Misa who has experience with necromancy. The reason is that a series of suicides carried out by guests have taken place in the garden which was once a place of execution. She agrees to use her knowledge of the black arts but demands  a fee of ten million yen. ","img":"https://cdn.myanimelist.net/images/anime/6/52733.webp"},{"title":"Hino Hideshi Toukaidou Yotsuya Kaidan","synopsis":"Based on Kaidan Yotsuya (Classic Japanese ghost story).","img":"https://cdn.myanimelist.net/images/anime/7/46545.webp"},{"title":"Akuma-kun (Movie)","synopsis":"The age of the demons has begun. Dr Faust has foreseen this rise of evil. Unfortunately, he is near death and is unable to personally battle this upcoming threat. Faust entrusts a young boy, Shingo Yamada, to take the responsibility of ridding the Earth of this new evil presence. Faust finds a birthmark on Shingo's forehead that signifies that he is the chosen demon fighter. Faust summons from hell what may be humanity's only hope of surviving: a less than enthusiastic devil named Mephisto rises. After signing a pact in blood to save humankind, Shingo and Mephisto set out to battle the supernatural world.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/21276.webp"},{"title":"Amrita no Kyouen","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1386/105333.webp"},{"title":"Kyoufu Shinbun","synopsis":"For reasons unknown to him, Rei receives the Kyoufu Shinbun every morning, a newspaper which foresees deaths and catastrophes...\n\nBased on Tsunoda Jirou's classic horror manga \"Kyoufu Shinbun\", serialized in Weekly Shounen Champion.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/5/47041.webp"},{"title":"Bouken Shounen Shadar","synopsis":"When Earth is threatened by the invading Ghostar, a young boy with nerves of steel and the strength of 50 men appears from a cave on Mount Fuji. He is Shadar, a boy of unknown origin who, with his faithful dog, Pinboke, fights to save the world. \n\n(Source: The Anime Encyclopedia) ","img":"https://cdn.myanimelist.net/images/anime/3/20774.webp"},{"title":"Inagawa Junji no Sugoku Kowai Hanashi","synopsis":"Short ghost stories by Inagawa Junji, an entertainer who is famous for his horror stories broadcasted on late night radio. He has gone on to write horror novels and directing live-action horror dramas and films. The anime is a spin-off of his Inagawa Junji no Chou: Kowai Hanashi (Inagawa Junji's Super Scary Stories) live-action direct-to-DVD series.","img":"https://cdn.myanimelist.net/images/anime/4/87498.webp"},{"title":"Kataribe Jinkou Chinou ga Tsubuyaku Noroi no Yogen","synopsis":"An animated promotion steamed on Kadokawa's official YouTube channel for Kataribe Jinkou Chinou ga Tsubuyaku Noroi no Yogen, in honor of its first tankoubon volume going on sale the very same day.","img":"https://cdn.myanimelist.net/images/anime/1225/90378.webp"},{"title":"Terra Formars: Earth-hen","synopsis":"Bundled with the 21st and 22nd volumes, the OVAs adapt the Earth arc of the manga.","img":"https://cdn.myanimelist.net/images/anime/1662/97844.webp"},{"title":"Shin Getter Robo","synopsis":"Humanity is under attack by demonic creatures called Oni. Unable to fight back by any other means, the scientist Dr. Saotome creates a series of giant robots that harness the mysterious power of Getter Rays, giving them the strength necessary to fight the Oni. The strongest of these is Getter Robo, and Saotome must enlist three very different men to pilot it - martial artist Ryoma Nagare, criminal leader Hayato Jin, and monk Benkei Musashibou. Together, the Getter Team fights to end the Oni menace forever.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/56841.webp"},{"title":"Violence Jack: Jigoku Gai-hen","synopsis":"The World as we know it has been torn apart shattered by a series of natural disasters that have turned civilization into a brutish nightmare of survival and has left whole cities buried beneath the Earth. It's now a lethal and chaotic place, a place where only the strongest and most savage remain alive. The strongest of them all is a giant warrior known as Violence Jack… \n\nViolence Jack tries to avert a civil war brewing among the wretched inhabitants of a subterranean metropolis called Evil Town. Based on a character created by manga horror specialist, Go Nagai. \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/13/12874.webp"},{"title":"Mahou Shoujo Ai","synopsis":"In a certain town, there were consecutive phantom assaults. Because the incidents were extraordinarily, there was a rumor that a ghost or supernatural creature caused them. The students in the school which Akitoshi went to were frightened. One day, an unknown girl appeared in the school. However, all the students except Akitoshi thought they had known her. Feeling strange, he shadowed her in order to investigate her but he lost sight of her. At that moment, he heard the scream of a woman from the nearby material yard and went to the place where the scream came from. There he found the beautiful girl of the school, Mikage. Mikage was surrounded by monsters \"Yuragi\" (fluctuation), and she was hanged naked. Yuragi noticed Akitoshi and began to attack him. Then, the fighter, Ai, appeared and cut them down. \nAkitoshi stared at Ai. What was her true character, an enemy or an ally? \n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/9/20045.webp"},{"title":"Maou Dante","synopsis":"While sleeping one night, Ryo Utsugi had a nightmare of monsters attacking him. One day he learns a mysterious power to let him hear voices and have visions of girls getting killed, but one night he hears the same voice.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/84849.webp"},{"title":"Sci-fi Harry","synopsis":"Harry is definitely not your average American teenager. Instead, he is the epitome of an \"alienated youth\"—friendless at school, extremely weird, and nervous to the point of paranoia. But a chance occurrence causes Harry to start to demonstrate what appear to be psychic powers—yet he neither believes in them nor consciously controls them.\n\nHowever, there are other ominous forces at work who do believe in Harry and attempt to make use of him in ways that are threatening and frightful.\n\n(Source: AniDB, edited)","img":"https://cdn.myanimelist.net/images/anime/9/57605.webp"},{"title":"Shihaisha no Tasogare","synopsis":"Since the beginning of time, monstrous Demons and noble Guardians have battled for Earth - the everlasting gift of the one great Mother, creator of all life. A deep hatred burns between Demon and Guardian; the Guardians prevented the Demons from destroying humanity and the world itself.\n\nEons later, Neo-Shinjuku City: few Demons or Guardians remain to continue their epic war. Humans rule the Earth, with no real memory of either Demons or Guardians. Yet deep within the dark underworld of the city, one supreme Demon is alive and plotting to subjugate mankind. Only one Guardian is left to do battle, and the fate of the human race is at stake.\n\nBased on the Graphic Novel\n\"Twilight of the Dark Master (Shihaisha no Tasogare)\" (Shinshokan) by Saki Okuse\n\n(Source: DVD Back Cover)","img":"https://cdn.myanimelist.net/images/anime/5/4277.webp"},{"title":"Jujutsu Kaisen (TV)","synopsis":"In a world where demons feed on unsuspecting humans, fragments of the legendary and feared demon Ryoumen Sukuna were lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of Jujutsu Sorcerers who exist to protect the precarious existence of the living from the undead!\n\nYuuji Itadori is high schooler who spends his days visiting his bedridden grandfather. Although he looks like your average teenager, his immense physical strength is something to behold! Every sports club wants him to join, but Itadori would rather hang out with the school outcasts in the Occult Club. One day, the club manages to get their hands on a sealed cursed object, but little do they know the terror they'll unleash when they break the seal... \n\n(Source: VIZ Media, edited)","img":"https://cdn.myanimelist.net/images/anime/1909/104931.webp"},{"title":"Kyoushoku Soukou Guyver II","synopsis":"Sho and his friend Tetsurou stumble upon an odd alien artifact while walking through the woods. Then, the alien artifact breaks free of its metallic bonds and enters Sho's body, turning him into the Guyver. With this new power, Sho must do battle with the evil Chronos corporation and their genetically enhanced Zoanoids, who seek to get the Guyver back into their labs. No one close to Sho is safe from Chronos. He must fight. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1833/92279.webp"},{"title":"Call Me Tonight","synopsis":"Rumi's met a lot of guys through her job, and it's probably fair to assume that most of them could be said to have some sort of problem, but a man who literally turns into a beast when he gets turned on may be outside of this perky call girl's field of expertise. Still, a little challenge every now and again stimulates the mind and makes life so much more interesting, so she's willing to give it a shot.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/4/18490.webp"},{"title":"Teito Monogatari","synopsis":"When an evil sorcerer bent on crushing the \"greatest city on earth\" uses dark powers to awaken the destructive spirit of Tokyo's historic \"guardian,\" Taira no Masakado, occultists, children, and scientists become embroiled in a ruinous struggle spanning two decades.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/88664.webp"},{"title":"Youma","synopsis":"A terrible war has ravaged the land, and now, fueled by the blood of numerous fallen warriors the Yoma, demons from hell, emerge once more. A skilled ninja seeks to end the bloodshed these demons inflict upon humanity, but to do this he must fight against his undead former best friend and fellow ninja who was killed in battle and has been resurrected to serve the Yoma. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1123/94526.webp"},{"title":"Biohazard 4: Incubate","synopsis":"After the Playstation port of Resident Evil 4 hit the stores Capcom released a new 97 minute DVD some time later which intended to summarize the whole story of Resident Evil 4. It's played on English audio with Japanese subtitles. It also included a little book which explains the life on El Pueblo before and the arrival of Osmund Saddler. It also solved some plot holes like the whereabouts of the children. It contains many of the scenes original to Resident Evil 4.\n\n(Source: Resident Evil Wiki)","img":"https://cdn.myanimelist.net/images/anime/3/21456.webp"},{"title":"Violence Jack: Hell's Wind-hen","synopsis":"The survivors of Kanto's Hell Earthquake built a new city and christened it \"Hope Town\". However, this peaceful town becomes a nightmare when it's raided by the motorcycle gang, \"Hell's Wind\". They abduct the women while the remaining townsfolk are left helpless against them.\n\nMeanwhile, a boy, Subaro, meets Jun. Jun's lover was previously murdered, and the duo help one another to fight against Hell's Wind. The battles are getting more and more difficult, but with the appearance of Violence Jack, the citizens seem to gain the upper hand against Hell's Wind. \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1/2384.webp"},{"title":"Mermaid's Scar","synopsis":"Legend has it that when you eat the flesh of a mermaid, you would live forever. Yuta and Mana are living proof of this... Together, they journey to various places trying to find meaning for their existence, or perhaps even a \"cure\" for their situation. One day, Yuta and Mana meet Masato, a little boy who seems terrified of his mother Misa. It seems to Yuta and Mana that mother and son have a very unusual relationship. What happens when Yuta and Mana decide to discover the dark secret Masato and Misa are hiding? And what about those monster-like creatures that have been appearing?\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1/2144.webp"},{"title":"Inda no Himekishi Janne","synopsis":"There is a beautiful princess, Janne, in a beautiful country. She has a special ability in sword technique and magic. The country is peaceful but monsters called ogres start to attack them. Janne takes an initiative and battles the ogres but her younger sister Yuwa is taken by them. Janne goes to Dark Elf's fastness by herself but she is trapped and caught by them. Janne is given a sexual training there and her body and spirit gradually change...","img":"https://cdn.myanimelist.net/images/anime/1892/104055.webp"},{"title":"Shishou Series","synopsis":"The story of the original novels revolves around a protagonist who experiences various spiritual encounters due to his upperclassman at his college's club, the \"master teacher\" in the series title that has spiritual sensitivity.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/72325.webp"},{"title":"Kimera","synopsis":"Strange \"lifepods\" have crashed in the western mountains, bringing with them supernatural beings previously found only in the realm of folk-lore and fantasy. Vampires walk the Earth, at war with Humanity and each other, driven by the most terrifying of genetic imperatives. Like wasps seeking a spider, they have come to this planet for only one purpose: to perpetuate their species.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/3460.webp"},{"title":"Ao Oni The Animation (Movie)","synopsis":"An animated film series based on the Ao Oni game. It will feature a new story.","img":"https://cdn.myanimelist.net/images/anime/6/81440.webp"},{"title":"Mermaid Forest OVA","synopsis":"It is said that consuming the flesh of a mermaid confers immortality. This certainly proved to be the case for the 500-year-old Yuta and his friend Mana.  However, most people who try to become immortal either die or transform into monsters.\n\nFifty-five  years ago, Towa Kannagi was given mermaid blood by her sister, Sawa, in order to cure a fatal illness. Now, Towa maintains her youthful appearance, save her white hair and beastly arm. For years she has dreamed of restoring her body, resorting to blood transfusions from youthful corpses aided by the local doctor, Shiina.\n\nMana, mistaken for dead by Shiina, is brought in to have her blood used by Towa. When she discovers that Mana is alive, what lengths will Towa go to in order to restore herself? Will Yuta be able to save Mana in time?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/55075.webp"},{"title":"Battle Royal High School","synopsis":"Hyoudo Riki is just an ordinary guy who likes to wear a tiger mask while Kung-Fu fighting, which means he fits in real well at BATTLE ROYAL HIGH SCHOOL!\n\nUnfortunately for Riki, he`s the doppleganger in our world of Byoudo, Master of the Dark Realm, and when a dimensional gate opens between the two worlds, the evil Fairy Master tricks Byoudo  into making an attempt to conquer our beautiful, and better lit, world.\n\nNow poor Riki is semi-possessed by his opposite number, and the minions of the Fairy Master are mutating his classmates into hideous lustful monsters. To make matters worse, all the inter-dimensional commotion has attracted the attention of a sword-happy exorcist and the heroic Zankan of the Space-Time Police!\n\nWhich all means that Riki is about to take one bitch of a mid-term. The course is survival, and forget \"Pass/Fail\". The test is graded \"Live/Die\".","img":"https://cdn.myanimelist.net/images/anime/10/6209.webp"},{"title":"Agitated Screams of Maggots","synopsis":"\"Agitated Screams of Maggots\" was directed by Keita Kurosaka and released in 2006 with the single, \"Agitated Screams of Maggots\", made by Japanese rock band, DIR EN GREY. ASOM has a traditional drawing design with erotic and grotesque aspects. The video had also received some attention from it's art style and was shown at the International Film Festival Rotterdam in 2007.","img":"https://cdn.myanimelist.net/images/anime/13/25059.webp"},{"title":"Blue Seed 2","synopsis":"A renegade scientist in San Francisco has found a way to create a new creature called a Neo-Aragami without the power of Susanoo. When these monsters start to terrorize California, the U.S. turns to the old members of the Terrestrial Administration Center (TAC) for help. \n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/7/2871.webp"},{"title":"Digital Devil Story: Megami Tensei","synopsis":"Akemi Nakajima, is a high school student with a genius talent for computer programming. \nOne day, Yumiko Shirasagi is transferred to the same class as him. She feels she knows Nakajima from somewhere, but doesn't try to deal with it. After school, Nakajima and a couple of classmates held a ceremony to summon the devil. Nakajima summons the devil Loki on the computer display while presenting a female offering. What will happen to Yumiko, who witnessed the scene?\n\n(Source: Official site, edited)","img":"https://cdn.myanimelist.net/images/anime/1015/90699.webp"},{"title":"Karakuri no Kimi","synopsis":"Princess Rangiku lost her entire family to Lord Karimata, who invaded her home seeking her father's life work, puppets with unique capabilities. As her duty, Rangiku sets out with three of her father's greatest puppet warriors to seek revenge. She can manipulate these to battle the strongest of warriors, however manipulating the puppets leaves her own self vulnerable to direct attacks, so she seeks a ninja warrior named Manajiri to aid and protect her in her quest.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/1658.webp"},{"title":"Shin Megami Tensei: Tokyo Mokushiroku","synopsis":"Handsome and effeminate, quiet but proud, the sinister Akito Kobayashi has a passion for the occult and has developed a computer program to summon demons and the living dead. But little does he know that fellow high school students Kojirou Souma and Saki Yagami are reincarnations of powerful and benevolent spirits. When the pair's friends have become targeted by demons trying to harvest their life energies, they must harness their dark metaphysical powers to destroy Kobayashi's threatening program, or risk losing their loved ones forever.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/22243.webp"},{"title":"Kyoushoku Soukou Guyver","synopsis":"The plot of this OVA is a rough adaptation of the first four chapters of the Guyver manga. It covers the same basic elements of these chapters; Genesis of the guyver, Fight with Vamore, Fight with Guyver 2 and the introduction of Guyver 3. Main differences are the exclusion of Tetsuro and his replacement by Mizuki, The replacement of Lisker with a female Agent \"Valcuria\", and thus a female Guyver 2. There is also a look at Sho's psychology of how he deals with his situation including a very harsh moment where his friends are assassinated in cold blood.\n\nOne night, high school student Sho Fukamachi discovers a mysterious metal object. Then in a blinding flash of light, Sho finds that he has accidentally fused with the Guyver, a mecha of mysterious alien design.\n\nNow, to save his girlfriend, Mizuki Segawa, along with the entire world, Sho must become the Guyver to fight the Chronos Corporation and their biocreatures, called Zoanoids, who are hell-bent on world domination.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/1833/94524.webp"},{"title":"Gibiate","synopsis":"In 2030, Japan. A virus has infected humans throughout the world. Infected people turn into different forms of monsters based on their ages, sexes, and races. The virus is named \"Gibia\"—after being rich in variety like gibia.\n\nJust then, a pair of samurai and ninja appeared in such a blighted wasteland of Japan. They both traveled from the early Edo period, fighting together with help from a doctor who tries to find cure for Gibia. Facing ceaseless attacks from Gibias and outlaws that attack travelers for food, they start the dangerous journey with enemies all around.\n\n(Source: Official Website)","img":"https://cdn.myanimelist.net/images/anime/1359/101974.webp"},{"title":"Devilman: Crybaby - Digest Eizou","synopsis":"A short web recap of the Devilman: Crybaby series, posted on Aniplex's official YouTube channel.","img":"https://cdn.myanimelist.net/images/anime/1959/91379.webp"},{"title":"Lily C.A.T.","synopsis":"The Deep Sleep Capsules, technology that has allowed man to reach out to the stars. These chambers slow the aging process by 95%. A 20-year trip passes, and the traveler has only aged 1 year. It definitely has its advantages, but after you've been on a few trips, it sure gets very lonely.\n\nRight now, however, that's not the big issue. The year is 2264. The Syncam Corporation has sent the Saldes and its crew of 13 (and 1 cat) out into deep space to explore the potential of a newfound planet 20 years away. Soon after they awaken from their stasis, however, things are happening one after another. First, the crew learns that two of the crew are not who they claim to be. Then, one by one, crewmembers die suddenly. Then, the ship begins to turn against them. And as if it couldn't get any worse, they find another mess on their hands and it is ugly.\n\nWhat was supposed to be a simple exploratory mission has become a struggle for survival in the depths of space. 20 years from home, they're all alone and no one can hear them scream.\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/12/5157.webp"},{"title":"Seoul-yeok","synopsis":"Several groups of people try to survive a zombie pandemic that unleashes itself in downtown Seoul.","img":"https://cdn.myanimelist.net/images/anime/10/81971.webp"},{"title":"Umezu Kazuo no Noroi","synopsis":"\"Do not toy with the supernatural.\" \n\nTwo stories of the consequences that descend upon humans who venture beyond the safe confines of their ordinary worlds. \n\nWhen a gorgeous girl named Rima transfers into Masami's class, she's not only jealous, but also deathly frightened of her. While the boys in class are tripping all over themselves to get to Rima, Masami's having nightmares of a ghastly visitor and finding scars on her body come morning. She asks a friend to help her get evidence to confirm her suspicions about the new girl. But if a picture is worth a thousand words, a video must be worth far more. The truth can set you free, but it can also be more terrifying than anything you can imagine. \n\nShy Miko and her more outgoing friend Nanako are enjoying their summer vacation, trying to make the most of their youth. But when horror-movie marathons just aren't thrilling enough, Nanako sets her eyes on a new target: an abandoned mansion at the edge of town, said to be haunted. With two other friends in tow, a reluctant Miko and a gung-ho Nanako enter the mansion. Soon, everything that can go wrong starts going wrong. Only luck or a miracle will allow them manage to escape the mansion with their lives, their sanity, and even their sense of reality. \n\n(Source: Hanako) ","img":"https://cdn.myanimelist.net/images/anime/11/36315.webp"},{"title":"Chainsaw Maid","synopsis":"A family and their maid are going about their daily lives when, unexpectedly, a woman bursts into their home shouting, \"They're coming!\" She then vomits out her organs, turns into a zombie, and attacks the master of the house. The maid saves her employer, but he and his daughter are stunned and have difficulty processing the events. As more and more zombies invade the residence, the maid decides it is her duty to defend the house from unwanted guests—using a chainsaw!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/32575.webp"},{"title":"Toshi Densetsu Monogatari Hikiko","synopsis":"Story: 3D CG-animated movie about Hikiko, who is a character of a Japanese urban legend. She was violently treated all the time by her parents and classmates at the elementary school and she's extremely ugly due to the constant violence. To revenge, she caught students from elementary school and drag them on the floor until they're badly mutilated.\n\nWhen Revsersing Hikiko's full name 森妃姫子(Mori Hikiko) gives 引き籠もり(hikikomori), which means Social Withdrawal.","img":"https://cdn.myanimelist.net/images/anime/7/15762.webp"},{"title":"Sin: The Movie","synopsis":"In Sin, Blade must unravel a series of mysterious kidnappings. As he delves into the city's merciless underworld, an elaborate mystery unfold; at is heart, the SinTEK corporation and its leader, the ruthless and beautiful Elexis Sinclair. A Brilliant biochemist, Sinclair will stop at nothing to achieve her goal: a plan that could force the next step of human evolution-or spell doom for mankind.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/42389.webp"},{"title":"Muramasa","synopsis":"\"A man with arms which can kill people like puppets is not aware that he himself has already become a puppet.\" In this short hand-drawn silent animation, a wandering samurai learns this lesson firsthand.\n\nAlong his travels, the samurai comes across a straw dummy at the base of a tree, with a sword lodged in its body. Upon drawing it out, the samurai learns that the blade is imbued with magic, and immensely powerful. The power comes at a price, though, and wielding the blade begins to slowly drive the warrior mad. He now has a choice to make: remain himself, or sacrifice his sanity for ultimate power?","img":"https://cdn.myanimelist.net/images/anime/2/66111.webp"},{"title":"Karadasagashi","synopsis":"\"Hey, Asuka... search for my body.\" \n\nAt school in the middle of the night, Asuka and her friends search for the scattered body-parts. If they don't find the entire body, the 9th of November is repeated and the red person will continue to kill them. Who is the red person?\n\n(Source: MU)","img":"https://cdn.myanimelist.net/images/anime/7/87141.webp"},{"title":"Pussycat","synopsis":"A pretty female cat gets into trouble. What's gonna happen? It's a sexy and violent sexploitation clay-animation! ","img":"https://cdn.myanimelist.net/images/anime/10/32599.webp"},{"title":"Extra","synopsis":"Animation veteran and Studio 4°C collaborator Koji Morimoto teamed up with techo artist Ken Ishii for this AMV.\n\n\"EXTRA\" is a random cross talk about computer, music, images, and Internet by two authors working on their first collaboration in techno music and animation. This short animation which is stored on CD-ROM and immediately shakes the viewer with question as to what the word of the title, \"EXTRA,\" means.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/71738.webp"},{"title":"Chuumon no Ooi Ryouriten (1991)","synopsis":"A short film based on a story by Japanese writer Kenji Miyazawa. \nTwo young British hunters get lost in the woods and discover a strange restaurant. Are the hunters about to discover how it feels to be the hunted?\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/7479.webp"},{"title":"Kago Shintarou Anime Sakuhin Shuu","synopsis":"In these jokey short films, many of them crudely animated, Kago's sick sense of humor reaches its full heights of absurdity. There's a playful surrealist sensibility to Kago's work, as well as a tendency to revel in the ridiculous, the crude and the disturbing. His work straddles a weird boundary between avant-garde experimentation and low-brow fart jokes—the punchline of one of these films is literally an oozing torrent of shit—although, admittedly, his videos seem to lean a bit more heavily towards the fart jokes than his comics. But hey, who doesn't appreciate a good fart joke once in a while?\n\n(Source: Only the Cinema blog)","img":"https://cdn.myanimelist.net/images/anime/10/27656.webp"},{"title":"Gegege no Kitarou (2007)","synopsis":"The classic tale of Gegege no Kitaro told yet again.  The story is the usual in the Gegege no Kitaro series. Kitaro is a boy living in the Gegege Forest/Cemetery (lands where many Yokai roam) with his mostly dead father (who survives only in his eye), Sunakake Babaa, NekoMusume, and Konaki Jiji.  One difference between this Kitaro and all of the others that came before him, is that this one has brown hair instead of the standard grayish silver. ","img":"https://cdn.myanimelist.net/images/anime/6/27397.webp"},{"title":"Psycho Diver: Mashou Bosatsu","synopsis":"Yuki Kano has it all: fame, wealth, the world at her feet. There's also something very wrong with her... from time to time, she's totally unable to sing (which, for a pop star, is not good). Enter Bosujima, a \"psycho diver\" with the capability to enter people's heads and straighten out what's wrong with them. Well, most of the time, anyway.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/1767.webp"},{"title":"Deimos no Hanayome: Ran no Kumikyoku","synopsis":"Two siblings were happy on Mt. Olympus, until they fell in love. Deimo's sister Venus got imprisoned in the Swamp of Death. To save Venus's life, he must find a human reincarnation so that they can continue their love.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/35349.webp"},{"title":"Airy Me","synopsis":"A test subject is administered daily medication by a nurse in a ward where mysterious medical experiments take place. One day, when the nurse presses the switch of the test subject, it successfully transforms into a chimera. When the test subject continues to hold human desires to take on non-human forms, what spectacle will arise as a result? And what effect will this have on the subject's relationship with the nurse?\n\n(Source: Japan Media Arts Festival)","img":"https://cdn.myanimelist.net/images/anime/7/78635.webp"},{"title":"Biohazard 4D-Executer","synopsis":"Biohazard 4D Executor was a 20 minute CG movie that people in Japan could see in a special theater. \n\nThough the CG was primitive, (the rendering and models aren’t much better than that seen in Resident Evil 2, it’s certainly not on par with Resident Evil 3) it told the story enough. Below is a summary of the events within the 20 minute movie. \n\nThe story focuses on an elite unit of 5 UBCS members, sent into Raccoon City to try and rescue Dr. Cameron. An Umbrella scientist lost in all the confusion. The UBCS team, consisting of members Rodrigo, Roger, Klaus, Ed and Norman, have a GPS device used to track down Dr. Cameron’s last known location, which is near a large food factory. \n\nUpon entering the factory they are attacked by a large creature, a sort of hybrid between a Tyrant and the more evolved forms of Nemesis. \n\n(Source: rehorror.net) ","img":"https://cdn.myanimelist.net/images/anime/2/11616.webp"},{"title":"No Littering","synopsis":"While enjoying a date in a park, a man carelessly tosses an empty bottle onto the ground. His selfish littering promptly summons an imposing figure wearing a white hockey mask. The gruesome events that follow tell an admonishing tale about the importance of preserving the outdoors and defending the environment from the ugly menace of litter.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/44760.webp"},{"title":"Bacterial Contamination","synopsis":"\"Kill yourself.\"\n\nAll it takes are those words to become the next victim. Ignore, slandered, and outcast, she has nowhere to turn. As their cruelty infects her, she begins to lose sight of herself. Her pain just won't go away, and as it consumes her whole being, she feels the only way to cleanse herself is to contaminate another.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/13/55475.webp"},{"title":"Yakumotatsu","synopsis":"Fuzuchi Kuraki is a quiet young high school student blessed with immense psychic powers and an ancient sword. He is searching for other magical artifacts with the help of Nanachi Takeo, a college student with latent powers of his own. They delve deep into the dark magic of Izumo, only to discover the secrets buried within the birthplace of all Japanese mythology.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/17266.webp"},{"title":"Warau Hyouteki","synopsis":"Yuzuru was an average teenager who had almost forgotten that he was betrothed to Azusa when he was only six! Now arriving to claim what she feels is rightfully hers, only Satomi (Yuzuru's current girlfriend) stands in her way... and with the mysterious and frightening powers that Azusa brings, Satomi won't stand in her way for long!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1300/94011.webp"},{"title":"Inyouchuu Shoku: Ryoushokutou Taimaroku - Kanzenban","synopsis":"Inyouchuu Shoku Complete Edition is a compilation of both Inyouchuu Shoku episodes with an additional 10 minutes of extra footage at the end with the twins. These extra scenes are credited as \"episode 3\" in the end credits and constitute this entry.\n\nThe demon hunters are back! Mikoto, Sui, and Takeru are sent to investigate a mysterious island where people have been disappearing repeatedly and dark yoma are rumored to be the cause. When the team first arrives it almost feels like a vacation to them, but it doesn't take them long to the feel the presence of something dark and evil... ","img":"https://cdn.myanimelist.net/images/anime/1618/104066.webp"},{"title":"Bloody Date","synopsis":"While enjoying their first date, a young couple experiences a nasty surprise when they're interrupted by an axe-wielding murderer! The girl manages to escape and finds refuge in a strange family's house, where she urges the people inside to call the police. However, she is knocked out and awakens inside a nightmarish room. Her real struggle for survival is only just beginning!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/32603.webp"},{"title":"Ane Naru Mono","synopsis":"Since the death of his parents, young Yuu has suffered considerably from neglect and abuse at the hands of his adoptive relatives, who leave him to his own resources to survive. Fortunately, a girl named Chiyo comes to his aid and offers to take care of Yuu while acting as his older sister. However, Chiyo is not what she seems, and Yuu knows all too well that her intentions are far from innocent. In exchange for her generosity, Yuu must supply Chiyo with his \"life potential.\"\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1544/105268.webp"},{"title":"Mouryou no Nie","synopsis":"Hundreds of years ago, a big war between humans and monsters happened. Humans somehow won the war and sealed up the monsters deep in the mountains.... Hayato, Chihiro and Suzuna work hard to eliminate and seal up evil monsters every day. They are actually monsters, but they just want to coexist with humans. One day, they hear that the monsters sealed up hundreds of years ago are about to come out.... To stop it, they decide to visit the place....\n\n(Source: ErogeShop)","img":"https://cdn.myanimelist.net/images/anime/2/43451.webp"},{"title":"Malice@Doll","synopsis":"Malice, a sex robot living in an abandoned human city, is assaulted and violated by a mysterious creature. Upon awakening, Malice finds out that she has become human and can pass on her humanity to her fellow machines. However, her gift soon becomes a curse when her fellow robots rage out of control after being exposed to the pleasures of life.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1277/106345.webp"},{"title":"Mahou Shoujo Site Recaps","synopsis":"Recaps of the Mahou Shoujo Site created by Avex Entertainment. Narrated by AI Kizuna and Nobuhiko Okamoto.","img":"https://cdn.myanimelist.net/images/anime/1255/93332.webp"},{"title":"Seisai","synopsis":"A horrible murder has been committed on the grounds of Nankai Academy. Professor Yuko, one of the school's most popular teachers, died when she was pushed off of the roof of one of the school's buildings. Her death has left her students with feelings of confusion, pain, and above all else... anger. Four of her male students, Masayoshi, Daisuke, Mitsuru and Shinya, are determined to uncover the truth. They soon discover an important clue: Professor Yuko's planner had been marked on the very night she was killed... marked with the names of seven girls. \n\nWith this evidence, the boys begin their investigations... and they'll use any method required in order to find the murderer. Through rape, manipulation and torture, they uncover important details, but piecing the puzzle together won't be easy. And the longer their search draws on, the more they feel themselves being overtaken by their own dark desires... Will they ever find out the truth behind Yuko's death?\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/4213.webp"},{"title":"Dark Cat","synopsis":"Hyoi and Ryoi, two brothers with the power to take the form of cats, must unravel the mystery of a creeping, tentacled, demon plague before it consumes them and their classmates. Ultimately, they must confront their old Dark Cat master Jukokubo, though whether they can put an end to the evil he has released remains a mystery.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1216/94235.webp"},{"title":"Kokuhaku","synopsis":"Beside a certain building, a girl appears to meet an important person. She is shy and carefully prepares herself before delivering what she has come to convey. Reaching behind her back, she lets her feelings come forth... But is it a confession of love, or something else entirely?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/76237.webp"},{"title":"Gegege no Kitarou (1968)","synopsis":"Kitarou, a ghost, spends his afterlife helping humans in need of his skills. He thwarts the plans of evil spirits who live to torment humanity.","img":"https://cdn.myanimelist.net/images/anime/13/27398.webp"},{"title":"Dororon Enma-kun","synopsis":"Monsters are coming to the human world from the Hell in order to get human spirits. As people's minds are getting dirty, being attracted by the dirty spirits, the monsters break the rule to go to the human world.\n\nTsutomu, a boy who goes to Yokai Elementary School, is suddenly assaulted by monsters. Those who save him from the monsters are Enma-kun, the son of Enma, Yukiko, a snow woman, and Kapaeru. They are members of Monster Patrol that are sent to the human world to arrest monsters.\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/9/28204.webp"},{"title":"Zekkyou Gakkyuu: Tensei","synopsis":"A girl's classmate disappears during a game of hide-and-seek. When she goes out to look for him, she hides when she hears someone pursuing her. After a while, she peeks out to see if her pursuer has given up.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/79529.webp"},{"title":"Choujin Densetsu Urotsukidouji 2","synopsis":"During World War 2, the Nazis attempted to breach the barriers between the three worlds. They failed then, but a Dr. Myunihausen (Munchausen?) tries again, through the manipulation of Nagumo's brother Takeaki. His goal? To have the Chojin replaced.\n\nAs Takeaki is injured in the approaching flight, Nagumo donates some of his blood to save his life, thus infusing Takeaki with the powers of the overfiend. And the results might be too much for Tokyo, perhaps even the overfiend himself, to bear.\n\n(Source: themanime.org)","img":"https://cdn.myanimelist.net/images/anime/4/24801.webp"},{"title":"Mo Ri Shu Guang","synopsis":"In the year of 2013, the tide of zombies outbreak exploded in everyone's homeland, humanity launches a large-scale battle in the endless nights awaiting for the arrival of the dawn.\n\nThe end is approaching, is there going to be a way out for them? \nTheir faiths were shattered into pieces and buried in ashes in the raging fire. But within the blazing fire, a newborn hope arise once again.\n\n(Source: polarbearadise)","img":"https://cdn.myanimelist.net/images/anime/1939/90507.webp"},{"title":"Maid of the Dead","synopsis":"It's just another normal day at a maid café until one of the customers turn out to be a zombie! Disrupting business and infecting some of the maids, everything suddenly descends into chaos as people are attacked. As one of the more experienced maids comes to deal with the unruly customer and newly-made zombie maids, perhaps there's a bright side to this unbelievable turn of events after all?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/55013.webp"},{"title":"The Urotsuki","synopsis":"An immortal beast-man of supernatural lusts, Amano Jaku escapes prison to gratify his appetites at Meishin College. But the campus is not just a hotbed of luscious coeds – it’s the breeding ground of a hideous monster! The Ultra God is Amano Jaku’s nemesis, a vile killing machine, and the ancient harbinger of the coming apocalypse. Now, immortals will clash in a battle that will bathe the Earth in innocent blood!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1630/94582.webp"},{"title":"Choujin Densetsu Urotsukidouji: Mirai-hen","synopsis":"Twenty-five years ago, the world was annihilated. With the coming of the Overfiend, God of all Gods, the human, demon, and beast realms collapsed together in chaos. With the promise that he would be born in 100 years to re-create his failed world, the Overfiend settled back to sleep within his mother's womb.\n\nBut something has gone terribly wrong...\n\nNow the Overfiend is born prematurely and awaits the coming of his natural the enemy, the Lord of Chaos. His only hope for survival are Amano Jyaku and his sister Megumi. But destiny has moved in ways that even the Overfiend could never predict, as a new race of half-breed demon beasts has evolved.\n\nAs Amano travels to the kingdom of Azuma to investigate the appearance of the Lord of Chaos, he is swept up in the world-conquering schemes of Caesar, Azuma's dictator.\n\nAgainst the backdrop of a demon beast slave revolt and the return of the diabolical Munhihausen, only Amano and the demon beast Buju can save the world from another fiery destruction. With the fate of the earth and its inhabitants hanging in the balance, all wait to see what the coming of the Lord of Chaos will bring...","img":"https://cdn.myanimelist.net/images/anime/13/6035.webp"},{"title":"Gregory Horror Show","synopsis":"The first series is a set of 25 stories about a male businessman arriving at the hotel after taking a train home from work. He encounters the mysterious owner of the hotel, an old mouse known as Gregory, who suggests that he stay a while. Soon, the man becomes drawn into a bizarre series of events taking place within Gregory House as he tries desperately to escape from this bizarre purgatory.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/5/13265.webp"},{"title":"Galerians: Rion","synopsis":"Six years have passed since Rion discovered his own identity as an artificial being, yet succeeded in destroying the genocidal Mother Computer, Dorothy, before perishing himself. Now reactivated by Lilia, Rion awakens to find that Dorothy managed to execute one final catastrophic program, rendering a new evil crew to finish her goal of human annihilation. It is a fully 3D CGI animated OVA based on the hit PlayStation game, called Galerians, released in August, 1999.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/11/38577.webp"},{"title":"H. P. Lovecraft's The Dunwich Horror and Other Stories","synopsis":"This anime is a compilation of three Lovecraft's works: The Picture in the House, The Dunwich Horror and The Festival.","img":"https://cdn.myanimelist.net/images/anime/13/7008.webp"},{"title":"Injuu Alien","synopsis":"The all female crew of the transport ship Muse is on a mission in deep space. They pick up an SOS signal and discover a derelict space cruiser where all the women have died mysteriously. They take the only survivor, a young woman named Flair, and detonate the ghost ship. However, the danger is just beginning. With Flair on the Muse, the romances between the women begin to take a new turn. One by one, the crewmembers are attacked by a mysterious alien presence, desperate to find a way to reproduce with human women.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/23250.webp"},{"title":"Yami no Shihosha Judge","synopsis":"Hoichiro Ohma works in an office. Everybody knows him as a silent, humble man. Even his girlfriend, Nanase, doesn't suspect that he could be something more, but he is. When a person dies as a victim of murder; when someone kills himself with a curse on his lips; when someone's death needs to be judged, he is there, for he is a Judge Of Darkness. Following the Laws Of Darkness, with a book made of human skin and an unusual parrot, he pronounces judgement over living criminals that would otherwise go free.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/66755.webp"},{"title":"Tokumu Sousakan Rei &amp; Fuko","synopsis":"Based on the game series by Black-Lilith.","img":"https://cdn.myanimelist.net/images/anime/13/33383.webp"},{"title":"Yoru ga Kuru!","synopsis":"Blue moon suddenly appeared near the moon, they called it True Moon. After 3 years when True Moon shined blue, a monster appeared in front of Ryo. He ran away from the monster, but finally, the monster cornered him. When he began to accept his death, a red eyed girl, Izumi, appeared. She cut the monster to death, and gone.\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/1/1702.webp"},{"title":"Yukidoke","synopsis":"The short film tells the story of a young boy, who as a result of seeing a dog's corpse, becomes interested in the bodies of living things and starts to develop phobias. Before long all manner of things begin to appear grotesque to him. \n\n(Source: Wochi Kochi)","img":"https://cdn.myanimelist.net/images/anime/2/59759.webp"},{"title":"Pinky","synopsis":"Two friends make a video together.","img":"https://cdn.myanimelist.net/images/anime/11/44752.webp"},{"title":"Zashiki Warashi no Tatami-chan","synopsis":"The \"pleasant horror gag comedy\" centers around the life of Tatami-chan, a sardonic ghost from Iwate Prefecture who is now living in Tokyo among other spirits, supernatural entities, and humans. In addition to dealing with otherworldly matters, the unemployed Tatami-chan also has to deal with job-hunting as well as paying for gas, water, and electricity. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1963/105596.webp"},{"title":"Jigoku Sensei Nube OVA","synopsis":"Continuation of the TV series.","img":"https://cdn.myanimelist.net/images/anime/1091/103240.webp"},{"title":"Bloody Night","synopsis":"A little girl is wandering the streets late at night, but something is eerily amiss. Suddenly, a vicious red monster appears and begins chasing her. As she desperately tries to get away, she encounters a homeless old man in an alleyway and later an armed policeman who both try to save her. Can either of these brave men save the girl from the monster that pursues her so relentlessly?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/33341.webp"},{"title":"Oni-Tensei","synopsis":"There is an ancient legend that says if a tattoo is drawn to perfection, it will come to life. Reiko Kure is a female detective with a strange massacre on her hands. Some kind of huge animal savagely murdered thirteen members of the mafia, and only the quiet Ema Nozomi was left at the scene. Ema is taken into protective custody. However, every man left with her is killed, and every woman left with her is raped. There are no clues, except the innocent Ema's strange tattoo, perfectly depicting a demon.\n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/10/61985.webp"},{"title":"Shi Xiong","synopsis":"Protagonist XiaoFei used to be an ordinary guy from H city. After the spring water was contaminated with a virus, however, he unexpectedly encountered an unprecedented crisis. The people living in H City became zombies one by one, devouring each other, and gradually evolving. Can XiaoFei escape from H city and meet up with his girlfriend Wei? The story now begins...\n\n(Source: The Faiien Scans)","img":"https://cdn.myanimelist.net/images/anime/11/72773.webp"},{"title":"Luv Wave","synopsis":"Takikawa Kanako, a secret agent that specialize in information and assassination. He has a robot girl for assistant. So far, they have 100% success rate, but their new target doesn't seem to want to stay dead. While finding out what's going on, they have to deal with a world network stopping virus and a strange new drug. Can he remember and how much does she love him?\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/2/5153.webp"},{"title":"Megami Kyouju","synopsis":"After a strange hostage-taking case, SWAT officer Linda and her friend Mary, who works at the CSI division, discover that the perpetrator has contracted a mutated rabies virus from the hostage's dog, which is now on the loose. Soon, the city is flooded with people turned to freaks by the decease, and to their horror, Linda and Mary's mutual friend Kata, a stripper at the local night club, appears to have been bitten by the stray dog, too... \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/41487.webp"},{"title":"Roots Search: Shokushin Buttai X","synopsis":"When a research crew in deep space discovers the desolate ship \"Green Planet\" that warps into their area, they encounter Buzz, the commander and sole surivor of the ship. Being too incapacitated to make them aware of the situation of his ship, the research team will soon discover that they have found something far, far worse... \n\n(Source: BakaBT) ","img":"https://cdn.myanimelist.net/images/anime/1/2476.webp"},{"title":"C.L.A.Y.","synopsis":"In a gray and empty landscape, a spherical, yellow entity suddenly materializes. Though its plain appearance may not suggest much, its ability to transform is boundless, and it is not hesitant to kill. Nearby, an armed woman awaits this creature, ready to eliminate it. Will she be able to defeat it, or does this being's abilities far outclass her own?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/44756.webp"},{"title":"Prison Lab","synopsis":"A victim of endless bullying, Aito Eyama is plagued by his classmates' constant taunts and beatings. However, through a fortuitous turn of events, he receives a strange invitations for the \"Captivity Game,\" where victory promises unbelievable wealth. To participate, he must accept the role of captor and choose one victim to imprison for a month. For Eyama, the only choice is Aya Kirishima, the ringleader of his bullies and the source of all his suffering. The rules of the game are simple: the jailer may do whatever they please with their inmate barring murder; but in order to win the game, the captor's identity must remain hidden. Exemption from the law, an isolated cell, and the funds to purchase supplies—all the necessary tools are provided.\n\nAs Eyama administers his sadistic revenge and \"divine\" retribution, he encounters other captors, each with their own hidden agendas. Meanwhile, Aya refuses to be a compliant prisoner and will go to any length to escape captivity. However, her endeavors threaten to awaken a darkness buried inside Eyama that craves to be unleashed.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1192/97875.webp"},{"title":"Shuten Douji","synopsis":"As a baby Jiro was delivered to his foster parents by a massive oni, who said he would return for Jiro in 15 years. When the time comes Jiro must contend with enemy oni, dark cultists, and their minions while attempting to protect both his parents and girlfriend from their depredations. Ultimately he must embark on a journey through the past, future, and other dimensions to embrace his destiny as Shuten Doji reborn. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/18492.webp"},{"title":"Hyakki","synopsis":"A group of young adults have decided to travel to a mysterious island through a tour line. The island has been deserted of human life and the ruins of a once promising city continue to decay. Each of the group members have a reason to visit the island, including returning to their former homes or embarking on a scavenger hunt. During their visit, strange events start to take place and past memories and sexual emotions began to surface among the group. The tour takes a turn for the worst when several of tourists are found murdered, showing that someone remains on the desolated island.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1545/104045.webp"},{"title":"Yuuwaku Countdown","synopsis":"From famed adult comic artist Hiroyuki Utatane come six of the most erotic, the most exotic, the most unusual and just downright odd stories ever animated.\n\nIn Alimony Hunter we see Jun in an extremely unusual three-for-all in which not everyone is what he (or she!) seems. She also makes an appearance as a teacher in Cherry Lips (under an alias). It all comes to conclusion in Virgin Road, there perhaps too-willing bride is having a last minute fling with her in the back room of the chapel; the groom is also not a stranger to Jun...\n\nThen there's a manly knight who discovers the joys of bondage at the hands of a fair maiden; and a Samurai policewoman forced to tackle a giant walking statue, controlled by a sex-crazed megalomaniac, before it destroys Tokyo.\nCrimson is a bloody story of a man and his blind love slave.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/50035.webp"},{"title":"Ankoku Shinwa","synopsis":"Long ago there were fierce gods of legends who shook the earth to its foundation with their power. There are now prehistoric rivals from the primitive times in Japan, that fought to protect their secrets in the present day. The God of Darkness Susanoah-oh is now sleeping in the shadows of the underworld waiting for his rebirth. However his coming hasn't gone unoticed. There are agents from the Kikuchi Clan (descendants of Japans first inhabitants) who have seen the warning signs of the spreading of darkness's bringing. These investigators are armed with ancient knowledge and artifacts who are willingly prepared to face the God of Darkness. Now they must fight the assembled spirits of hell to find the one young boy who is chosen by fate to grasp the chaotic might of the deadly Gods.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/57439.webp"},{"title":"Youkai Ningen Bem (2006)","synopsis":"The plot of the series revolves around three youkai, Bem, Bera and Barro, who arrive at a large coastal city and come across an evil atmosphere, which was brought about by immoral behavior by humans and mischief caused by monsters and youkai. They therefore decide to stay in the city, fighting against other monsters and yōkai which attack humans, making a few friends in the way. Even though the three youkai are often abused by other human beings due to their appearance, they still strive in protecting the human populace of the city from other monsters, one day hoping to become human beings in return for their good actions.","img":"https://cdn.myanimelist.net/images/anime/5/12183.webp"},{"title":"Kuro no Danshou","synopsis":"While vacationing with his adopted daughter, Private Detective Susuki becomes trapped in a secluded ski resort with a few other vacationers after a storm closes the place down. All is well until one of the guests is found brutally murdered. Being the good investigator he is, Susuki gets to work to find the killer. While digging for the killer, Susuki uncovers a lot of dirt on the other guests and even finds out a thing or two about his own past. But, as Susuki struggles to find the killer, the other guests start to point the finger at him. \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/10/29841.webp"},{"title":"Love Bites","synopsis":"A short animation by Nagao Takena made in MMD.","img":"https://cdn.myanimelist.net/images/anime/3/78881.webp"},{"title":"Choujin Densetsu Urotsukidouji: Inferno Road","synopsis":"Directly following the conclusion of Urotsukidoji III, the survivors of the Azuma kingdom genocide travel aboard a futuristic tank with Osaka as the destination. There, they plan to face both the Overfiend and their own fates as well. Along they way, the stumble upon a civilization beyond imagination, where children cruely rule over the adults. It is up to Amano Jyaku to save his friends from this sinister land and its evil ruler, Ellis. Shortly after their encounter, Sui Kaka Ju's sister Yoenhime summons Munhihausen, who transforms her into the menacing Yoenki. At last, she is strong enough to reap revenge on Amano for killing her brother. But Munhihausen has his own hidden agendas. The Urotsukidoji legend will finally reach its climax in Osaka, when Kiojo, the sweet and innocent Himi, and the Chojin meet face to face. ","img":"https://cdn.myanimelist.net/images/anime/12/10943.webp"},{"title":"Daimajuu Gekitou: Hagane no Oni","synopsis":"In the year 1999, a team of UN scientists in an attempt to tap into a new energy resource on a deserted island called Sansara, unknownigly open a portal to another universe, unleashing dormant biomechanical entities. Three years later, Takuya Goroza returns to the island of Sansara urged by a mysterious request by college chum Haruka Alford. Little does he know, his old friend isn't what he appears to be... \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/72909.webp"},{"title":"Injuu Kyoushi","synopsis":"Atsuko and Sayaka think they have it made when they are both accepted into the same prestigious women`s academy. There, they will be free to explore the intense passion of their relationship, unbounded. \n\nBut when the mystical bonds imprisoning a hideous ancient evil that feeds on the lust of nubile women are accidentally broken, the two young lovers soon learn they have more to fear than final exams. ","img":"https://cdn.myanimelist.net/images/anime/9/7014.webp"},{"title":"Injuu Seisen: Twin Angels","synopsis":"The Demon King has arisen to enslave humanity with his legions of sex demons! Our only hope: the delectable yet deadly warrior twins Ai and Mai. But the sexy sisters are betrayed by an old friend, and it's not long before they're trapped and tortured mercilessly by monsters. Now only a miracle can save them. ","img":"https://cdn.myanimelist.net/images/anime/1930/104059.webp"},{"title":"Within the Bloody Woods","synopsis":"A man wanders lost in the forest when he happens upon another person. At first thinking the stranger is injured, the man quickly realizes that isn't the case. The stranger, in fact, isn't even human—he's a zombie! Suddenly finding himself in danger, the man pulls out a machete to fight. The lost man must now defend himself against the dangers lurking in the forest...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/33469.webp"},{"title":"Jigoku Sensei Nube (Movie)","synopsis":"Kumiko Ijima who is one of Nube's students recognizes that a man in a local park is really a criminal wanted for murder when she remembers drawing his face from the wanted photos posted by the police. Kumiko warns her classmate Kyoko while at the same time the man discovers the drawing with the name initials \"K.I.\" written on Kumiko's drawing portfolio and briefly sees that Kumiko wears a red ribbon in her hair. The cops chase the criminal who crashes his car into a seal where a demon takes control over his soul. The demon is now on a killing rampage to find any girl that wears a red ribbon whose name initials are \"K.I.\". \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/21280.webp"},{"title":"Aragne no Mushikago","synopsis":"Life could be better for shy, anxious university student Rin. The apartment she has rented is hardly the sunny palace the rental listings suggested. The housing complex is rundown, grim and haunted by troubled souls lurking in dark corners. Ghastly crimes are occurring in the vicinity. And a grinning stranger makes his unsettling presence known.\n\nBeyond all this, Rin is coming to realize that something even more sinister is manifesting itself, something at the cursed crossroads of mythology, monstrosity and medical science. Determined to find out more, Rin visits the library, where she meets a sympathetic young staffer. But what she learns does not begin to put her mind at ease.\n\n(Source: Fantasia)","img":"https://cdn.myanimelist.net/images/anime/1477/96023.webp"},{"title":"Hametsu no Mars","synopsis":"Several months after a probe returning from Mars burns up during reentry, strange creatures dubbed \"Ancients\" begin to appear throughout Tokyo. Aggressive and dangerous, they cannot be killed with ordinary weapons. As scientists struggle to find the cause of their sudden appearance, the monsters wreak havoc across the world.\n\nHumanity finds hope in the form of the MARS suit—a new weapon developed to take down these enemies. The suit, however, can only be worn by those with specific DNA. Enter Takeru Hinata, an ordinary teen with a troubled past and one of the few capable of piloting the only weapon against the Ancients. With the help of the AAST, a special police force established to defeat the dangerous creatures, the young man battles against demons both personal and global whilst trying to discover the true nature of Earth's new aggressors.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/68855.webp"},{"title":"Gyo","synopsis":"Though her trip to Okinawa was supposed to be a lovely excursion to the seaside, college student Kaori Sawahara finds that it is anything but when a horrifying menace emerges from the watery depths. A strange mechanism has taken control of the sea creatures, granting them legs and sending them on land to attack anything in their way. Kaori and her friends—the lustful Erika and the reserved Aki—find themselves caught up in this onslaught, made worse by the creatures' rotting stench of death.\n\nSurviving the first assault, Kaori tries to contact her fiancé Tadashi in Tokyo. However, the call is cut short in what sounds like another fish attack. Fearing for his safety, Kaori leaves for Tokyo. With Erika and Aki contending with the attacks in Okinawa, Kaori rushes to find Tadashi, unaware that the crisis has only just begun.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/31905.webp"},{"title":"Jigoku Shoujo: Yoi no Togi","synopsis":"If you have a grudge against someone, you can access the Hell Correspondence website at the stroke of midnight, type in your grudge's name, and the Hell Girl, Ai Enma, will appear to grant your wish. However, the price for ridding yourself of such a burden is a steep one: in return for condemning the soul of your tormentor to Hell, your soul will also face eternal damnation. In her long vigil as the Hell Girl, Ai has met many willing to pay such a cost.\n\nIn Jigoku Shoujo: Yoi no Togi, Ai and her enigmatic companions continue to carry out their work, ferrying soul after suffering soul into the depths of Hell. However, as of late, a mysterious girl has been following them. This strange child, unable to even remember her own identity, questions Ai about her duty as the Hell Girl. Who is this girl, and what connection does she have to Ai?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1110/92117.webp"},{"title":"Tokkou","synopsis":"\"Shindou Ranmaru has just graduated from police academy and assigned to Tokko: Special Mobile Investigation Force. On the day of his graduation, he meets the half-naked girl he has been seeing in his dreams. Her name is Rokujo Sakura and she works for a secret group within Tokki, known as Tokko: Special Public Safety Task Force. Shindou ends up joining Tokko to avenge his parents' death, and solve the mysterious mass murder of residents in his hometown of Machida. Meanwhile, bottomless pits begin appearing around Japan, and mysterious creatures emerge from them. Could these events be linked to Machida Massacre?\"\n\n(Source: DVD Complete Series Back Cover)","img":"https://cdn.myanimelist.net/images/anime/8/18280.webp"},{"title":"Ajin OVA","synopsis":"New episodes bundled with the limited edition eighth and ninth manga volumes.","img":"https://cdn.myanimelist.net/images/anime/12/79906.webp"},{"title":"Ajin Part 1: Shoudou","synopsis":"For high schooler Kei—and for at least forty-six others—immortality comes as the nastiest surprise ever.\n\nSadly for Kei, such a feat doesn't make him a superhero. In the eyes of both the general public and governments, he's a rare specimen who needs to be hunted down and handed over to scientists to be experimented on for life—a demi-human who must die a thousand deaths for the benefit of humanity.\n\n(Source: Vertical)","img":"https://cdn.myanimelist.net/images/anime/6/77205.webp"},{"title":"Yami Shibai 2","synopsis":"For the second time, the masked storyteller returns to tell children tales and legends of horror and woe, such as the tale of a ventriloquist's dummy, a locker that grants wishes, a capsule toy machine that returns lost possessions, and a strange food called Ominie-san.\n\nBuilding on the foundation that was laid by the first, Yami Shibai 2 is a collection of Japanese scary stories of the unknown and the occult that are truly terrifying, narrated in a style of art that mimics kamishibai storytelling. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/74108.webp"},{"title":"Hellsing: Digest for Freaks","synopsis":"This OVA is a summary of the first three episodes of Hellsing, with the animation style of Hellsing Ultimate and following the events of the Hellsing manga.","img":"https://cdn.myanimelist.net/images/anime/7/26935.webp"},{"title":"Juubee Ninpuuchou: Ryuuhougyoku-hen","synopsis":"Fourteen years after defeating the immortal warrior Himuro Genma and thwarting the Shogun of the Dark's evil plans, Kibagami Jubei continues to roam all over Japan as a masterless swordsman. During his journey, he meets Shigure, a priestess who has never seen the world outside her village. But when a group of demons destroys the village and kills everyone, Jubei becomes a prime target after acquiring the Dragon Jewel—a stone with an unknown origin. Meanwhile, Shigure—along with the monk Dakuan and a young thief named Tsubute—travels to the village of Yagyu. And with two demon clans now hunting down Shigure, Dakuan must once again acquire the services of Jubei to protect the Priestess of Light.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1898/103439.webp"},{"title":"JoJo no Kimyou na Bouken: Phantom Blood","synopsis":"An adaptation of the original five volume arc of the popular JoJo's Bizarre Adventure manga, covering the Phantom Blood chapters. Jonathan Joestar is an aristocratic boy whose life is suddenly turned upside down by a mysterious new boy who arrives, Dio Brando. Dio has a connection to his father, and over time, a rivalry forms as Dio becomes obsessed with a mysterious, ancient, and mystical stone mask that Jonathan's father keeps. ","img":"https://cdn.myanimelist.net/images/anime/5/50055.webp"},{"title":"Kakurenbo","synopsis":"Among the high rises of steel pipes, meshed power lines, and faded neon lights, exists a game that children dare to play within the ruins of the old city.\n\n\"Otokoyo,\" a secret game of hide-and-seek, one where all who play wear fox masks and only begins when seven have gathered. But it is no normal game, as all who have played it have gone missing. Many whisper it is the work of demons, but that is just a rumor... or is it?\n\nKakurenbo follows the story of seven children as they play Otokoyo for the first time and discover why if you play, you never return.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/18917.webp"},{"title":"Terra Formars: Bugs 2-hen","synopsis":"Adaptation of the Bugs 2 arc of the manga.","img":"https://cdn.myanimelist.net/images/anime/1149/97842.webp"},{"title":"Kyuuketsuhime Miyu (TV)","synopsis":"Evil Shinma (shape-shifting monsters and vampires) roam the Earth on a mission to unleash their darkness upon the Human race. Miyu Royal Princess from the dark is the Chosen One—the one being who must banish the Evil Shinma from the Earth. She has the power to offer Humans the gift of eternal happiness, yet is herself, trapped between two worlds; destined for perpetual solitude and internal conflict. \n\nMiyu's only companion is Larva, once an evil Shimna; now her devoted guardian. Together they share a dark journey through the weakness of the human heart and the tragic loss of innocence. Cut off from humanity by the knowledge of what she is, Miyu lives an endless quest as both the hunter and the hunted, on the edge of darkness. \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/8/61317.webp"},{"title":"X/1999","synopsis":"At the millennial edge, the concluding battle for humanity's future is staged. Kamui Shirou's destiny has been decided as he returns to Tokyo to face his ultimate challenge. The Dragon of Heaven, defenders of the Earth, stand ready to protect the world from the Dragon of Earth, the seven angels of legend, who embrace the devastation of the planet to bring about its purification. Now Kamui must decide which side to fight for although he finds the idea utterly unappealing. It isn't until realizing that his two childhood friends, Fuma and Kotori Monou, are in grievous peril that Kamui decides to step into his fated position in the climactic struggle of the Year of Destiny: 1999. \n\n(Source: AnimeNfo) ","img":"https://cdn.myanimelist.net/images/anime/7/23579.webp"},{"title":"Kyougoku Natsuhiko: Kousetsu Hyaku Monogatari","synopsis":"Tired of writing riddles for children, Yamaoka Momosuke plans on gathering spooky and gruesome stories and publishing them in an anthology called Hyakumonogatari (\"One Hundred Tales\"). While researching these old myths and legends he comes across a mysterious trio who call themselves the Ongyou. They are detectives who are investigating the legends to reveal their truths...and bring those in the wrong to justice. Each time Momosuke meets the Ongyou he must face horrible truths and battle with his morals, but he's seeing things he shouldn't be seeing... \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/30681.webp"},{"title":"Tokyo Majin Gakuen Kenpucho: Tou Dai Ni Maku","synopsis":"The battle against Tendou Kodzunu is over, and the Magami Five begin to look forward to their senior graduation, hopefully planning for their adult futures. However, life in Tokyo is not at peace...\n\nThe underground assassin group known as the Twelve Heavenly Generals of the Martial Fist begin to move against those protecting the city from demons. Normally rumored to kill criminals that the mundane law was unable to bring to justice, the Martial Fist now set their sights on Tatsuma Hiyuu, Kyouichi Houraiji, Aoi Misato, Komaki Sakurai, Yuuya Daigo, and Hisui Kisaragi. \n\nWhat is the purpose of this cruel turn of events? And who ordered the hit? New threats emerge as others awakened to powers unleashed by the Ryumyaku seek out the Magami kids - and old friends now return as enemies.\n\nDestinies will collide as the Stars of Fate begin to merge; Yin and Yang will meet. And soon the shadowy figure pulling the strings will reveal himself, in an effort to raze Tokyo to the ground and awaken the Vessel of the Golden Dragon.    ","img":"https://cdn.myanimelist.net/images/anime/13/21754.webp"},{"title":"Biohazard: Degeneration","synopsis":"The story is set in autumn 2005, one year after Resident Evil 4 game took place. Due to an as of yet unexplained reason, zombies appear in a United States airport. The release of the zombies leads to danger of an outbreak. ","img":"https://cdn.myanimelist.net/images/anime/4/11769.webp"},{"title":"Kowabon","synopsis":"In today's world full of wondrous technological innovation, the unnatural and mysterious sometimes appear even more horrifying than usual. But despite how far society has advanced, the fear of the unknown always remains. The unfortunate participants in Kowabon find themselves in such a predicament, experiencing the supernatural through their everyday technology. From a frightening sight caught on a parking garage camera to a video chat that takes an unexpected turn, the victims struggle to escape that which haunts them. However, what awaits these doomed souls may be a fate even worse than death...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/74465.webp"},{"title":"Kagewani","synopsis":"A video blogger attempts to fake cryptid sightings to boost his views, but gets more than he bargained for when his crew is slaughtered by a real monster. Elsewhere, students find themselves preyed upon by a sandworm-like beast, initiating a desperate struggle for survival on their own school grounds.\n\nWith more of these attacks from mysterious creatures occurring, researcher Sousuke Banba tasks himself with delving into the mystery. With nothing but the keyword \"Kagewani\" to lead him, he scours the sites of recent attacks in hopes of finding a lead to eradicating the creatures for good. However, Sousuke finds that these threats to humanity are even closer to home when the pharmaceutical company, Sarugaku, starts to encroach on his investigation.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/76060.webp"},{"title":"Youjuu Toshi","synopsis":"There is Earth, our familiar world, and then there is the Black World, a parallel dimension that very few people are aware of. For centuries, a pact between the two worlds has been observed to maintain peace, and terms must be negotiated and renewed soon to continue relative harmony.\n\nThis time around, there is a militant faction that will stop at nothing to prevent the signing of a new treaty for inter-dimensional peace. Two agents of the elite organization known as the Black guards—defenders of the balance between the two worlds—are charged with ensuring the success of the treaty.\n\nDirector Yoshiaki Kawajiri (Ninja Scroll) blends stylish eroticism, graphic horror and pulse-pounding action as these two race to consummate the peace treaty in time.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/2/50021.webp"},{"title":"Supernatural The Animation","synopsis":"Based on the live-action CW show Supernatural, the anime will be a 22-episode season that will cover the storyline of the live-action version's first two seasons.\n\nThe anime project will not only remake the best episodes from the live-action version, but also depict original episodes not seen in the live-action version. Those original episodes will include prologues of the Winchester brothers' childhood, anime-only enemies, and episodes featuring secondary characters from the live-action version.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/37135.webp"},{"title":"Zombie-Loan Specials","synopsis":"The series was originally planned to be 20+ episodes but was cut short due to unknown circumstances. These specials released on the 7th DVD volume continue the story.","img":"https://cdn.myanimelist.net/images/anime/7/25890.webp"},{"title":"Ayakashi","synopsis":"As a child, Yuu Kusaka made a vow upon a shooting star that he would stand on the side of justice and defend the weak. However, the death of one of his friends robs him of the desire to live up to that vow, and he turns a blind eye to the misery of others, using the mysterious power he possesses as a means of making money instead of helping those in need. His days of living only for himself continue, until he's forced to fight for his life against another classmate with powers similar to his. He's saved by a mysterious girl named Eimu Yoake, who also has strange powers.\n\nEimu reveals that his powers stem from a creature known as an Ayakashi, a parasitic being that grants the user special abilities at the price of slowly draining the life of the host. She helps him fully awaken his own. Now aware of the ayakashi he possesses, Yuu must live up to his childhood vow, putting his ayakashi to use and fend off those who would use their own for evil, all while unraveling the mystery behind the death of his friend. ","img":"https://cdn.myanimelist.net/images/anime/5/20942.webp"},{"title":"Alien 9","synopsis":"Soon after entering middle school, Yuri Otani is coerced into joining the \"Alien Party,\" a single-minded group with one goal: capture any alien attempting to enter school grounds. Terrified of aliens her entire life, Otani is anything but thrilled, and to make matters worse, her kit includes a \"Borg\"—an alien-like creature tasked with ensuring her safety. Despite this, she finds solace in her two partners: the independent and reliable Kumi Kawamura, and the smart and energetic Kasumi Tomine.\n\nAs the Alien Party works to fend off extraterrestrial threats, will their roller blades and lacrosse sticks be enough to overcome the dire challenges ahead, or will they succumb to fear and suffer the grim consequences of defeat?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/2607.webp"},{"title":"Higurashi no Naku Koro ni (2020)","synopsis":"New Higurashi no Naku Koro ni anime project.","img":"https://cdn.myanimelist.net/images/anime/1808/105271.webp"},{"title":"Yami Shibai 3","synopsis":"A young boy silently sketches out the forms of the horrors that dwell in his mind. During this adventure into the occult and mysterious, he tells tales that involve dreams of a person with a muscular arm that you must not look at, a hospital with a room that holds a grim secret, and a visit to an eerily silent taxidermy museum.\n\nThese tales and more are compiled in Yami Shibai 3. Presented in an art style similar to kamishibai storytelling, this horror series stays true to the gruesome and creepy trend that is prominent in Yami Shibai and Yami Shibai 2nd Season.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/78074.webp"},{"title":"Koutetsujou no Kabaneri Movie 2: Moeru Inochi","synopsis":"Compilation film of the second half of the TV series. ","img":"https://cdn.myanimelist.net/images/anime/12/82963.webp"},{"title":"Genocyber","synopsis":"As the nations of the world begin to merge, world peace is threatened by the private armies of individual corporations. The Kuryu Group has just discovered a weapon that will tip world power in their favor. The Genocyber: a nightmarish combination of cybernetics and psychic potential. Many desire to control this monstrosity, but can its hatred be contained... Battle erupts, and the cyberpunk world of the future is about to explode with violence.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/3751.webp"},{"title":"Koutetsujou no Kabaneri Movie 1: Tsudou Hikari","synopsis":"Compilation film of the first half of the TV series. ","img":"https://cdn.myanimelist.net/images/anime/13/82962.webp"},{"title":"Blue Seed","synopsis":"Momiji is an average girl until the day she finds she is the descendant of the great Kushinada family. Only she, with her Kushinada blood, can stop the Aragami, demonic plant-like monsters threatening to destroy Japan. Along to help her is the TAC, and a possible love interest in a young man named Kusanagi.\n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/2/14047.webp"},{"title":"3x3 Eyes","synopsis":"3X3 Eyes is the story of a young man named Yakumo Fuuji, who through a strange series of events becomes the immortal slave of the last of a race of 3 Eyed demons. The demon absorbs his soul to save his life, making him immortal in the process. Now, he begins a journey with the female demon in an attempt to find a way of becoming human. Of course, there are many complications along the way, not the least of which being that the demon is a female with a split personality, one achingly cute and the other being no-nonsense destructive power, and the romances that develop between.","img":"https://cdn.myanimelist.net/images/anime/4/26940.webp"},{"title":"The SoulTaker: Tamashii-gari","synopsis":"Kyousuke Date comes home one night and finds his mother dying in a pool of her own blood. In her final moments, she stabs him in the chest. After a swift recovery, Kyousuke searches for answers regarding his mother's motives, but finds more than he bargained for when he is attacked by two rival organizations: the Hospital and the Kirihara Group.\n\nKyousuke is surprised to discover that he has a twin sister named Runa, and both groups try to coerce information out of him about her despite his ignorance to her existence. As their assault continues, Kyousuke soon makes another discovery—he has the ability to transform into a terrifying mutant called SoulTaker. With these newfound powers, Kyousuke resolves to crush both organizations, uncover the truth behind his mother's actions, and protect Runa.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/11004.webp"},{"title":"Blade","synopsis":"The story revolves around Blade, a \"Daywalker\" vampire hunter who was born with vampire and human blood after a vampire attacked his mother. While visiting Japan on a mission, Blade tracks down Deacon Frost, the vampire who killed his mother. Blade confronts \"Existence,\" a mysterious organization composed of vampires modified by Frost. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/29742.webp"},{"title":"Takahashi Rumiko Gekijou Ningyo no Mori","synopsis":"According to an ancient legend, mermaid's flesh can grant immortality if eaten. 500 years ago, Yuta unknowingly ate a piece of mermaid's flesh. For centuries, he travels across Japan, hoping to find a mermaid, thinking she may be able to make him a normal human again. When he finally finds one, he discovers that she and her companions have been raising a girl to be their food so they can eat her and take on her youthful looks. That is how mermaids stay young. Yuta kills the mermaids and rescues her, but she has already eaten some of the mermaid's flesh. Although he had to kill the mermaids, Yuta isn't too disappointed. Yuta's once lonely existence is now over, as he has found a companion in Mana. And Mana, who had been trapped in a small hut her whole life, finds delight in even the simplest of things. Together, Yuta and Mana attempt to seek out more mermaids, trying to become normal humans again. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/21590.webp"},{"title":"Manie-Manie: Meikyuu Monogatari","synopsis":"1. Labyrinth Labyrinthos\nA girl and her cat fall through a looking-glass into a dark labyrinth full of strange people.\n\n2. Running Man\nIn the distant future, a tough racer uses his psychokinetic powers against his opponents during his final race. \n\n3. The Order to Stop Construction\nA snooty salaryman is sent by his bosses to the jungle to stop a completely automated construction job, and spends several days there arguing with the robots.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/18685.webp"},{"title":"Hells","synopsis":"Amagane Rinne had an accident and died while hurrying to school. She suddenly arrived in an awkward school... in Hell, filled with demons. While she is struggling and wishing to go back to the world whence she came from, she makes friends with her demon schoolmates and develops an uncommon bond.","img":"https://cdn.myanimelist.net/images/anime/12/50303.webp"},{"title":"Ajin Part 2: Shoutotsu","synopsis":"For high schooler Kei—and for at least forty-six others—immortality comes as the nastiest surprise ever.\n\nSadly for Kei, such a feat doesn't make him a superhero. In the eyes of both the general public and governments, he's a rare specimen who needs to be hunted down and handed over to scientists to be experimented on for life—a demi-human who must die a thousand deaths for the benefit of humanity.\n\n(Source: Vertical)","img":"https://cdn.myanimelist.net/images/anime/9/79908.webp"},{"title":"Devilman: Tanjou-hen","synopsis":"Akira Fudou leads the life of a typical high school student. After a chance encounter with school bullies, he is rescued by his childhood friend Ryou Asuka. Ryou and Akira catch up over the course of an afternoon that ends with them crashing a party at a nightclub. Initially uncomfortable with the environment, Akira is shocked when violence provokes some of the club's partygoers to transform into demonic monsters. He and Ryou are only saved from the encounter thanks to the intervention of a great demon known as Amon. Amon possesses Akira, and the two together form the powerful Devilman⁠—a being that, due to the influence of Akira's strong empathy for his fellow man, is resolved to keep the human race safe from the threats of demonkind.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1211/91770.webp"},{"title":"Chika Gentou Gekiga: Shoujo Tsubaki","synopsis":"Behind the colorful curtains and extravagant performances, there lies the dark side of a circus life, hidden away from the smiles and praises of the audience. Set in early 20th century Japan, Midori: Shoujo Tsubaki highlights the misdeeds that occur in circus camps.\n\nMidori was an innocent young girl who enjoyed her life as an elementary student to the fullest. However, everything changed after her mother fell ill. Eventually, Midori is forced to stop going to school and, instead, sells flowers in the city. When her mother dies tragically, Midori meets a stranger who leads her towards the circus. What awaits her will change her life forever...\n\nIn a life where nothing seems to go right, will Midori lose faith and give up? Or will she manage to stay strong in hopes of a better future?","img":"https://cdn.myanimelist.net/images/anime/13/77662.webp"},{"title":"Enzai","synopsis":"The protagonist is Guys, a young boy from a poor family, who gets caught for stealing candy from a Paris store. \n\nHowever, after being railroaded by a city detective named Guildias, Guys finds himself accused, convicted, and sentenced to life imprisonment for the murder of a man he never met.\n\nFrom that point on, most Enzai takes place inside a dark, claustrophobic, dirty prison, in there, Guys experiences humiliation and torture of various kinds, much of it involving sexual acts such as rape and forcible sodomy.","img":"https://cdn.myanimelist.net/images/anime/2/24031.webp"},{"title":"Biohazard: Damnation","synopsis":"United States Special Agent Leon S. Kennedy sneaks into a small Eastern European country to verify rumors that Bio Organic Weapons (B.O.W.s) are being used in war. Right after his infiltration, the U.S. government orders him to leave immediately. Determined to uncover the truth, Leon ignores the order and enters the battlefield to end the chain of tragedies caused by the B.O.W.s.\n\n(Source: IMDB)","img":"https://cdn.myanimelist.net/images/anime/8/42299.webp"},{"title":"Sekai no Yami Zukan","synopsis":"Tucked away in the darkest depths of this world, tales of the bizarre and the supernatural quietly unfold. These inexplicable stories are chronicled throughout the pages of a certain strange encyclopedia, sheltered within a crumbling, decrepit building. Do you dare to open its cover and experience the horrors firsthand?\n\nEach of the macabre tales held within the book's pages details some unusual, surreal experiences that often come to a gruesome end. A man searches for his adulterous wife, only to find himself at the mercy of otherworldly visitors; a boy befriends a snowman who harbors a sinister secret; crop circles suddenly form on a family farm, created by some unexpected visitors; hidden in plain sight, menacing mechanical beings continue on undetected. In all of these horrifying stories, nothing is as simple as it seems, revealing a terrifying darkness that perhaps might have been best left alone.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/84611.webp"},{"title":"Ajin Part 3: Shougeki","synopsis":"For high schooler Kei—and for at least forty-six others—immortality comes as the nastiest surprise ever.\n\nSadly for Kei, such a feat doesn't make him a superhero. In the eyes of both the general public and governments, he's a rare specimen who needs to be hunted down and handed over to scientists to be experimented on for life—a demi-human who must die a thousand deaths for the benefit of humanity.\n\n(Source: Vertical)","img":"https://cdn.myanimelist.net/images/anime/5/85580.webp"},{"title":"Devilman","synopsis":"Devilman features Akira Fudo, a shy and timid teenager who has gone mountain climbing in the Himalayas with his father. While in the middle of the expedition, both father and son are killed in a tragic accident. Akira's body is found and possessed by the demon soldier Devilman, who uses his new human form as a disguise in order to fulfill his mission of causing chaos on Earth in order to pave the way for a demonic invasion of the planet.\n\nBefore his mission can begin in earnest, Devilman meets Akira's childhood friend Miki Makimura and quickly falls in love with her. Devilman resolves to protect Miki and humanity as a whole by battling against his fellow demons. Demon Tribe leader Zennon becomes greatly angered at Devilman's betrayal and is quick to send Devilman's former comrades to destroy him. The other demons soon learn that Miki is precious to Devilman and he must now work to protect her, as well as protect himself. Will the power of love be able to overcome that of true evil?","img":"https://cdn.myanimelist.net/images/anime/9/72913.webp"},{"title":"Yami Shibai 4","synopsis":"Excited children gather around the enigmatic masked Storyteller once more. His unique kamishibai storytelling draws them into tales of fear and dread. These are dark and foreboding stories, which could happen to anyone...\n \nThis season has tales of a salaryman who buries a dead cat, only to be haunted soon after; a college student and her cheap new apartment that hides a ghastly secret; boys exploring an abandoned haunted house before coming across a strange fish tank; a man who finds himself on the wrong bus, and in more danger than he thought possible; and a young couple's visit to an amusement park, which suddenly takes a dark turn. All these stories and more await in Yami Shibai 4.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/83113.webp"},{"title":"Kikoushi Enma","synopsis":"Enma is a character created by the genius manga artist Go Nagai. Now, the popular character makes his appearance in an alluring Japanese horror anime for adults. It's a hair-raising erotic suspense in which Enma takes on complicated and gruesome incidents caused by demons who lurk in the darkness. But humans have lit up the darkness of the night with neon lights and turned their world into one that never sleeps, so demons now lurk in the \"darkness of the human heart.\" Unfulfilled hearts, suppressed hearts, despair,...such darkness of the heart is the place they lurk.\n\nEnma is the Demon Prince of the Underworld, a demon \"Born of Fire.\" His mission is to take back or destroy demons that have escaped to the human world from the Underworld. Along with his partner, Princess Yukihime, \"Born of Ice,\" and the monster, Kapaeru, Enma sets up \"Enma's Detective Agency.\" Tonight, like any other night, they will roam the sleepless city. Horrific incidents that could not possibly be human acts occur one after another. The stench of evil lingers at the scene... Enma's fire rips through the darkness!\n\n(Source: Bandai Entertainment)","img":"https://cdn.myanimelist.net/images/anime/8/50391.webp"},{"title":"Boukyaku no Senritsu","synopsis":"A great war occurred in the 20th century between humans and monsters. Since that time, the monsters rule the world in fear but keep relatively hidden from public view. A boy named Bokka ponders the past and wonders what became of the Meros Warriors who defended the world so bravely against the demons. He soon meets Kurofune and learns of the power of the Meros and the I-bar machines they ride in battle. Warriors are the only ones who can see and hear the Melody of Oblivion, a phantom girl hidden away waiting to be rescued and be the savior of mankind. During a battle between Kurofune and a demon, Bokka discovers something only his wildest dreams could possibly imagine...he too can hear that melody. Throughout his journeys, Bokka meets many monsters and their agents, friends, and companions as he discovers the true extent of his new powers. He must continue to battle evil in the hope of releasing Boukyaku no Senritsu and free a world that has forgotten its once beautiful melody.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/52679.webp"},{"title":"Kyuuketsuhime Miyu","synopsis":"A quiet gothic horror story about a vampire girl, Miyu, whose destiny it is to hunt down murderous demons known as Shinma and return them to their land of origin, the Dark. Miyu is pursued by the Spiritualist Himiko, determined to find out who Miyu is and to stop her from sucking the life blood from helpless humans. Each of the four episodes chronicle one of Miyu's encounters with a Shinma and the humans that it is affecting, from the perspective of Himiko's pursuit of Miyu. \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/12/78948.webp"},{"title":"Devilman Lady","synopsis":"Fudo Jun is a beautiful supermodel who is idolized by many. She also has a dark secret that not even she knows about at first, for within her veins run the genes that hold the next step in the evolution of mankind. The same blood as the beastlike superhumans that terrorize the city. Unlike the rest of them, though, Jun has managed to hold a tenuous grip onto her humanity, and she is recruited by the mysterious Asuka Ran, member of a secret organization within the government, aimed at controlling, if not eliminating, these berserk destroyers of mankind. Jun, as Devilman Lady, must now exterminate her own kind, but how much longer can she keep her sanity in a situation she never chose in the first place?\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/18370.webp"},{"title":"Kagewani: Shou","synopsis":"After surviving the onslaught at Sarugaku headquarters, Sousuke Banba resumes his investigation of the Kagewani monster hybrids. Armed with the ability to harness the Kagewani's power, the researcher now has a means to eliminate the creatures. But despite the benefits of this skill, it has one major drawback: Sousuke now struggles to maintain his sanity, with the power threatening to consume his body.\n\nSoon, threats old and new begin to rear their heads, as the upper echelons of Sarugaku become active once again and an assassin with a personal vendetta sets her sights on Sousuke. Nevertheless, he resolutely forges ahead on his mission, determined to track down the origins of the Kagewani and eliminate their threat once and for all.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/78601.webp"},{"title":"Night Walker: Mayonaka no Tantei","synopsis":"Shido Tatsuhiko is not only a private eye... he is also a vampire with no real memory of his past. Joined by Yayoi Matsunaga, a female government agent, Riho Yamazaki, an orphaned teenage girl working as his girl Friday and Guni, a little green imp, Shido must face demonic creatures known as Nightbreed. Meanwhile, Cain, the vampire who made him what he is now, is seeking him...\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/31985.webp"},{"title":"Ao Oni The Animation","synopsis":"In most ordinary high schools, many stories and rumors float around—some scandalous, some happy and some...more macabre. One such example is of monsters lurking in an abandoned mansion outside of town. Such tales, however, prove too tempting to resist for Hiroshi and his friends Mika, Takeshi, and Takurou. They decide to brave the rumored dangers in order to investigate the manor and complete a test of courage. Each of them approaches the mansion with an overwhelming sense of dread. And when they enter, they come upon a blue monster named Ao Oni who attacks them.\n\nAs Hiroshi and his friends try to solve the various puzzles in the mansion and escape their new blue nemesis, they find themselves meeting several horrible endings as they fail miserably.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/81430.webp"},{"title":"Amon: Devilman Mokushiroku","synopsis":"Fear runs rampant throughout Tokyo with the revelation that demons in fact exist amongst us. Paranoia and the darker side of humanity boils onto the streets as people turn on one another, suspecting that anyone could in fact be a demon hiding in human clothing. Amidst the growing tensions, tragedy strikes Akira causing his mind to snap, retreating into his subconscious, allowing his Devilish alter-ego Amon to break free from Akira's cage of flesh and wreak havoc on both human and demons alike. ","img":"https://cdn.myanimelist.net/images/anime/1311/91101.webp"},{"title":"Yami Shibai 5","synopsis":"The mysterious masked Storyteller returns to tell more twisted tales of horror. Continuing his particular style of kamishibai inspired storytelling, he now finds that his audience is an eerie crowd of young girls, who eagerly await his devilish stories.\n\nHe recounts ghostly legends involving girls of all ages: a housewife who receives a barrage of chilling phone calls; a strange girl whose flower readings are always right; a mother and daughter's ominous meeting with the \"crow lady\"; and a young girl whose demands from others grow more and more outrageous with each request. Witness once again the Storyteller's haunting and gripping tales, which are sure to leave one with more than just chills...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/86158.webp"},{"title":"Devilman: Yochou Sirene-hen","synopsis":"Demons exist and their power is beyond what humans can fathom. In fact they are so strong that humans do not stand a chance against them in a fight. \n\nThe only thing strong enough to defeat a demon is another demon and it is trough this logic that Ryo Asuka hatches the plan to have his good-hearted friend Akira Fudo possessed by a demon. If a person is of pure of heart then he might be able to control the demon that posses him and thereby acquire power equal to a demon. After raising some hell in a club the plan works and Akira is possessed by the powerful demon known as Amon. \n\nNow Akira is humanities sole champion of justice against the hidden demon menace that has plagued humanity since the dawn of time.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1452/91103.webp"},{"title":"Hitsuji no Uta","synopsis":"Kazuna's family has a history of suffering from a disease that creates an uncontrollable vampire-like thirst for blood. Knowing none of this, Kazuna was sent to live with the Eda couple as a child. As the sickness begins to show signs of being present within himself, he comes into contact with his older sister, Chizuna, who has been suffering from it since early childhood. Knowing that the sickness incurs a heavy weight upon those that suffer from it, Chizuna tries to ease her brother's burden, to help him learn to control his urges, but... \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/7/18066.webp"},{"title":"Jigoku Sensei Nube","synopsis":"Nube is a clumsy, easygoing, and very kind teacher, but he has a secret under his glove on the left hand. He has a monster hand, and he also has the ability to sense ghosts and evil spirits. So he protects his dear students from these evil spirits with his monster hand, proving to be very powerful.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/63617.webp"},{"title":"Highlander: The Search for Vengeance","synopsis":"Colin MacLeod, the immortal Scottish Highlander, travels with the wise-cracking ghost Amergan in search of the immortal despot Marcus Octavius, who killed Colin's lover on the Celtic plains centuries earlier. The once great city of New York is now submerged under water, with only one dominant fortress towering over the sea, the fortress of Marcus Octavius. MacLeod is torn between saving the survivors of New York and hunting down his nemesis.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/10219.webp"},{"title":"Arc the Lad","synopsis":"The story follows Elk, a bounty hunter in some strange futuristic world. On this world archaic but advanced technology exists side by side with primitive attitudes, beasts and magic. In other words it's got a bit of everything. It also has an evil conspiracy who are able to produce powerful monsters called chimera, who can also appear as human. Naturally it is not long before Elk has rescued a young female beast-master and gained himself some serious enemies. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/49041.webp"},{"title":"Biohazard: Vendetta","synopsis":"Chris Redfield enlists the help of Leon S. Kennedy and Rebecca Chambers to stop a death merchant, with a vengeance, from spreading a deadly virus in New York.\n\n(Source: IMDB)","img":"https://cdn.myanimelist.net/images/anime/6/83300.webp"},{"title":"Tomie","synopsis":"Tomie Kawakami is a femme fatale with long black hair and a beauty mark just under her left eye. She can seduce nearly any man, and drive them to murder as well, even though the victim is often Tomie herself. While one lover seeks to keep her for himself, another grows terrified of the immortal succubus. But soon they realize no matter how many times they kill her, the world will never be free of Tomie.\n \n(Source: VIZ Media)","img":"https://cdn.myanimelist.net/images/anime/2/89805.webp"},{"title":"Kaidan Restaurant","synopsis":"TV Asahi announced a new kids anime \"Kaidan Restaurant (Thriller Restaurant)\" based on a picture book. Each episode will consist of three stories or \"dishes\": the appetizer, the main dish, and dessert. The first two \"dishes\" will deal with an ordinary sixth-grade schoolgirl named Ako Ozara and the bizarre occurrences that befall her classmates. The third \"dish\" will be a standalone short ghost story told by Ako and her friends.","img":"https://cdn.myanimelist.net/images/anime/11/17905.webp"},{"title":"Shikabane Hime: Kuro – Soredemo, Hito to Shite","synopsis":"This special follows the story of how Isaki Shuuji and Ruo Minai became Contracted Priest and Shikabane Hime.","img":"https://cdn.myanimelist.net/images/anime/4/73631.webp"},{"title":"Makai Toshi Shinjuku","synopsis":"Kyoya's father was a great warrior, killed at the hands of the diabolical psychic, Rebi Ra, who has now opened a portal to hell in the city of Shinjuku. It falls to Kyoya to finish what his father started and battle his way through demons, while protecting a young woman from harm. The only problem is that he's not exactly your classic hero type, and his powers are still latent. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/25337.webp"},{"title":"Blood-C: Special Edition","synopsis":"Two summary episodes of the TV series that are airing prior to Blood-C: The Last Dark.  They will feature secret content that was never aired during the TV series' run.","img":"https://cdn.myanimelist.net/images/anime/11/39001.webp"},{"title":"3x3 Eyes: Seima Densetsu","synopsis":"Yakumo has trained and searched for 4 years, following Pai's mysterious disappearance. However, when he finally finds her, not all is well as her memory seems to be gone. They attempt to return her memory by going to the Holy Land, birthplace of the immortal race of Sanjiyans.","img":"https://cdn.myanimelist.net/images/anime/7/12744.webp"},{"title":"Betterman","synopsis":"A deadly virus known as \"Algernon\" has attacked humanity with vicious meaning. At the forefront of the battle is the mystifying Akamatsu Industries—disguised as a heavy machine factory in Tokyo, this undercover organization uses neural enhanced weapons known as NeuroNoids to battle Algernon. Also helping with their secret efforts is the mysterious mutant who is only known as \"Betterman.\"\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1157/91069.webp"},{"title":"Uzumaki","synopsis":"In the town of Kurouzu-cho, Kirie Goshima lives a fairly normal life with her family. As she walks to the train station one day to meet her boyfriend, Shuuichi Saito, she sees his father staring at a snail shell in an alley. Thinking nothing of it, she mentions the incident to Shuuichi, who says that his father has been acting weird lately. Shuuichi reveals his rising desire to leave the town with Kirie, saying that the town is infected with spirals.\n\nBut his father's obsession with the shape soon proves deadly, beginning a chain of horrific and unexplainable events that causes the residents of Kurouzu-cho to spiral into madness.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1432/105265.webp"},{"title":"Kaibutsu Oujo (OVA)","synopsis":"Based on a manga by Mitsunaga Yasunori, serialised in Monthly Shounen Sirius.\n\nHiyorimi Hiro moves to a new city to live with his older sister, but dies before he can find her. He then awakens to a new life as a servant of a Princess of the Monster Realm, who just happens to be employing his sister. Monsters soon appear to attack or pester the princess since she is in line for the royal throne, and Hiro must protect her with his life (and repeated deaths).\n\n(Soure: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/27643.webp"},{"title":"Silent Möbius","synopsis":"The year is 2023 and Alien Beings known as \"Lucifer Hawks\" have begun invading earth from another dimension. All that stands between them and the enslavement of the human race is the Attacked Mystification Police Department - a special division of the Tokyo Police staffed by women with amazing paranormal abilities.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/61831.webp"},{"title":"Interlude","synopsis":"The unnamed main character has been having strange dreams, seeing strange things, and meeting strange people. He investigates these events and finds a strange girl named Aya. With her help, he discovers that his world may not in fact be real and many of the people he thinks he knows may not exist anymore.\n\n(Source: FUNimation)","img":"https://cdn.myanimelist.net/images/anime/2/75602.webp"},{"title":"Yami Shibai 6","synopsis":"Late at night, in a clearing within a dark fog-filled forest, there sits a kamishibai storyboard. A visitor approaches, and suddenly, the fog recedes. A shape begins to take form beside the board—this figure is the masked Storyteller, who once again starts to spin tales of horror and despair.\n\nThe events described in these macabre tales might happen to anyone, even your neighbors or friends: a group of girls bully one of their members in a cave, only to find themselves the victims of a dark presence; a boy with scopophobia moves to the countryside, but he still cannot escape the eyes of others; a man has a window that won't stay closed, and is the recipient of strange phone calls; and a salaryman steals an umbrella on a rainy day, but this seemingly insignificant act leads to consequences he never expected. Visitors may enjoy the Storyteller's offerings, but they should also be vigilant so that they don't wind up as the subjects of his next story.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1911/95045.webp"},{"title":"Berserk: Majo no Tsuisou","synopsis":"Recap episode of Berserk 2nd Season.","img":"https://cdn.myanimelist.net/images/anime/13/86045.webp"},{"title":"Ushio to Tora","synopsis":"Ushio thinks his father's tale of an ancient ancestor impaling a demon on a temple altar stone with the legendary Beast Spear is nuts, but when he finds the monster in his own basement, Ushio has to take another look at the family legend! Fortunately, Ushio knows it's best to let sleeping dogs lie and leave captured demons where they are. Unfortunately, the release of the monster's evil energies begins to beckon other demons to Ushio's hometown! To save his friends and family from the invading spirits, Ushio is forced to release Tora from his captivity. But will the cure prove to be worse than the curse? Will Ushio end his life a Tora-snack? Or will the Beast Spear keep Tora in line long enough to save the city?\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/10/30961.webp"},{"title":"Change!! Getter Robo: Sekai Saigo no Hi","synopsis":"Dr. Saotome returns from the dead after being seemingly murdered by Getter pilot Nagare Ryoma and threatens the world with his ultimate creation: the Shin Dragon. Ryoma reluctantly teams up with his former co-pilots Jin Hayato and Tomoe Mushashi to combat Dr. Saotome. The pilots must also deal with the mysterious Invaders, aliens that have the ability to possess humans and warp their flesh to form hideous creatures.\n\n(Source: Nihon Review)","img":"https://cdn.myanimelist.net/images/anime/4/23767.webp"},{"title":"Kyoushoku Soukou Guyver (1989)","synopsis":"Shou and his friend, Tetsurou, stumble upon a strange orb-like mechanism, the Guyver Unit, in the woods. It physically bonds with Shou and turns him into the alien soldier, Guyver. His mission is to protect the Guyver Unit from the Japanese corporation known as Chronos. They are after it and two other units just like it. To retrieve the object, they send out vicious monsters known as Zoanoids. So no one is safe in Shou's life; not even himself.\n","img":"https://cdn.myanimelist.net/images/anime/7/13102.webp"},{"title":"Litchi DE Hikari Club","synopsis":"A short, comical anime adaptation of the psychological-horror manga, Litchi☆Hikari Club. \n\nThe story is about nine boys who are members of the Hikari Club and their self-made AI robot, Litchi. They are led by their leader Zera and keep a kidnapped girl named Kanon. ","img":"https://cdn.myanimelist.net/images/anime/11/40867.webp"},{"title":"Kaibutsu Oujo: Konsui Oujo","synopsis":"Episode 26 included in the ninth DVD volume of Kaibutsu Oujo.","img":"https://cdn.myanimelist.net/images/anime/13/22440.webp"},{"title":"Neo Ranga","synopsis":"An ancient God called Ranga awakens on an isolated island in the South Pacific where it has been slumbering forgotten by mankind. Three sisters living in Tokyo—Minami, Ushio, and Yuuhi Shimabara—discover they have inherited this Island Kingdom, along with the huge God. When Ranga shows up in Tokyo, it soon becomes a source of wonder and conflict for the three sisters that control Ranga, the people who want to destroy it, and ones who want to use it. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1473/92555.webp"},{"title":"Kishin Douji Zenki","synopsis":"In ancient times, a great battle was waged between a master mage, Enno Ozuno, and an evil demon goddess, Karuma. Unfortunately, Enno didn't have the strength to defeat her alone and was forced to call upon Zenki, a powerful protector demon. After Karuma was defeated, Enno sealed Zenki away in a pillar located inside his temple.\n\n1,200 years after this epic battle, Enno's descendant, Chiaki, spends her days showing tourists around her hometown of Shikigami-cho and doing exorcisms to pay the bills. One day, two thieves enter the town in hopes of opening a seal in the Ozuno temple and releasing the hidden treasure from within. However, what actually pops out is a dark entity that attaches itself to the henchmen, transforming them into demonic beings. After this transformation, they begin a rampage through the temple, terrorizing poor Chiaki.\n\nIt is now up to this young progeny to unleash her family's powers to summon Zenki and save Shikigami-cho from these demons, as well as the evil entities sure to follow in their footsteps.","img":"https://cdn.myanimelist.net/images/anime/1225/92572.webp"},{"title":"Blue Gender: The Warrior","synopsis":"It is a time of chaos. Earth is no longer what it used to be. It has been infested with a bug like species called the Blue. 20 years ago Yuji Kaido, who has a mysterious disease, is put into suspended animation until a cure is found. When he wakes up Yuji learns that it’s been more than 20 years since he was put into suspended animation, and the world is now controlled by these creatures. He then decides to join a group of soldiers fighting against the Blue for hope of a better future.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/15774.webp"},{"title":"Bio Hunter","synopsis":"Two scientists are attempting to distribute the cure for a demon virus that is affecting people all over Japan, however, things have become complicated. One of them has become infected. So begins his battle with himself, as he attempts to not only control his emerging demon side, but also to save the lives of others by wielding its great strength. \n","img":"https://cdn.myanimelist.net/images/anime/11/17896.webp"},{"title":"Aru Zombie Shoujo no Sainan (ONA)","synopsis":"On a hot summer day, five university students sneak into the library storage to look for some treasure. They find two sets of female antique mummies from Italy around the age of 14–20 years old.\n\nOne of the students, Sayaka, rips open the mummy and takes out a stone called \"stone of life,\" which gave the mummies super strength and eternal life. Having stolen their \"stone of life,\" the two mummy girls wake up and become zombies after 100 years in order to get it back in a bloody gruesome way, smashing their heads and eating their flesh for power.\n\nThe only way for the students to get out is to somehow find a way to kill the zombie girls. Will they be able to survive?\n\n(Source: Shochiku)","img":"https://cdn.myanimelist.net/images/anime/1159/93477.webp"},{"title":"Hakaba Kitarou","synopsis":" Kitarou is a youkai boy born in a cemetery, and aside from his mostly-decayed father, the last living member of the Ghost tribe. He is missing his left eye, but his hair usually covers the empty socket. He fights for peace between humans and youkai, which generally involves protecting the former from the wiles of the latter.\n\nThis version of the Kitarou story is based on the original Hakaba Kitarou manga, the manga which inspired the popular Gegege no Kitarou series in the late 60's.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/1856/92125.webp"},{"title":"Mamono Hunter Youko","synopsis":"Yohko Mono is a regular girl making her way through high school--until she learns that she is the 108th successor to a line of warriors charged with defending the earth against demons. Eventually she must fight her ultimate battle against the demon who started it all. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1276/97039.webp"},{"title":"Karakurizoushi Ayatsuri Sakon","synopsis":"The dark-haired bishounen is Sakon Tachibana, a puppeteer, and the other is Ukon, his favorite puppet, and best friend. Sakon is the (only) grandson of Saemon Tachibana, a national treasure of Japan famous for his manipulation of Bunraku puppets. Ukon is a child doll puppet made in the early Meiji era by the famous female dollmaker Unosuke. Together they run into murders and solve them.\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/10/16022.webp"},{"title":"Himekishi Lilia","synopsis":"The princess knight Lilia Evelvine is set to succeed her father as the ruler of the Leuven kingdom, but her jealous brother, Dirk, will do anything to halt her ascension to the throne. With the aid of Kiriko, his court enchantress, and Sand, the servant of the King of Demons, the dastardly prince enacts a coup to gain control of the castle and become the next king. He succeeds, but not before being reminded of his agreement with Sand: to extract the holy energy within Lilia as a tribute to the King of Demons. Dirk then proceeds to corrupt his mother and Lilia with all sorts of perversions, hoping to fulfill his task on time while turning the two into his loyal slaves.\n \n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/1755/103993.webp"},{"title":"Berserk Recap","synopsis":"Recap episode of Berserk.","img":"https://cdn.myanimelist.net/images/anime/9/84535.webp"},{"title":"Kyochuu Rettou","synopsis":"After an airplane crash during a school trip, Oribe Mutsumi and her classmates were stranded on a seemingly deserted island. Mutsumi found the other survivors, and used her wilderness knowledge to help them. She expects that they will be rescued in about three days, which doesn't seem so long to endure. However, she didn't account for the fact that the island is populated with gigantic killer insects. Her knowledge of butterflies, wasps, and more may be the only thing that will help any of her classmates survive to be rescued!\n\n(Source: MangaHelpers)","img":"https://cdn.myanimelist.net/images/anime/1767/97921.webp"},{"title":"Monster Extra: Hottan","synopsis":"Recap of the first 17 episodes of Monster, airing between episodes 24 and 25 of the TV series.","img":"https://cdn.myanimelist.net/images/anime/5/10372.webp"},{"title":"Yami Shibai 7","synopsis":"A rusted door opens to a decrepit apartment filled with darkness. Inside, the masked Storyteller waits to spin more twisted tales of horror, inviting all to listen.\n\nIn one story, a woman is tormented by her past sins; in another, a man visits a chilling art exhibit, where things quickly go awry when he ignores the warnings regarding taking photographs. That is not all, though—an unsuspecting woman hears strange noises from her veranda, but when her boyfriend investigates, he receives the shock of his life; a lady receives a frantic call from her sister, who begs her to come to a phone booth, but when she arrives, she realizes that things are not as they appear; and a man looks for one of his belongings in his little sister's room, only to soon discover that a malevolent presence lives there. The Storyteller is all too eager to share these tales, which will no doubt shock and terrify his audience.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1795/101063.webp"},{"title":"Violence Jack: Harlem Bomber-hen","synopsis":"Kanto Hell Earthquake has demolished the metropolitan completely. After the earthquake, Slum King is kidnapping girls and sell them as sex slaves. Mari is wandering on the devastated field looking for her lover, Ken. But she is also kidnapped by them. While she is tortured and trained as a sex slave, Ken saves her. Ken has become the member of Slum King. The king offers condition to him; in return for releasing her, he has to kill Violence Jack. \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/6/12873.webp"},{"title":"Koroshiya 1 The Animation: Episode 0","synopsis":"A masochistic mobster meets his match in the dark streets of Tokyo. His nemesis, Ichi, is a psychopathic killer with an unrelenting thirst for bloodshed. A horrifying secret burns in his mind, and his hands deal death without mercy. At last, the shrouds of mystery are parted to reveal the origin of the monster. The city will know its greatest fear at the unveiling of Ichi the Killer. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/34131.webp"},{"title":"Ajin 2nd Season OVA","synopsis":"Bundled with the limited edition tenth manga volume.","img":"https://cdn.myanimelist.net/images/anime/6/88499.webp"},{"title":"Kakugo no Susume","synopsis":"A series of natural disasters has reduced the world to rubble, with the survivors doing whatever they must to survive in a world gone mad. But one young boy, Kakugo, gifted with amazing martial arts and a superpowerful suit of armor by his late father, has been charged with making the world (or at least his school) a safer place. But his sister has a matching set of skills and equipment, and she`s on a mission to bring peace to the world... by wiping out humanity! \n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/6/16230.webp"},{"title":"Teizokurei Daydream","synopsis":"Saiki Misaki has been able to see ghosts since she was a kid. Now, working at an S&amp;M club, her spare time goes to sending the spirits off to the other world by having to make them realize they're dead and have to leave. This would supposedly be a little bit easier if you didnt have a background of hardship and loneliness... and a perverted employer.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/3784.webp"},{"title":"Kyochuu Rettou Movie","synopsis":"After an airplane crash during a school trip, Oribe Mutsumi and her classmates were stranded on a seemingly deserted island. Mutsumi found the other survivors, and used her wilderness knowledge to help them. She expects that they will be rescued in about three days, which doesn't seem so long to endure. However, she didn't account for the fact that the island is populated with gigantic killer insects. Her knowledge of butterflies, wasps, and more may be the only thing that will help any of her classmates survive to be rescued!\n\n(Source: MangaHelpers)","img":"https://cdn.myanimelist.net/images/anime/1701/104027.webp"},{"title":"Gakkou no Kaidan: Kubinashi Rider!! Shi no Noroi","synopsis":"A TV special of Gakkou no Kaidan that aired almost 5 months after the original anime. However, this event takes place before the Finale episode of the TV series.\n\nThe story focuses on a headless motorcycle rider. ","img":"https://cdn.myanimelist.net/images/anime/2/74184.webp"},{"title":"Dorohedoro: Ma no Omake","synopsis":"OVA included with the special edition of volume two of the Blu-ray release. \n\n","img":"https://cdn.myanimelist.net/images/anime/1611/105459.webp"},{"title":"Darkside Blues","synopsis":"The Persona Century Corporation has purchased nearly every parcel of land on earth. Dissension is not tolerated within the corporation's borders and those who oppose Persona are dealt with swiftly. Of those few places not yet under Persona's control is the free town of Kabuki-cho, also known as \"The Dark Side of Tokyo\". Within the town, under the leadership of a woman named Mai, is a small resistance group called Messiah. Into this world steps a man who takes the sobriquet of Kabuki-cho: Darkside. Sealed up in another dimension eighteen years ago by Persona Century, Darkside now returns to aid Messiah using his unique mystic power of renewal. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/3766.webp"},{"title":"Tokyo Ghoul","synopsis":"Tokyo has become a cruel and merciless city—a place where vicious creatures called “ghouls” exist alongside humans. The citizens of this once great metropolis live in constant fear of these bloodthirsty savages and their thirst for human flesh. However, the greatest threat these ghouls pose is their dangerous ability to masquerade as humans and blend in with society.\n\nBased on the best-selling supernatural horror manga by Sui Ishida, Tokyo Ghoul follows Ken Kaneki, a shy, bookish college student, who is instantly drawn to Rize Kamishiro, an avid reader like himself. However, Rize is not exactly who she seems, and this unfortunate meeting pushes Kaneki into the dark depths of the ghouls' inhuman world. In a twist of fate, Kaneki is saved by the enigmatic waitress Touka Kirishima, and thus begins his new, secret life as a half-ghoul/half-human who must find a way to integrate into both societies.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/64449.webp"},{"title":"Elfen Lied","synopsis":"Lucy is a special breed of human referred to as \"Diclonius,\" born with a short pair of horns and invisible telekinetic hands that lands her as a victim of inhumane scientific experimentation by the government. However, once circumstances present her an opportunity to escape, Lucy, corrupted by the confinement and torture, unleashes a torrent of bloodshed as she escapes her captors.\n\nDuring her breakout, she receives a crippling head injury that leaves her with a split personality: someone with the mentality of a harmless child possessing limited speech capacity. In this state of instability, she stumbles upon two college students, Kouta and his cousin Yuka, who unknowingly take an injured fugitive into their care, unaware of her murderous tendencies. This act of kindness will change their lives, as they soon find themselves dragged into the shadowy world of government secrecy and conspiracy.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/6883.webp"},{"title":"Another","synopsis":"In 1972, a popular student in Yomiyama North Middle School's class 3-3 named Misaki passed away during the school year. Since then, the town of Yomiyama has been shrouded by a fearful atmosphere, from the dark secrets hidden deep within.\n\nTwenty-six years later, 15-year-old Kouichi Sakakibara transfers into class 3-3 of Yomiyama North and soon after discovers that a strange, gloomy mood seems to hang over all the students. He also finds himself drawn to the mysterious, eyepatch-wearing student Mei Misaki; however, the rest of the class and the teachers seem to treat her like she doesn't exist. Paying no heed to warnings from everyone including Mei herself, Kouichi begins to get closer not only to her, but also to the truth behind the gruesome phenomenon plaguing class 3-3 of Yomiyama North.\n\nAnother follows Kouichi, Mei, and their classmates as they are pulled into the enigma surrounding a series of inevitable, tragic events—but unraveling the horror of Yomiyama may just cost them the ultimate price.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/75509.webp"},{"title":"Tokyo Ghoul √A","synopsis":"Ken Kaneki has finally come to accept the monstrous, flesh-craving part of himself that he has feared and despised for so long. After escaping captivity and torture, Kaneki joins Aogiri Tree—the very militant ghoul organization that had abducted him, leading his friends to question his true motive and loyalty.\n\nAs tension between the government and the ghouls continues to rise, the Commission of Counter Ghoul, the government's specialized anti-ghoul agency, has intensified their efforts to completely purge Tokyo of ghouls. This threatens the transient peace of Kaneki's friends and former comrades—the ghouls at the Anteiku coffee shop. Aware of the dangerous situation, Kaneki faces several battles that puts his precious fleeting humanity on the line.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/71777.webp"},{"title":"Kiseijuu: Sei no Kakuritsu","synopsis":"All of a sudden, they arrived: parasitic aliens that descended upon Earth and quickly infiltrated humanity by burrowing into the brains of vulnerable targets. These insatiable beings acquire full control of their host and are able to morph into a variety of forms in order to feed on unsuspecting prey.\n \nSixteen-year-old high school student Shinichi Izumi falls victim to one of these parasites, but it fails to take over his brain, ending up in his right hand instead. Unable to relocate, the parasite, now named Migi, has no choice but to rely on Shinichi in order to stay alive. Thus, the pair is forced into an uneasy coexistence and must defend themselves from hostile parasites that hope to eradicate this new threat to their species.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/73178.webp"},{"title":"Highschool of the Dead","synopsis":"It happened suddenly: The dead began to rise and Japan was thrown into total chaos. As these monsters begin terrorizing a high school, Takashi Kimuro is forced to kill his best friend when he gets bitten and joins the ranks of the walking dead. Vowing to protect Rei Miyamoto, the girlfriend of the man he just executed, they narrowly escape their death trap of a school, only to be greeted with a society that has already fallen.\n\nSoon, Takashi and Rei band together with other students on a journey to find their family members and uncover what caused this overwhelming pandemic. Joining them is Saeko Busujima, the beautiful president of the Kendo Club; Kouta Hirano, an otaku with a fetish for firearms; Saya Takagi, the daughter of an influential politician; and Shizuka Marikawa, their hot school nurse. But will the combined strength of these individuals be enough to conquer this undead apocalypse?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/78311.webp"},{"title":"Deadman Wonderland","synopsis":"It looked like it would be a normal day for Ganta Igarashi and his classmates—they were preparing to go on a class field trip to a certain prison amusement park called Deadman Wonderland, where the convicts perform dangerous acts for the onlookers' amusement. However, Ganta's life is quickly turned upside down when his whole class gets massacred by a mysterious man in red. Framed for the incident and sentenced to death, Ganta is sent to the very jail he was supposed to visit. \n\nBut Ganta's nightmare is only just beginning. \n\nThe young protagonist is thrown into a world of sadistic inmates and enigmatic powers, to live in constant fear of the lethal collar placed around his neck that is slowed only by winning in the prison's deathly games. Ganta must bet his life to survive in a ruthless place where it isn't always easy to tell friend from foe, all while trying to find the mysterious \"Red Man\" and clear his name, in Deadman Wonderland.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/75299.webp"},{"title":"Yakusoku no Neverland","synopsis":"Surrounded by a forest and a gated entrance, the Grace Field House is inhabited by orphans happily living together as one big family, looked after by their \"Mama,\" Isabella. Although they are required to take tests daily, the children are free to spend their time as they see fit, usually playing outside, as long as they do not venture too far from the orphanage—a rule they are expected to follow no matter what. However, all good times must come to an end, as every few months, a child is adopted and sent to live with their new family... never to be heard from again.\n\nHowever, the three oldest siblings have their suspicions about what is actually happening at the orphanage, and they are about to discover the cruel fate that awaits the children living at Grace Field, including the twisted nature of their beloved Mama.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1125/96929.webp"},{"title":"Hellsing Ultimate","synopsis":"There exist creatures of darkness and evil that plague the night, devouring any human unfortunate enough to be caught in their grasp. On the other side is Hellsing, an organization dedicated to destroying these supernatural forces that threaten the very existence of humanity. At its head is Integra Fairbrook Wingates Hellsing, who commands a powerful military and spends her life fighting the undead.\n\nIntegra's vast army, however, pales in comparison with her ultimate weapon: the vampire Alucard, who works against his own kind as an exterminator for Hellsing. With his new vampire servant, Seras Victoria, at his side, Alucard must battle not only monsters, but all those who stand to oppose Hellsing, be they in the guise of good or evil.\n\nIn a battle for mankind's survival, Hellsing Ultimate proves that appearances are not all they may seem, and sometimes the greatest weapon can come in the form of one's worst nightmare.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/7333.webp"},{"title":"Higurashi no Naku Koro ni","synopsis":"Keiichi Maebara has just moved to the quiet little village of Hinamizawa in the summer of 1983, and quickly becomes inseparable friends with schoolmates Rena Ryuuguu, Mion Sonozaki, Satoko Houjou, and Rika Furude. However, darkness lurks underneath the seemingly idyllic life they lead. \n\nAs the village prepares for its annual festival, Keiichi learns about the local legends surrounding it. To his horror, he discovers that there have been several murders and disappearances in the village in the recent years, and that they all seem to be connected to the festival and the village's patron god, Oyashiro. Keiichi tries to ask his new friends about these incidents, but they are suspiciously silent and refuse to give him the answers he needs. As more and more bizarre events occur, he wonders just what else his friends might be keeping from him, and if he can even trust them at all.\n\nWhen madness and paranoia begin taking root in Keiichi's heart, he will stumble straight into the mysteries at work in Higurashi no Naku Koro ni, a story that is told across multiple arcs.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/19634.webp"},{"title":"Shinsekai yori","synopsis":"Following a sudden outbreak of psychokinesis in 0.1% of the population, a rapid transformation swept the world. The godlike ability to manipulate matter remotely turned many power wielders to violence, inciting a long period of upheaval. Finally, after a chaotic era shaped by the rise and fall of oppressive regimes, the psychic humans were able to achieve a fragile peace by isolating their society, creating a new world bound by complex rules.\n\nIn the town of Kamisu 66, 12-year-old Saki Watanabe has just awakened to her powers and is relieved to rejoin her friends—the mischievous Satoru Asahina, the shy Mamoru Itou, the cheerful Maria Akizuki, and Shun Aonuma, a mysterious boy whom Saki admires—at Sage Academy, a special school for psychics. However, unease looms as Saki begins to question the fate of those unable to awaken to their powers, and the children begin to get involved with secretive matters such as the rumored Tainted Cats said to abduct children.\n\nShinsekai yori tells the unique coming-of-age story of Saki and her friends as they journey to grow into their roles in the supposed utopia. Accepting these roles, however, might not come easy when faced with the dark and shocking truths of society, and the impending havoc born from the new world.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/36775.webp"},{"title":"Koutetsujou no Kabaneri","synopsis":"The world is in the midst of the industrial revolution when horrific creatures emerge from a mysterious virus, ripping through the flesh of humans to sate their never-ending appetite. The only way to kill these beings, known as \"Kabane,\" is by destroying their steel-coated hearts. However, if bitten by one of these monsters, the victim is doomed to a fate worse than death, as the fallen rise once more to join the ranks of their fellow undead.\n\nOnly the most fortified of civilizations have survived this turmoil, as is the case with the island of Hinomoto, where mankind has created a massive wall to protect themselves from the endless hordes of Kabane. The only way into these giant fortresses is via heavily-armored trains, which are serviced and built by young men such as Ikoma. Having created a deadly weapon that he believes will easily pierce through the hearts of Kabane, Ikoma eagerly awaits the day when he will be able to fight using his new invention. Little does he know, however, that his chance will come much sooner than he expected...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/79164.webp"},{"title":"Monster","synopsis":"Dr. Kenzou Tenma, an elite neurosurgeon recently engaged to his hospital director's daughter, is well on his way to ascending the hospital hierarchy. That is until one night, a seemingly small event changes Dr. Tenma's life forever. While preparing to perform surgery on someone, he gets a call from the hospital director telling him to switch patients and instead perform life-saving brain surgery on a famous performer. His fellow doctors, fiancée, and the hospital director applaud his accomplishment; but because of the switch, a poor immigrant worker is dead, causing Dr. Tenma to have a crisis of conscience.\n\nSo when a similar situation arises, Dr. Tenma stands his ground and chooses to perform surgery on the young boy Johan Liebert instead of the town's mayor. Unfortunately, this choice leads to serious ramifications for Dr. Tenma—losing his social standing being one of them. However, with the mysterious death of the director and two other doctors, Dr. Tenma's position is restored. With no evidence to convict him, he is released and goes on to attain the position of hospital director. \n\nNine years later when Dr. Tenma saves the life of a criminal, his past comes back to haunt him—once again, he comes face to face with the monster he operated on. He must now embark on a quest of pursuit to make amends for the havoc spread by the one he saved.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/18793.webp"},{"title":"Tokyo Ghoul:re","synopsis":"Two years have passed since the CCG's raid on Anteiku. Although the atmosphere in Tokyo has changed drastically due to the increased influence of the CCG, ghouls continue to pose a problem as they have begun taking caution, especially the terrorist organization Aogiri Tree, who acknowledge the CCG's growing threat to their existence.\n\nThe creation of a special team, known as the Quinx Squad, may provide the CCG with the push they need to exterminate Tokyo's unwanted residents. As humans who have undergone surgery in order to make use of the special abilities of ghouls, they participate in operations to eradicate the dangerous creatures. The leader of this group, Haise Sasaki, is a half-ghoul, half-human who has been trained by famed special class investigator, Kishou Arima. However, there's more to this young man than meets the eye, as unknown memories claw at his mind, slowly reminding him of the person he used to be.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1063/95086.webp"},{"title":"Hellsing","synopsis":"Hellsing, an organization specializing in dealing with supernatural threats, is called in to eliminate a vampire that is turning the villagers of Cheddar into ghouls. To put an end to this, the leader of the organization, Sir Integra Fairbrook Wingates Hellsing, dispatches her most formidable asset: a powerful vampire known as Alucard.\n\nArmed with only a single handgun, Alucard wreaks havoc on the monsters plaguing Cheddar. However, a young police officer, Seras Victoria, gets caught up in the chaos and becomes mortally wounded as a result. Taking pity on the girl, Alucard gives her a choice: die as a human or live on as a vampire. Seras accepts his offer and begins a new life as a member of Hellsing.\n\nThough it was her decision, Seras struggles with the fact that she is no longer human. Nevertheless, she must embrace being a creature of the night soon if she wants to survive on the front lines in the fight between humans and the supernatural.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/19956.webp"},{"title":"Akira","synopsis":"Japan, 1988. An explosion caused by a young boy with psychic powers tears through the city of Tokyo and ignites the fuse that leads to World War III. In order to prevent any further destruction, he is captured and taken into custody, never to be heard from again. Now, in the year 2019, a restored version of the city known as Neo-Tokyo—an area rife with gang violence and terrorism against the current government—stands in its place. Here, Shoutarou Kaneda leads \"the Capsules,\" a group of misfits known for riding large, custom motorcycles and being in constant conflict with their rivals \"the Clowns.\"\n\nDuring one of these battles, Shoutarou's best friend Tetsuo Shima is caught up in an accident with an esper who finds himself in the streets of Tokyo after escaping confinement from a government institution. Through this encounter, Tetsuo begins to develop his own mysterious abilities, as the government seeks to quarantine this latest psychic in a desperate attempt to prevent him from unleashing the destructive power that could once again bring the city to its knees.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/82596.webp"},{"title":"Devilman: Crybaby","synopsis":"Devils cannot take form without a living host. However, if the will of an individual is strong enough, they can overcome the demon and make its power their own, becoming a Devilman.\n\nWeak and unassuming, Akira Fudou has always had a bleeding heart. So when his childhood friend Ryou Asuka asks for his help in uncovering devils, Akira accepts without hesitation. However, to Akira's surprise, the place they go to is Sabbath: an immoral party of debauchery and degeneracy. Amidst bloodshed and death, demons possess the partiers, turning their bodies into grotesque monsters, and begin wreaking havoc. In a reckless attempt to save his best friend, Akira unwittingly merges with the devil Amon and becomes a Devilman, gaining the power to defeat the remaining demons.\n\nThough it grants him great power, this new partnership awakens an insatiable and primeval part of Akira. Having the body of a devil but the same crybaby heart, Akira works alongside Ryou, destroying those that harm humanity and his loved ones.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/89973.webp"},{"title":"Shiki","synopsis":"Fifteen-year-old Megumi Shimizu dreamed of a glamorous life in the big city; however, her unexpected death in the quiet village of Sotoba marks the beginning of what appears to be a ferocious epidemic that turns the hot summer into a season of blood and terror. A young doctor named Toshio Ozaki  begins to doubt the nature of the disease and comes to understand that to discover the truth, he must abandon his humanity. Meanwhile, Natsuno Yuuki, an antisocial youth from the city, is haunted by the sudden death of Megumi and must realize the pain of friendship in the face of his own tragedy. Toshio and Natsuno form an unlikely pair as they work together to save Sotoba before it transforms into a ghost town of vampires.\n\nShiki, adapted from the horror novel written by Fuyumi Ono, goes beyond the average vampire story. It tells the tragic tale of survival in a world where one cannot easily distinguish between good and evil. Abandoned by God, the Shiki, as the vampires call themselves, have only their will to live as they clash with the fear of the paranoid/unbelieving villagers. Shiki explores the boundary that separates man from monster.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/21343.webp"},{"title":"Sankarea","synopsis":"Ever since he was a child, zombie-obsessed Chihiro Furuya has wanted an undead girlfriend. Soon enough, his love for all things zombie comes in handy when his cat Baabu gets run over, prompting Chihiro to try to make a resurrection potion and bring him back to life. During his endeavor, he sees a rich girl named Rea Sanka yelling into an old well every day about her oppressive life. After meeting and bonding with her, Chihiro is convinced by Rea to persevere in saving Baabu. Eventually, he succeeds with the help of the poisonous hydrangea flowers from Rea's family garden.\n\nUnaware of the potion's success and seeking to escape the burdens of her life, Rea drinks the resurrection potion, mistakenly thinking she will die. Though it doesn't kill her, the effects still linger and her death from a fatal accident causes her to be reborn as a zombie. With help from Chihiro, Rea strives to adjust to her new—albeit undead—life. \n\nFor a boy wanting a zombie girlfriend, this situation would seem like a dream come true. But in Sankarea, Chihiro's life becomes stranger than usual as he deals with Rea's odd new cravings and the unforeseen consequences of her transformation.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1487/95651.webp"},{"title":"Ajin","synopsis":"Mysterious immortal humans known as \"Ajin\" first appeared 17 years ago in Africa. Upon their discovery, they were labeled as a threat to mankind, as they might use their powers for evil and were incapable of being destroyed. Since then, whenever an Ajin is found within society, they are to be arrested and taken into custody immediately.\n\nStudying hard to become a doctor, Kei Nagai is a high schooler who knows very little about Ajin, only having seen them appear in the news every now and then. Students are taught that these creatures are not considered to be human, but Kei doesn't pay much attention in class. As a result, his perilously little grasp on this subject proves to be completely irrelevant when he survives an accident that was supposed to claim his life, signaling his rebirth as an Ajin and the start of his days of torment. However, as he finds himself alone on the run from the entire world, Kei soon realizes that more of his species may be a lot closer than he thinks.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/77968.webp"},{"title":"Kenpuu Denki Berserk","synopsis":"Born from the corpse of his mother, a young mercenary known only as Guts, embraces the battlefield as his only means of survival. Day in and day out, putting his life on the line just to make enough to get by, he moves from one bloodshed to the next.\n\nAfter a run-in with the Band of the Hawk, a formidable troop of mercenaries, Guts is recruited by their charismatic leader Griffith, nicknamed the \"White Hawk.\" As he quickly climbed the ranks in order to become the head of the offensive faction, Guts proves to be a mighty addition to Griffith's force, taking Midland by storm. However, while the band's quest for recognition continues, Guts slowly realizes that the world is not as black-and-white as he once assumed.\n\nSet in the medieval era, Kenpuu Denki Berserk is a dark, gritty tale that follows one man's struggle to find his own path, while supporting another's lust for power, and the unimaginable tragedy that begins to turn the wheels of fate.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/18520.webp"},{"title":"Paprika","synopsis":"The world of dreams can be an incredible window into the psyche, showing one's deepest desires, aspirations, and repressed memories. One hopeful tech lab has been developing the \"DC Mini,\" a device with the power to delve into the dreams of others. Atsuko Chiba and Kosaku Tokita have been tirelessly working to develop this technology with the hopes of using it to deeply explore patients' minds and help cure them of their psychological disorders.\n\nHowever, having access to the deepest corners of a person's mind comes with a tremendous responsibility. In the wrong hands, the DC Mini could be used as a form of psychological terrorism and cause mental breakdowns in the minds of targets. When this technology is stolen and people around them start acting strangely, Atsuko and Kosaku know they have a serious problem on their hands. Enlisting the help of Officer Konakawa, who has been receiving this experimental therapy, they search both the real and dream worlds for their mental terrorist.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1929/93629.webp"},{"title":"Tokyo Ghoul:re 2nd Season","synopsis":"After the conclusion of the Tsukiyama Family Extermination Operation, the members of the Commission of Counter Ghouls (CCG) have grown exponentially in power and continue to pursue their goal of exterminating every ghoul in Japan. Having resigned from Quinx Squad, the now seemingly emotionless Haise Sasaki begins taking on more and more tasks from the CCG with no regard to the difficulty. Despite his vacant expressions, Ken Kaneki's memories are resurfacing in Haise, leaving him in a state of internal conflict. Meanwhile, his new coldhearted behavior is affecting the people around him. Quinx Squad are left in shambles, having to cope with the death of one of their members without the support of their former mentor.\n\nAmidst this turmoil, both Quinx Squad and Haise must continue to fulfill their duties to the CCG, whether willingly or not. However, the presence of a mysterious group behind the CCG has been made known to Haise, and certain whispers of corruption have not gone unheard by the Quinx Squad as well.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1271/95623.webp"},{"title":"Blood+","synopsis":"Saya Otonashi is a seemingly ordinary girl living a mundane life with her adoptive family in Okinawa City. In fact, her only peculiarities are suffering from anemia and being unable to remember any of her life beyond the previous year.\n\nHowever, Saya's forgotten past quickly comes back to haunt her—one night, she is attacked at school by a creature that feeds on human blood. Just when all hope seems lost, a mysterious man named Haji appears and fends off the creature temporarily. But when her rescuer forces her to drink his blood, Saya suddenly enters a trance and slays the monster with ease, using her own blood as a catalyst. \n\nSaya then learns of an organization named Red Shield, founded for the sole purpose of defeating the hellish beasts. Now Saya and Haji must work together with Red Shield to fight these fearsome monsters and unlock the secrets to the girl's past.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/10183.webp"},{"title":"Gakkougurashi!","synopsis":"Yuki Takeya loves her school so much that she does not want to ever leave! Megurigaoka High School is a unique and lively place where Yuki enjoys her carefree life as a third-year high school student and member of the School Living Club. The club, consisting of the president Yuuri Wakasa, the athletic Kurumi Ebisuzawa, the mature junior Miki Naoki, the supervising teacher Megumi Sakura, and the club dog Taroumaru, prides itself on making the most of life at school. However, this illusion of endless bliss is just a bubble waiting to be burst because Yuki is unable to perceive what is truly happening around her. In reality, all is not as it seems—the real purpose of the School Living Club is to escape from the shocking and disturbing truth: the girls are in the middle of a zombie apocalypse and have barricaded themselves inside the school as the sole survivors.\n\nBased on the manga by Kaihou Norimitsu, Gakkougurashi! follows a group of girls who are forced to adapt to a post-apocalyptic life all by themselves. They have no means of contact with the outside world and are surrounded by hostile undead waiting to devour them. The girls must not only contend with the challenge of survival; they must also strive to maintain a false appearance of normality in Yuki's presence.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1798/91548.webp"},{"title":"Tasogare Otome x Amnesia","synopsis":"Seikyou Private Academy, built on the intrigue of traditional occult myths, bears a dark past—for 60 years, it has been haunted by a ghost known as Yuuko, a young woman who mysteriously died in the basement of the old school building. With no memory of her life or death, Yuuko discreetly finds and heads the Paranormal Investigations Club in search of answers.\n\nA chance meeting leads Yuuko to cling to diligent freshman Teiichi Niiya, who can see the quirky ghost, they quickly grow close, and he decides to help her. Along with Kirie Kanoe, Yuuko's relative, and the oblivious second year Momoe Okonogi, they delve deep into the infamous Seven Mysteries of the storied school.\n\nTasogare Otome x Amnesia tells a unique tale of students who work together to shed light on their school's paranormal happenings, all the while inching closer to the truth behind Yuuko's death.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/64435.webp"},{"title":"Perfect Blue","synopsis":"J-pop idol group CHAM! has spent the last two years entertaining its fans. Sadly, all good things must come to an end, and CHAM! must see one of its members, Mima Kirigoe, leave the group to pursue her acting career. While Mima's choice is met with a mixed response, she hopes her fans will continue to support her.\n\nHowever, Mima's life begins to change drastically after her departure from the group. Wanting to shed her pop-idol image, she takes on a role in a crime drama series, and her career as an actress gradually becomes more demanding and taxing for both Mima and her manager, Rumi Hidaka. To add to Mima's growing unease, an obsessed fan who is incapable of accepting that Mima has quit being an innocent idol, begins stalking her; a new anonymous website begins to impersonate her life with intricate detail; and CHAM! also appears to be doing better without her. One by one, each disturbing development drives Mima to become increasingly unhinged and unable to distinguish reality from fantasy.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/79127.webp"},{"title":"Satsuriku no Tenshi","synopsis":"With dead and lifeless eyes, Rachel Gardner wishes only to die. Waking up in the basement of a building, she has no idea how or why she's there. She stumbles across a bandaged murderer named Zack, who is trying to escape. After promising to kill her as soon as he is free, Rachel and Zack set out to ascend through the building floor by floor until they escape.\n\nHowever, as they progress upward, they meet more twisted people, and all of them seem familiar with Rachel. What is her connection to the building, and why was she placed in it? Facing a new boss on each floor, can Rachel and Zack both achieve their wishes?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1862/95624.webp"},{"title":"Jigoku Shoujo","synopsis":"Have you heard of Hell Correspondence? Those with a powerful grudge may only access this mysterious website at midnight, allowing them to enter anyone's name and have that person be ferried straight to hell. Ai Enma, the Hell Girl, will not judge whether or not the chosen target deserves punishment; she will merely exact revenge on them for you. Not much is known about this young girl other than that she swiftly carries out her tasks with the help of three straw dolls. There is just one catch, however—as payment for carrying out such a request, the user must condemn themselves to an afterlife in hell.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/71958.webp"},{"title":"Gantz","synopsis":"Thought your life was bad? Sometimes, death is worse. There is no salvation, peace, nor god waiting to receive you into their care. But wait, a god? Maybe you are talking about that big black ball stuck in the room with you. Now you are thrown into a game, fighting green aliens and robot monsters for the chance to survive.\n\nWhen Kei Kurono is killed, he thus finds himself caught in such a game—a test of his skills, morals, and will to survive. His life is not his own; his death is spat and trampled upon over and over again. What happens if he does not listen? God knows.\n\nA word of warning: Gantz is not for the faint-hearted, but neither is it as simple as it looks. Gore, rape, and violence is rampant, as are portrayals of greed, violence, and all the ugliness that one sees in society today.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/5998.webp"},{"title":"Corpse Party: Tortured Souls - Bougyakusareta Tamashii no Jukyou","synopsis":"Nine students gather in their high school at night to bid farewell to a friend. As is customary among many high school students, they perform a sort of ritual for them to remain friends forever, using small paper charms shaped like dolls.\n\nHowever, the students do not realize that these charms are connected to Heavenly Host Academy—an elementary school that was destroyed years ago after a series of gruesome murders took place, a school that rests under the foundation of their very own Kisaragi Academy. Now, trapped in an alternate dimension with vengeful ghosts of the past, the students must work together to escape—or join the spirits of the damned forever.\n\nA feast for mystery fanatics, gore-hounds, and horror fans alike, Corpse Party: Tortured Souls - Bougyakusareta Tamashii no Jukyou shows a sobering look at redemption, sacrifice, and how the past is always right behind, sometimes a little too close for comfort.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/78811.webp"},{"title":"Berserk","synopsis":"Now branded for death and destined to be hunted by demons until the day he dies, Guts embarks on a journey to defy such a gruesome fate, as waves of beasts relentlessly pursue him. Steeling his resolve, he takes up the monstrous blade Dragonslayer and vows to exact vengeance on the one responsible, hunting down the very man he once looked up to and considered a friend.\n\nAlong the way, he encounters some unlikely allies, such as a small elf named Puck, and Isidro, a young thief looking to learn swordsmanship from the former mercenary. As the ragtag group slowly comes together after having decided to join Guts in his quest, they will face incredible danger unlike anything they have ever experienced before.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/79352.webp"},{"title":"Blood-C","synopsis":"Peaceful schoolgirl by day, fearsome monster slayer by night, Saya Kisaragi is leading a split life. Equipped with a ceremonial sword given to her by her father for sacred tasks, she vanquishes every monster who dares threaten her quiet little village. But all too soon, Saya's reality and everything she believes to be true is tested, when she overhears the monsters speak of a broken covenant—something she knows nothing about. And then, unexpectedly, a strange dog appears; it asks her to whom she promised to protect the village, curious as to what would happen if she were to break that promise. Tormented by unexplainable visions and her world unraveling around her, we travel with Saya through her struggle to find a way to the truth in a village where nothing is as it seems.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/31649.webp"},{"title":"Danganronpa 3: The End of Kibougamine Gakuen - Mirai-hen","synopsis":"After Makoto Naegi and his fellow survivors escaped Hope's Peak Academy to the world beyond, they soon join the Future Foundation, an organization dedicated to combating despair. Just when all seems to be looking up, Naegi is arrested and tried for betrayal due to defending a malicious group of Remnants of Despair. Standing before all of the Future Foundation executives, he finds himself, along with Kyouko Kirigiri and Aoi Asahina, facing an unknown fate.\n\nThe matter at hand only escalates when the organization's supposedly impenetrable security is hacked into by a\nfamiliar face: Monokuma. Much to Naegi's horror, the mechanical bear immediately announces the beginning of a new killing game, as moments later, the first victim appears as a signal for despair to resume its brutal conquest.\n\nIn the conclusion to Danganronpa's gripping tale of hope and despair, Naegi, the Super High School-Level Lucky Student, must once again unravel the mystery as his colleagues and friends begin falling around him. However, there are no more class trials; among the 16 desperate participants, there is only one killer—and their death means the end of this infernal game.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/80931.webp"},{"title":"Ajin 2nd Season","synopsis":"After escaping certain death, Kei Nagai and his new companion Kou Nakano plot revenge on Satou, their fellow Ajin who is hellbent on world domination. As Satou embarks on a string of public executions, the human race rushes to come up with a solution to stop the immortal villain.\n\nKei discovers unlikely allies in the form of two former adversaries: high-ranking government official Yuu Tosaki, whose extensive research on Ajin gives him a tactical advantage in the fight against Satou, and Tosaki's Ajin assistant Izumi Shimomura. As his faction continues to gather allies, Kei races against time to put a stop to Satou's crusade before it brings about an end to civilization as he knows it.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/12/81858.webp"},{"title":"Ghost Hunt","synopsis":"While at school, Taniyama Mai and her friends like to exchange ghost stories. Apparently, there is an abandoned school building on their campus that is the center of many ghost stories. During the story, they are interrupted by a mysterious male figure. The person turns out to be Shibuya Kazuya, a 17-year-old who is president of the Shibuya Psychic Research Company. He was called by the principal to investigate the stories surrounding the abandoned school building.\n\nThe next day, on the way to school, Mai passes the school building in question. While examining a strange camera she spotted inside, she gets surprised by Kazuya's assistant. Unknowingly interfering with the investigation, Mai breaks the camera and Kazuya's assistant gets injured.\n\nKazuya forcefully hires Mai in order to pay for the camera and replace his injured assistant. From that point on, Mai begins to learn about the paranormal world and the profession of ghost hunting.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/73908.webp"},{"title":"Danganronpa 3: The End of Kibougamine Gakuen - Zetsubou-hen","synopsis":"Hope's Peak Academy's unconventional class 77-B is about to have an even more eccentric addition: Chisa Yukizome, an alumna with the title of Super High School-Level Housekeeper—and their new homeroom teacher. Cheerful, passionate, and capable, Chisa immediately sets about correcting the students' problematic behavior and strengthening their relationships. It may not be easy dealing with diverse pupils ranging from princesses and nurses to yakuza and impossibly lucky students, but anything is possible with the power of hope.\n\nMeanwhile, Hajime Hinata, an unremarkable boy from the school's Reserve Course, longs for a talent. One day, he has an unexpected meeting with class 77-B's Super High School-Level Gamer Chiaki Nanami, who presents to him a new, hope-filled outlook on life. However, unbeknownst to him, the school's upper echelon is about to execute a sinister project centered around Hajime that will bring Hope's Peak—and the rest of the world—to its knees.\n\nZetsubou-hen chronicles the daily lives carried out at the talent-cultivating academy, and the darkness that lurks beneath. As despair slowly infects hope, plans are put into motion to start the Biggest, Most Awful, Most Tragic Event in Human History, and the end begins.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/80932.webp"},{"title":"Mayoiga","synopsis":"A bus full of eccentric individuals is headed towards the urban legend known as Nanaki Village, a place where one can supposedly start over and live a perfect life. While many have different ideas of why the village cannot be found on any map, or why even the police cannot pinpoint its location, they each look forward to their new lives and just what awaits them once they reach their destination.\n\nAfter a few mishaps, they successfully arrive at Nanaki Village only to find it completely abandoned. Judging from the state of disrepair, it has been vacant for at least a year. However, secrets are soon revealed as some of the group begin to go missing while exploring the village and amidst the confusion, they find bloody claw marks in a forest. As mistrust and in-fighting break out, will they ever be able to figure out the truth behind this lost village?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/79413.webp"},{"title":"Mononoke","synopsis":"The \"Medicine Seller\" is a deadly and mysterious master of the occult who travels across feudal Japan in search of malevolent spirits called \"mononoke\" to slay. When he locates one of these spirits, he cannot simply kill it; he must first learn its Form, its Truth, and its Reason in order to wield the mighty Exorcism Sword and fight against it. He must begin  his strange exorcisms with intense psychological analysis and careful investigative work—an extremely dangerous step, as he must first confront and learn about the mononoke before he even has the means to defeat it.\n\nThe Medicine Seller's journey leads him to an old-fashioned inn where Shino, a pregnant woman, has finally found a place to rest. The owner has reluctantly placed her in the last vacant room; however, as she settles in, it quickly becomes clear that the room is infested by a lethal band of mononoke, the Zashiki Warashi. With his hunter's intuition, the Medicine Seller begins his investigation to discover the Form, the Truth, and the Reason before the Zashiki Warashi can kill again.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/20713.webp"},{"title":"Umineko no Naku Koro ni","synopsis":"Considered as the third installment in the highly popular When They Cry series by 07th Expansion, Umineko no Naku Koro ni takes place on the island of Rokkenjima, owned by the immensely wealthy Ushiromiya family. As customary per year, the entire family is gathering on the island for a conference that discusses the current financial situations of each respective person. Because of the family head's poor health, this year involves the topic of the head of the family's inheritance and how it will be distributed.\n\nHowever, the family is unaware that the distribution of his wealth is the least of Ushiromiya Kinzou's (family head) concerns for this year's family conference. After being told that his end was approaching by his longtime friend and physician, Kinzou is desperate to meet his life's true love one last time: the Golden Witch, Beatrice. Having immersed himself in black magic for many of the later years in his life, Kinzou instigates a ceremony to revive his beloved upon his family's arrival on Rokkenjima. Soon after, a violent typhoon traps the family on the island and a string of mysterious murders commence, forcing the eighteen people on the island to fight for their lives in a deadly struggle between fantasy and reality.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/17709.webp"},{"title":"Terra Formars","synopsis":"During the 21st century, humanity attempted to colonize Mars by sending two species which could endure the harsh environment of the planet to terraform it—algae and cockroaches. However, they did not anticipate the species' remarkable ability to adapt. Now in the 26th century, a lethal disease known as the Alien Engine Virus has arrived on Earth, and the cure is suspected to be found only on Mars. The problem is, Mars in the present is overrun by creatures known as \"Terraformars,\" incredibly powerful and intelligent humanoid cockroaches that mutated from those originally sent to the planet. \n\nThe Annex I team, consisting of a hundred men and women genetically enhanced with characteristics of powerful organisms from earth, has been sent to Mars on a mission to find the cause of the Alien Engine Virus and to help cure humanity—signalling the start of the crew's fight for survival.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/67117.webp"},{"title":"Elfen Lied: Tooriame nite Arui wa, Shoujo wa Ikani Shite Sono Shinjou ni Itatta ka? - Regenschauer","synopsis":"Having been accepted into the Kaede Inn, Nana struggles to find some way to contribute, though she inadvertently brings more trouble than assistance. However, Nana's worries are directed more towards fellow resident Nyu, whom she had only known as Lucy, the violent Diclonius. Fearful that Nyu will unleash the same horrific savagery—violence that scars Nana to this day—upon those close to her, Nana faces a dilemma: attempt to live peacefully alongside Lucy with all the uncertainty that that entails or dispose of the source of her worries, shattering the relationships she has formed at the inn. As Nana struggles to come to a decision, Nyu recalls a painful memory of one of her dearest friends and one of her greatest rivals.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/80498.webp"},{"title":"Tokyo Ghoul: \"Jack\"","synopsis":"Who needs school, who needs baseball, and who needs friends? That's the attitude of high school delinquent, Taishi Fura, who became a loner after falling out with his peers. One day, he witnesses the brutal attack of a ghoul, which left one of his former friends in the hospital and the other dead. Determined to avenge them, Fura decides to pursue the man-eating monster.\n\nHis efforts allow him to cross paths with Kishou Arima, a quiet student who also attends his high school. Arima, however, is no ordinary student. Despite his young age, he is a full-fledged investigator of the CCG, a government task force that strives to deal with the ghoul threat. Together, Fura and Arima hunt down the ghoul, known as Lantern, but it soon becomes apparent the monster may be closer than anyone suspects.\n\nIn this side story, Tokyo Ghoul: \"Jack\" offers a glimpse into the past of Kishou Arima, well before he ever became the CCG's feared God of Death.","img":"https://cdn.myanimelist.net/images/anime/13/76048.webp"},{"title":"Ousama Game The Animation","synopsis":"It can be rough transferring to a new school—even more so if you don't want to make any friends, like Nobuaki Kanazawa. But the reason for his antisocial behavior soon becomes clear when his class receives a text from someone called \"The King.\" Included are instructions for the \"King's Game,\" and all class members must participate. Those who refuse to play, quit halfway, or don't follow an order in the allotted time of 24 hours will receive a deadly punishment.\n\nHaving played the game before and watched as those around him died, Nobuaki tries to warn his clueless classmates. Unfortunately, they only believe him after the King's Game claims its first casualties. Stuck in a horrific situation with no chance of escape, Nobuaki has a choice: put his own survival above those around him, or do what he couldn't before and save his classmates.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/88190.webp"},{"title":"Mnemosyne: Mnemosyne no Musume-tachi","synopsis":"Immortality is something many people would wish for. But would it be such a coveted ability if people knew they would be subject to countless attacks because of it? Such is the case for Rin Asougi, an immortal private investigator, because there is no shortage of people who want her dead. Over the centuries, she has met many grisly ends, but each time, she returns to life as if nothing had happened.\n\nIn 1990, while looking for a lost cat, Rin runs into Kouki Maeno, a man who feels that his memories are wrong. Agreeing to help him, Rin discovers that Kouki is not what he seems, all the while drawing closer to her true enemy. This adversary knows Rin and her kind all too well, and if she dies by his hand, she may stay dead permanently.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/10918.webp"},{"title":"Boogiepop wa Warawanai (2019)","synopsis":"Hushed exchanges among the female student populace of Shinyo Academy center around an enigmatic supernatural entity. This entity is Boogiepop, a Shinigami who is rumored to murder people at the height of their beauty before their allure wanes. Few know of his true nature: a guardian who, between periods of dormancy, manifests as the alter ego of a high school girl named Touka Miyashita to fend off \"the enemies of the world.\" Now, a string of mysterious disappearances—presumed by the school to be merely runaways—has caused Boogiepop to awaken. But somewhere in the academy, a menacing creature hides, waiting for its opportune moment to strike.\n\nBoogiepop wa Warawanai subtly explores the intrinsic associations between human beings and their perception of time, while delving into its characters' complex relationships, emotions, memories, and pasts.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1135/95454.webp"},{"title":"Another: The Other - Inga","synopsis":"Shortly before the start of a new semester, Misaki Fujioka visits her twin sister Mei Misaki in Yomiyama City. The girls make full use of the last days of summer, roaming around a heat-weary town and visiting various places including a shopping center and shooting stall. When they prowl around her basement, Mei expresses uneasiness about her new class, which is said to be cursed.\n\nCraving more entertainment, the twins decide to pay a visit to the local amusement park. But the leisure of a sleepy summer day could soon turn woeful as Mei sees the color of death on her sister—an unmistakable omen that a tragedy is bound to strike.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/42051.webp"},{"title":"Happy Sugar Life","synopsis":"Satou Matsuzaka is a beautiful high schooler who has a reputation for being permissive with men. However, a chance encounter with a young girl named Shio Koube makes Satou realize that this is her first and only true feeling of love.\nTelling others that she lives with her aunt, Satou secretly shares an apartment with Shio. Despite her innocent appearance, Satou is willing to do anything to protect her beloved, resorting to desperate measures to ensure that their \"happy sugar life\" remains intact.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1386/103920.webp"},{"title":"Berserk: Ougon Jidai-hen III - Kourin","synopsis":"The Band of the Hawk has dwindled in the year since Guts left them on his journey to forge his own destiny. Unaware of their fate, Guts returns to the Hawks—now being led by his former ally Casca—after a rumor about them passes his way. Once the saviors of the kingdom of Midland, the Band of the Hawk are now hunted as they desperately fight for their lives while plotting to free their leader, Griffith, after he was imprisoned for committing treason. But the man they save is far from the Griffith they remember.\n\nGriffith is a shell of his former charismatic self after a year of continuous, horrific torture. No longer able to walk, speak, or even hold a sword, he has nothing but the small, strange trinket, the Crimson Behelit, that will not leave him. The entire Band of the Hawk want to rise to greatness once more, but how much are they willing to sacrifice to return to their past glory? It doesn't seem possible, but when Griffith's heart darkens and a solar eclipse blackens the sky, the Behelit offers a choice that will leave the Band of the Hawk with a blood-soaked fate that will haunt them for the rest of their days.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/41305.webp"},{"title":"Pupa","synopsis":"Abandoned by their abusive parents and with only each other to depend on, siblings Utsutsu and Yume Hasegawa find themselves led astray by beautiful red butterflies that have appeared in their world. Unbeknownst to them, these crimson winged heralds trumpet the beginning of a cannibalistic nightmare—a mysterious virus known as Pupa is about to hatch.\n \nAfter succumbing to the full effects of Pupa, Yume undergoes a grotesque metamorphosis into a monstrous creature with an insatiable desire for flesh; Utsutsu, on the other hand, is only partially affected, gaining remarkable regenerative powers instead. Reaffirming the resolve to keep the promise he made to himself years ago, Utsutsu is willing to sacrifice everything in order to always be there for his precious little sister.\n\nPupa tells the story of a loving brother's desperate struggles to save his sister while protecting the world from her uncontrollable hunger.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/54395.webp"},{"title":"Berserk: Ougon Jidai-hen II - Doldrey Kouryaku","synopsis":"The Band of the Hawk and their enigmatic leader Griffith continue winning battle after battle as their prestige throughout the kingdom of Midland grows. But their latest task is one that has seen failure from everyone who has attempted it: the subjugation of the impenetrable fortress of Doldrey. \n\nBut with members like Guts—the captain of the Hawks' raiders who can easily fell 100 men with his gigantic sword—such tasks prove to be trivial. However, in the aftermath of the battle, Guts decides to leave the Hawks in order to pursue his own dream and bids farewell to his companions, despite Griffith's attempts to make him stay. This single event causes Griffith to lose his composure, and leads him to make a decision that will alter his and the Hawks' fates forever.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/37193.webp"},{"title":"Shingetsutan Tsukihime","synopsis":"Shiki Toono sustained a life threatening injury as a child, and due to that incident he was sent away from the Toono household and was given to a relative to be raised. Years later, when Shiki is in high school, the head of the Toono household—his father—dies, and he is ordered to move back in by his sister Akiha, who is the new head of the household. However, Shiki holds a huge secret. Ever since that injury, he has been seeing lines on objects, and only with a special pair of glasses is he able to stop seeing them. Also he is unable to remember anything well from the time before his accident. The day he moves back to the Toono household is the day he stumbles upon a woman named Arcueid Brunstud and decapitates her with one stab of his knife in a temporary fit of insanity. When she suddenly showed up beside him later alive and well, and ask him to be her bodyguard, Shiki's journey to unravel the mysteries of his past begins.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/20669.webp"},{"title":"Gantz 2nd Stage","synopsis":"Kurono Kei and his ex-elementary school classmate, Kato Masaru have survived the first two ordeals that the unknown black sphere Gantz has sent them through. Exploding body parts, struggling to stay alive till the last seconds and seeing your fellow comrades fall in a pile of blood and gore are norm to them now. They are aware now that Gantz can call them up along with any new deeds, at any time for another confrontation with aliens.\n\nWill Kato's experiences in the Gantz world give him the same courage in the real world? With fellow veteran Gantzer Kei Kishimoto currently staying at Kurono's home as his \"adopted pet\", can Kurono stave off his growing lust for her mammaries?\n\nWhat the heck is Gantz?\n\n(Source: anime-source.com)","img":"https://cdn.myanimelist.net/images/anime/10/23247.webp"},{"title":"Tokyo Ghoul: \"Pinto\"","synopsis":"The OVA adapts the third story in the Tokyo Ghoul: Hibi novel when Shuu Tsukiyama and Chie Hori met.","img":"https://cdn.myanimelist.net/images/anime/3/78666.webp"},{"title":"Jigoku Shoujo Futakomori","synopsis":"Ai Enma and her companions continue to offer their service of revenge against those who have wronged others, and the price is as steep as ever—for damning the offender to hell, the person exacting vengeance is sent to the abyss as well. As they cast soul after soul into the darkness, a new sinister force is watching them: a little girl named Kikuri.\n\nWhile Ai continues her duties, she meets a boy named Takuma Kurebayashi, known as the \"Devil's Child\" because of the horrific events that occur around him. Unfortunately, Takuma's reputation leads the townspeople to use him as a scapegoat for those who have been ferried off to hell. When things quickly spiral out of control, Ai must find a way to bring an end to this senseless violence, as it poses a threat to her very existence.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/86975.webp"},{"title":"Shingeki no Kyojin: Lost Girls","synopsis":"Bundled with the 24th, 25th, and 26th volumes of the Shingeki no Kyojin manga. ","img":"https://cdn.myanimelist.net/images/anime/3/89417.webp"},{"title":"Zombie-Loan","synopsis":"Do you know when you are going to die? Michiru Kita does, as she has the ability to see a \"ring of death\" on the necks of those around her—and the darker the ring, the closer one is to death. \n\nOne day, she notices that two boys in her class, Chika Akatsuki and Shito Tachibana, have completely black rings. Seeking to warn them of their impending demise, she stumbles onto their secret: they are already dead, but are kept alive due to a contract with Zombie-Loan, a mysterious loan office. Of course, nothing comes without a price, as the boys must hunt down and kill zombies in order to pay off their debt. And once they learn about Michiru's \"Shinigami Eyes,\" they drag her into their crazy world.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/21539.webp"},{"title":"Mahou Shoujo Site","synopsis":"Every day, Aya Asagiri thinks about killing herself. She is bullied relentlessly at school, and at home, her older brother Kaname physically abuses her to relieve the academic stress put on him by their father.\n\nOne night, as she lies awake wishing for death, a mysterious website called Magical Girl Site appears on her laptop, promising to give her magical powers. At first, she dismisses it as a creepy prank, but when she finds a magical gun in her shoe locker the next day, she doesn't know what to believe. Deciding to take it with her, she soon runs into her bullies once again. But this time, desperate for anything to save her, she uses the gun—and her assailants are transported to a nearby railroad crossing, where they are run over. \n\nAya's conscience is unable to handle the fact that she murdered two of her classmates with magic, and she desperately tries to understand the situation. However, when she finds herself in trouble again, she is saved by Tsuyuno Yatsumura, a classmate who can use magic to stop time. This duo has a lot to do: not only do they have to fight alongside and against other magical girls, but they also need to uncover the truth behind the website and the apocalyptic event known as \"The Tempest\" that is soon to occur.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1456/90843.webp"},{"title":"Dorohedoro","synopsis":"Hole—a dark, decrepit, and disorderly district where the strong prey on the weak and death is an ordinary occurrence—is all but befitting of the name given to it. A realm separated from law and ethics, it is a testing ground to the magic users who dominate it. As a race occupying the highest rungs of their society, the magic users think of the denizens of Hole as no more than insects. Murdered, mutilated, and made experiments without a second thought, the powerless Hole dwellers litter the halls of Hole's hospital on a daily basis.\n\nPossessing free access to and from the cesspool, and with little challenge to their authority, the magic users appear indomitable to most—aside for a few. Kaiman, more reptile than man, is one such individual. He hunts them on a heedless quest for answers with only a trusted pair of bayonets and his immunity to magic. Cursed by his appearance and tormented by nightmares, magic users are his only clue to restoring his life to normal. With his biggest obstacle being his stomach, his female companion Nikaidou, who runs the restaurant Hungry Bug, is his greatest ally.\n\nSet in a gritty world of hellish design, Dorohedoro manages a healthy blend of comedy and lightheartedness with death and carnage. Taking plenty of twists and turns while following the lives of Hole's residents, it weaves a unique world of unearthly origin and dreary appearance not for the squeamish or easily disturbed.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1740/104786.webp"},{"title":"Vampire Hunter D (2000)","synopsis":"The story revolves around D, the infamous \"dunpeal\" (born of a vampire father and a human mother) outcast and renowned vampire hunter. His prowess at hunting the creatures of the night allowing his acceptance among humans, he is called upon to locate Charlotte Elbourne, the lovely daughter of an affluent family who has been mysteriously kidnapped.\n\nWhen the sun sets, the hunt goes on! Charlotte's father offers a rich bounty, be she dead or alive, a task D willingly accepts, even with notorious Markus brothers and their gang of bounty hunters seeking the prize as well. Amidst the chase and unknown to all lurks, a sinister evil which has been secretly manipulating their every move and has set a chilling trap that none will expect and few will survive. With the tables turned and the secrets revealed, the hunters could quickly become the hunted!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/21432.webp"},{"title":"Deadman Wonderland: Akai Knife Tsukai","synopsis":"Two years after the catastrophic tidal wave that swept over Japan, police officer Kiyomasa Senji is trying to make the world a safer place. Using his Branch of Sin powers, he stops criminals in whatever ways he can. After rescuing a boy named Izuru Tsukiyoshi from a gang called Goreless Peace, the conflict between Kiyomasa and his adversaries heats up rapidly, to the point of being explosive.\n\nOffering a glimpse into the past of the future Deadman, the story follows Senji, helping to further develop the reasoning that drives his actions later in life.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/33033.webp"},{"title":"Shinrei Tantei Yakumo","synopsis":"Haruka Ozawa's sophomore year is getting seriously scary. One of her friends is possessed, another has committed suicide and Haruka could be the next one to flunk the still-breathing test. Her only way out of this potentially lethal dead end? Yakumo Saito, an enigmatic student born with a mysterious red eye that allows him to see and communicate with the dead. But the deceased don't always desist and some killers are more than ready to kill again to keep dead men from telling any more tales. That doesn't stop Haruka's knack for digging up buried secrets, and there's even more evidence of bodies being exhumed by both Yakumo's police contact and an investigative journalist with a newly made corpse in her closet! Can this pair of anything but normal paranormal detectives solve the ultimate dead case files or will they end up in cold storage themselves? \n\n(Source: Sentai Filmworks)","img":"https://cdn.myanimelist.net/images/anime/13/35829.webp"},{"title":"Berserk 2nd Season","synopsis":"Demons have now become commonplace around the kingdom of Midland, which has fallen into chaos. The swordsman Guts still cannot stay in one place for long due to his demonic brand. He could always manage to protect himself when he was alone, but now he has the added challenge of protecting former Commander Casca, a shell of her former self who neither remembers nor trusts him. They never have a moment's rest with the constant threat of demons, and they need a place where Casca will be safe till they find a way to heal her. Their elf ally, Puck, tells of the mystical land of Elfhelm, which is supposed to be a safe haven from the demons that ravage the lands. Tired and with only a vague hope, they struggle on to find a place to live—and they still need to find those responsible for the madness they are forced to endure. \n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/12/85296.webp"},{"title":"Danganronpa 3: The End of Kibougamine Gakuen - Kibou-hen","synopsis":"The Future Foundation is in shambles after the Final Killing Game and the revelation of the true culprit. As a desperate plot arises from one of the survivors to rid the world of despair once and for all, the remaining Future Foundation members must band together to stop this atrocity from taking place. Fortunately, they find themselves with help from a group of unlikely allies as they race against the clock to stop their world from being changed.\n\nIn this finale to the Hope's Peak storyline of the Danganronpa series, the players in this neverending death game begin to understand the true meaning behind despair, hope, and atonement.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1295/91106.webp"},{"title":"Zetman","synopsis":"The story starts off with a face-off between two rival heroes, ZET and ALPHAS, and then traces their origins - Jin Kanzaki, a young man with the ability to transform into a superhuman being known as ZET, and Kouga Amagi, a young man with a strong sense of justice who uses technology to fight as ALPHAS.\n\nThe fates of these two men and those around them intertwine as they fight to protect mankind and destroy monstrous abominations known as Players.\n\n(Source: ytv ENGLISH)","img":"https://cdn.myanimelist.net/images/anime/7/35529.webp"},{"title":"Shikabane Hime: Aka","synopsis":"After being brutally murdered along with her family, Makina Hoshimura turns into a Shikabane Hime, a living corpse contracted to the Kougon Cult, in order to exert revenge on the mysterious undead organization responsible for her death. She is assisted in this task by Keisei Tagami, her contracted priest and former friend. This series follows the story of Keisei's younger brother Ouri, a boy with an unusual attraction to death, who slowly discovers his brother's secret and gets dragged into the world of the Shikabanes. \n\n(Source: Wikipedia, edited)","img":"https://cdn.myanimelist.net/images/anime/10/20544.webp"},{"title":"Corpse Party: Missing Footage","synopsis":"Someday a group of classmates will perform a charm at night after school—the Happy Sachiko charm. This paper doll ritual is meant to make them stay friends forever, but performing it incorrectly will lead them to be dragged down into a dilapidated phantom of Tenjin Elementary School, which had been torn down years ago. Trapped until they can reunite and perform the charm correctly, the students will have to solve the mystery of the haunted school in order to make it out alive.\n\nBefore that ill-fated event, however, the friends led ordinary lives. Corpse Party: Missing Footage reveals an insight into the students' lives on the day before they were thrust into a waking nightmare.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/38331.webp"},{"title":"Juubee Ninpuuchou","synopsis":"Jubei Kibagami wanders feudal Japan as an itinerant swordsman-for-hire. After a past betrayal left him masterless, he has no more patience for warring political factions and their schemes. Unfortunately, both past and political intrigue collide when he meets and saves a female ninja named Kagero from a man with the ability to make his body as hard as stone.\n\nThe sole survivor of a ninja clan, Kagero continues her team's last mission: investigate a mysterious plague that wiped out an entire village. Jubei wants nothing to do with this, but the stone-like man's allies, a group of ninja with supernatural powers known as the Devils of Kimon, make that option difficult. To make matters worse, a government spy poisons Jubei, promising him an antidote if he can unravel the true intentions of the Devils of Kimon and their connection to the plague. The trail leads to shadow leaders, a plot to overthrow the government, and a man that Jubei thought he would never see again.","img":"https://cdn.myanimelist.net/images/anime/6/66727.webp"},{"title":"Gakkou no Kaidan","synopsis":"Years ago, all of the ghosts in a haunted schoolhouse were banished by a certain student. Now, they're back—and they want revenge...\n \nSatsuki and Keiichirou Miyanoshita are two siblings recovering from the tragic loss of their mother. After moving to their mother's hometown, they learn that the local school they have transferred to is an old building—one said to be haunted. Despite initially brushing it off as a silly rumor, the two soon discover that ghosts are indeed real and that they're after them! Gakkou no Kaidan is the creepy tale of the lives of these siblings and their newfound friends as they try to survive the school's ghosts—with a little help from their pet cat along the way.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/18360.webp"},{"title":"Blood: The Last Vampire","synopsis":"Teropterids are evil beasts which pose as humans and live only to drink human blood. Fortunately for the human world there are groups dedicated to destroying them. A brooding and mysterious girl named Saya is the best teropterid slayer there is, and now, in 1960s Japan, she is sent to a U. S. army base which may be infested...\n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/9/18913.webp"},{"title":"Sankarea OVA","synopsis":"Two OVA episodes are bundled as DVDs with each of volumes 6 and 7 of the manga.\n\nThe first OVA is a prequel story written by the manga's author. Before the beginning of the main story, Rea and Chihiro have already met at a certain place: an outdoor hot-spring bath.\n\nThe second OVA takes place after the series (effectively episode 14). The Furuya family finds a mysterious young girl hiding under the household temple.","img":"https://cdn.myanimelist.net/images/anime/4/79032.webp"},{"title":"Boogiepop wa Warawanai","synopsis":"Five years ago, a string of grisly murders shook the city to its core and now the rumors have begun once more. Boogiepop... Everyone knows about Boogiepop: meet her one dark night and you are taken. People tell each other the stories and laugh: no one believes that she can possibly exist in this day and age. Still, strange things appear to be going on and the darkness is taking on many forms. Something is out there. Are you safe?\n\n(Source: RightStuf)","img":"https://cdn.myanimelist.net/images/anime/1327/95777.webp"},{"title":"Kurozuka","synopsis":"Adaptation of Takashi Noguchi's manga, which itself adapts Baku Yumemakura's supernatural romance novel.\n\nThe original novel is about a 12th-century man named Minamoto no Yoshitsune (Kurou). Kurou flees into the mountains after losing to his brother Minamoto no Yoritomo, the first Shogun to rule all of Japan. History records that he committed suicide, but instead, Kurou meets a strange, beautiful woman named Kuromitsu in her mountain hermitage. Eventually, Kurou falls in love with Kuromitsu, but then realizes she conceals a dark secret. He learns that he is unable to die and continues to live for a thousand years as Japan evolves into a future society.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/21844.webp"},{"title":"Itou Junji: Collection","synopsis":"In the light of day and in the dead of night, mysterious horrors await in the darkest shadows of every corner. They are unexplainable, inescapable, and undefeatable. Be prepared, or you may become their next victim.\n\nSit back in terror as traumatizing tales of unparalleled terror unfold. Tales, such as that of a cursed jade carving that opens holes all over its victims' bodies; deep nightmares that span decades; an attractive spirit at a misty crossroad that grants cursed advice; and a slug that grows inside a girl's mouth. Tread carefully, for the horrifying supernatural tales of the Itou Junji: Collection are not for the faint of heart.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/88366.webp"},{"title":"Memories","synopsis":"Memories is a compilation of three standalone short films encompassing different genres.\n \nMagnetic Rose\nIn the far reaches of space, after tracing a distress signal to a large abandoned space station, a pair of engineers—Heintz Beckner and Miguel Costrela—find a derelict mansion and decide to explore on foot. Their investigation reveals a dark secret surrounding the fate of Eva Friedel, a renowned opera singer with a tragic history. Hallucinations soon begin to plague them, and they must fight to retain their sanity in order to escape the station alive.\n \nStink Bomb\nHapless lab technician Nobuo Tanaka consumes some pills at his laboratory to cure a cold. Unknown to him, however, the pills are actually experimental drugs that enhance his flatulence to a lethal degree. As the toxic gas escaping him kills everyone in his vicinity, he is ordered by his superiors to retreat to the company headquarters in Tokyo. The journey to the city is made all the more arduous as Nobuo struggles with his deadly odor while the police, military, and foreign adversaries are hot on his trail.\n \nCannon Fodder\nIn a fortress city filled to the brim with cannons, a young boy wishes to surpass his father by becoming a revered artillery officer. Despite no proof of an enemy nation, he cannot resist the urge to partake in the daily bombardment routines organized by the city. Whether at school or just before bedtime, he only dreams of someday firing a cannon for the sake of his homeland.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/9/74781.webp"},{"title":"Terra Formars: Revenge","synopsis":"In Terra Formars Revenge, the crew members of the Annex I continue to fight against Terraformars—the large humanoid cockroaches that evolved from the ones sent to Mars centuries ago. However, far from discovering the cure for the lethal Alien Engine Virus that has been plaguing Earth, the Annex I team have learned that some squadrons have agendas from their own countries. Now, the squadrons must not only fight against the Terraformars for their survival, but also each other in the never-ending battle for international dominance.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/78566.webp"},{"title":"Hellsing: The Dawn","synopsis":"During the height of World War II, Nazi Germany seeks to strengthen their soldiers with technology crafted under the influence of vampiric biology. Out of fear of this technology turning the tide of war in the Axis's favor, Sir Arthur Hellsing enlists his butler and soldier Walter C. Dornez and vampire Alucard to put a stop to the German plot, sending the two men into a conflict that will scar them both forever.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/30667.webp"},{"title":"Yami Shibai","synopsis":"The mysterious, yellow-masked Storyteller is a man whose true name and origin are both unknown. He appears at dusk where children gather and recites sinister tales based on Japanese urban legends, to which his young audience eerily intakes. However, the Storyteller is no ordinary teller of tales. He incorporates a kamishibai, a traditional paper-scrolling device, to add visuals to his already demented narration.\n\nA series of short horror stories, Yami Shibai begins with a bachelor who, after moving into a new apartment, immediately starts sensing a malevolent glare being pressed into him. A single talisman rests on his ceiling, but he has no way of knowing it is one of the few safeguards that separate him from a bottomless pit of suffering. Each story is more terrifying, more appalling, and more sickening than the last as the Storyteller's audience find themselves being sucked into the vicious world of his words.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/74107.webp"},{"title":"Shikabane Hime: Kuro","synopsis":"A direct continuation of Shikabane Hime: Aka, taking place six months after Tagami Keisei's death at the hands of the Shichisei (Seven Stars), a group of elite Shikabane who act on more than just regrets. As per Keisei's dying wish, Kagami Ouri formed a temporary contract with Makina to save her from degenerating into a Shikabane. Since then, Ouri's been training to become a proper monk so that he can remain contracted to Makina and help her fight against the Shichisei -- the ones who originally killed Makina, the entire Hoshimura family, and now Keisei. However, the traitorous monk Shishidou Akasha has sided with the Shichisei in an attempt to destroy all Shikabane Hime and the entire monk organization that uses them -- Kougon Sect.","img":"https://cdn.myanimelist.net/images/anime/3/29945.webp"},{"title":"Ookamikakushi","synopsis":"The story follows Hiroshi Kuzumi, a 16-year-old student who has just moved to the seemingly serene village of Jogamachi. Nestled in the mountains far away from the city, the village is divided by a river that separates old Jogamachi from new Jogamachi. Young Hiroshi soon discovers that the village is ancient as well as mysterious traditions and customs have been kept alive over the ages. Although a bit bewildered by the new environment, Hiroshi begins to settle into his new life. While he has never been the type to win any popularity contests, he quickly earns the affection of his classmates. That is with the exception of aloof class president, Nemuru Kushinada, whose only words to Hiroshi are a warning to stay away from old part of town. It is there that terror and mystery await him.","img":"https://cdn.myanimelist.net/images/anime/10/21784.webp"},{"title":"Blood-C: The Last Dark","synopsis":"Having escaped the many horrors of her village, Saya Kisaragi vows to hunt down the monster responsible and make him pay with his life. As she tears through flesh and bone for her vendetta, she encounters SIRRUT, a group of ingenious hackers, who enlist Saya to help them defeat a common enemy—someone she knows all too well.\n\nUnfortunately, the path she follows is paved with tragedy, as once again, Saya faces betrayal at the hands of those she has come to trust. With her back against the wall, the fearsome monster slayer must fight with all her strength and skill if she is to overcome this final mission and exact vengeance.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/34495.webp"},{"title":"Kaibutsu Oujo","synopsis":"When Hiro Hiyorimi tries to save a beautiful young woman from certain death, he ends up a dead hero himself! However, since the drop-dead girl is Hime, daughter of the King of the Monsters, his \"reward\" is to come back as a not-quite-living soldier in her honor guard of horror! That means helping fight off the army of supernatural monstrosities Hime's siblings are unleashing against her in hopes of moving up the ladder of succession.\n\nAnd if facing off with vampires and zombies isn't bad enough, how can anyone be prepared for the REALLY weird ones, like were-sharks, pandas and killer dumplings? This sure as hell isn't the afterlife Hiro was hoping for, but the really sad part is that Hime is the good girl in all of this... or at least as close to good as you can come when you're on the wrong side of the gates of hell!\n\n(Source: RightStuf)","img":"https://cdn.myanimelist.net/images/anime/2/20946.webp"},{"title":"Sankarea: Wagahai mo... Zombie de Aru...","synopsis":"Extra episode included on BD/DVD vol. 6; effectively episode 13. \n\nDespite their decaying bodies, Rea’s zombie power comes in handy both at school and at home, and Babu gets interested in another cat—although this particular feline is one of the living.\n\n(Source: FUNimation)","img":"https://cdn.myanimelist.net/images/anime/12/44918.webp"},{"title":"Blue Gender","synopsis":"Blue Gender takes place in the not too distant future in a world where things have gone terribly wrong for humanity. Humans have been replaced at the top of the food chain by the Blue, a race of bug-like aliens that have colonized Earth and pushed humans aside. A space station, Second Earth, has been constructed as a safe haven for humans, with the hope of one day reclaiming the Earth once more.\n\nYuji Kaido was cryogenically frozen, having been suffering from a disease known as B-Cells. Once awakened, he joins a team of soldiers that have come to Earth to extract him. Unfortunately, nothing goes according to plan as they make their way back to Second Earth.\n\nYuji will have to deal with the horrors of fighting a bloody war as he and the fighters from Second Earth look to survive. Will they be able to win back Earth without losing their humanity?","img":"https://cdn.myanimelist.net/images/anime/1/2023.webp"},{"title":"Tokyo Majin Gakuen Kenpucho: Tou","synopsis":"Something evil is stirring in the shadows of Tokyo...\n\nDuring the spring of his senior year in high school, quiet Tatsuma Hiyuu transfers to Magami Academy in Shinjuku. The mysterious boy's \"outsider\" status and his profound skills in martial arts quickly earn him the friendship of class delinquent Kyouichi Houraiji. Through an uncanny connection and a happenstance challenge, he also meets Yuuya Daigo of the wrestling club, the captain of the girls' archery club, Komaki Sakurai, and Aoi Misato, the Student Council President.\n\nDuring their encounter, there is a sudden, harsh disruption of the Ryumyaku (literally Dragon Pulse, otherwise known as Dragon Vein or Dragon Stream), the flow of arcane energy. The surge awakens within the five teenagers a latent power, giving them each a supernatural ability. Enlightened to their newly acquired gifts by Hisui, the young heir of the Kisaragi Clan who maintains his family's antiques shop - as well as their duty to protect Tokyo from Oni (demons) - the Magami students decide to use their power to protect the city from the onslaught of dark forces.\n\nBattling the demons alongside Hisui Kisaragi, the five unlikely friends discover that they may have to face a greater threat to Tokyo other than destroying a few malevolent, random monsters. The Ryumyaku had been disrupted by force, from someone invoking the Dark Arts - and that person has a wicked desire to unleash a long-dead evil.\n\nCan the teenagers overcome their own fears and flaws to fight against the Dark Arts? And soon they will also have to face their own destinies as they discover their Stars of Fate.\n\nThis anime is based on a manga, which was based on the Nintendo role-playing video game originally released in 1998. ","img":"https://cdn.myanimelist.net/images/anime/7/21751.webp"},{"title":"Vampire Hunter D","synopsis":"10,000 years in the future, the world has become a very different place; monsters roam the land freely, and people, although equipped with high tech weapons and cybernetic horses, live a humble life more suited to centuries past. The story focuses on a small hamlet plagued by monster attacks and living under the shadow of rule by Count Magnus Lee, a powerful vampire lord who has ruled the land for thousands of years. When a young girl is bitten by the Count and chosen as his current plaything, she seeks out help of a quiet wandering stranger, D. It so happens that D is one of the world's best vampire hunters, and he takes it upon himself to cut through Magnus Lee's many minions, and put an end to the Count's rule.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/4/24228.webp"},{"title":"Tasogare Otome x Amnesia: Taima Otome","synopsis":"Tired of Yuuko's antics for causing more ghost stories to be spread amongst the students, Kirie challenges her to a series of games which if Yuuko loses, she must behave.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/6/65883.webp"},{"title":"Gantz:O","synopsis":"Death does not have to be the end; one can live again, but only through beating the game posed by the black ball called Gantz.\n \nOn his way home to celebrate his younger brother's birthday, brave and kind-hearted student named Masaru Katou is stabbed to death. He awakes in a small room with a cityscape view in the heart of Tokyo—and he is not alone. To his surprise, it is not the afterlife, but the waiting room for a high stakes game with their lives on the line. Before he has the chance to process the situation, Masaru is handed a gun and teleported into the center of Osaka to carry out one simple task: eliminate any alien on sight.\n \nAccompanied by the aged Yoshikazu Suzuki, the stunning idol Reika Shimohira, and the cold but experienced Jouichirou Nishi, Masaru must overcome his fears in order to survive the game and return home to his waiting brother.\n \n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/81255.webp"},{"title":"JoJo no Kimyou na Bouken","synopsis":"Kujo Jotaro is a normal, popular Japanese high-schooler, until he thinks that he is possessed by a spirit, and locks himself in prison. After seeing his grandfather, Joseph Joestar, and fighting Joseph's friend Muhammad Abdul, Jotaro learns that the \"Spirit\" is actually Star Platinum, his Stand, or fighting energy given a semi-solid form. Later, his mother gains a Stand, and becomes sick. Jotaro learns that it is because the vampire Dio Brando has been revived 100 years after his defeat to Jonathan Joestar, Jotaro's great-great-grandfather. Jotaro decides to join Joseph and Abdul in a trip to Egypt to defeat Dio once and for all.","img":"https://cdn.myanimelist.net/images/anime/1801/104558.webp"},{"title":"Cossette no Shouzou","synopsis":"The anime is about art student Eiri Kurahashi, who works in an antique shop. One day, he sees the image of a girl in an antique glass. To his shock, she appears to be moving and living out her life before his eyes. He becomes infatuated with the girl, and one night at midnight, somehow makes contact with her. He learns her name is Cossette, and that she was an aristocrat's daughter during the 18th century.\n\nShe reveals to him that her spirit has been entrapped within the glass by her murder, which was perpetrated by her betrothed, the artist Marcelo Orlando. To set her free, she tells Eiri, a man must be willing to take upon himself punishment for the sins Marcelo committed.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/11/77004.webp"},{"title":"Koutetsujou no Kabaneri Movie 3: Unato Kessen","synopsis":"The movie is a continuation of the story from the original series that takes place half a year later. The original team joins an alliance to help take back the area around Unato Castle, however things do not go as planned. Will Ikoma and his friends be able to survive, or will they fall to the hordes of Kabane?","img":"https://cdn.myanimelist.net/images/anime/1749/99713.webp"},{"title":"Shiki Specials","synopsis":"The official website of the Shiki television anime series confirmed on Saturday that the anime's eighth and ninth Blu-ray Disc/DVD volumes will each include an unaired episode. The eighth volume will ship with Episode 21 and the unaired episode \"Dai Futatō to Han wa\" (a wordplay for \"Episode 20.5\") on May 25, 2011, while the ninth volume will ship with Episode 22 and the unaired episode \"Dai Futatō-ichi to Han wa\" (\"Episode 21.5\") on June 22. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/36543.webp"},{"title":"Kemonozume","synopsis":"Creatures known as Shokujinki have been secretly living alongside humans for hundreds of years. Though they may look like humans, Shokujinki are able to transform into uncontrollable beasts with gigantic claws and consume humans to survive. The equally secretive Kifuuken dojo specializes in killing Shokujinki by cutting off their arms, and is the only force preventing unchecked Shokujinki domination.\n\nToshihiko Momota, the son of the leader of the Kifuuken, is instantly charmed by a mysterious woman named Yuka Kamitsuki. Their relationship is complicated, however, because unbeknownst to them both, Yuka is a Shokujinki and Toshihiko is sworn to kill her. Meanwhile, the Kifuuken is having a crisis of confidence as Toshihiko's brother Kazuma pushes against tradition and tries to modernize the Kifuuken. As emotions are strained and the secrets of both the past and present are revealed, who will live, and who will be eaten?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/86766.webp"},{"title":"Super Danganronpa 2.5: Komaeda Nagito to Sekai no Hakaimono","synopsis":"At Hope's Peak Academy, a school full of extraordinarily talented individuals, Nagito Komaeda is an ordinary boy with no special traits or interesting skills to speak of—except for his incredible unluckiness. Just walking to school in the morning leads to a number of unfortunate accidents, which only escalate as the day goes on. Despite this, Komaeda leads a relatively normal life and is satisfied with his modest slice of happiness.\n\nBut everything changes when a mysterious boy who declares himself the \"Destroyer of the World\" arrives to shatter this hopeless paradise.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/83150.webp"},{"title":"Ayakashi: Japanese Classic Horror","synopsis":"A collection of three classic Japanese horror stories: \"Yotsuya Kaidan\", the story of a wife betrayed by her husband who seeks vengeance even in death. \"Tenshu Monogatari\", the story of forbidden love between a goddess and a human, and \"Bakeneko\", the story of a mysterious cat monster with a vendetta against a certain family. \n","img":"https://cdn.myanimelist.net/images/anime/2/11746.webp"},{"title":"Higurashi no Naku Koro ni Kaku: Outbreak","synopsis":"The story is set in the same Hinamizawa village of the previous stories. The village has been completely sealed off due to a mysterious virus in 1983, and Maebara Keiichi and Ryuuguu Rena deal with the outbreak.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/51063.webp"},{"title":"Ayashi no Ceres","synopsis":"Ceres was a tennyo (Celestial maiden) who came down from the heavens to bathe in a stream. She hung her hagoromo (robe) on a tree nearby, which was her key to returning to the heavens. But the robe was stolen and the man who had stolen it forced her to become his wife, thus producing a family full of human and tennyo blood mixed.\n\nNow, in modern day time, Aya Mikage is a descendent of Ceres, and has quite an amount of tennyo blood. On her 16th birthday, she and her twin brother, Aki, are thrown a party. At the \"party,\" Aya's grandpa plans to kill her, for she has tennyo powers unlike the rest of the family, and can actually become Ceres herself and destroy the Mikage family. Aya, however, can switch back, so this transformation happens quite frequently.\n\nWith protector Yuuhi by her side, it is up to Aya to control Ceres and keep her from coming back, but her relationship with an ex-worker for her evil grandpa may be a distraction.","img":"https://cdn.myanimelist.net/images/anime/8/23580.webp"},{"title":"Petshop of Horrors","synopsis":"Count D, a quite interesting pet shop owner from an area called Chinatown, sells rare and hard to come by pets to people longing for something special, but with each sale comes a contract. If the rules of the contract are followed, everything goes fine, but if someone should break the rules of the contract, the pet shop cannot be held responsible for anything unfortunate that might happen. Leon Orcot, a homicide detective, has linked many odd and unexplainable deaths together; they all were customers of Count D's pet shop, and he intends to find out why. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/64543.webp"},{"title":"Yami no Matsuei","synopsis":"Even after death, life is full of paperwork and criminals. Tsuzuki Asato is a 26 year old, happy-go-lucky, and dorky shinigami (god of death) whose job is to makes sure that those who are dead remain dead and stay in their proper realms. Even though he's had this job for over 70 years, he is in the worst division with horrible pay. He also has a knack for not keeping partners (since shinigami work in pairs), but now he seems to have one that will stick around; stubborn, smart-mouthed, serious and defensive 16 year old, Kurosaki Hisoka. With each case they investigate, they come closer to the conspiracies of the serial killer Dr. Muraki Kazutaka. Tsuzuki's relationship with Hisoka is growing stronger and closer...but there is a dark past to how Tsuzuki died that will not give him peace. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/6726.webp"},{"title":"JoJo no Kimyou na Bouken: Adventure","synopsis":" Kujo Jotaro is a normal, popular Japanese high-schooler, until he thinks that he is possessed by a spirit, and locks himself in prison. After seeing his grandfather, Joseph Joestar, and fighting Joseph's friend Muhammad Abdul, Jotaro learns that the \"Spirit\" is actually Star Platinum, his Stand, or fighting energy given a semi-solid form. Later, his mother gains a Stand, and becomes sick. Jotaro learns that it is because the vampire Dio Brando has been revived 100 years after his defeat to Jonathan Joestar, Jotaro's great-great-grandfather. Jotaro decides to join Joseph and Abdul in a trip to Egypt to defeat Dio once and for all. ","img":"https://cdn.myanimelist.net/images/anime/8/53147.webp"}]