[{"title":"Yoroshiku Mechadock","synopsis":"Mechadock is a powerful race car obtained from a simple economy car, which is able to race on any ground.","img":"https://cdn.myanimelist.net/images/anime/7/16963.webp"},{"title":"Collar x Malice","synopsis":"A dangerous shadow organization launches a campaign of fear and violence in the city of Shinjuku, pushing society to the brink of chaos. As a young police officer tasked with restoring order, Ichika Hoshino becomes the target of an attack, and has a poisonous collar attached to her neck. With the situation spiraling out of control and time running out, five mysterious strangers appear to aid her in her quest for the truth. Who can she trust? Will she be able to save herself and the soul of Shinjuku from the clutches of oblivion?\n\n(Source: Aksys Games)","img":"https://cdn.myanimelist.net/images/anime/1072/103260.webp"},{"title":"Naikaku Kenryoku Hanzai Kyousei Torishimarikan Zaizen Joutarou","synopsis":"Based on Ken Kitashiba &amp; Yasuhiro Watanabe's political intrigue detective manga. \n\nThe close relationship between political and business circles doesn't die; politicians and government officers line their pockets taking advantage of their positions. \nZaizen Jotaro is an investigator who is allowed to use extralegal methods to crack down these power abusing criminals.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/11/62657.webp"},{"title":"Techno Police 21C","synopsis":"The plot consists of a chase of a hijacked MBT-99A tank, designed by the United States Air Force (which is odd, but will become the saviour of Eleanor, as she can be ejected before the tank explodes, like a fighter jet). The audience is expected to be enamored with this vehicle. At one scene when it looks like the tank is sure to get away, the background music turns into cocktail-lounge jazz and sparkly lights swirl around the tank. The tank carries six ATGM launchers (which Ken is somehow able to dislodge with minimal trouble, along with a piece of the turret, towards the end of the movie), three to each side of the turret, and a laser-based machine-gun-esque installment, in addition to its rifled main gun. The tank's treads are dual-mounted (the tread is split in half, making four sets of treads for the tank).\n\nThe employment of the laser, however, seems counter-productive to a machine-gun's mission, as it can only fire once every few seconds. If it can fire at higher rates, it does not do so, and tries to acquire a lock on its pursuer (Blader, in this case). This suggests a low ammunition capacity, unlike thousand-round-and-up machine-guns routinely mounted on modern tanks. It does not appear to have any effect on the road, either, which does not say much about its power.\n\nAnother tank involved is the MBT-90D, which are dispatched by the Army (or Air Force—the movie never makes it clear if it is a joint effort, although the general who arrives midway into the movie is shown riding in something resembling an ADATS) to take out the tank. Despite having at least a platoon of these, the MBT-99 still evades capture. The M-90Ds are armed with a three-barreled autocannon, the calibre of which may be around fifteen to twenty millimeters. The MBT-90D is equipped with three ATGM missile launchers, on the left side of the turret, and its main cannon is mounted on the front, instead of on a turret.\n\nAfter the MBT-99's hijackers (who appear inside the tank after getting away from a recently-committed bank robbery), hired by a shadowy group, backed by a foreign nation seeking an edge in their military (the M-99 is presumably on its way to be tested at a separate base), are forced out by Ken and his team, Eleanor enters to study the tank, and it starts up on its own, having been programmed by the hijackers to head for a pier and drive off its end so as to rendezvous with an enemy submarine. The rest of the movie is made up of the chase through the city, resulting in the destruction of another bank (owned by the same corporation that built the first bank in the movie), and various collateral damage.","img":"https://cdn.myanimelist.net/images/anime/13/67173.webp"},{"title":"Chou Kousoku Galvion","synopsis":"Super High Speed Galvion features mecha designs by Ohata Koichi (of Gunbuster fame). In the 23rd century billionaire Midoriyama Rei creates a secret organization called Circus to combat a hidden group called Shadow that is taking over the world. When she can't find qualified pilots for Circus' main mecha, the Galvion, she cuts a deal with two convicts, Mu and Maya, to lead the fight against Shadow.","img":"https://cdn.myanimelist.net/images/anime/2/56453.webp"},{"title":"Bounty Hunter: The Hard","synopsis":"The story of \"Hard\", a bounty hunter living in New-York and seeking revenge.","img":"https://cdn.myanimelist.net/images/anime/1534/96368.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo The Movie 2: UFO Shuurai! Tornado Daisakusen","synopsis":"More movie mayhem for Ryoutsu. \n","img":"https://cdn.myanimelist.net/images/anime/12/5943.webp"},{"title":"Kikou Keisatsu Metal Jack","synopsis":"Twenty years into the future, a city now called \"Tokyo\" has developed into one of the few world-class high-tech centers, \"Tokyo City.\" The main character, Ken Kanzaki, is a young investigator assigned to the criminal investigation section of the Metropolital Police. He is one of the finest sharp shooters in the Police.One day, Ken is ordered to provide security for a party held by for \"Zaizen Konzern,\" a world-class plutocracy.\n\nAll of a sudden, spector robots appear and distrupt the party. Zaizen, a commander-in-chief, is killed and both Ken and Jun. Zaizen's son,are fatally injured by the robots. Two of the party's guests, an auto-racer, Ryo Aguri,and a wresler, Go Goda, also receive serious injuries. Three severely injured young men are operated upon by scientists from the Metropolitan Police. Several days later, a robot corp led by a mysterious organization called \"Ido\" appears in the floating-town of the Tokyo Bay. But the Police and the Army have no effective strategies to contain them.\n\nAt that moment, three young men attired in mechanical suits enter. They are the very three young men, Ken, Ryo and Go, who have been turned into the cyborg investigators through the operation. They call themselves \"Armored Police Metal Jacks\". \"Metal Jacks,\" dazzlingly switching from \"Jack Suits\" to \"Jack Armors,\" completely demolish the robot corp and achieve victory, thus signals the beginning of the battle between the high-tech criminals and \"Metal Jacks\" with a futuristic \"Tokyo City\" in the background.","img":"https://cdn.myanimelist.net/images/anime/2/77278.webp"},{"title":"Tomica Hyper Rescue Drive Head: Kidou Kyuukyuu Keisatsu (TV)","synopsis":"A little bit in the future, the government has established a brand new organization with the purpose of rescuing lives to respond to the increasingly complicated and varied types of disasters, accidents and crimes that go beyond human comprehension. It is called the \"Mobile Emergency Police DRIVE HEAD\" force combining specialized police, firefighting and rescue skills. \"DRIVE HEAD\" is an advanced mobile device that transforms in form factor from car to humanoid walker vehicle. The drivers are high-aptitude, grade school students such as Go Kurumada who collaborate with mobile emergency police adults and rush to crisis situations to secure public safety and preserve the peace for all!\n\n(Source: TBS Global Business)","img":"https://cdn.myanimelist.net/images/anime/1385/95682.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo: Jump Festa Special","synopsis":"Jump Special Anime Festival piece, based on the popular Shounen Jump manga by AKIMOTO Osamu, that began serialisation in 1976. Produced by Tatsunoko Pro, and later shown on TV Tokyo due to popular demand. ","img":"https://cdn.myanimelist.net/images/anime/2/5942.webp"},{"title":"Neon The Animation","synopsis":"Promotional animated videos of Osaka's entertainment and shopping district, Nipponbashi (or colloquially known as Nippombashi) narrated by Nipponbashi's mascot Neon and her sister Hikari-chan. Nipponbashi is the equal of Tokyo's Akihabara.","img":"https://cdn.myanimelist.net/images/anime/8/47203.webp"},{"title":"Wild 7 Another Bouryaku Unga","synopsis":"A big transatlantic ship, full of rich and important people for international business, has been taken by a group of terrorists. The only hope for their rescue is in the hands of a Japanese man known as Japa, but first, he must hire seven companions to help him, and together they will be the Wild Seven. The main plot occurs in the waters of Nicaragua's Canal.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/2591.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo: The Final - Ryoutsu Kakichi Saigo no Hi","synopsis":"The typical Kochikame plot involves Ryo-san coming up with a money-making scheme by inventing a new gadget or capitalizing on a fad, achieving great success, calling on Nakagawa's help as things turn sour, and finally losing it all as the fad runs out of steam or out of control. While the plots are gag-driven, much of the humor comes from the juxtaposition of mundane characters with the bizarrely incongruous (Nakagawa's wealth, Maria's appeal, everyone's lack of actual police work), most of which is never explained or rationalized in the slightest. \n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/4/80486.webp"},{"title":"Restol: Teugsu Gujo Dae","synopsis":"It is the year 2035, a world filled with advanced science and technology, sophisticated computer systems, audio/video multimedia converstions,world government unification, network wars by hackers, and the future world controlled by one huge multinational company. A 14-year old named Kang Maru, a boy with excellent manuevering skills in a RESTOL simulation game, was chosen by GEONOID, a company with the task of protecting the earth against natural calamities, to pilot RESTOL 03, one of the 5 RESTOLs, to rescue people in different calamities. Now, he and his teammates faces different challenges in their duty, including being hacked their space-based rescue station R-SAT.","img":"https://cdn.myanimelist.net/images/anime/1379/97015.webp"},{"title":"Yakushiji Ryouko no Kaiki Jikenbo: Hamachou, Voice &amp; Fiction","synopsis":"A recap of the last few episodes with some commentary by Jacqueline, as well as Ryoko, and Izumida.","img":"https://cdn.myanimelist.net/images/anime/9/71646.webp"},{"title":"Tomica Hyper Rescue Drive Head: Kidou Kyuukyuu Keisatsu Movie","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1709/90853.webp"},{"title":"L/R: Licensed by Royal Special","synopsis":"Chronologically episode 4, this special never aired on TV.","img":"https://cdn.myanimelist.net/images/anime/13/72038.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo: Maguro no Notta Keikan","synopsis":"A Kochikame special that takes place on a fisherman's boat.","img":"https://cdn.myanimelist.net/images/anime/8/81543.webp"},{"title":"Edokko Boy: Gatten Tasuke","synopsis":"Tasuke, a student in a police academy, wanted to be the manager of the academy and arrest all criminals in Edo city. Tasuke is still eleven years old, but, he really wanted to get rid of criminals so the world will be a better place to stay in. Tasuke have three other friends; Omon and the other two. With them, they work together and that is the start of a funny and sometimes serious adventure.","img":"https://cdn.myanimelist.net/images/anime/12/24988.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo: Mezase! Kameari Superstar!! Ryoutsu-shiki Aidoru h","synopsis":"A new idol unit is formed to teach people the importance of traffic safety.","img":"https://cdn.myanimelist.net/images/anime/11/81553.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo: Hashire! Ryoutsu-shiki Chinchin Densha","synopsis":"The first Kochikame television special of 2006.","img":"https://cdn.myanimelist.net/images/anime/8/81547.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo: Washi to Ore!? - Bokura wa Asakusa Shounen Tanteid","synopsis":"An amazing time machine invention allows Ryoutsu to return to the years of his childhood.","img":"https://cdn.myanimelist.net/images/anime/6/81552.webp"},{"title":"Ore no Sora Keiji-hen","synopsis":"Yasuda Ippei (Shonozaki Ken) is the son of Yasuda Seijiro (Osugi Ren), the head of Yasuda Group, Japan's biggest business conglomerate. Although he is the son of a distinguished family, he has absolutely no disagreeable areas and is liked by everyone. \n\nHis academic achievements are exceptional. He completed his entire high school programme in 2 years and qualified for Tokyo University's Faculty of Law without studying for the exams. In order to establish his own concept of justice, Yasuda leaves his position as the heir to the Yasuda Group to attend the police academy. He becomes a detective at Kyobashi Police Precinct and bravely faces great evil.\n\n(Source: DramaWiki)","img":"https://cdn.myanimelist.net/images/anime/8/25868.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo: Ryou-san no Sushi Kuinee! - Choujyou Maguro Taiket","synopsis":"A two part Kochikame special wherein Ryoutsu becomes involved in a sushi chef's dealings.","img":"https://cdn.myanimelist.net/images/anime/4/81550.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo: Ryoutsu no Asakusa Rinyuuaru Daisakusen!! - Aa, Om","synopsis":"A second and final Kochikame special of 2006.","img":"https://cdn.myanimelist.net/images/anime/7/81548.webp"},{"title":"Pi Po Pa Po Patrol-kun","synopsis":"A children's anime about police and their talking police cars. It has no steady plot.","img":"https://cdn.myanimelist.net/images/anime/12/5740.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo: Shiiron Tankentai! Sumidagawa no Chikai - Omoide n","synopsis":"The two-part Kochikame special, wherein Ryoutsu helps a zoologist friend capture a real white whale.","img":"https://cdn.myanimelist.net/images/anime/6/81549.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo: Ryoutsu vs. Nakimushi Aidoru!? Nihon Ikkai Dai-Sug","synopsis":"A Kochikame special pitting Ryoutsu against Aidoru.","img":"https://cdn.myanimelist.net/images/anime/8/81544.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo: Ryou-san to Chyuuken Rakkii Monogatari - Kameari D","synopsis":"A Kochikame television special.","img":"https://cdn.myanimelist.net/images/anime/7/81546.webp"},{"title":"SNS Police","synopsis":"The story centers around the titular SNS Police (Social Network Service Police), who protect the peace in social media sites like Twitter and Facebook and deal harsh justice to those who violate it. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/88495.webp"},{"title":"Columbos","synopsis":"A re-imagining of Columbo with puppet animation.","img":"https://cdn.myanimelist.net/images/anime/13/71275.webp"},{"title":"Hei Mao Jing Zhang","synopsis":"The series follows Officer Black Cat's adventures around the forest neighbourhood, apprehending criminals, dealing justice, and solving crimes.","img":"https://cdn.myanimelist.net/images/anime/6/83206.webp"},{"title":"Jingi","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/12/29575.webp"},{"title":"Ginga Hyouryuu Vifam: Chicago Super Police 13","synopsis":"A parody of Ginga Hyouryuu Vifam set in 1920's Chicago. Originally released as an extra on the Ginga Hyouryuu Vifam: Keito no Kioku - Namida no Dakkai Sakusen VHS tape.","img":"https://cdn.myanimelist.net/images/anime/9/38829.webp"},{"title":"Heisei Policemen!!","synopsis":"Gougou, the man who deals with himself, strangers and the society as a whole at his own pace. He tends to confuse his surroundings beginning with his unique name, but surprisingly his job is upholding law and order as policeman; however, his way of life as modern time policeman leaves his superiors, civilians and even criminals dumbfounded. It's the new type of police comedy the Heisei-era has brought forth.\n\n(Source: Translation from NicoNico Douga, edited)","img":"https://cdn.myanimelist.net/images/anime/1575/91828.webp"},{"title":"Chuuhai Lemon: Love 30s - Ame ni Nurete mo","synopsis":"Bug-eyed Katsumi (known as Chuhai to his friends) is a muscle-bound detective determined to use his strength and pig-headed stupidity to rescue his teenage girlfriend from a succession of embarrassing situations. \n\nBased on a manga by Sho Fumimura and heavily seeded with background music from the 1960s U.S. hit parade.\n\n(Source: The Anime Encyclopedia)\n\n","img":"https://cdn.myanimelist.net/images/anime/6/27716.webp"},{"title":"Tomica Hyper Rescue Drive Head: Kidou Kyuukyuu Keisatsu (ONA)","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1997/90929.webp"},{"title":"Hei Mao Jing Zhang (1992)","synopsis":"The series follows Officer Black Cat's adventures around the forest neighbourhood, apprehending criminals, dealing justice, and solving crimes.","img":"https://cdn.myanimelist.net/images/anime/2/83207.webp"},{"title":"Seibu Tetsudou Ekiin Tako-chan","synopsis":"Tako-chan joins Seibu Railways in 2011, and gets assigned to Tanashi Station. He finally became a railway employee like he always yearned for, but he constantly keeps making blunders, and so all his work seems to be useless. Will the day come when he can stand on his own?\n\n(Source: Official Site)","img":"https://cdn.myanimelist.net/images/anime/13/29970.webp"},{"title":"Robocar Poli 2","synopsis":"In Broom's Town, a small town with a strong rescue team, there are always accidents and troubles such as a car sliding off a cliff in the rain, a car crash, a child locked in a firehouse and so on. In every episode the town's rescue team saves characters. At the end of each episode, the rescue team strongly advises the characters who were in danger and children.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/12/78248.webp"},{"title":"Da Wei Bei Ken Zhi Daomei Tegong Xiong","synopsis":"A Chinese adaptation of the international Backkom franchise. This film serves as a prequel to the main show.\n\nWith the human exploitation of natural resources, the Arctic environment is completely destroyed, leaving only the last polar bear to survive. A human girl named Jessica adopts the polar bear and names him Backkom. Jessica is an extraordinary agent of the Security Department. Backkom eager to become an agent someday, but he is so clumsy that he can only do the cleaning in the Security Department.\n\nAll of a sudden, a mysterious organization of polar bears shows up, places bombs around the world, and claims to seek revenge from human race. To remove threat of bombs, the top decision-making body of men, Global League, decides to arrange agents going under the basement of the Polar Bear Organization. While there are human detectors placed in the basement, their mission failed. Leaving the Global League with no choice, they have to train Backkom into an agent and arrange him to the Polar Bear Basement. Jessica is so concerned about Backkom and follows him in secret.\n\nBackkom and Jessica encounter so many difficulties in the basement, while they all succeed in solving them. They remove the bomb threat eventually, but Backkom was caught by the organization, where they show him a shocking fact. In the same time, the Global League is concerning giving up on Backkom, and launches attack to the Polar Bear Organization. \n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/3/86814.webp"},{"title":"W-Tails Cat: A Strange Presence","synopsis":"A hentai based on Shirow Masamune's W-TAILS CAT art books.","img":"https://cdn.myanimelist.net/images/anime/4/53957.webp"},{"title":"Oni Keibu Anpan","synopsis":"CG anime about a scary but kind hearted police man doing his job.","img":"https://cdn.myanimelist.net/images/anime/6/70673.webp"},{"title":"Mr. Bond","synopsis":"A paper and marker stop-motion short about an international secret agent named Mr. Bond.\n","img":"https://cdn.myanimelist.net/images/anime/1780/91745.webp"},{"title":"Chuanyue Huoxian: Youling Jihua","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1699/105730.webp"},{"title":"Detective Conan OVA 06: Follow the Vanished Diamond! Conan &amp; Heiji vs. Kid!","synopsis":"One day Mori Kogoro's private detective agency receives a blackmail call. It turns out that the caller has dialed the wrong number. Conan is able to identify the voice on the phone, it's similar to that of his old friend Heiji, who's also a high school detective but in Osaka. They join once again forces to solve the case and find the jewel which was stolen. \n\nBut they are not the only ones who are after the jewel. The notorious master thief Kaitou Kid has taken an interest in this piece, which is worth 100,000,000 Yen, as well and now it's up to Heiji and Conan to be the first to find the culprit and acquire the jewel. \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/10/31137.webp"},{"title":"Appleseed XIII","synopsis":"After facing massive destruction from a devastating war, the city Olympus has become the last stronghold as the center of command for the world. In order to protect the city from a group of terrorists known as the Argonauts, former LAPD SWAT member, Deunan Knotts, runs special military forces consisting of Biroids (cloned humans) and her cyborg partner Brialeos. Knotts must protect the city at all costs but is met with difficulties when Al Ceides, the Argonaut leader thought to be dead, resurfaces and causes problems. \n\n(Source: FUNimation) ","img":"https://cdn.myanimelist.net/images/anime/5/28796.webp"},{"title":"Detective Conan OVA 03: Conan and Heiji and the Vanished Boy","synopsis":"Conan and Ran are visiting Heiji and Kazuha in Osaka when the four come across a trio of kids while touring the city. These children, who look eerily similar to the Detective Boys but with different personalities, are looking for their friend who has gone missing—and the two young detectives agree to help find the vanished boy.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/72319.webp"},{"title":"Armitage III: Poly-Matrix","synopsis":"In the year 2046 humans are moving away from using robots and begin to trust them less and less. In this time life becomes very perilous for the beings known as seconds. The seconds are the most recent line of robots, as far as the public knows. This is the world Detective Ross Sylibus lives in. Detective Sylibus is transferred to Mars by his request after his partner was killed by a robot. As he arrives he falls headfirst into a murder where a country singer on his flight was murdered. He steps off the plane and watches as a scene unfolds and he meets his partner, Armitage a female cop with a major attitude. A rash of murders begins when yet more women are killed. As the investigation is continued a secret is uncovered. There is another line of robots known as Thirds. More and more Thirds turn up missing, as a serial killer who is intent on wiping out all the Thirds runs rampant. Armitage in her quest to put the murderer to justice reveals a secret. She herself is a Third.\n\n(Source: ANN, edited)","img":"https://cdn.myanimelist.net/images/anime/9/2859.webp"},{"title":"Hikari to Mizu no Daphne","synopsis":"In the future, water has covered much of the Earth due to the effects of global warming. The orphaned Maia Mizuki, 15, just graduated from middle school and has already applied for employment in the elite paramilitary Ocean Agency, part of the futuristic world government. Only the best, most intelligent, and physically fit students are eligible for admission. Maia, the series' protagonist, is set to become one of the few.\n\nBut her ideal life quickly falls apart. To her disappointment, Maia unexpectedly fails her entrance exams. Making matters worse, she promptly gets evicted from her house, pick pocketed, taken hostage, then shot. She is \"saved\" by two women (Rena and Shizuka) that are part of an unorthodox help-for-hire organization called Nereids (inspired by the Greek mythological Nereids ). With nowhere to go, Maia joins up with Nereids, taking jobs from capturing wanted criminals to chasing stray cats, often with unexpected results. Gloria and Yu later join up with Nereids.\n\n\"Daphne\" in the title refers to a subplot that starts midway into the series and eventually become important to Maia. \"Brilliant Blue\" refers to the fact that this is a world covered by water with almost no land. The world consists of vast oceans, a few islands, and floating cities.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/7/49131.webp"},{"title":"Sushi Police","synopsis":"Honda, Kawasaki, and Suzuki all comprise the elite ninth unit of the Sushi Police—a task force with the sole objective of sniffing out restaurants serving illicit or non-traditional sushi and eradicating them, no matter how insignificant their offense may be. The Sushi Police travel freely around the world in pursuit of these vile criminals day or night, with their strong sense of justice and the World Food-Culture Conservation Organization backing them. No offenders of Japan's traditional cuisine can escape their wrath!\n\nDuring one of their purification missions, the Sushi Police encounter Sara—a hot, young, television reporter out to expose them and the World Food-Culture Conservation Organization for corruption. They interrogate her, but her wiles, skills, and charms allow her to easily escape from their grasp, setting off a chain of events that will lead to the true purpose of the Sushi Police being revealed.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/76236.webp"},{"title":"Angel Cop","synopsis":"Sometime in the future, terrorism in Japan has become commonplace, and the police have become almost as brutal as criminals. A member of the Special Security Force known as Angel, is the best of the best, stopping at nothing in her fight for justice.\n\nThings get interesting for Angel and her partner, Raiden, when they begin investigating a series of murders in which the victims were known criminals, killed in very unpleasant ways. This trio of killers known as Hunters, is a group of psychics that have banded together to hunt down the lowest scum in the city and bring them to justice.\n\nAfter a couple of encounters between the cops and the psychics, two of the psychics begin to think that maybe they're not the good guys after all; but the third prefers killing to morality. Augmented by cybernetics from a mysterious source, this third hunter heads out on a killing spree, with the Special Security Force as the first target. \n\nEven with help from the other two psychics and her newly cyborged partner (after an unfortunate accident), Angel is going to have her work cut out trying to find the rogue psychic and the organization behind the Hunters. ","img":"https://cdn.myanimelist.net/images/anime/8/67603.webp"},{"title":"AD Police","synopsis":"The year is 2027 in MegaTokyo, six years before the Knight Sabers will make their debut. Boomers (artificial humans) are still a relatively new advancement, and the implementation and integration of boomers into society is still a bit buggy -- sometimes fatally so. Whenever a boomer incident occurs, though, there is the Advanced Police, a special force trained to deal with boomer crimes.\n\nLeon McNichol is a rookie in the AD Police, and is just starting to become exposed to the horrors and tragedies one finds every day in MegaTokyo. He and his veteran partner, Gina Marceau, slowly learn about the ever-fading line that separates man from machine. ","img":"https://cdn.myanimelist.net/images/anime/13/2851.webp"},{"title":"Detective Conan OVA 05: The Target is Kogoro! The Detective Boys' Secret Investigation","synopsis":"Conan Edogawa and his classmates are assigned to do a class report about a small business of their choice. After discarding other possible topics, the Detective Boys concludes that it's a perfect opportunity to find out more about  Detective Kogorou Mouri's job.\n\nConan's friends refuse to settle for a simple interview though, as they want to experience first-hand all the details of his work. Thus, they, along with a reluctant Conan and Ai Haibara, decide to tail the renowned detective for a day. However, the kids soon get involved in a grim situation when Kogorou's current case takes an unexpected and dangerous turn.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/31143.webp"},{"title":"Detective Conan OVA 07: A Challenge from Agasa! Agasa vs. Conan and the Detective Boys","synopsis":"Professor Agasa is kidnapped and the Detective Boys must use clues found at his house and in various parts of the city in order to find him.","img":"https://cdn.myanimelist.net/images/anime/12/31145.webp"},{"title":"Parasite Dolls","synopsis":"A secret unit of the AD Police, known as Branch, specializes in crimes involving humanoid robots called 'Boomers'. Branch officer Buzz must cope with having a Boomer for a partner, while officer Michaelson finds the line between human and robot to be a thin one. Together they serve to protect a world that is slowly deconstructing around them. Set in the Bubblegum Crisis universe. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/28884.webp"},{"title":"Inferno Cop 2nd Season","synopsis":"Second season of Inferno Cop announced by Studio Trigger at AnimeNEXT.","img":"https://cdn.myanimelist.net/images/anime/2/86161.webp"},{"title":"Detective Conan Magic File 2: Kudou Shinichi - The Case of the Mysterious Wall and the Black Lab","synopsis":"Magic File 2 was sold at select retailers (7-11 branded equivalents) in Japan, along with PPV episodes of the show (episodes released long before, such as the NY case). The first disc housed the Movie 12 Side-Story OVA, which features Kudou Shinichi and details a bit of the backstory from the upcoming movie. The second disc was the one with the PPV episodes.\n\n(Source: DCTP Forum)","img":"https://cdn.myanimelist.net/images/anime/6/10891.webp"},{"title":"Detective Conan Movie 23: The Fist of Blue Sapphire","synopsis":"23rd Detective Conan Movie.","img":"https://cdn.myanimelist.net/images/anime/1010/98309.webp"},{"title":"Detective Conan OVA 08: High School Girl Detective Sonoko Suzuki's Case Files","synopsis":"Sonoko is writing a script for a play. In her script, there's a murder case, and high-school detective Suzuki Sonoko is there to help solve it. Haibara finds flaws in the deduction section of the plot, and Ran decides to call Shinichi for help with the script.\n\n(Source: Wikipedia, edited)","img":"https://cdn.myanimelist.net/images/anime/13/13791.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo","synopsis":"Ryoutsu, being an underpaid policeman, is always coming up with underhanded schemes in order to make a quick buck. But in the end, his plans (which are ridiculous to begin with) always go wrong and land him in big trouble with the chief.","img":"https://cdn.myanimelist.net/images/anime/5/21196.webp"},{"title":"Koukaku Kidoutai Arise: Another Mission","synopsis":"The premise of the story: \"Snatch the rebel elements' secret data using the Surface! There is a leak saying that the giant coporation Ishimiya Industry will commit an act of international terrorism, and Motoko Kusanagi and the Armored Riot Police head out to seize the plug data!\"\n\n(Source: ANN)\n\nA short animation for promoting Microsoft's Surface tablet in Japan.","img":"https://cdn.myanimelist.net/images/anime/6/51733.webp"},{"title":"Detective Conan OVA 11: A Secret Order from London","synopsis":"Diana invites Kogorou and Ran to London, but since Conan cannot travel with his invented name, Ai gives him a temporary antidote, letting him travel as Kudou Shin'ichi. Together with Professor Agasa they are on a plane to London.\n\nBack in Japan, Ai now lives with Ayumi. Near their apartment, a suspicious man clothed in black named Kurokawa Youji has been trying to track down and now has found Ai. Shortly after Mitsuhiko notices a picture in a magazine of a foreign actress named Grace Aihara, who looks exactly like Ai, Conan calls, ominously instructing Mitsuhiko to keep Ai away from the Professor's house. And so, Mitsuhiko and Genta go about trying to protect Ai...\n\n(Source: foo2)","img":"https://cdn.myanimelist.net/images/anime/11/29489.webp"},{"title":"Detective Conan Magic File 4: Osaka Okonomiyaki Odyssey","synopsis":"Another special to accompany the release of the 14th feature film, The Lost Ship in the Sky. Along with a number of previous episodes, the original episode contained within will take place after the events of the film.","img":"https://cdn.myanimelist.net/images/anime/2/21912.webp"},{"title":"Burn Up Excess","synopsis":"Follows the exploits of Team Warrior, a special anti-terror wing of the Neo-Tokyo Police force. Team Warrior is comprised of the habitually broke Rio, gun-crazy Maya, computer specialist Lillica, tech-expert Nanvel, piliot/voyeur Yuji, and is led by the enigmatic Maki. The team faces a number of missions, ranging from bodyguard duty, breaking up robbery and arms rackets, and providing security for a very powerful tank. Rio and company continually thwart the terrorist aims of Ruby, an operative for a shadowy cabal of powerful men. Before the final showdown, the circumstances behind the formation of Team Warrior, how the precocious Rio came to join it, and Maki's painful past will be revealed.\n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/6/75501.webp"},{"title":"WXIII Kidou Keisatsu Patlabor","synopsis":"When the level of Labor accidents begin to escalate around Tokyo Bay, police detectives Kusumi and Hata are assigned to investigate. What they discover leads to a series of government cover-ups, conspiracy concerning a new biological weapon entitled WXIII-Wasted Thirteen and a tragic, personal connection to Hata. The only hope to stop this threat is to cooperate with the military and lead WXIII into a showdown with the Labors of Special Vehicle Division 2. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/1290.webp"},{"title":"Inferno Cop: Fact Files","synopsis":"There are 12 companion pieces in the forms of \"Fact Files\" (which expand upon a given character from a corresponding episode) airing shortly after each episode. ","img":"https://cdn.myanimelist.net/images/anime/9/47569.webp"},{"title":"The Disappearance of Conan Edogawa: The Worst Two Days in History","synopsis":"The anime special celebrates the 20th anniversary of Gosho Aoyama's original manga, and it recounts a previously untold story from Conan's past.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/67289.webp"},{"title":"ACCA: 13-ku Kansatsu-ka - Regards","synopsis":"Set in the capital city of Badon one year after the events of the TV anime, Jean and the rest of the ACCA department are preparing for the one-year anniversary of the establishment of the new order. For the characters — caught between rumors of unrest, unchanging days, new crossroads, gazes remembered in memories, and days of new beginnings — time once again begins to move forward.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1878/101560.webp"},{"title":"Detective Conan OVA 12: The Miracle of Excalibur","synopsis":"The Miracle of Excalibur is the twelfth OVA of the anime and manga franchise Detective Conan. The plot is based on Gosho Aoyama's short story \"Excalibur.\"\n\n(Source: Detective Conan World)","img":"https://cdn.myanimelist.net/images/anime/5/59513.webp"},{"title":"New Dominion Tank Police","synopsis":"In the follow up to Shirow's classic anime, Al, Leona and their trusty steed, Bonaparte, continue to fight crime in New Port City, alongside the rest of the Tank Police. But a new threat appears in the form of a series of terrorist attacks, using the latest weapons technology. The Tank Police are out-numbered and out-gunned, but Al and Leona set out to discover who or what is behind these attacks. With massive explosions and high-speed chases, Leona often causes more damage than the criminals she pursues.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/65915.webp"},{"title":"Amazing Nuts!","synopsis":"Amazing Nuts! is an anthology of four animated shorts with each featuring its own distinct animation style and music by Studio 4°C.\n\n1. Global Astroliner Gou\n2. Glass Eye\n3. Kung-Fu Love\n4. Joe and Marilyn","img":"https://cdn.myanimelist.net/images/anime/2/73635.webp"},{"title":"Hyper Police","synopsis":"Sasahara Natsuki is a poor bounty hunter in a world where monsters and humans live together. Most of her cases involve monsters infringing upon the rights of humans, who are protected by law from their generally more powerful neighbors. Being half-human and half cat-beast, Natsuki straddles the two societies and tries to understand and respect both while enforcing the law. She is assisted by a werewolf named Batanen who is afraid to admit he loves her; another werewolf named Tommy; and a Kyubi fox demon named Sakura who has her own plans--which include eating Natsuki to complete her her nine tails and thereby her magical powers. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/60155.webp"},{"title":"Tenchi Muyou!: Galaxy Police Mihoshi Space Adventure","synopsis":"On a sunny day, Mihoshi Kuramitsu decides to take a peaceful nap while everyone else does chores. Sick of Mihoshi's laziness, Aeka Jurai Masaki questions her capability as a Galaxy Police Officer. Her pride wounded, Mihoshi decides to prove that she is a skilled first class detective by telling the story of how she and her partner, Kiyone Makibi, put a stop to a series of thefts involving Ultra Energy Matter. \n\nTo make it more fun, Mihoshi inserts Tenchi Masaki and the others into her story. However, her fantastical tale may just demonstrate her lack of a grip on reality rather than showcase her accomplishment as a talented officer.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1274/94457.webp"},{"title":"Taiho Shichau zo: Second Season","synopsis":"AA! Megami Sama creator, Kosuke Fujishima, is back with the second season of Taiho Schihauzo (You're Under Arrest). Same characters, two policewomen, the gentle Miyuki and the wild Natsumi teamed up together in Bokuto police station`s traffic division.\n\nOther characters including Kenichi, the motorcycle cop who has a feeling for Miyuki; Yoriko with her gossip and Aoi, a transvestite. They all ready to take on harmless criminals and costumed weirdos... You think you can have a better police station?\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/21852.webp"},{"title":"Burn Up Scramble","synopsis":"AD. 2023, Tokyo. Because of the change of the society such as internationalization and enlargement of the trading, the dark side of the society also continues changing. The criminals are getting deep, and their organizations are increasing its size, then the peace and security is getting worse.\n \nThe government takes it seriously, and decides to introduce an innovative system. In order to cope with the special criminals, an extralegal police is founded. \n\nIt is a special criminal team, Warriors, which consists of a few elite members. \n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/12/75500.webp"},{"title":"Detective Conan Magic File 5: Niigata - Tokyo Omiyage Capriccio","synopsis":"Another Detective Conan Magic File.","img":"https://cdn.myanimelist.net/images/anime/6/28938.webp"},{"title":"Crying Freeman","synopsis":"Yo Hinomura was an ordinary Japanese potter when a run-in with a Chinese mafia changed his life forever. Now an assassin for the 108 Dragons, Yo is the perfect killing machine. As a sign for remorse over his victims, he sheds tears after eliminating his targets. Because of this, he is infamously known by the Dragons and every crime syndicate in the world as \"Crying Freeman.\"\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/37721.webp"},{"title":"Meitantei Holmes","synopsis":"Loosely based on the \"Sherlock Holmes\" series by Sir Arthur Conan Doyle, Sherlock Hound turns all the classic characters into dogs. The canine Sherlock Holmes, his assistant Watson, and housemaid Mrs. Hudson work together to solve mysteries. The culprit is usually Professor Moriarty and his gang, who use all kinds of wacky contraptions to steal what they want.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/75723.webp"},{"title":"Taiho Shichau zo: Full Throttle","synopsis":"Miyuki Kobayakawa, fresh from forensics training in the United States and Natsumi Tsujimoto, from completing Japanese Self-Defense Force (JSDF) ranger training return in the long-awaited 3rd season of the highly popular series. This time, the duo rejoins active duty at Bokuto Police Department, fighting against crime using their wits and brawn, plus having some misadventures along the way. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/21616.webp"},{"title":"Detective Conan Movie 10: Promo Special","synopsis":"A promotional preview summary of the events in Detective Conan Movie 10: Requiem of the Detectives. Aired before the movie.","img":"https://cdn.myanimelist.net/images/anime/2/17584.webp"},{"title":"Mad★Bull 34","synopsis":"Daizaburo Edi-Ban, a Japanese-American, joins New York City's toughest precinct, the 34th. On his first day he is partnered up with John Estes, called Sleepy by his friends and Mad Bull by his enemies, a cop who stops crime with his own violent brand of justice. Mad Bull makes no qualms about executing common thieves with shotgun blasts if they even pose a minor threat to him or anyone around them. Mad Bull also often steals from prostitutes and does incredible amounts of property damage while fighting crime. Mad Bull's unpoliceman-like behavior often puts him in hot water with his partner Daizaburo and the 34th precinct. However, despite how reckless or illegal these acts are, a good cause is always revealed (For example, Sleepy uses the money he steals from the prostitutes to fund a venereal disease clinic and a home for battered and raped women). Perrine Valley, a police lieutenant, joins Daizaburo and Sleepy later on to help them tackle more difficult cases involving the mafia and drug-running.\n\nMad Bull 34 is inspired by the high-action buddy cop films of the '70s and '80s.\n\n(Source: Thevinnymac)","img":"https://cdn.myanimelist.net/images/anime/8/67821.webp"},{"title":"Detective Conan Movie 09: Promo Special","synopsis":"A promotional preview summary of the events in Detective Conan Movie 09: Strategy Above the Depths. Aired before the movie.","img":"https://cdn.myanimelist.net/images/anime/6/25397.webp"},{"title":"Detective Conan Bonus File: Fantasista Flower","synopsis":"\"Fantasista Flower\" is a side-story OVA related to The Eleventh Striker. \n\n(Source: Detective Conan World) ","img":"https://cdn.myanimelist.net/images/anime/13/38385.webp"},{"title":"Kidou Keisatsu Patlabor: New OVA","synopsis":"Special Vehicles Division 2 is back on duty, along with their Ingram Patrol Labor (Patlabor) robots. Using their courage as well as the Ingrams, Captain Goto's motley crew of officers battle crime in Tokyo city. They also deal with their personal lives, as well as the supernatural. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1183/96504.webp"},{"title":"Dirty Pair Flash","synopsis":"Kei and Yuri were originally junior auxiliary agents in the Worlds Works and Welfare Agency (W.W.W.A. or 3WA for short) when the two were paired together under the codename \"Lovely Angels.\" Kei was coming off her fourth probation for something she had done, and Yuri's dating exploits were common knowledge, not to mention the two had an instant dislike for each other when they met.\n\nAt first, Kei and Yuri refused to work with each other, and Kei even resigned from the 3WA. Afterwards, the two continued to work together, although they earned their nickname, \"the Dirty Pair\" because of all the collateral damage the two (unintentionally) cause in the completion of their cases. And even though the two now get along with one another, they continue to bicker and complain to each other.\n\nAlthough it is often said that these are younger versions of the original Lovely Angels Kei and Yuri, in truth this series is an alternate universe telling of Dirty Pair, set in the years 2248-49.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/1405/91068.webp"},{"title":"Burn Up!","synopsis":"To the unsuspecting eye Maki, Reimi and Yuka may not look like ace crime fighters, which might explain why they're stuck on traffic patrol instead of more \"exciting\" police duties.\n\nAll that changes when Yuka gets herself kidnapped by a white slave organization run by a politically connected businessman who's got the rest of the police cowed.\n\nNow it's up to Maki and Reimi to don skin-tight battle armor, liberate a tank, and make sure that a certain slaver learns that when you play with fire, you're going to get your ass burned!\n\n(Source: DVD Back Cover)","img":"https://cdn.myanimelist.net/images/anime/4/2888.webp"},{"title":"Taiho Shichau zo The Movie","synopsis":"Bokutou Precinct rarely deals with criminals more nefarious than speeding sportscar drivers. So when Officers Nikaido Yoriko and Aoi Futaba find a cache of illegal firearms in a stolen car, and a rash of traffic control malfunctions snarls traffic along Tokyo's streets, it is up to Tokyo's finest to figure out what's gone wrong. And of course, it'll take the talents of Kobayakawa Miyuki and Tsujimoto Natsumi to crack the case. But will Miyuki's trusty Mini-Pat and Natsumi's fierce determination be enough to stop a devious mastermind from exploiting the weaknesses of the system and crippling Tokyo—and the world—for good?\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/1921/92313.webp"},{"title":"Biohazard 4: Incubate","synopsis":"After the Playstation port of Resident Evil 4 hit the stores Capcom released a new 97 minute DVD some time later which intended to summarize the whole story of Resident Evil 4. It's played on English audio with Japanese subtitles. It also included a little book which explains the life on El Pueblo before and the arrival of Osmund Saddler. It also solved some plot holes like the whereabouts of the children. It contains many of the scenes original to Resident Evil 4.\n\n(Source: Resident Evil Wiki)","img":"https://cdn.myanimelist.net/images/anime/3/21456.webp"},{"title":"Dirty Pair: The Movie","synopsis":"Agerna is a planet rich in Vizorium, the one mineral necessary to space travel. So when a series of mysterious attacks on mining operations has the governments of the world pointing fingers and blaming each other, the World Welfare &amp; Works Association naturally sends in their top agents to investigate. But are the lovely angels up to the task of stopping a mad scientist bent on taking a long dormant alien race to its final evolutionary form? Throw in a thief who's hunting a bottle of World War II-vintage wine and it's a safe bet that nobody on the planet is safe. It's more chaos, more mayhem and even more destruction than ever before as the Dirty Pair take on their wildest case yet!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1855/92685.webp"},{"title":"Koroshiya-san: The Hired Gun","synopsis":"The comedy story follows the title character, who is regarded by himself and others as the best hit man in Japan. He goes by the motto, \"If I have an assignment, I will kill anything.\" However, his \"killing\" assignments have expanded to include everything from summer vacation homework to housekeeping. \"The hit man never fails to kill the target. Though he does not aim to, he also never misses the laughter.\"\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/55531.webp"},{"title":"Detective Conan: Black History","synopsis":"A special episode aired after ep. 490, it summarizes the history of confrontation with the black organization. ","img":"https://cdn.myanimelist.net/images/anime/2/86591.webp"},{"title":"Detective Conan: Conan vs. Kid - Shark &amp; Jewel","synopsis":"3D IMAX movie, shown only at the Suntory Museum in Osaka.","img":"https://cdn.myanimelist.net/images/anime/13/27101.webp"},{"title":"Hero Mask (2019)","synopsis":"Second part of Hero Mask.","img":"https://cdn.myanimelist.net/images/anime/1960/102191.webp"},{"title":"Double Decker! Doug &amp; Kirill: Extra","synopsis":"During the final episode pre-screening event on Friday, it was announced that Double Decker! Doug &amp; Kirill TV anime will get three extra episodes. Titled Double Decker! Doug &amp; Kirill: Extra, the three episodes will be streamed via Bandai Channel and other streaming websites between February and April 2019. The Blu-ray and DVD for the extra episodes will also be released on May 24, 2019.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1987/97850.webp"},{"title":"Dirty Pair OVA","synopsis":"Set in the future Kei and Yuri are Trouble Consultants for The 3WA. Code Named \"Lovely Angels\", but, they are known throughout the galaxy as The Dirty Pair. They always solve their case, but, not without causing collateral damage and mayhem.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/61127.webp"},{"title":"Miami Guns","synopsis":" Spoiled rich girl Yao Sakurakouji decides to join the Miami police force to enjoy car chases, gunfights and wanton destruction. The psychotic and not-too-bright Yao is partnered with Lu Amano, the soft-spoken and sharp-tongued daughter of the police chief. Together the dirty duo clean up the streets of Miami and take on a mysterious crime syndicate known only as 'The Organization'. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/783.webp"},{"title":"Kidou Keisatsu Patlabor: Reboot","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/3/82621.webp"},{"title":"Taiho Shichau zo Special","synopsis":"Best friends and partners Miyuki Kobayakawa and Natsumi Sujimoto, along with the rest of the gang at Bokuto station, confront a motley group of offenders ranging from hi-tech panty thieves, purse-snatchers, and traffic violators. Using Miyuki's driving prowess and tech knowledge, as well as Natsumi's spunk and strength, the duo at times must resort to unconventional methods to see that justice is served.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/21692.webp"},{"title":"Detective Conan: Black History 2","synopsis":"A special episode aired after ep. 490, it summarizes episodes 309 -&gt; 311.","img":"https://cdn.myanimelist.net/images/anime/10/86592.webp"},{"title":"Sin: The Movie","synopsis":"In Sin, Blade must unravel a series of mysterious kidnappings. As he delves into the city's merciless underworld, an elaborate mystery unfold; at is heart, the SinTEK corporation and its leader, the ruthless and beautiful Elexis Sinclair. A Brilliant biochemist, Sinclair will stop at nothing to achieve her goal: a plan that could force the next step of human evolution-or spell doom for mankind.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/42389.webp"},{"title":"Koukaku Kidoutai: Shin Movie Virtual Reality Diver","synopsis":"Animation studio Production I.G announced on Monday that it will enter the virtual reality (VR) content market with an app titled Koukaku Kidoutai Shin Gekijou-ban Virtual Reality Diver (Ghost in the Shell: The New Movie Virtual Reality Diver).\n\nThe app will offer an original story in 360° 3D video, which can be seen with a VR headset. A three-minute promotional video will be available worldwide for the Oculus Rift on Google Play and App Store, followed by the full work in Japanese and English.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/76203.webp"},{"title":"Detective Conan vs. Wooo","synopsis":"A web series \"Detective Conan vs. Wooo.\" This web short is an advertisement for the Wooo line of televisions in Japan.","img":"https://cdn.myanimelist.net/images/anime/7/29671.webp"},{"title":"Gosho Aoyama's Collection of Short Stories","synopsis":"GOSHO collection reveals the origin of the smash hit \"Detective Conan.\" \"GO\" into his world, and we will \"SHO\" you SEVEN romantic and exciting stories created by GOSHO AOYAMA.\n\nWAIT FOR ME (30 min.)\nA genius inventor, who is still a high school student, has a girlfriend two years older than him. One day, he invents a time machine and attempts to go two years back into the past, to become the same age as her. However, it is she who ultimately uses the machine to travel through time!\n\nTEN PLANETS IN THE NIGHT SKY (10 minutes)\nMeet Baby Conan! Yukiko Kudo is looking for her missing husband. The only clue to find him again is to decipher a mysterious message left for her. Their baby, Shinichi Kudo, one who later becomes the famous high school Detective Conan, will at this age already be offering some important hints for her.\n\nTHE WANDERING RED BUTTERFLY (7 minutes)\nA handsome detective, Yusaku Kitakata, receives phone calls from a mysterious woman day after day, with a new case each day. He of course solves them one by one. But the biggest mystery is who is this mysterious woman?\n\nPLAY IT AGAIN (30 minutes)\nThanks to the mystical powers of a Cherry Blossom Tree, a 70-year-old man with a secret sword technique goes back into the past and becomes the same age as his granddaughter. While enjoying his youth for the second time around, he notices that a player is after his granddaughter.\n\nSANTA CLAUS IN SUMMER (30 minutes)\nKeisuke, a young man of 17, accidentally activates the Earth Destruction System. The destiny of the Earth now depends on whether he can stop the system within 24 hours. However, suddenly amnesia strikes him and he forgets the pin number to stop the system. The time is running out...\n\nDETECTIVE GEORGE’S SPECIAL CASE (30 minutes)\nA girl is fleeing from men in black. She runs into a detective agency and discovers that the detective there is a super-miniature-size, cool dude. He risks his life trying to solve a case for this client. Will they come through in the end?\n\nMAKING OF DETECTIVE CONAN (7 minutes)\nDo you know how to make animation? Everybody wants to see the workings of an animation studio. Based on the concept of Detective Conan, the three sub-characters visit the animation studio of Detective Conan. This episode will surely catch the hearts of Detective Conan fans! (The actual animation is also involved in this special.)\n\n(Source: TMS Entertainment, LTD)","img":"https://cdn.myanimelist.net/images/anime/11/28507.webp"},{"title":"Sukeban Deka","synopsis":"Having spent time at a juvenile corrections facility, teenage delinquent Saki Asamiya is given a chance to redeem herself and delay her mother's possible death sentence by working as an undercover cop. Armed with nothing but a special yo-yo, Saki's assignment is to return to her high school and investigate on the corruption and mysterious deaths among the students. But in order to find the answers to the condition of her school, she must confront the wealthy and powerful Mizuchi sisters, who moved in and have taken control after her previous expulsion. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/3675.webp"},{"title":"Taiho Shichau zo in America","synopsis":"Fresh from being transferred to the LAPD, Miyuki and Natsumi must investigate some unusual car theft incidents in their area. And when Miyuki's yellow 1973 Ford Mustang Mach 1 is \"gone in 60 seconds\" (literally), the situation gets more complicated when they discover who the thief is.\n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/11/75565.webp"},{"title":"Detective Conan: Conan vs. Kid - Jet Black Sniper","synopsis":"3D IMAX movie, shown only at the Suntory Museum in Osaka.\n\nThe story involves a heist taking place on 15 Aug at the Takaramachi Jewelry Museum where a jewel worth 1 Billion Yen is stolen.","img":"https://cdn.myanimelist.net/images/anime/13/27102.webp"},{"title":"Taiho Shichau zo: Nagisa no Koutsuu Yuudou","synopsis":"Summer arrives to Bokuto Station. Miyuki and Natsumi have to work on a beach road protecting the safety of the civilians that are enjoying their summer vacations. Suffering because of the hot, the two officers were having problems to remain calm, but then, some pickpocket appeared on the beach causing a ruckus. The girls will do their best to catch the thief, control the traffic and enjoy their summer day.\n","img":"https://cdn.myanimelist.net/images/anime/11/21617.webp"},{"title":"Cop Craft: Utsukushiki Onna Kishi! Toraware no Yousei wo Oe!","synopsis":"Recap of the first four episodes of Cop Craft series from Tilarna's perspective.","img":"https://cdn.myanimelist.net/images/anime/1815/103061.webp"},{"title":"Dirty Pair: Lovely Angels yori Ai wo Komete","synopsis":"Released direct to video in Japan after the original TV series was canceled, this OVA is actually the final two episodes of the TV series.","img":"https://cdn.myanimelist.net/images/anime/7/29694.webp"},{"title":"Appleseed XIII Remix Movie 2: Yogen","synopsis":"In the wake of the destruction of a worldwide non-nuclear war, the city Olympus has become the control center of the world. Run by Bioroids (cloned humans made from only the best DNA), it is defended from terrorists by special military forces. Among these are former LAPD SWAT member Deunan Knute and her multipurpose cyborg partner Briareos. They face a challenge from the Human Liberation Front and its terrorist underbelly the Argonauts. The leader of this group, Al Ceides, supposedly died 20 years ago in an attack on Poseidon, but now his shadow emerges once again.\n\n(Source: Aniworlds)","img":"https://cdn.myanimelist.net/images/anime/6/37085.webp"},{"title":"Appleseed XIII Remix Movie 1: Yuigon","synopsis":"This is a remix, theatrical release of the first half of the Appleseed XIII series.","img":"https://cdn.myanimelist.net/images/anime/3/64539.webp"},{"title":"L/R: Licensed by Royal","synopsis":"Jack Hofner and Rowe Rikenbacker are Cloud 7's L/R. Their job is to protect the Royal family of Ishtar, their treasures, and their reputation. Jack &amp; Rowe face one of the toughest missions of their career when they are assigned to protect Noelle, a candidate for the 15 Year Princesse contest. It starts out simple, but soon all of Cloud 7 are involved in a web of intrigue that includes bombings, corruption and murder. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/14587.webp"},{"title":"Kaiketsu Jouki Tanteidan","synopsis":"The scene is Steam City, a London-ish city which represents an entire civilization run by coal and steam power. Because of steam, the city is sometimes covered in a mist. Villains take advantage of the steamy mist to hide and execute their evil plans. Only a few dare venture into what's beyond the steamy mist. They are known as the Steam Detectives: Narutaki (and his convertible all-purpose pistol), his nurse-assistant Lingling, and his Megamaton robot Gohliki.\n \n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/20557.webp"},{"title":"Dirty Pair no Ooshoubu: Nolandia no Nazo","synopsis":"The Dirty Pair are travelling to the planet of Ookbar in search of a missing girl. Kei and Yuri have traced Missinie to the forest of Nolandia, but their investigations have stalled thanks to the less-than-helpful Chief of Security. But the Dirty Pair have never let a little bureaucracy stand in their way.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/5/81369.webp"},{"title":"Virus: Virus Buster Serge","synopsis":"Neo Hong Kong, 2097: The world has changed. Advances in genetic engineering and cybernetics have created an environment full of artificially enhanced humans and intelligent super-computers that operate using biological software. But the same technology that has allowed man and machine to merge has made both susceptible to a new kind of threat—digital viruses capable of controlling their hosts.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1388/94194.webp"},{"title":"Itazura Majo to Nemuranai Machi","synopsis":"The story is set in New York which is lit up with Christmas lights. Tokyo Metropolitan Police officer Akari Kido is directing traffic while on her international exchange training program, when a witch-like character pulls a \"Christmas Party\" prank. Just before a runaway trailer truck smashes into Akari, a mysterious girl suddenly appears and shouts, \"I'm going to protect New York and Akari!\"  \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/89169.webp"},{"title":"Dirty Pair: Bouryaku no 005-bin","synopsis":"It's Chief Gooley's worst nightmare come true. The Lovely Angels are back on the job, but this time the 3WA's Central Computer has assigned them two cases at the same time: investigate a space liner explosion in which three hundred people died, but no one`s come forward to claim any insurance money; and find a missing scientist and his family.\n\nCould the two cases be connected? Only the Central Computer knows and it's not talking. So it's up the Dirty Pair to get down and dirty and solve the puzzle before time runs out for a grieving grandfather, his family and the universe!\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/7/82031.webp"},{"title":"Sanctuary","synopsis":"Two Japanese survivors of the Khmer Rouge massacres in Cambodia vow to find a sanctuary, even if they have to build it themselves. Returning to Japan, they take seemingly opposite paths: one becomes a politician, the other a gangster.\n\nAs Asami and Houjou work through the linked worlds of politics and crime in modern Japan, they don't hesitate to do anything necessary to secure their own positions and stay true to their vow. Loyal to no one else, they find their friendship increasingly tested as they rise in their chosen fields.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1795/105898.webp"},{"title":"Detective Conan Movie 24: Hiiro no Dangan","synopsis":"24th Detective Conan Movie.","img":"https://cdn.myanimelist.net/images/anime/1865/105413.webp"},{"title":"Assemble Insert","synopsis":"A criminal group known as Demon Seed terrorizes Tokyo with its vast armies of mecha. The local police is afraid to confront them, but one person stands in their way: Maron Namikaze, a 13-year-old idol singer with a catchy voice and unbelievable superhuman strength.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/61291.webp"},{"title":"Detective Conan: Happy New Year Special","synopsis":"Special episode consisting of two short stories. The first being an expanded version of Detective Conan: The Fugitive Kogorou Mouri, which was never aired on TV till now. The second half being a brand new New Years Day segment.","img":"https://cdn.myanimelist.net/images/anime/4/82692.webp"},{"title":"Dirty Pair Flash 2","synopsis":"Always causing more destruction than they prevent, special agents Kei and Yuri face tough challenges while at an amusement park planet. This anime set finds the pair facing off against an android hit woman, transvestite assassins, ghosts and more. In addition, the Lovely Angels get into several wild adventures while tracking down a con man and giving love advice to the computer programmer they're protecting. \n\n(Source: Netflix) ","img":"https://cdn.myanimelist.net/images/anime/9/35253.webp"},{"title":"Bean Bandit","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1651/93298.webp"},{"title":"Dirty Pair Flash 3","synopsis":"Sexy superagents Kei and Yuri find themselves in serious trouble when they attempt to track down Kei's godson and cross paths with a killer ski patrol. This collection of episodes also features the crime fighters fending off seagulls and assassins. There is no time to rest for these two anime characters, who must continually put their lives on the line in order to successfully complete their important missions. \n\n(Source: Netflix) ","img":"https://cdn.myanimelist.net/images/anime/8/35247.webp"},{"title":"Keishichou Tokumubu Tokushu Kyouakuhan Taisakushitsu Dainanaka: Tokunana OVA","synopsis":"The OVA will be focus on when Kujaku Nijou first entering group, which occurs one year before the main anime begins.","img":"https://cdn.myanimelist.net/images/anime/1417/104653.webp"},{"title":"Taiho Shichau zo: Full Throttle - Watashitachi no Iru Basho","synopsis":"Rounding off season 3, Natsumi and Miyuki reminiscince about their lives at Bokuto station while hearing from people they've met through work. (This is limited to characters they've met in season 3.)\n\nWe are also introduced to Bokuto Station's two new recruits; Kaori Takano and Sakura Fujieda. Starting off their duty, they are taken on a field trip by Miyuki and Natsumi and quickly find out what will be expected of them as police officers.","img":"https://cdn.myanimelist.net/images/anime/9/22541.webp"},{"title":"Ojousama Sousamou","synopsis":"Debutante Detective Corps begins with introductions to the five main characters, Miyuki, Reika, Youko, Nina, and Kimiko. It seems these five girls are incredibly rich and have been sent a threatening video tape by forces unknown. A police guard is set up at the school where the girls have enrolled. Kimiko, however, doesn't like the idea of being cooped up at school, and convinces the rest of the girls to trick the police into leaving. No sooner are the police gone, however, then the girls are assaulted by three armed terrorists. What ensues is a rather silly escapade with our heroines attempting to thwart their attackers. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1556/97264.webp"},{"title":"Luv Wave","synopsis":"Takikawa Kanako, a secret agent that specialize in information and assassination. He has a robot girl for assistant. So far, they have 100% success rate, but their new target doesn't seem to want to stay dead. While finding out what's going on, they have to deal with a world network stopping virus and a strange new drug. Can he remember and how much does she love him?\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/2/5153.webp"},{"title":"Yuusha Keisatsu J-Decker","synopsis":"Grade schooler Yuuta Tomonaga stumbles upon Deckerd, a humanoid robot under construction by the Japanese police, built to fight advanced forms of crime. Yuuta's constant contact with Deckerd gives the robot a \"heart,\" or personality; when Yuuta is recruited as the \"boss\" of the \"Brave Police\" as a result, a true human/robot partnership occurs.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/1999/91843.webp"},{"title":"HeatGuy J Special","synopsis":"In the city of Judoh, Claire Leonelli has inherited leadership of the Mafia group \"Vampire\" following the death of his father. To keep Claire's and other criminal activities in check, the city's Bureau of Urban Safety has Special Services Division operative Daisuke Aurora and the super android codenamed \"J\" (whose identity is apparently kept in secrecy, as androids are banned in the city). With both of them around, crime now has little room to breathe in Judoh.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/56995.webp"},{"title":"Detective Conan: The Bomb Demon That Came From the Picture Book","synopsis":"Real Escape Game company SCRAP announced that its currently-touring Detective Conan attraction \"Scotland Yard kara no Dasshutsu\" (Escape From Scotland Yard) will get a tie-in anime special. The two-episode special, titled Ehon kara Tobidasu Bakudan Ma (The Bomb Demon That Came From the Picture Book), will air this winter.\n\nThe Real Escape Game's story is set in the newly opened theme park Touto London City. Attractions like the Tower Bridge Coaster, Buckingham Maze, and British Museum Theater mimic locations in real-world London. Participants in the Real Escape game visit Scotland Yard to take on the main attraction called Mystery Game. When the curtain raises on the game, and explosion goes off inside the park. The sound signals the start of a life-and-death game. The key to deactivating three bombs scattered throughout the park is a pop-up book that the \"bomb demon\" left behind. To stop the countdown, participants must uncover the truth in the pop-up book. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/86779.webp"},{"title":"TANK S.W.A.T. 01","synopsis":"Masamune Shirow presents a story about the Dominion Tank Police dealing with terrorists taking over the NT Building with AI driven tanks.","img":"https://cdn.myanimelist.net/images/anime/2/34555.webp"},{"title":"City Hunter: Ryou no Propose","synopsis":"A scan of the upcoming issue of Monthly Comic Zenon magazine, revealed that City Hunter will be receiving a new OVA adaptation. It will be bundled with the release of the new version of the manga, City Hunter XYZ Edition, on July 18. This announcement was made to commemorate the 30th anniversary of City Hunter. The OVA will promote the new animation and cast members.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/10/74209.webp"},{"title":"Kamyla","synopsis":"Late 20th century, during a time of rampant social corruption, a criminal market in human sex slavery has become increasingly common. The Japanese government created a specially trained task force to combat these crimes. \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/2/41751.webp"},{"title":"Wild 7","synopsis":"An elite police crime fighting team is formed using convicted criminals. Using their first hand knowledge of the criminal mindset, the Wild 7 are first sent after a gang of Bank robbers. Then in Wild Biker Knights they are sent after a huge crime syndicate that has many high powered government officials in its deep pockets.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1886/96607.webp"},{"title":"Hurricane Polymar","synopsis":"Yoroi Takeshi is a carefree and somewhat naïve youth, who works as an assistant to the bumbling detective wannabe Kuruma Jo (who frequently proclaims himself the heir apparent to the title of Greatest Detective “Sherlock Holmes”). \n\nFrom their rundown and shabby office, they run a humble if not failing private investigation service. The spunky and cute Nanba Teru (who’s father owns the building when Jo and Takeshi reside in) frequently interferes in their affairs by threatening eviction (Jo is continually months behind in back rent). \n\nSince they rarely get any clients, they must resort to eavesdropping and spying on the Secret International Police Department headquarters, located in the building across from theirs in order to get their assignments. Unbeknownst to Jo and Teru, Takeshi has a deep secret. Not only is Takeshi the son of the International Police Department Chief but in times of peril and danger, mild-mannered Takeshi uses his trusty Poly-Met (Polymer Helmet) to transform into the Superhero “Hurricane” Polymer, a red suited masked man with incredible fighting abilities and superhuman strength. The only one who knows Takeshi’s secret is his lazy Saint Bernard, Daisaku, who always likes to provide cutting commentary to the audience (using his inner voice). \n\nTogether Jo and Takeshi (as Polymer) confront and battle a myriad of evil organizations, criminal gangs, mutants and monsters as they fight crime in the future city of Washinkyo (Washington/Tokyo).\n\n(Source: japanhero.com)","img":"https://cdn.myanimelist.net/images/anime/9/60393.webp"},{"title":"Mirai Keisatsu Urashiman","synopsis":"By chance, Ryo has slipped from the 1980s into the future, and is trying to get back. In the interim, he's working for the police force of the future, solving cases by applying his unique and often comical approach.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1605/91989.webp"},{"title":"Keishichou Tokumubu Tokushu Kyouakuhan Taisakushitsu Dainanaka: Tokunana Recap","synopsis":"Recap of first eight episodes of Keishichou Tokumubu Tokushu Kyouakuhan Taisakushitsu Dainanaka: Tokunana.","img":"https://cdn.myanimelist.net/images/anime/1490/104552.webp"},{"title":"Kochira Katsushikaku Kameari Kouenmae Hashutsujo The Movie","synopsis":"The wicked multi-billionaire, Shinatora, builds wretched, ugly buildings. The explosives genius calling himself Benten has targeted Shinatora's empire and begins to destroy the monstrosities that are wiping out whole sections of downtown Tokyo. In cooperation with the local police force, the FBI has sent Lisa Hoshino, a bomb disposal expert, and her robot assistant, Dandy, on a lecture tour of Japan. Ryotsu is reluctantly paired with Lisa to protect the people of the Kameari district. Why does Benten only target Shinatora's buildings? What is his next target?\n\nAnother email warning arrives at the Katsushika Police Station. Benten's next target is the newly built, gigantic amusement park, Shinatora World. Lisa and Ryotsu hurry to the scene. What they find is a huge Soviet-era rocket armed with a massive bomb powerful enough to obliterate the entire area of Katsushika.\n\nWhat can Ryotsu do?\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/8/58875.webp"},{"title":"Koukaku Kidoutai: Ghost Chaser","synopsis":"A new ride-like VR attraction. The ride will debut at the \"hexaRide\" attraction area of the renewed Diver City Tokyo Plaza. The ride attraction allows up to 12 people to ride at the same time using Q-Ride equipment with six-directional movement, and VR headsets. The ride costs 1,000 yen (about US$9) per person.\n\nThis story is set in the Kuzan Republic. The defense minister, who will take part in a meeting of the Next-generation Weapon Coordination Council, has ordered an advance onsite inspection.\n\nRide participants are tasked with providing escort while securing an inspection route in Public Security Section 9, where Motoko Kusanagi serves as leader.\nRiders will use the hexaRide vehicle to enter cyberspace and, serving as a Public Security Section 9 agent, join in an attack on revolutionary movement forces.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1427/95917.webp"},{"title":"Sabu to Ichi Torimono Hikae","synopsis":"The series follows the adventures of Sabu, a young Edo bakufu investigator traveling with the blind master swordsman Ichi. In their travels, they assist the common people in solving mysteries and righting wrongs (usually committed by bandits or corrupt officials). Sabu is engaged to Midori, the daughter of his boss, who works as a police officer for the Tokugawa shogunate.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/9/84054.webp"},{"title":"Detective Conan: Amuro Secret Call","synopsis":"Special two-part bonus video included on the Limited Deluxe Edition BD/DVD of the Detective Conan: Zero The Enforcer Movie. ","img":"https://cdn.myanimelist.net/images/anime/1039/98287.webp"},{"title":"Mainichi ga Nichiyoubi","synopsis":"Yumi Takeshita is a cheerful lady who recently joined the police force of the Tawagoto precinct. When she was still a middle school student, she was saved from being hit by a truck thanks to a stranger. Several years later, she meets her savior once again while performing her first arrest attempt. He is a magician named Tohru Ichidaiji and Yumi is charmed to finally meet him. As a police officer who is assigned to several odd tasks, she will keep asking for the help of the handy Tohru.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/62363.webp"},{"title":"Tong Zhi Zhe","synopsis":"A Jack of All Trades is a person who can competently do all kinds of jobs. Loser Zhang Dabao is a professional Jack of All Trades, but his living conditions are, shall we say, less than satisfactory. One day, a beautiful woman who is being harassed by a pervert approaches him for help. He accepts, and soon embarks on a mission like nothing the world has seen before.","img":"https://cdn.myanimelist.net/images/anime/8/81483.webp"},{"title":"Death Note","synopsis":"A shinigami, as a god of death, can kill any person—provided they see their victim's face and write their victim's name in a notebook called a Death Note. One day, Ryuk, bored by the shinigami lifestyle and interested in seeing how a human would use a Death Note, drops one into the human realm.\n\nHigh school student and prodigy Light Yagami stumbles upon the Death Note and—since he deplores the state of the world—tests the deadly notebook by writing a criminal's name in it. When the criminal dies immediately following his experiment with the Death Note, Light is greatly surprised and quickly recognizes how devastating the power that has fallen into his hands could be.            \n\nWith this divine capability, Light decides to extinguish all criminals in order to build a new world where crime does not exist and people worship him as a god. Police, however, quickly discover that a serial killer is targeting criminals and, consequently, try to apprehend the culprit. To do this, the Japanese investigators count on the assistance of the best detective in the world: a young and eccentric man known only by the name of L.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/9453.webp"},{"title":"Psycho-Pass","synopsis":"Justice, and the enforcement of it, has changed. In the 22nd century, Japan enforces the Sibyl System, an objective means of determining the threat level of each citizen by examining their mental state for signs of criminal intent, known as their Psycho-Pass. Inspectors uphold the law by subjugating, often with lethal force, anyone harboring the slightest ill-will; alongside them are Enforcers, jaded Inspectors that have become latent criminals, granted relative freedom in exchange for carrying out the Inspectors' dirty work.\n\nInto this world steps Akane Tsunemori, a young woman with an honest desire to uphold justice. However, as she works alongside veteran Enforcer Shinya Kougami, she soon learns that the Sibyl System's judgments are not as perfect as her fellow Inspectors assume. With everything she has known turned on its head, Akane wrestles with the question of what justice truly is, and whether it can be upheld through the use of a system that may already be corrupt.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/43399.webp"},{"title":"Monster","synopsis":"Dr. Kenzou Tenma, an elite neurosurgeon recently engaged to his hospital director's daughter, is well on his way to ascending the hospital hierarchy. That is until one night, a seemingly small event changes Dr. Tenma's life forever. While preparing to perform surgery on someone, he gets a call from the hospital director telling him to switch patients and instead perform life-saving brain surgery on a famous performer. His fellow doctors, fiancée, and the hospital director applaud his accomplishment; but because of the switch, a poor immigrant worker is dead, causing Dr. Tenma to have a crisis of conscience.\n\nSo when a similar situation arises, Dr. Tenma stands his ground and chooses to perform surgery on the young boy Johan Liebert instead of the town's mayor. Unfortunately, this choice leads to serious ramifications for Dr. Tenma—losing his social standing being one of them. However, with the mysterious death of the director and two other doctors, Dr. Tenma's position is restored. With no evidence to convict him, he is released and goes on to attain the position of hospital director. \n\nNine years later when Dr. Tenma saves the life of a criminal, his past comes back to haunt him—once again, he comes face to face with the monster he operated on. He must now embark on a quest of pursuit to make amends for the havoc spread by the one he saved.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/18793.webp"},{"title":"Psycho-Pass 2","synopsis":"A year and a half after the events of the original sci-fi psychological thriller, Akane Tsunemori continues her work as an inspector—enforcing the Sibyl System's judgments. Joining her are new enforcers and junior inspector Mika Shimotsuki, a young woman blindly and inflexibly loyal to Sibyl. As Akane ponders both the nature of her job and the legitimacy of Sibyl's verdicts, a disturbing new menace emerges.\n\nA mysterious figure has discovered a way to control the Crime Coefficient—a number compiled from mental scans that allows Sibyl to gauge psychological health and identify potential criminals. Through these means, he is able to murder an enforcer, leaving behind a cryptic clue: \"WC?\" scrawled in blood on a wall.\n\nAkane and the rest of Division 1 soon find themselves playing a deadly game against their new foe, coming face-to-face with a conspiracy threatening not only the authority of the Sibyl System, but the very foundation of Akane's own convictions.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1197/100616.webp"},{"title":"Koukaku Kidoutai","synopsis":"In the year 2029, Niihama City has become a technologically advanced metropolis. Due to great improvements in cybernetics, its citizens are able to replace their limbs with robotic parts. The world is now more interconnected than ever before, and the city's Public Security Section 9 is responsible for combating corruption, terrorism, and other dangerous threats following this shift towards globalization.\n\nThe strong-willed Major Motoko Kusanagi of Section 9 spearheads a case involving a mysterious hacker known only as the \"Puppet Master,\" who leaves a trail of victims stripped of their memories. Like many in this futuristic world, the Puppet Master's body is almost entirely robotic, giving them incredible power. \n\nAs Motoko and her subordinates follow the enigmatic criminal's trail, other parties—including Section 6—start to get involved, forcing her to confront the extremely complicated nature of the case. Pondering about various philosophical questions, such as her own life's meaning, Motoko soon realizes that the one who will provide these answers is none other than the Puppet Master themself.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/82594.webp"},{"title":"Koukaku Kidoutai: Stand Alone Complex","synopsis":"In the not so distant future, mankind has advanced to a state where complete body transplants from flesh to machine is possible. This allows for great increases in both physical and cybernetic prowess and blurring the lines between the two worlds. However, criminals can also make full use of such technology, leading to new and sometimes, very dangerous crimes. In response to such innovative new methods, the Japanese Government has established Section 9, an independently operating police unit which deals with such highly sensitive crimes.\n\nLed by Daisuke Aramaki and Motoko Kusanagi, Section 9 deals with such crimes over the entire social spectrum, usually with success. However, when faced with a new A level hacker nicknamed \"The Laughing Man,\" the team is thrown into a dangerous cat and mouse game, following the hacker's trail as it leaves its mark on Japan.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/50857.webp"},{"title":"Mousou Dairinin","synopsis":"The infamous Shounen Bat (Lil' Slugger) is terrorizing the residents of Musashino City. Flying around on his rollerblades and beating people down with a golden baseball bat, the assailant seems impossible to catch—much less understand. His first victim, the well-known yet timid character designer Tsukiko Sagi, is suspected of orchestrating the attacks. Believed only by her anthropomorphic pink stuffed animal, Maromi, Tsukiko is just one of Shounen Bat's many victims.\n\nAs Shounen Bat continues his relentless assault on the town, detectives Keiichi Ikari and Mitsuhiro Maniwa begin to investigate the identity of the attacker. However, more and more people fall victim to the notorious golden bat, and news of the assailant begins circulating around the town. Paranoia starts to set in as chilling rumors spread amongst adults and children alike.\n\nWill the two detectives be able to unravel the truth behind Shounen Bat, or will the paranoia get to them first?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/10240.webp"},{"title":"Detective Conan","synopsis":"Shinichi Kudou, a high school student of astounding talent in detective work, is well known for having solved several challenging cases. One day, when Shinichi spots two suspicious men and decides to follow them, he inadvertently becomes witness to a disturbing illegal activity. Unfortunately, he is caught in the act, so the men dose him with an experimental drug formulated by their criminal organization, leaving him to his death. However, to his own astonishment, Shinichi lives to see another day, but now in the body of a seven-year-old child.\n\nPerfectly preserving his original intelligence, he hides his real identity from everyone, including his childhood friend Ran Mouri and her father, private detective Kogorou Mouri. To this end, he takes on the alias of Conan Edogawa, inspired by the mystery writers Arthur Conan Doyle and Ranpo Edogawa.\n\nDetective Conan follows Shinichi who, as Conan, starts secretly solving the senior Mouri's cases from behind the scenes with his still exceptional sleuthing skills, while covertly investigating the organization responsible for his current state, hoping to reverse the drug's effects someday.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/75199.webp"},{"title":"Psycho-Pass Movie","synopsis":"Due to the incredible success of the Sibyl System, Japan has begun exporting the technology to other countries with the hope that it will one day be used all around the world. In order to test its effectiveness in a foreign location, the war-torn state of the South East Asian Union (SEAUn) decides to implement the system, hoping to bring peace and stability to the town of Shambala Float and keep the population in check.\n\nHowever, a group of anti-Sibyl terrorists arrive in Japan, and the Ministry of Welfare's Public Safety Bureau discovers significant evidence that the invaders are being aided by Shinya Kougami, a former Enforcer who went rogue. Because of their past relationship, Akane Tsunemori is sent to SEAUn to bring him back, but with their last meeting years in the past, their reunion might not go quite as planned.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/71793.webp"},{"title":"Koukaku Kidoutai: Stand Alone Complex 2nd GIG","synopsis":"Following the closure of the \"Laughing Man\" case, Section 9 is re-established by Japan's newly elected Prime Minister, Youko Kayabuki, to combat the persistent threat of cyber-terrorism.\n\nA group calling themselves \"The Individual Eleven\" has begun committing acts of terror across Japan. While Motoko Kusanagi, Daisuke Aramaki, Batou, and the other members of Section 9 investigate this new menace, the Japanese government faces a separate crisis, as foreign refugees displaced by the Third World War seek asylum in Japan. But as the members of the special-ops team continually encounter Gouda Kazundo—a leading member of the Cabinet Intelligence Service—in their hunt, they begin to suspect that he may be involved, and that the events of the refugee crisis and The Individual Eleven may be more connected than they realize...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/51465.webp"},{"title":"B: The Beginning","synopsis":"On the islands of Cremona, a vigilante runs amok. Celebrated by some and hunted by others, the notorious \"Killer B\" takes justice into his own hands, armed with a sharp blade and superhuman abilities. Unable to apprehend this renegade, the Royal Investigation Service (RIS) calls upon the expertise of Keith Flick, a seasoned, yet eccentric detective who was relegated to the Archives Department following a personal loss. As crimes in Cremona begin to escalate, from stealthy executions of wrongdoers to sophisticated strikes on public figures, it soon becomes clear that there is more than one person responsible.\n\nWith the help of his impulsive sidekick Lily Hoshina, and unexpected aid from the elusive Killer B himself, Keith begins to unravel plots involving secret organizations, domestic terrorism, and human experiments. When the involvement of the RIS extends beyond the scope of justice, the extent of the government's corruption—as well as the trustworthiness of close allies—are thrown into question. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1564/90469.webp"},{"title":"Rail Wars!","synopsis":"Rail Wars! takes place in an alternate universe where the Japanese government remains in control of the nation's railway systems. Because of the stability afforded by the leadership of the government, the railway system is allowed to flourish.\n\nNaoto Takayama aspires to become an employee for Japan National Railways because of the comfortable life that it will enable him to live. In order to accomplish this he enters its training program, where students must demonstrate their knowledge of trains as well as their ability to be ready for any challenge that might arise.\n\nDuring this time period he will encounter other students such as the athletically gifted Aoi Sakura, the constantly hungry Sho Iwaizumi, and the human encyclopedia Haruka Komi. Together they will work towards surviving their trainee period, all the while taking on purse snatchers, bomb threats, and the looming specter of the extremist “RJ” group who wants to privatize the railway system.","img":"https://cdn.myanimelist.net/images/anime/13/65671.webp"},{"title":"Death Note: Rewrite","synopsis":"1. Genshisuru Kami (Visions of a God)\nA two hour episode of Death Note, mainly a compilation of the confrontations between Light and L, re-edited from Ryuk's perspective with new dialogue and soundtrack along with additional animation that could not be included in the original series.  An Unnamed Shinigami comes to Ryuk to question him about his new story in the human world.\n\n2. L o Tsugu Mono (L's Successors)\nThis story continues where the previous left off, continuing the story of Light. As the previous special told Light and L's battles, this story does the same with the conflicts between Light, Mello, and Near.  \n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/13/8518.webp"},{"title":"Psycho-Pass 3","synopsis":"Thanks to the Sibyl System, the mental states of society can now be measured on a numerical scale. Using these \"crime coefficients,\" a culprit can be apprehended before they ever commit a crime. But is it a perfect system? For Inspectors Kei Mikhail Ignatov and Arata Shindou, that remains to be seen, as their career with the Public Safety Bureau's Crime Investigation Department has only just begun. \n\nShindou and Ignatov are assigned to investigate the crash of a ship carrying immigrants, but they begin to suspect that it was no mere accident. Meanwhile, a mysterious group called Bifrost is observing them from the shadows, but they aren't the only ones who have taken an interest in the two new Inspectors...\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/1406/104344.webp"},{"title":"Id:Invaded","synopsis":"The Mizuhanome System is a highly-advanced development that allows humans to enter one of the most intriguing places in existence—the mind of a criminal. Appearing as a bizarre mess of thoughts, an id well is the manifestation of a murderer's unconscious mind. Kura, a specialized police squad, is tasked with analyzing these complex psychological planes to track down the culprits. Brilliant detective Sakaido assists the police by investigating the id wells and piecing together the countless clues scattered within.\n\nHowever, there is a rule regarding those who enter the id wells: you are only permitted to dive into one if you have killed someone yourself. Such is the case for former detective Akihito Narihisago, Sakaido's real-world counterpart. Two years ago, his daughter was brutally murdered by a serial killer, driving Narihisago to seek his revenge.\n\nDespite finding himself on the other side of the law, Narihisago nevertheless continues to assist the police. While his detective skills continue to prove useful toward the investigations, Narihisago discovers he may not have everything figured out—especially regarding those he despises most, serial killers.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1889/105337.webp"},{"title":"Koukaku Kidoutai 2: Innocence","synopsis":"With Major Motoko Kusanagi missing, Section 9's Batou is assigned to investigate a string of gruesome murders—seemingly at the hands of faulty gynoids, or sex robots. But when a faulty gynoid leaves Batou a cryptic message, he begins to question the cause of their malfunctions. Suspicions of politically motivated murder and an illegal \"ghost\" quickly crop up, drawing Batou and his partner Togusa into a perilous web of conspiracy.\n\nAs their investigation goes on, the line between man and machine continues to blur, and reality and perception become indistinguishable. Confronting strange and dangerous foes, Batou and Togusa explore a futuristic world filled with machines and living dolls but utterly devoid of humanity.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/75628.webp"},{"title":"Jin-Rou","synopsis":"After witnessing the suicide bombing of a terrorist girl, Constable Kazuki Fuse becomes haunted by her image, and is forced to undergo retraining for his position in the Capital Police's Special Unit. However, unknown to him, he becomes a key player in a dispute between Capital and Local Police forces, as he finds himself increasingly involved with the sister of the very girl he saw die.","img":"https://cdn.myanimelist.net/images/anime/1323/103343.webp"},{"title":"ACCA: 13-ku Kansatsu-ka","synopsis":"ACCA—a national body of the kingdom of Dowa that provides public services to the citizens of the country—was established as part of the peace settlement between the king of Dowa and the 13 states of the country during a revolt. One hundred years later, Dowa is in a period of unprecedented peace, due in part to the ACCA system. However, rumors of a coup d'état start to surface. Jean Otus, the second-in-command of the inspection department of ACCA, is charged with inspecting all 13 state branches. What will he discover as he performs his audit?\n\nIntriguing and mysterious, ACCA: 13-ku Kansatsu-ka is a politically-themed mystery that reveals a world of diverse cultures and lifestyles, with intricate connections between its characters, as the truth of the coup d'état slowly unfolds.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/83776.webp"},{"title":"Gyakuten Saiban: Sono \"Shinjitsu\", Igi Ari!","synopsis":"Since he was a child, Ryuuichi Naruhodou's dream was to become a defense attorney, protecting the innocent when no one else would. However, when the rookie lawyer finally takes on his first case under the guidance of his mentor Chihiro Ayasato, he realizes that the courtroom is a battlefield. In these fast paced trials, Ryuuichi is forced to think outside the box to uncover the truth of the crimes that have taken place in order to prove the innocence of his clients.\n\nGyakuten Saiban: Sono \"Shinjitsu\", Igi Ari! follows Ryuuichi as he tackles cases to absolve the falsely accused of the charges they face. It will not be easy—standing in his path is the ruthless Reiji Mitsurugi, a prosecutor who will stop at nothing to hand out guilty verdicts. With his back against the wall, the defense attorney must carefully examine both evidence and witness testimony, sifting through lies to solve the mystery behind each case. With a shout of \"objection!,\" the battle in the courtroom begins!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/79448.webp"},{"title":"Witch Hunter Robin","synopsis":"Witches are individuals with special powers like ESP, telekinesis, mind control, etc. Robin, a 15-year-old craft user, arrives from Italy to Japan to work for an organization named STN Japan Division (STN-J) as a replacement for one of STN-J's witch hunters who was recently killed. Unlike other divisions of STN, STN-J tries to capture the witches alive in order to learn why and how they became witches in the first place.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1796/91065.webp"},{"title":"Koukaku Kidoutai: Stand Alone Complex - Solid State Society","synopsis":"A.D. 2034. It has been two years since Motoko Kusanagi left Section 9. Togusa is now the new leader of the team, that has considerably increased its appointed personnel. The expanded new Section 9 confronts a rash of complicated incidents, and investigations reveal that an ultra-wizard hacker named the Puppeteer is behind the entire series of events.\n\nIn the midst of all, Batou, who was stalking the case on a separate track, encounters Motoko. She goes away after saying, \"Stay away from the Solid State Society.\" Batou is left with a doubt in his mind. Could Motoko be the Puppeteer?\n\nThe series of intriguing incidents that Section 9 faces gradually link together almost artistically. Who is the Puppeteer? What will happen to Batou's relationship with Motoko? What is the full truth behind this carefully planned perfect crime? And what will the outcome be? Mysteries surround the Solid State Society...\n\n(Source: Production I.G.)","img":"https://cdn.myanimelist.net/images/anime/4/29816.webp"},{"title":"Cop Craft","synopsis":"Fifteen years ago, a hyperspace gate appeared in the middle of the Pacific Ocean, connecting Earth to a strange world filled with fairies and monsters. The city of San-Teresa became a home for over two million of these otherworldly visitors. Unfortunately, the population boom also brought its fair share of problems—drugs, prostitution, and trafficking. To combat the rampant crime lurking in the city's shadows, a new department was established in the San-Teresa Metropolitan Police.\n\nFormer JSDF soldier Kei Matoba is one of the best cops that the department has to offer, despite his inclination to occasionally bend the rules. After a fairy trafficking case goes wrong, Kei loses Rick Fury, his friend and partner of four years, setting him on a quest for vengeance. To help him with the case, the department pairs him with Tilarna Exedilika, a noble of the Farbani Kingdom. As one of the Knights of Mirvor, her duty is to rescue the noble fairy that Kei encountered during his last case. Despite his distaste for non-humans, he accepts the arrangement at the request of his superiors. Now, the unlikely duo must come together and overcome their differences in order to return the missing fairy to her country and avenge the death of Kei's partner.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1365/103219.webp"},{"title":"Inferno Cop","synopsis":"Jack Knife Edge Town is as edgy as it sounds, and it's up to Inferno Cop to stop that edge from tearing his city apart. He's both law and outlaw, dispensing ungodly justice to evildoers like a candy machine. Lowlifes, gangsters, and even hellspawn all infest Inferno Cop's hunting ground, but that's the good news. The bad news? Prior to the story, his family was brutally murdered by Southern Cross, a shady organization that made the worst mistake imaginable by doing so. Now, Inferno Cop's limiters have been removed and his mercy rung more dry than the entrails of his victims. \n\nSomething is welling up in Inferno Cop's city, however, and soon he'll face the most daunting gauntlet of his life involving him literally falling into and escaping from Hell. A flaming head won't be enough to ward off the true evil that's rapidly approaching—Inferno Cop must call upon all his allies and his own wacky antics to conquer the trials that await him.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/47037.webp"},{"title":"Koukaku Kidoutai 2.0","synopsis":"Mamoru Oshii's first Ghost in the Shell cyberspace film will return to five Japanese theaters in an enhanced Ghost in the Shell 2.0 edition on July 12. The new edition will include new computer graphics and digital effects for some scenes and a reunion of most of the cast members for a new 6.1 surround sound recording. Academy-Award-winning sound mixer/editor Randy Thom (Ghost in the Shell 2: Innocence, The Incredibles, The Right Stuff) has overseen the new soundtrack with Kenji Kawai's original music and a final mix that has been produced at Thom and Lucas Digital's Skywalker Sound studio in California.\n\nIn the new edition, the enigmatic Puppet Master character will be played by Yoshiko Sakakibara (Ghost in the Shell 2: Innocence's Harraway, Ghost in the Shell: Stand Alone Complex's Prime Minister Yoko Kayabuki). Iemasa Kayumi (Giant Robo's Chief Chuujou Shizuo, RahXephon's Ernst Von Bähbem) played the role in the original edition.\n\nThe film will screen in Tokyo, Osaka, Nagoya, Fukuoka, and Sapporo. Not coincidentally, Oshii's latest film, The Sky Crawlers, will open one month after Ghost in the Shell 2.0 on August 2. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/75608.webp"},{"title":"Fugou Keiji: Balance:Unlimited","synopsis":"Daisuke Kanbe, a detective with extraordinary assets, is assigned to the Modern Crime Prevention Headquarters, where only those who have caused problems for the Metropolitan Police Department are sent. There, Daisuke is partnered with Haru Katou. Haru is repulsed by Daisuke's material ways, believing that money isn't everything. Challenging mysteries unfold in front of the two detectives, and they must work together to solve them.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1066/106556.webp"},{"title":"Metropolis","synopsis":"In the great city of Metropolis, severe community structures and prejudice dominate a world where humans and robots live together. Unrest and violence increase with each new day.\n\nSearching for the scientist Dr. Laughton, suspected to violate human rights by trading organs, the Japanese detective Shunsaku Ban and his nephew Kenichi arrive at Metropolis. In the scientist's laboratory, Kenichi discovers a girl without any memory of her past life. He decides to help her, so they run away together. His uncle follows him and penetrates the dark secrets of the city to find Duke Red, the man ruling from the shadows. Meanwhile, Kenichi desperately tries to protect the mysterious girl from the people hunting her. However, Duke Red and his adoptive son have their own deep reasons for chasing the girl. These reasons are connected to her true identity and the struggle for the domination of Metropolis...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/75601.webp"},{"title":"Appleseed (Movie)","synopsis":"Growing out of the chaos of a global war, the city of Utopia is populated by humans and bioroids (artificial humans). On the surface, everything is harmonious, but tensions lurk. Into this seemingly perfect society comes a survivor of the wars, Deunan Knute, who carries a legacy that will turn out to be of critical importance to the future of humanity. \n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/9/57231.webp"},{"title":"Psycho-Pass: Sinners of the System Case.1 - Tsumi to Bachi","synopsis":"A runaway vehicle driven by Izumi Yasaka, en route to the Public Safety Bureau building, is reported shortly before it crashes into the building. Izumi is a counselor who recently ran away while working at a latent criminal isolation and rehabilitation facility known as Sanctuary.\n\nBefore Inspectors Mika Shimotsuki and Akane Tsunemori get to interrogate the suspect, a sudden request is issued from the facility to promptly bring Izumi back. Interpreted as a direct order from the Chief and the board at Sanctuary, the Inspectors obey, but insist that Izumi be escorted back personally. Tsunemori intends to investigate further with the rest of the team at the Bureau. \n\nNow Inspector Shimotsuki has finally been given the opportunity she had been waiting for—to be the primary investigator on an important case. This case follows Shimotsuki and her team of Enforcers as they uncover the secrets of Sanctuary.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1623/96878.webp"},{"title":"Active Raid: Kidou Kyoushuushitsu Dai Hachi Gakari","synopsis":"In a futuristic, post-disaster Tokyo, the \"Special Public Security Fifth Division Third Mobile Assault Eighth Unit,\" or \"Unit Eight,\" is a police unit specializing in handling criminals who wield dangerous wearable technology called \"Willwear.\" Equipped with Willwear of their own, the squadron is often criticized by the public for their carelessness and disregard for protocol.\n\nSent in by the government as an undercover agent with special instructions from the higher-ups, Asami Kazari is Unit Eight's newest member. Determined to straighten out what she expects to be a group of incompetent fools, she instead finds a team of well-intentioned experts who use very effective—albeit unorthodox—methods, hindered by strict regulations. With their newest member by their side, Unit Eight fights crime and overcomes unexpected adversaries in Active Raid: Kidou Kyoushuushitsu Dai Hachi Gakari.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/77977.webp"},{"title":"Owari no Seraph: Owaranai Seraph","synopsis":"Specials included in the Blu-ray and DVD releases.","img":"https://cdn.myanimelist.net/images/anime/6/76505.webp"},{"title":"Detective Conan Movie 06: The Phantom of Baker Street","synopsis":"Noah's Ark—the latest in VR technology and a milestone of human innovation—is set for a showcase to Japan's privileged children. They have the honour of beginning a new revolution in gaming; however, their carefree fun is cut short when a company employee is found murdered, with his dying message pointing to a clue hidden within the Ark.\n\nAlong with the Detective Boys and Ran Mouri, Conan Edogawa enters Noah's Ark to solve this mystery and ensure the perpetrator is caught. But once they're inside the Ark, it takes on a mind of its own, imprisoning them and the children within its worlds. To escape and bring the murderer to justice, Conan and company must navigate a simulated 19th century London and track down the infamous Jack the Ripper—with the lives of 50 innocent children depending on them.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1400/94320.webp"},{"title":"Wizard Barristers: Benmashi Cecil","synopsis":"The story takes place in Tokyo in 2018, where normal humans and those who can use magic coexist. As a result, there are laws against using magic, and a \"magic courtroom\" exists to preside over lawsuits regarding magic use. In these cases, \"Benmashi\" or wizard barristers defend those who use magic. The anime follows Cecil, the youngest Benmashi in history, and her associates as they defend clients in these cases.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/58145.webp"},{"title":"Koukaku Kidoutai Arise: Ghost in the Shell - Border:1 Ghost Pain","synopsis":"The anime's story is set in 2027, one year after the end of the fourth non-nuclear war. New Port City is still reeling from the war's aftermath when it suffers a bombing caused by a self-propelled mine. Then, a military member implicated in arms-dealing bribes is gunned down.\n\nDuring the investigation, Public Security Section's Daisuke Aramaki encounters Motoko Kusanagi, the cyborg wizard-level hacker assigned to the military's 501st Secret Unit. Batou, a man with the \"eye that does not sleep,\" suspects that Kusanagi is the one behind the bombing. The Niihama Prefectural Police detective Togusa is pursuing his own dual cases of the shooting death and a prostitute's murder. Motoko herself is being watched by the 501st Secret Unit's head Kurutsu and cyborg agents.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/46673.webp"},{"title":"Detective Conan Movie 01: The Timed Skyscraper","synopsis":"Conan Edogawa is facing a dilemma: Ran Mouri has asked Shinichi Kudou out to the movies and he is unable to provide a convincing excuse not to go. However, when the day of the date arrives, he has more pressing problems to worry about—a great amount of plastic explosives has recently been stolen and the culprit has challenged Shinichi to find and dispose of the bombs he has scattered across the city. Now forced in a race against time, Conan must not only protect the city, but also figure out who the mastermind is and his reason for confronting Shinichi.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/77131.webp"},{"title":"Detective Conan Movie 03: The Last Wizard of the Century","synopsis":"Kaitou Kid dares to challenge the police once more, setting his sights on the Russian Imperial Easter Egg. With the date, time, and place, the Osaka police force scrambles to stop him. But this time, Kid may have bitten off more than he can chew—Conan Edogawa, Heiji Hattori, and numerous others are also trying to get their hands on the jeweled egg.\n\nAs the race for possession of the egg escalates, a string of murders threatens those after it, and at the same time the tragic truth behind the Romanov Dynasty is finally revealed. At the center of these developments, it is up to Conan to solve the gruesome murders and catch Kid, all while protecting those close to him and concealing his identity.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/20103.webp"},{"title":"A Kite","synopsis":"Sawa is a school girl, an orphan, and an assassin. She is being controlled by a corrupt cop who gives her targets to kill, detailing to her the crimes these men have committed in order to justify their death. Some of his power over Sawa has to do with her deceased parents and the promise of revenge. When another orphan, a teenage boy called Oburi, is brought in to assist Sawa, the two teenage killers form a bond of sorts. As they heal each other's emotional wounds, they begin to dream of a life that would not be spent under the shadows of murder.","img":"https://cdn.myanimelist.net/images/anime/5/85959.webp"},{"title":"Detective Conan Movie 02: The Fourteenth Target","synopsis":"A mysterious attacker has appeared and is assaulting people whose names contain a number from the standard deck of cards in descending order. When Conan Edogawa points out that all the victims are related to the now famous detective Kogorou Mouri, suspicion immediately falls upon the recently released convict Jou Murakami, as Kogorou was the one responsible for his arrest ten years prior.\n\nWith potential victims still at risk, Conan and the police are determined to catch the culprit. As the case gradually unfolds, both Conan and his friend Ran Mouri learn more about her parents' separation and the truth on what transpired a decade ago.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1900/94316.webp"},{"title":"Detective Conan Movie 05: Countdown to Heaven","synopsis":"Conan Edogawa, the Detective Boys, and Professor Hiroshi Agasa decide to visit the Nishitamashi Twin Towers. There they run into Ran Mouri; her closest friend, Sonoko Suzuki, and Ran's father, the famous Kogorou Mouri. Learning the trio are attending the towers' grand opening, Conan and company tag along for a private tour of its floors.\n\nHowever, as preparations are finalized for the opening ceremony, their visit takes an unexpected turn—three brutal murders occur, seemingly linked to a mysterious Porsche 356A. Soon after, as Conan and the detectives dive deeper into the case, the towers are rocked by an explosion. With fire rapidly spreading and lives in danger, police desperately seek to evacuate everyone. But when the elevator, their only means to escape goes down, Conan and company are left behind. With help on its way, they frantically try to keep everyone safe, but time is running out if they want to bring the perpetrators to justice.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1144/92654.webp"},{"title":"Detective Conan Movie 04: Captured in Her Eyes","synopsis":"On a rainy afternoon, the Detective Boys witness a murder across the street. Barred by traffic, the culprit slips away and Conan Edogawa is left a single clue by a dying detective. Days later, another detective is found murdered in a parking lot, leaving the police rattled. Suspicious that the culprit is one of their own, everyone in the police department without an alibi is suspect. But despite being on high alert, they are outmaneuvered and suffer yet another attack—this time with Ran Mouri finding herself in the crossfire.\n\nTraumatized, Ran wakes in the hospital with retrograde amnesia, remembering nothing about her life. Soon released, she struggles to remember her past and grows fearful of not regaining her memories before being targeted by the killer for what she witnessed. As she is guarded by friends and family, it is up to Conan to piece together the clues and find who the murderer is before they strike again.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1196/94319.webp"},{"title":"Psycho-Pass: Sinners of the System Case.3 - Onshuu no Kanata ni＿＿","synopsis":"\"Could you become my teacher?\" \n\nFollowing the incident in the Southeast Asia Union (SEAUn) in 2116, Shinya Kogami resumes his vagrant journey. In a small South Asian nation, Kogami rescues a bus of refugees under attack by armed guerrilla forces. Among the refugees is a young lady by the name of Tenzin, who begs Kogami to teach her how to retaliate against the enemy. Just what do the girl who wishes for revenge and the man who has exacted revenge see as they gaze upon the edge of a world from which there is no escape? \n\n(Source: Official Website, translated by Edo)","img":"https://cdn.myanimelist.net/images/anime/1819/97220.webp"},{"title":"ēlDLIVE","synopsis":"Chuuta Kokonose is an orphan who lives with his aunt. For as long as he can remember, he's had a voice in his head, but other than that he's a normal boy—right until the day when a strange-looking thing follows him home and teleports him to a place filled with more fantastic creatures. It's a space police station, and Rein Brickke, the Chief of Solar System Department, tells him that he's been chosen by the computer as a possible candidate to join the police force. Misuzu Sonokata, a girl from Chuuta's school with an angelic face and ill temper who turns out to be one of Rein Brickke's subordinates, doesn't think him suitable for such a job. Chuuta, who was shocked at first, decides to take the aptitude test after being urged by the voice in his head and to prove Misuzu wrong.","img":"https://cdn.myanimelist.net/images/anime/8/82348.webp"},{"title":"Koukaku Kidoutai Arise: Ghost in the Shell - Border:2 Ghost Whispers","synopsis":"Second movie of Ghost in the Shell: Arise.\n\nFreed of her responsibilities with the 501 Organization, Motoko Kusanagi must now learn how to take orders from Aramaki. Someone hacks the Logicomas, and Batou enlists the help of former army intelligence officer Ishikawa and former air artillery expert Borma. Kusanagi also seeks to enlist ace sniper Saito and undercover cop Paz into the new Public Security Section 9. The two groups rival each other in a case involving a man who receives false memories of a refugee transport operation.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/8/52135.webp"},{"title":"Detective Conan Movie 13: The Raven Chaser","synopsis":"Kudou Shinichi is living his life as Edogawa Conan, but those days seem like they might end pretty soon. The Black Syndicate is coming dangerously close to learning the truth about Shinichi having survived. Conan and everybody around him may end up dead if he doesn't manage to find Irish—a member of the Black Organization who has infiltrated the police forces, currently investigating a big serial murder case.","img":"https://cdn.myanimelist.net/images/anime/2/22558.webp"},{"title":"Psycho-Pass: Sinners of the System Case.2 - First Guardian","synopsis":"Enforcer Teppei Sugou, former ace pilot of the National Defence Army's 15th Integrated Task Force, is visited by a scout from the Ministry of Foreign Affairs and invited to rejoin the military. While considering the offer, he recalls his last months of service.\n\nHis last mission, Operation Foot Stamp, had been a highly classified military strike against the Southeast Asian Union. The operation quickly went south for the ground forces, and Sugou's First Guardian drone was ordered in as air support to drop emergency supplies for the ground units and then return to base. Following orders against his own judgement, Sugou abandoned his comrades on the field.\n\nMany lives were lost during the operation, including Itsuki Otomo, Sugou's commanding officer. However, three months later, following a massacre at the Ministry of Defence, Otomo was spotted at the scene on camera. Now a suspect in an act of terrorism, Sugou cooperates with Enforcer Tomomi Masaoka and CID Division One as they hunt his former mentor down.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1357/96879.webp"},{"title":"Tokkou","synopsis":"\"Shindou Ranmaru has just graduated from police academy and assigned to Tokko: Special Mobile Investigation Force. On the day of his graduation, he meets the half-naked girl he has been seeing in his dreams. Her name is Rokujo Sakura and she works for a secret group within Tokki, known as Tokko: Special Public Safety Task Force. Shindou ends up joining Tokko to avenge his parents' death, and solve the mysterious mass murder of residents in his hometown of Machida. Meanwhile, bottomless pits begin appearing around Japan, and mysterious creatures emerge from them. Could these events be linked to Machida Massacre?\"\n\n(Source: DVD Complete Series Back Cover)","img":"https://cdn.myanimelist.net/images/anime/8/18280.webp"},{"title":"Detective Conan Movie 08: Magician of the Silver Sky","synopsis":"Once again, Kaitou Kid crosses swords with Conan Edogawa in this annual installment of the Detective Conan movie franchise. After receiving a letter from the thief, famous actress Juri Maki seeks the help of private detective Kogorou Mouri to protect the Star Sapphire—the \"Jewel of Destiny,\" said to represent faith, fate, and hope. Thinking he has deciphered Kid's riddle, Kogorou personally shows up to the newly constructed space theater where Juri is acting in the play \"Josephine\" in order to catch Kid in the act.\n \nThe next day, Conan and the gang are invited by Juri to her holiday home, to celebrate the thwarting of Kid's plan and the success of the play. However, their triumph crumbles when a murder occurs during the flight there. Although unintentional, this sets off a series of events that escalate to catastrophic results. Conan and Kid, unlikely allies that they are, must work together to save both their friends and every other passenger aboard the plane.\n \n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/72562.webp"},{"title":"Koukaku Kidoutai: Shin Movie","synopsis":"In the year 2027, a year following the end of the non-nuclear World War IV, a bomb has gone off in Newport City, killing a major arms dealer who may have ties with the mysterious 501 Organization. Public Security official Daisuke Aramaki hires full-body cyber prosthesis user and hacker extraordinaire, Motoko Kusanagi, to investigate.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/2/72690.webp"},{"title":"Detective Conan Movie 10: Requiem of the Detectives","synopsis":"After receiving a strange invitation, Kogorou Mouri pays a visit to the Miracle Land theme park along with his daughter Ran, Conan Edogawa, and the Detective Boys. Once there, Kogorou and Conan are tasked with finishing an unsolved case by a mysterious stranger. Realizing that the invitations were actually an elaborate trap, the two have just 12 hours to solve the case or face grave danger.\n\nWith the help of familiar faces like Heiji Hattori, Kaitou Kid, and even Saguru Hakuba, the group of detectives must unravel the web of clues surrounding the case in order to find the culprit and bring them to justice before it's too late.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1919/94322.webp"},{"title":"Detective Conan Movie 14: The Lost Ship in the Sky","synopsis":"Kid has his eyes set on the \"Lady of the Sky\" jewel aboard Bell 3, the largest airship in the world. However, a mysterious terrorist group called Red Shamu-neko (Red Siamese Cat) has hijacked the airship itself, along with Conan and his allies Kogoro and Ran.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/22312.webp"},{"title":"Detective Conan Movie 07: Crossroad in the Ancient Capital","synopsis":"Under the cover of darkness, a masked samurai murders six men across the metropolis of Japan: three in Tokyo, one in Osaka, and the last in Kyoto. In their investigation, the police learn that each man was a member of the Genjibotaru—a thieves gang centered on the theft of Buddhist statues and artifacts and who go by the names of Minomoto no Yoshitune's servants.\n \nWithout a clear motive or clues to the other members' identities, the case runs dry until a Kyoto temple calls for the famous Kogorou Mouri. Having received an anonymous letter containing a peculiar puzzle, the temple monks ask for his assistance in solving it to recover their long lost statue. Meanwhile, Conan Edogawa and high school detective Heiji Hattori team up in order to solve the cryptic puzzle and find the murderer, as Hattori searches for his childhood love.\n \nWith Hattori's knowledge of Kyoto, the two scour the streets and gradually discover the truth, but not before the murderer strikes again—killing another Genjibotaru member and, after repeated attempts on Hattori's life, eventually kidnapping Hattori's childhood sweetheart. It is only by working together to bring buried clues to light can Conan and Hattori hope to end the rogue samurai's bloodshed and save Hattori's love.\n \n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/20984.webp"},{"title":"Koukaku Kidoutai Arise: Alternative Architecture","synopsis":"A TV anime version of Ghost in the Shell: Arise. The first eight episodes are an edited version of the four movies while the last two features a new arc called \"Pyrophoric Cult.\"\n\nThe plot involves the \"Fire Starter\" virus explored previously, and introduces the new character Pyromania. The episode will have ties to the upcoming film.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/5/72037.webp"},{"title":"Koukaku Kidoutai Arise: Ghost in the Shell - Border:3 Ghost Tears","synopsis":"Third movie of Ghost in the Shell: Arise.\n\nMotoko and Batou work to try to stop a terrorist organization whose symbol is the Scylla. Meanwhile, Togusa investigates a murder of a man who possessed a prosthetic leg manufactured by the Mermaid's Leg corporation.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/9/56607.webp"},{"title":"Detective Conan Movie 09: Strategy Above the Depths","synopsis":"Fifteen years ago in a barren stretch of the Pacific, a cruise ship collided with an iceberg and was lost at sea. More than a decade later, Hideto Yashiro—a ship engineer—died in a fatal car accident. The unlikely connection between these events only comes to light on the luxury liner St. Aphrodite during her maiden voyage.\n\nAboard it on a much needed vacation, Kogorou Mouri, his daughter Ran, Conan Edogawa, and the Detective Boys enjoy a trip provided by Sonoko Suzuki's family. But their fun is soon cut short when a game of hide-and-seek leads to Sonoko's disappearance. Some time later, the CEO of the Yashiro group, who built the St. Aphrodite, is found stabbed to death and her father missing. While the police's investigation turns to a dead end, Conan closes in on the culprit. Unwilling to be apprehended, the culprit threatens to blow up the St. Aphrodite and sink all her passengers.\n\nAs the ship's hull rapidly fills with water, the truth behind the vengeful murders is finally revealed. With no place to escape, Conan and Kogorou must wrestle with the elusive culprit before everyone on board is dragged to the ocean floor.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/20983.webp"},{"title":"B: The Beginning 2","synopsis":"Second season of B: The Beginning.","img":"https://cdn.myanimelist.net/images/anime/1594/93194.webp"},{"title":"Koukaku Kidoutai: Stand Alone Complex - The Laughing Man","synopsis":"In 2024, the terrorist incident known as \"The Laughing Man Incident\" occurred in which Ernest Serano, president of the groundbreaking micromachine company, Serano Genomics, was kidnapped and ransomed. One day, the case having remained unsolved for six years, Detective Yamaguchi, who has been investigating \"The Laughing Man Incident,\" sends word that he wants to meet with Togusa from Public Safety Section 9. However, soon after sending this message, Yamaguchi, crucial to the success of the case, dies in an accident. Many days pass and in the midst of a police interview relay concerning suspicions behind interceptors, a forewarning is received from \"The Laughing Man\" of his next crime. The incorporeal hacker begins to move once again.\n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/3/21835.webp"},{"title":"Detective Conan Movie 12: Full Score of Fear","synopsis":"Serial murders involving all kinds have happened. All the victims are from a Music School led by a famous pianist. Conan and company have been invited to a opening concert of the Music Hall built by the pianist. The biggest attraction of this concert is the world famous violin called \"Stradivarius\" and a special appearance of a singer who has perfect pitch. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/22766.webp"},{"title":"Koukaku Kidoutai Arise: Ghost in the Shell - Border:4 Ghost Stands Alone","synopsis":"The story of this fourth installment takes place amidst signs of postwar reconstruction in the winter of 2028. Tensions are rising in New Port City as demonstrations are held concerning the interests of foreign cartels. This leads to a shooting incident involving riot police. It all started with a cyberbrain infection released by the terrorist \"Fire Starter.\" An independent offensive unit led by Motoko Kusanagi entrusts the suppression of the situation to their ghosts and aims for their own justice. Below the surface of the incident, lies the \"tin girl\" Emma and the \"scarecrow man\" Burinda Junior. As Kusanagi deals with the incident, she draws near to what those two ghosts were seeking.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/63993.webp"},{"title":"Detective Conan Movie 15: Quarter of Silence","synopsis":"The story begins with a threat against the Tokyo governor, but Conan's quick thinking prevents any fatalities when a subway tunnel is blown up. Conan learns there may be a connection to a village that was relocated for the construction of a dam, and he races to stop the criminal before the next attack.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/32035.webp"},{"title":"Keishichou Tokumubu Tokushu Kyouakuhan Taisakushitsu Dainanaka: Tokunana","synopsis":"In Tokyo, there exists a peaceful cohabitation between supernatural creatures—elves, dwarves, vampires, and more—and humans. However, contrary to history, powerful dragons once ruled over this world of creatures and humans but have since disappeared. Consequently, a diabolical group under the alias \"Nine,\" who seek the miracles of the once godlike dragons, stirs up trouble in the streets of Tokyo, commiting mass murder and causing destruction. To combat the dangerous group of Nine, the police organize the Special 7—a group of highly skilled professionals whose abilities exceed those of ordinary humans. \n\nCaught up in a bank robbery turned hostage crisis, Seiji Nanatsuki, having recently become a detective, has a chance encounter with Shiori Ichinose, a member of Special 7. Assisting with the resolution of the robbery, Seiji is recognized for his clear sense of justice and refreshing character, suddenly earning him a spot on the elite unit. \n\nAs he takes on new missions, Seiji finds that being a detective as part of Special 7 isn't the police work he expected, where working alongside a team of different species with special abilities and vibrant personalities brings unpredictability to his daily life and police work. While the everyday crime in Tokyo continues, Seiji and the Special 7 will fight not only to resolve special cases, but also obstruct the ill-intentioned plans of the merciless group of Nine.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1338/102486.webp"},{"title":"Detective Conan Movie 11: Jolly Roger in the Deep Azure","synopsis":"The luscious hills of Koumi Island are one of many reasons tourists pay its shores a visit—a reason that comes second only to its scenic coral reefs and the legend of Anne Bonnie and Mary Read. The museum that houses the cutlass and pistol of the daring pirate duo does wonders for the small island's tourism. \n\nOn a trip to the island, the famous Kogorou Mouri is joined by his daughter Ran, her best friend Sonoko Suzuki, the Detective Boys, and Conan Edogawa. Following a mix up at the hotel regarding their rooms, the group encounters treasure hunters and becomes acquainted with the island's treasure fever. Sent on a hunt of their very own, the Detective Boys scour the isle; while in far harsher waters, Conan discovers a murder. The police, following a clue from a recent robbery, arrive soon after, and Koumi is plunged into chaos. \n\nWhat follows is a mad dash by not only the treasure hunters but also the inhabitants of Koumi to secure Anne and Mary's long lost booty. All the while, however, Conan, Kogorou, and the police search for the one thing far greater than riches—justice.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1765/94323.webp"},{"title":"Gunsmith Cats","synopsis":"In the dangerous suburbs of Chicago, skilled bounty hunters Irene \"Rally\" Vincent and \"Minnie\" May Hopkins run Gunsmith Cats, a firearms store of questionable legality. One day, Bill Collins, an agent for the Chicago branch of the Bureau of Alcohol, Tobacco, Firearms, and Explosives, blackmails Rally and May into working with him on a case. The stakes are high, but Rally’s gunmanship and May’s knowledge of explosives are unmatched. As Rally and May unravel the secrets of the case, the two will need to use guns and grenades while being faster, stronger, and better than everyone else in order to stay alive.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/2769.webp"},{"title":"Kidou Keisatsu Patlabor the Movie","synopsis":"The Babylon Project is a massive renovation of Tokyo's neighborhoods, including the creation of artificial islands in the Bay. Utilizing \"Labors,\" or robots created for the express purpose of doing work, architects and construction crews are able to more efficiently progress development of the overhaul. When a key figure in the Project's conception is found dead after committing suicide under mysterious circumstances, Captain Kiichi Gotou's Patlabor police unit is tasked with getting to the bottom of the bizarre situation.\n\nAs several Labors begin to go haywire and a hacked AI program endangers the people of Tokyo, young pilot Noa Izumi and her Patlabor Alphonse work under Gotou's orders to save the city and the entire nation from a massive biblical conspiracy.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/74786.webp"},{"title":"Double Decker! Doug &amp; Kirill","synopsis":"The once peaceful city-state of Lisvalletta has found itself beset by a dangerous new drug called Anthem. The side effects of the drug allow the user to enter a state of Overdrive, wherein they mutate into superpowered beasts with inhuman abilities. With the police powerless to stop this new threat, the responsibility falls upon the Special Crime Investigation Unit SEVEN-O. To offset the dangers of this work, the investigators work under the patented \"Double Decker\" system, which requires them to team up in \"buddy cop\" pairs.\n\nAs a child, average police officer Kirill Vrubel fantasized about being a hero who would save his school from a random terrorist attack. His chance to be a hero arrives when his landlady blackmails him into searching for her lost cat. Upon arriving and falling asleep in an abandoned warehouse, Kirill finds himself in the middle of a hostage situation involving an Anthem user. By teaming up with SEVEN-O detective Douglas \"Doug\" Bilingam, Kirill earns his spot as the newest member of SEVEN-O. Now, with the help of this secret organization, he may finally achieve his dream of becoming a hero.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1299/95783.webp"},{"title":"Detective Conan Movie 16: The Eleventh Striker","synopsis":"After an interaction with J-League professional players, Conan and co watches the big match between Tokyo Spirits and Gamba Osaka, only to find out that a bomb has been planted in the stadium. It is now up to Conan once again to foil the culprit's plans and reveal his/her true identity.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/37511.webp"},{"title":"Psycho-Pass 3: First Inspector","synopsis":"The film will conclude the story of season 3 on the case of the \"Foxes\" being pursued by Unit 1, the Bifrost mystery, and Arata and Kei's battle.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1834/106107.webp"},{"title":"Detective Conan Movie 18: The Sniper from Another Dimension","synopsis":"A vicious sniper has appeared in Tokyo, rendering the people too scared to go outside, once again it's up to Conan to figure out the meaning behind the killings and capture the mysterious sniper before more lives are lost.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/60289.webp"},{"title":"Kidou Keisatsu Patlabor: On Television","synopsis":"In the future, advanced robotics has created heavy robots (\"labors\") for use in a variety of functions: construction, fire-fighting, military, and more. However, though the robots are only machines, their operators are also only human—and humans sometimes turn to crime. Since a heavy labor unit can be a dangerous weapon, the police of the future are set to fight fire with fire, using advanced patrol labor units, \"patlabors.\" This is the story of the Second Special Vehicles Division, a motley crew of patlabor policemen and women doing their best to fight crime and live a normal life.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/59293.webp"},{"title":"Tantei Gakuen Q","synopsis":"Kyuu is your average boy with a knack for logic and reasoning. Desiring to become a detective, he finds out about the existence of the Dan Detective School (DDS); a famed school where students are allowed to bear arms. Together with Megu, a girl with photographic memory, the martial arts master Kinta, the genius programmer Kazuma and the mysterious Ryuu, Kyuu tackles many well planned out crimes, always seeking the truth.","img":"https://cdn.myanimelist.net/images/anime/1/407.webp"},{"title":"Detective Conan Movie 17: Private Eye in the Distant Sea","synopsis":"The movie is set on a state-of-the art Aegis vessel with the full cooperation of Japan's real-life Ministry of Defense and Maritime Self-Defense Force. The corpse of a Self-Defense Force member has been found—minus the left arm—and a spy has infiltrated the Aegis vessel. The heroine Ran is put in jeopardy, and Conan is forced to stand up against the dangerous Spy \"X.\"\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/47419.webp"},{"title":"Tenchi Muyou! GXP","synopsis":"From crashing his bike to falling in lakes, Seina Yamada just cannot shake the bad luck that follows him. But his fortune begins to change when he is forcibly recruited into the Galaxy Police and ends up capturing the most pirates in the force. \n\nNow, Seina is no longer just the unfortunate boy from Earth; he is a man that pirates have come to fear. Despite his reputation, Seina is still the same clumsy guy, but at least he has Amane Kaunaq, a former model, and Kiriko Masaki, his long time friend, to keep him together. With their help, Seina sets out on an adventure in the hopes of becoming a great Galaxy Police Officer.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/20295.webp"},{"title":"Armitage III","synopsis":"The year is 2046. Detective Ross Sylibus is transferred to Mars when a country singer on her flight is murdered. Making matters more complicated is that the singer is a \"Third\"—a robot that looks and feels like a human. Sylibus is partnered with Armitage—a beautiful female cop with a bad attitude. As they investigate the murder of the singer and other women on Mars, they uncover a conspiracy that can have them both killed by the Martian government.\n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/1398/94072.webp"},{"title":"Appleseed","synopsis":"Appleseed takes place in the aftermath of World War III, where the General Management Control Office has constructed the experimental city known as Olympus. Built to be a paradise on Earth, Olympus is inhabited by humans, cyborgs, and bioroids (genetically engineered humans designed for increased physical capabilities and decreased emotional capabilities). Bioroids run and control all of the administrative functions of Olympus, ensuring that the city remains the utopian society it was meant to be for all of its citizens. But for some people living in Utopia, the city has become less of a home and more of a cage.\n\nPolice officer Calon Mautholos has grown to despise Olympus following his wife's suicide, blaming her death on the lack of creative freedom caused by the rules binding the citizens of the city. As his hatred for the city grows, Calon conspires with the terrorist A.J. Sebastian to destroy the Legislature of the Central Management Bureau to send the rules of Olympus that killed his wife tumbling down. But when Calon discovers it is not political malcontent, but rather hatred for bioroids that motives Sebastian, Calon turns renegade and gains the attention of city officials. Deunan Knute and her partner Briareos of the ESWAT counter-terrorism unit are dispatched to hunt down and stop Calon and Sebastian... by any means necessary!","img":"https://cdn.myanimelist.net/images/anime/6/27979.webp"},{"title":"Switch","synopsis":"Two newbies at the Narcotic Control Department in Japan, Haru and Kai, struggle against: drug dealers, gangs, murderers, psychopaths, mysterious organizations, and mad people in general. The gentle and caring one of the group, Kai, who has problems of his own, has the tendency of turning into a lethal killing machine in certain scenarios. The way he acts changes like that of a \"switch\". As the two do their job, answers of what is behind Kai's strange behavior and who exactly he is, is revealed.\n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/3/26316.webp"},{"title":"Detective Conan Movie 20: The Darkest Nightmare","synopsis":"On a dark night, the Japanese police is raided by a spy. Different countries' intelligence agencies—such as England's MI6, Germany's BND, and America's CIA—as well as the FBI's secret files are going to be taken, but public safety officers lead by Tooru Amuro arrive just in time. The spy steals a car and escapes. The spy and Amuro are then locked in a dead heat on the highway, and just as it is about to cause an accident with multiple cars, the spy's car is hit by FBI agent Shuichi Akai's rifle bullet and falls of the roadway.\nThe next day, Conan and his friends go to a newly-remodeled aquarium in Tokyo. Under the main attraction, a Ferris wheel, Conan finds an attractive woman alone and injured. Her left and right eyes are different colors.\n\nBut the woman is in a state of amnesia where she doesn't even remember her own name, and the cellphone she's carrying is broken. Conan and his friends promise to help her regain her memory, so they stay with her.\n\nThroughout all this, Vermouth is watching behind the scenes. Afterwards, she pulls out a silencer and speaks into an attached intercom, \"It's as planned, Gin.\"","img":"https://cdn.myanimelist.net/images/anime/10/78894.webp"},{"title":"Kidou Keisatsu Patlabor 2 the Movie","synopsis":"Three years after the Babylon Project conspiracy is resolved, the members of Kiichi Gotou's Patlabor unit have gone their separate ways. Gotou remains with the Patlabor team, accompanied by Shinobu Nagumo, his romantic crush and comrade.\n\nPlaying into the public's skepticism toward the Japanese Ground Self-Defense Force, a terrorist organization begins to work from within the military to cause destruction and mass civil unrest throughout Japan. Nagumo learns that the mastermind behind the growing terrorist plot is none other than Yukihito Tsuge, her former mentor and lover.\n\nGotou reassembles his former Patlabor team, spearheaded by pilot Noa Izumi. Leading the team into a mission to arrest Tsuge, Nagumo must come to terms with her complicated past relationships in order to save Japan.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/74764.webp"},{"title":"Detective Conan Movie 19: The Hellfire Sunflowers","synopsis":"Kaitou Kid and Vincent van Gogh's artworks feature heavily in the movie, according to an interview with Gosho Aoyama. The teaser preview at the end of Dimensional Sniper included references to van Gogh's \"Sunflowers\" series.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/5/73618.webp"},{"title":"Gyakuten Saiban: Sono \"Shinjitsu\", Igi Ari! Season 2","synopsis":"Defense attorney Ryuuichi Naruhodou is still hard at work defending the falsely accused with his knack for last-minute turnabouts. With his trusty assistant and medium-in-training Mayoi Ayasato in tow, Ryuuichi's fame as a champion for the innocent steadily grows. But this newfound success attracts the attention of the coffee-loving, masked Godot⁠—a mysterious rookie prosecutor who bears an inexplicable grudge against Ryuuichi.\n\nWith the help of their allies, Ryuuichi and Mayoi take this new challenger head-on and search for the reason behind his appearance. But before long, the first two cases from the career of Mayoi's late sister Chihiro Ayasato become critical to solving a fantastical murder mystery, continuing the bloody saga of the tumultuous Ayasato clan. Will Ryuuichi once again be able to overcome the odds and find the truths hidden within the web of lies?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1861/91089.webp"},{"title":"Kidou Keisatsu Patlabor","synopsis":"As the human race evolves, so does its technology. Engineers have successfully created robots dubbed \"Labors\" for mass distribution, utilized by society for a number of everyday tasks. However, there are criminals who manage to get their hands on these Labors, using them for their own nefarious means.\n\nTo combat this new form of delinquency, police around the world begin using \"Patrol Labors\" or \"Patlabors\" to put a stop to Labor-related crimes. Rookie police officer Noa Izumi is drafted into a special Patlabor unit, getting her own mechanical suit to fight crime. Naming this machine Alphonse, Izumi works tirelessly alongside her peers to keep civilization safe from those who would use this advanced technology to harm others.\n\nAs Izumi becomes further ingrained within her unit, she must also learn how to navigate both her social and professional spheres with grace and wit. She befriends the aloof Asuma Shinohara, fellow pilot Isao Oota, and the other members of her brigade as she helps them to combat conspiratorial plots, workplace revolts, and supernatural beings.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/24151.webp"},{"title":"Koukaku Kidoutai: SAC_2045","synopsis":"In the year 2045, after an economic disaster known as the Synchronized Global Default, rapid developments in AI propelled the world to enter a state of “Sustainable War”. However, the public is not aware of the threat that AI has towards the human race.\n\nFull-body cyborg Major Motoko Kusanagi and her second-in-command Batou are former members of Public Security Section 9, who are now hired mercenaries traveling hot devastated American west coast. This land is full of opportunity for the major and her team, they utilize their enhanced cyberbrains and combat skills from their time working in Section 9. However, things get complicated with the emergence of “post humans,” who have extreme intelligence and physical powers. The members of Section 9 comeback together again in order to face this new threat.\n\n(Source: Official Website)","img":"https://cdn.myanimelist.net/images/anime/1213/106702.webp"},{"title":"Taiho Shichau zo (TV)","synopsis":"Tokyo Highway Patrolwomen Natsumi and Miyuki get off to a bad start when Miyuki busts Natsumi for reckless moped driving on her way to work. Things get worse when they find out they're going to be partners!\n\nA continuation of the OVA series, the adventures of Tokyo policewomen Natsumi and Miyuki continue in the You're Under Arrest TV series. It's back to Bokuto Precinct, where demented felons and bashful (but hunky) policemen abound, and where the cutest girl in the office... isn't a girl.\n\n(Source: Rightstuf)","img":"https://cdn.myanimelist.net/images/anime/4/16767.webp"},{"title":"Dirty Pair","synopsis":"If you're in a big trouble, call the World Welfare Work Association or WWWA. They will send out a team of highly trained capable agents called Trouble Consultants who can solve your problems. But if the team they send you is the Dirty Pair, there will be a lot of collateral damage aside from solving your problems.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/2/20673.webp"},{"title":"Detective Conan: Episode One - The Great Detective Turned Small","synopsis":"The \"real\" episode 1 of Detective Conan written by the Mangaka Gosho Aoyama.","img":"https://cdn.myanimelist.net/images/anime/5/81968.webp"},{"title":"Active Raid: Kidou Kyoushuushitsu Dai Hachi Gakari 2nd","synopsis":"Set in a part of Tokyo that has descended into a quagmire, the story follows Unit 8 of the 5th Special Public Security Section's 3rd Mobile Assault Division, popularly called \"The Eighth,\" who don powered armor \"Willwear\" exoskeletons to counter the rise in crime. \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/2/80341.webp"},{"title":"Cyber City Oedo 808","synopsis":"It is the year 2808. Three convicts are recruited as members of the Cyber Police to keep major criminal activity in Oedo (formerly Tokyo) in check. In return, their life sentences will be reduced by a few years for every mission accomplished. However, to ensure that these convicts are doing their job, the police have secured special collars around their necks. If they attempt to remove their collars or fail to meet the time limit of their mission, the collars will self-destruct. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/58763.webp"},{"title":"Hero Mask","synopsis":"Now there's a mysterious Mask before James Blood, and the man behind it is one that shouldn't exist. What is the mystery surrounding this mask...? So begins an action-packed crime story set in a beautiful city! ","img":"https://cdn.myanimelist.net/images/anime/1934/96007.webp"},{"title":"Detective Conan Movie 21: The Crimson Love Letter","synopsis":"A bombing case at Nichiuri TV in autumn. The Satsuki Cup, which crowns the winner of Japan's Hyakunin Isshu, is currently being filmed inside the facility. The incident results in a big commotion and, while the building is burning to ashes, the only people left inside are Heiji and Kazuha. They get rescued just in time by Conan, who rushes to the scene. Both the identity and purposes of the bomber are unknown.\n\nWhile confusion takes over due to the explosion, Conan meets a mysterious beautiful girl who claims she is \"Heiji's fiancée\". Her name is Momiji Ooka and she is the Kyoto High School champion of the Karuta game. As fate would have it, Kazuha is going to face Momiji in the Hyakunin Isshu, so she begins to train with the help of Heiji's mother, Shizuka, who is a skilled Karuta player.\n\nAt the same time, in a Japanese house in Arashiyama, Kyoto's outskirts, the reigning Satsuki Cup champion is murdered. Pictures of the crime scene reveal Momji's presence. Additionally, several Karuta cards were spread around the victim.\n\nConan and Heiji, along with the Osaka and Kyoto police departments, begin their investigation on the Satsuki Cup and the related murder case. As the inquiry goes on, they come across a secret connected with the Hyakunin Isshu. \n\n(Source: Detective Conan Wiki)","img":"https://cdn.myanimelist.net/images/anime/2/83919.webp"},{"title":"Fake","synopsis":"Dee Laytner and Randy \"Ryo\" Maclane are two New York cops taking a needed vacation in England. Dee has very strong feelings for Ryo and wants to take this chance to advance their relationship (and if he's lucky, maybe seduce Ryo). Ryo doesn't understand his own feelings for Dee, and doesn't know if he wants to (or should) acknowledge them. Their vacation and relationship is suddenly disturbed when murders and missing person reports keep surfacing around their hotel. The only common tie the cases have is that all of the victims were Japanese or Japanese descent. Dee and Ryo have to solve the case before Ryo, who is half Japanese, becomes the next victim.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/25196.webp"},{"title":"Top Secret: The Revelation","synopsis":"A newly developed method allows to display the memories of dead people. It is used to solve difficult murder cases. But at what cost? What of the dead's privacy as strangers poke about in their most private memories? What about the effects the imageries may have on the persons whose jobs require going through psychotic murderers' minds and experience whatever emotions and feelings these murderers felt as they skin and disembowel their victims?\n\n(Source: Adapted from manga description)","img":"https://cdn.myanimelist.net/images/anime/6/21702.webp"},{"title":"Taiho Shichau zo","synopsis":"Running late on her first day as a patrol woman for the Bokuto Police Department, spunky moped rider Natsumi Tsujimoto decides to take several shortcuts, only to be chased down and cited by mechanical genius and expert police driver Miyuki Kobayakawa. Upon arrival at the precinct, Natsumi finds out that her new partner is the same woman who ticketed her earlier. At first, she doesn't trust Miyuki, but in a short period of time, they develop an unbreakable friendship that overcomes traffic accidents, reckless drivers and even the strongest typhoons to hit Tokyo. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/21601.webp"},{"title":"Detective Conan OVA 09: The Stranger in 10 Years...","synopsis":"This OVA takes place ten years in the future and chronicles the possible events if Conan Edogawa and Ai Haibara do not take the antidote to APTX 4869 and grow up alongside their friends Genta, Mitsuhiko, and Ayumi, while still maintaining their detective endeavors.","img":"https://cdn.myanimelist.net/images/anime/5/14746.webp"},{"title":"Yakushiji Ryouko no Kaiki Jikenbo","synopsis":"Based on a series of light novels written by Tanaka Yoshiki and illustrated by Kakinouchi Narumi.\n\nThe story revolves around Ryouko Yakushiji, a 27-year-old multilingual investigator that graduated from Tokyo University's elite Department of Law, and the bizarre cases she faces while working for the Tokyo Metropolitan Police. Yakushiji not only has to deal with supernatural beings in her line of work, but also her rival Yukiko Muromachi, another equally talented and beautiful police investigator.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/75426.webp"},{"title":"HeatGuy J","synopsis":"In the city of Judoh, Claire Leonelli has inherited leadership of the Mafia group \"Vampire\" following the death of his father. To keep Claire's and other criminal activities in check, the city's Bureau of Urban Safety has Special Services Division operative Daisuke Aurora and the super android codenamed \"J\" (whose identity is apparently kept in secrecy, as androids are banned in the city). With both of them around, crime now has little room to breathe in Judoh.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/76288.webp"},{"title":"Appleseed Alpha","synopsis":"Set in a different series of events, this story does not follow the previous Appleseed movie canon (despite being directed by the same director of the previous movies); it is an alternate story to their beginnings. Briareos is already a cyborg and did not become separated from Deunan to be later reunited in Olympus to join ESWAT.\n\nAppleseed Alpha depicts the early days of Deunan Knute and Briareos in the 22nd century, as they embark on a journey throughout dystopic ruins of New York in search of the city of Olympus. They are hired by Two Horns, the warlord of the ruined city, to eliminate bipedal combat machines. During the fight, they encounter Iris and Olson, both on a mission. Deunan and Briareos befriend them and decide to join their mission.\n\nIris is tasked with preventing the malevolent cyborg Talos from capturing a secret weapon humans were building. Talos uses Iris to activate the gigantic war machine.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/11/64775.webp"},{"title":"Detective Conan OVA 04: Conan and Kid and Crystal Mother","synopsis":"Once again, Kaitou Kid has a target in mind: the Crystal Mother, Europe's largest topaz owned by Queen Selizabeth of the Principality of Ingram. He intends to steal this jewel while the Queen is stuck on a train from Tokyo to Osaka. However, Kid's abilities are put to the test, as the Queen has already concealed the gem somewhere aboard the train. \n\nConan Edogawa, who is among train's passengers, suspects an attack from the phantom thief and begins investigating on his own, while Inspector Ginzou Nakamori is ready for a new confrontation against the elusive jewelry robber. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/31141.webp"},{"title":"Riding Bean","synopsis":"Bean Bandit and his partner Rally Vincent are couriers for hire - transporting clients and delivering goods in his custom sports car \"Roadbuster\" for a hefty price. But when they are hired to escort a kidnapped girl named Chelsea to her home, they don't realize they're being framed for kidnapping as their former clients Semmerling and Carrie plan their escape with Chelsea's father and the ransom money. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/4/55505.webp"},{"title":"Detective Conan Movie 22: Zero The Enforcer","synopsis":"In the film's story, there is a sudden explosion at Tokyo Summit's giant Edge of Ocean facility. The shadow of Tooru Amuro, who works for the National Police Agency Security Bureau as Zero, appears at the site. In addition, the \"triple-face\" character is known as Rei Furuya as a detective and Kogorou Mouri's apprentice, and he is also known as Bourbon as a Black Organization member. Kogorou is arrested as a suspect in the case of the explosion. Conan conducts an investigation to prove Kogorou's innocence, but Amuro gets in his way.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/90104.webp"},{"title":"Detective Conan OVA 10: Kid in Trap Island","synopsis":"In this entirely new story produced specifically for the DVD, Conan leads a group of young detectives against the phantom thief Kaitou Kid, who has his eyes set on a jewel at a hotel on an isolated island.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/23698.webp"},{"title":"Detective Conan OVA 02: 16 Suspects","synopsis":"Conan Edogawa and the rest of the gang are invited to Inspector Ninzaburou Shiratori's villa for a small gathering. The party's highlight is Shiratori's prized wine collection—including his most expensive vintage—and a bottle from it will be served for the evening. However, just as this wine is to be brought out, Shiratori finds the bottle smashed on the floor—and the culprit can only be among the 16 people present in the gathering.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/71317.webp"},{"title":"Dominion","synopsis":"Leona Ozaki joins Newport City's infamous Tank Police division. With aid of Al and her newly built mini-tank, Bonaparte, she wages war on Buaku and his cohorts, the Puma Sisters. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/18850.webp"},{"title":"Koukaku Kidoutai: Stand Alone Complex - Solid State Society 3D","synopsis":"Kenji Kamiyama and Production I.G's Ghost in the Shell: Stand Alone Complex: Solid State Society movie will be converted into stereoscopic 3D. Kamiyama himself is overseeing the conversion, and I.G will also add a newly animated opening sequence.","img":"https://cdn.myanimelist.net/images/anime/4/29259.webp"}]