[{"title":"Anomalies","synopsis":"We try to enrich ourselves through prayer, faith and devotion to someone or something \"other.\" Similarly, we believe in the existence of \"anomalies,\" such as unknowable and uncontrollable monsters. But can such beliefs advance us?\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/10/69593.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Special","score":4.74,"genres":["Psychological"]},{"title":"Nisou no Kuzu","synopsis":"The dialogue in question takes place between a woman, who appears to be submerged in water, and a man who sits by a tree on sandy soil. The messages the couple sends back and forth to one another take the form of metaphor: a seed, a fish, a thorn, and so on.\n\n(Source: Midnight Eye)","img":"https://cdn.myanimelist.net/images/anime/2/59755.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.08,"genres":["Psychological"]},{"title":"Wake up!! Tamala","synopsis":"In 2050, the world's climate has changed for the worse. One rainy day, Tamala saves a honeybee named Kuronosuke from drowning in a gutter. As the last bee of the cat world, he invites Tamala on a magical journey back in time—back to our near future. \n\nWith Tamala's era quickly approaching, civilization has begun to waste and destroy the nature that lie around them. Roving around a land where all other animals are extinct, she finally begins to starve.. Until Kuronosuke offers himself as food. \n\n(Source: Official site, edited)","img":"https://cdn.myanimelist.net/images/anime/7/76309.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.48,"genres":["Fantasy","Psychological"]},{"title":"Warau Salesman Episode 0","synopsis":"The prologue to Warau Salesman that aired a week before the official episode 1 was released.","img":"https://cdn.myanimelist.net/images/anime/7/84708.webp","source":"Manga","numberOfEpisode":"1","studio":null,"type":"Special","score":5.91,"genres":["Psychological","Seinen","Supernatural"]},{"title":"Nouryou Anime: Denkyuu Ika Matsuri","synopsis":"Death is the gateway to birth. The deceased crosses the line to join the kingdom of the dead. He sees there the dance of the sperm and the egg. He is drawn towards the sky. This is the path to the afterlife.\n\n(Source: starandshadow.org.uk)","img":"https://cdn.myanimelist.net/images/anime/13/73673.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":4.72,"genres":["Psychological","Dementia","Horror"]},{"title":"Youkaiden Nekome Kozou","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/4/60329.webp","source":"Manga","numberOfEpisode":"25","studio":null,"type":"TV","score":null,"genres":["Adventure","Horror","Psychological","Seinen","Supernatural"]},{"title":"Da Shi Jie","synopsis":"A hard rain is about to fall on a small town in Southern China. In a desperate attempt to find money to save his fiancée’s failed plastic surgery, Xiao Zhang, a mere driver, steals a bag containing 1 million from his boss. News of the robbery spreads fast within the town and, over the course of one night, everyone starts looking for Xiao Zhang and his money.\n\n(Source: Metacritic)","img":"https://cdn.myanimelist.net/images/anime/1320/90231.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":6,"genres":["Comedy","Psychological","Thriller"]},{"title":"Kokoroya","synopsis":"An educational film about empathy in Japan. In the movie's example, uses a sci-fi twist to show how the hearts of others to the main character in certain situations.","img":"https://cdn.myanimelist.net/images/anime/2/65991.webp","source":"-","numberOfEpisode":"1","studio":"Toei Animation","type":"OVA","score":null,"genres":["Kids","Psychological","Sci-Fi"]},{"title":"Worku","synopsis":"A dark stop motion anime about a lone traveler in a desert who finds a solitary box. When he opens it, he finds a rundown and rather spooky city made up of large tower block apartments. Suddenly, a mysterious ghostly stick entity appears and seems to follow our hero. What is the purpose of this strange figure?","img":"https://cdn.myanimelist.net/images/anime/12/18022.webp","source":"-","numberOfEpisode":"2","studio":null,"type":"ONA","score":5.74,"genres":["Psychological","Fantasy"]},{"title":"Warau Salesman Dai SP-banashi","synopsis":"Specials of Warau Salesman broadcasted intermittently during the main show not included in the episode count of the main show. They are 3 times the length of a normal episode and fill a half hour time-slot.","img":"https://cdn.myanimelist.net/images/anime/12/84709.webp","source":"Manga","numberOfEpisode":"8","studio":"Shin-Ei Animation","type":"Special","score":null,"genres":["Comedy","Psychological","Supernatural","Drama","Seinen"]},{"title":"Kodomo no Kaitei no Koto","synopsis":"For whom does a girl keep rotating? A story of a weird relationship between a child and adults.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/8/71812.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":4.53,"genres":["Psychological"]},{"title":"Yellow","synopsis":"Everybody wants to be fashionable and praised. So do grandmothers.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/6/71787.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.13,"genres":["Psychological"]},{"title":"Byulbyul Iyagi","synopsis":"Six animated shorts about discrimination and being different. \n\n1. \"Daydream\" talks about dealing with people with disability. It homes in on the daily life of a father with a daughter whose hands and feet are deformed. \n\n2. \"Animal Farm\" relies on the rough-and-ready feel of stop-motion clay animation to create a satire of bullying and mob dynamics. \n\n3. \"At Her House\" paints a devastating picture of gender inequality within a marriage. \n\n4. \"Flesh and Bone\" gently pillories superficiality and the obsession with outward appearance. \n\n5. \"Bicycle Trip\" focuses on the discrimination experienced by foreign workers in Korea.\n\n6. \"Be a Human Being\" looks at the way young Koreans are barely treated as human beings before they get to university. \n\n(Source: ANIWEBLOG, ASIANDB, Jeonju)","img":"https://cdn.myanimelist.net/images/anime/3/17743.webp","source":"-","numberOfEpisode":"6","studio":null,"type":"Movie","score":null,"genres":["Psychological","Drama"]},{"title":"Chikotan","synopsis":"Okamoto Tadanari short film.","img":"https://cdn.myanimelist.net/images/anime/5/71181.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.56,"genres":["Music","Psychological"]},{"title":"Kakari","synopsis":"A clerk has his own duty. A clerk does his own work. This is what a clerk should do.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/7/71810.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":4.76,"genres":["Psychological"]},{"title":"Ninja &amp; Soldier","synopsis":"Two eight-year-old boys compete in a game of childish bravado. Ken is a Ninja, Nito a child soldier from the Congo who was forced to kill his own mother. Their naïve game addresses cruel realities, and they talk about their differences and what they have in common. Accompanied by contrasting graphics, the film explores the types of acts of which humankind is capable.\n\n(Source: Berlinale)","img":"https://cdn.myanimelist.net/images/anime/10/69831.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.95,"genres":["Psychological"]},{"title":"Paradise","synopsis":"\"A highly energetic story told from outer space, battlefields, and dentist offices, over and around time and space.\"\n\n(Source: Image Forum Festival 2014 program)","img":"https://cdn.myanimelist.net/images/anime/5/71482.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"Movie","score":null,"genres":["Adventure","Psychological","Space"]},{"title":"WIXOSS","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1181/106738.webp","source":"Card game","numberOfEpisode":"?","studio":null,"type":"TV","score":null,"genres":["Game","Psychological"]},{"title":"Pianoman","synopsis":"The still, white space expands as far as the eye can see. A man who's lost his memory awakens. An enormous door stands before him, and there's an old temple in the distance. The building seems to be calling to him, and the man approaches it. There's an old piano there. The moment he touches it, horrifying memories return to him. Who is this man, really? And what is the truth of this space...?\n\n(Source: YouTube)","img":"https://cdn.myanimelist.net/images/anime/1181/105817.webp","source":"Original","numberOfEpisode":"1","studio":"Echoes","type":"ONA","score":6.47,"genres":["Music","Demons","Psychological","Fantasy"]},{"title":"Byulbyul Iyagi 2","synopsis":"This film consists of 6 animated shorts produced by the Human Rights Commission of Korea.  Like the previous movie, the stories deal with seeing the world through the eyes of people who are different from social norms.  The film was nominated for Best Animated Feature in 2008 from the Asia Pacific Screen Awards.\n\n1. \"The Third Wish” (AN Dong-hui, RYU Jeong-wu). A fairy godmother appears before a visually impaired young woman to grant her three wishes. But this is no fairytale. The irritable middle-aged fairy wants to finish her job as soon as possible. Yet she proves to be helpful as she leads the woman through a busy marketplace, which is delightfully reminiscent of \"Amelie\". But it's no walk in the park, as busy urbanites show no consideration for our protagonist. Yet she prevails through obstacles. With a walking stick, she taps together the heels of her shiny new shoes and follows the \"yellow brick road\" (guiding tiles for the visually impaired) around the city.\n\n2. \"Ajukari” (HONG Deok-pyo) is a street-style cartoon. It comically depicts how a certain macho \"complex\" can cripple men. Male circumcision becomes the ultimate standard for being \"manly\" and those who have failed to do the deed are forever fearful of going to public baths.\n\n3. \"Baby\" (LEE Hong-su, LEE Hong-min) portrays the difficulties a career woman faces in having a child. \"I'm not saying you can't have maternity leave, but can you afford to raise a child while working?\" asks her boss. This smart story portrays everything from mother and daughter-in-law relationships to a parody of \"Tazza: The High Rollers\" and hilarious episodes where an \"ambulance bus\" picks up several patients en route.\n\n4. \"Shine Shine Shining\" (KWON Mi-jeong) is drawn like a warm, watercolor storybook for children. Grade schooler Eun-jin is smart and popular, but she has a secret. She hides her curly hair, which she gets from her Filipino mother, in braids.\n\n5. \"Merry Golasmas\" is an adorable claymation, or stop motion animation of models constructed from clay, plasticine, etc. It explores physical discrimination or stereotypes. In an open audition to find a Santa Claus, the real Santas ― one who's black, another who's Asian, a female Santa and one in a wheelchair ― lose to a fake Santa, a pot-bellied, Caucasian.\n\n6. “Lies\" explores homosexuality. Drawn in pastel-like sketches with art deco-esque details, it is a stunning digital cut-out animation, A homosexual man is forced by his parents to marry a woman, while others are pressured to fake having a girlfriend or receive \"therapy\" to become straight.\n\n(Source: The Korean Times)","img":"https://cdn.myanimelist.net/images/anime/13/26149.webp","source":"-","numberOfEpisode":"6","studio":null,"type":"Movie","score":null,"genres":["Psychological","Drama"]},{"title":"Miyako","synopsis":"MONOLITH (a.k.a. Kaoru/Brilliance) provides a poetry reading for Miyako, taken from the perspective of a mentally ill woman stalking another woman.","img":"https://cdn.myanimelist.net/images/anime/1741/92704.webp","source":"Other","numberOfEpisode":"1","studio":null,"type":"ONA","score":null,"genres":["Psychological"]},{"title":"Hyoutan","synopsis":"Independent animation by Suzuki Shin'ichi.","img":"https://cdn.myanimelist.net/images/anime/13/71329.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"Movie","score":null,"genres":["Psychological"]},{"title":"Tamayura no Yume","synopsis":"A girl is informed by her doctor that she is pregnant. Surprised by the unexpected announcement, falls into an anguish. The fleeting dream is a despairing dream.\n\n(Source: Geidai Animation)","img":"https://cdn.myanimelist.net/images/anime/1155/99550.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":null,"genres":["Psychological","Drama"]},{"title":"Flying Luna Clipper","synopsis":"A trip on a chartered plane with a number of other thrill-seekers (most of whom are anthropomorphic fruits and vegetables) and hop from island to island, each of which offer their own unique visual delights. \n\n(Source: IMDB)","img":"https://cdn.myanimelist.net/images/anime/1170/98289.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"OVA","score":null,"genres":["Music","Comedy","Parody","Dementia","Psychological","Ecchi"]},{"title":"KiyaKiya","synopsis":"The term \"KiyaKiya\" comes from the old Japanese expression \"mune ga kiyakiya suru.\" I first encountered it in Shibusawa Tatsuhiko's book Introductory Essays on Girls, in the chapter about \"childhood experiences.\" The expression, which describes “an enigmatic, nostalgic, disturbing feeling,” or an impression of “deja-vu”, is at the origin of my \"KiyaKiya\" series.\n\nIn our everyday routine, there are moments when suddenly we feel like something is different; this unexpected change, like in my memory, feels like it has a kind of reality. This impression is at the core of “KiyaKiya” and the related painting and drawing series.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/10/82516.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Music","score":null,"genres":["Music","Psychological"]},{"title":"Ushinawareta Choushoku","synopsis":"A businessman happily goes about his carefully prepared morning routine. One day, this routine is suddenly interrupted.","img":"https://cdn.myanimelist.net/images/anime/1902/102382.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"ONA","score":null,"genres":["Dementia","Psychological"]},{"title":"Pianoman Trailer","synopsis":"Trailer for Echoes' PIANOMAN with original animation that was not reused in the resulting short film.","img":"https://cdn.myanimelist.net/images/anime/1294/106625.webp","source":"Original","numberOfEpisode":"1","studio":"Echoes","type":"ONA","score":null,"genres":["Music","Psychological"]},{"title":"Itekoma Hits","synopsis":"Otoboke Beaver's new album ITEKOMA HITS features six new tracks, two re-recorded songs, and the contents from their Love Is Short and Bakuro Book EPs. To promote the album, an animated summary video was made by Naoyuki Asano.","img":"https://cdn.myanimelist.net/images/anime/1521/103623.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Music","score":null,"genres":["Music","Dementia","Psychological"]},{"title":"Key the Metal Idol","synopsis":"Tokiko Mima, nicknamed \"Key,\" is a 17-year-old girl living in the Japanese countryside who, despite her human-like appearance, is a robot. When Key's grandfather Dr. Murao Mima passes away, he leaves her a dying message, telling her that she can become a real girl if she is able to make thirty thousand friends. Thus, Key moves from the quiet Mamio Valley to the busy streets of Tokyo, where she soon runs into her childhood friend Sakura Kuriyagawa.\n\nKey quickly becomes enamored with idol singer Miho Utsuse and wonders if becoming a singer will allow her to make the amount of friends needed for her to become human. But Miho carries a ominous secret: she is connected to Jinsaku Ajou, an old rival of Dr. Mima trying to make new a breakthrough in robotic weaponry. As Key works to become a real girl, Ajou sets a dangerous plan into action, and it turns out there's much more to Key than meets the eye.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/11220.webp","source":"Original","numberOfEpisode":"15","studio":"Studio Pierrot","type":"OVA","score":6.95,"genres":["Action","Sci-Fi","Music","Psychological","Drama","Mecha"]},{"title":"7 Seeds 2nd Season","synopsis":"Second season of 7 Seeds.","img":"https://cdn.myanimelist.net/images/anime/1133/106529.webp","source":"Manga","numberOfEpisode":"12","studio":"Gonzo","type":"ONA","score":7.31,"genres":["Sci-Fi","Adventure","Mystery","Psychological","Drama","Romance","Shoujo"]},{"title":"RahXephon: Tagen Hensoukyoku","synopsis":"Ayato Kamina was separated from the girl he loved, Haruka Mishima, when an event occurred that was thought to have killed everyone outside of Tokyo. But one day three years later, invaders suddenly attacked the city. It was then that he meets an agent of TERRA, Haruka Shitow, who tells him that she will give him the truth about the world. It is the beginning of a series of strange events, which involve him activating a giant mecha, the RahXephon and finding out that many people, including his own mother, has blue blood, and that he was actually living in a self-encased dimension where time moves slower than that of the outside world.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1771/94881.webp","source":"Original","numberOfEpisode":"1","studio":"Bones","type":"Movie","score":7.06,"genres":["Action","Drama","Mecha","Psychological","Romance","Sci-Fi"]},{"title":"Kidou Senkan Nadesico: The Prince of Darkness","synopsis":"Two years have passed since the end of the \"Martian Successor Nadesico.\" Akito and Yurika have disappeared. The Jovians and the Earthlings have joined forces and Ruri is now captain of Nadesico B. As the popularity of Boson Jumping grows, a vast transportation network has been developed. Dubbed the Hisago Plan, this network of Chulip portals holds the answers to the mysteries behind Bose particles and their power. If those secrets should fall into the wrong hands, it could mean big trouble. And big trouble there is. A Martian splinter group has launched an offensive, leaving the United Forces befuddled and desperate. So much so, in fact, that the former crew of the Nadesico is called back to active duty for a special unsanctioned mission-to save us all. Does this menagerie of misfits have what it takes? Who will win the race for the Boson technology? And what the heck happened to Akito and Yurika?","img":"https://cdn.myanimelist.net/images/anime/10/51253.webp","source":"Original","numberOfEpisode":"1","studio":"Xebec","type":"Movie","score":6.78,"genres":["Action","Comedy","Drama","Mecha","Psychological","Sci-Fi","Shounen","Space"]},{"title":"Hikari to Mizu no Daphne","synopsis":"In the future, water has covered much of the Earth due to the effects of global warming. The orphaned Maia Mizuki, 15, just graduated from middle school and has already applied for employment in the elite paramilitary Ocean Agency, part of the futuristic world government. Only the best, most intelligent, and physically fit students are eligible for admission. Maia, the series' protagonist, is set to become one of the few.\n\nBut her ideal life quickly falls apart. To her disappointment, Maia unexpectedly fails her entrance exams. Making matters worse, she promptly gets evicted from her house, pick pocketed, taken hostage, then shot. She is \"saved\" by two women (Rena and Shizuka) that are part of an unorthodox help-for-hire organization called Nereids (inspired by the Greek mythological Nereids ). With nowhere to go, Maia joins up with Nereids, taking jobs from capturing wanted criminals to chasing stray cats, often with unexpected results. Gloria and Yu later join up with Nereids.\n\n\"Daphne\" in the title refers to a subplot that starts midway into the series and eventually become important to Maia. \"Brilliant Blue\" refers to the fact that this is a world covered by water with almost no land. The world consists of vast oceans, a few islands, and floating cities.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/7/49131.webp","source":"Original","numberOfEpisode":"24","studio":"J.C.Staff","type":"TV","score":6.78,"genres":["Sci-Fi","Mystery","Comedy","Police","Psychological","Drama","Ecchi"]},{"title":"Betterman","synopsis":"A deadly virus known as \"Algernon\" has attacked humanity with vicious meaning. At the forefront of the battle is the mystifying Akamatsu Industries—disguised as a heavy machine factory in Tokyo, this undercover organization uses neural enhanced weapons known as NeuroNoids to battle Algernon. Also helping with their secret efforts is the mysterious mutant who is only known as \"Betterman.\"\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1157/91069.webp","source":"Original","numberOfEpisode":"26","studio":"Sunrise","type":"TV","score":6.62,"genres":["Action","Adventure","Psychological","Comedy","Mecha","Drama","Horror","Mystery","Sci-Fi"]},{"title":"Uzumaki","synopsis":"In the town of Kurouzu-cho, Kirie Goshima lives a fairly normal life with her family. As she walks to the train station one day to meet her boyfriend, Shuuichi Saito, she sees his father staring at a snail shell in an alley. Thinking nothing of it, she mentions the incident to Shuuichi, who says that his father has been acting weird lately. Shuuichi reveals his rising desire to leave the town with Kirie, saying that the town is infected with spirals.\n\nBut his father's obsession with the shape soon proves deadly, beginning a chain of horrific and unexplainable events that causes the residents of Kurouzu-cho to spiral into madness.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1432/105265.webp","source":"Manga","numberOfEpisode":"4","studio":"Drive","type":"TV","score":null,"genres":["Dementia","Horror","Psychological","Supernatural","Drama","Romance","Seinen"]},{"title":"Robotica*Robotics","synopsis":"What is love? Two robots abandoned by their previous owner are with a new owner, a scientist. A story about the meaning of love.","img":"https://cdn.myanimelist.net/images/anime/7/89081.webp","source":"-","numberOfEpisode":"1","studio":"CoMix Wave Films","type":"OVA","score":6.91,"genres":["Slice of Life","Psychological","Sci-Fi","Shounen Ai"]},{"title":"Magia Record: Mahou Shoujo Madoka☆Magica Gaiden (TV) 2nd Season","synopsis":"2nd Season of Magia Record: Mahou Shoujo Madoka☆Magica Gaiden (TV).","img":"https://cdn.myanimelist.net/images/anime/1097/106793.webp","source":"Game","numberOfEpisode":"?","studio":null,"type":"TV","score":null,"genres":["Psychological","Drama","Magic","Thriller"]},{"title":"AD Police","synopsis":"The year is 2027 in MegaTokyo, six years before the Knight Sabers will make their debut. Boomers (artificial humans) are still a relatively new advancement, and the implementation and integration of boomers into society is still a bit buggy -- sometimes fatally so. Whenever a boomer incident occurs, though, there is the Advanced Police, a special force trained to deal with boomer crimes.\n\nLeon McNichol is a rookie in the AD Police, and is just starting to become exposed to the horrors and tragedies one finds every day in MegaTokyo. He and his veteran partner, Gina Marceau, slowly learn about the ever-fading line that separates man from machine. ","img":"https://cdn.myanimelist.net/images/anime/13/2851.webp","source":"Original","numberOfEpisode":"3","studio":"AIC","type":"OVA","score":6.31,"genres":["Sci-Fi","Adventure","Mystery","Dementia","Police","Psychological","Thriller","Mecha"]},{"title":"Ou Dorobou Jing in Seventh Heaven","synopsis":"Jing, the infamous King of Bandits, finds himself and his feathered partner Kir behind bars in Seventh Heaven, the most notorious prison complex in the world. There, they seek to steal the Dream Orb from the convict Campari. But before doing so, they must escape from the prison of dreams that Campari has conjured for them. \n","img":"https://cdn.myanimelist.net/images/anime/5/30325.webp","source":"-","numberOfEpisode":"3","studio":"Studio Deen","type":"OVA","score":7.32,"genres":["Adventure","Fantasy","Psychological","Comedy","Shounen"]},{"title":"Human Lost: Ningen Shikkaku","synopsis":"\"Mine has been a life of much shame.\"\n\nTokyo, 2036 (Showa year 111): a revolution in medical treatment has conquered death...\nBy means of internal nanomachines and the \"S.H.E.L.L.\" system whose network controls them, human beings suffer no diseases, require no treatment for injuries, and are guaranteed a 120-year lifespan, free from illness. Yet this consummate social system warps the Japanese nation in a host of ways: unresolved economic disparities, ethical decadence resulting from deathlessness, grave environmental pollution, and the \"Human Lost\" phenomenon, in which people themselves, disconnected from the S.H.E.L.L. network, become malformed. Japan teeters wildly between two potential futures: civilization's restoration or its destruction.\n\nAtmospheric pollution suffuses \"Route 16\" in the Outside—the area outside the Route 16 beltway. Youzou Oba, who lives an idle, drug-saturated life, joins Masao Horiki, a mysterious man who associates with the drag-racing gangs, on an incursion Inside—the area within the Route 7 loop where the privileged class lives—only to be embroiled in a violent struggle. When he encounters a malformed sufferer of the Human Lost phenomenon, a \"Lost,\" Youzou's life is saved by Yoshiko Hiiragi, a girl of mysterious abilities who belongs to the anti-Lost agency H.I.L.A.M., and he discovers that he himself also possesses extraordinary powers...\n\nDegradation and death. Life and hope. Buffeted by fate, a man tears himself apart and cries out. Rage. Sorrow. Pathos. Consumed by despair and bitter tears, Youzou Oba is himself transformed into a demon. A human lost... or a human who can find himself? \n\n(Source: Official Site)","img":"https://cdn.myanimelist.net/images/anime/1815/104501.webp","source":"Novel","numberOfEpisode":"1","studio":"Polygon Pictures","type":"Movie","score":5.88,"genres":["Historical","Psychological","Drama","Seinen"]},{"title":"Shuangsheng Lingtan","synopsis":"There is always more to the world than meets the eye. This is the motto that twin brothers Sun Xiaotu and Sun Xiaohu follow in their lives as paranormal investigators, where what may be terrifying to some is just another day at work. Normally, it is simple for them to separate their daily lives from their job, but when they go to investigate a seemingly typical haunting of a pair of twins, a series of bizarre events throw their perception of the supernatural world into question as they become a target of the hauntings themselves.\n\nThe further the brothers search for answers to the paranormal mysteries thrown at them, the hazier the lines between truth and fiction become. Through the challenging and sometimes dangerous adventures ahead, one question remains: what kind of secrets are the ghosts trying to hide from them, and are they already more connected to the spirits than they originally thought?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/81754.webp","source":"Manga","numberOfEpisode":"20","studio":"B.CMAY PICTURES","type":"ONA","score":7.32,"genres":["Mystery","Psychological"]},{"title":"Mi Yu Xing Zhe","synopsis":"A magician, a female doctor, a gangster, an archaeology professor, a policewoman, a drug dealer, a businessman... Such a random group of people find themselves trapped on a desolate island when they wake up from sleep one day. They are surrounded by tribes, mutant viruses, and countless life and death situations on this mysterious island. What will they do to survive and escape?","img":"https://cdn.myanimelist.net/images/anime/1869/104422.webp","source":"Web manga","numberOfEpisode":"12","studio":"Thundray","type":"ONA","score":7.45,"genres":["Mystery","Psychological","Thriller"]},{"title":"Change!! Getter Robo: Sekai Saigo no Hi","synopsis":"Dr. Saotome returns from the dead after being seemingly murdered by Getter pilot Nagare Ryoma and threatens the world with his ultimate creation: the Shin Dragon. Ryoma reluctantly teams up with his former co-pilots Jin Hayato and Tomoe Mushashi to combat Dr. Saotome. The pilots must also deal with the mysterious Invaders, aliens that have the ability to possess humans and warp their flesh to form hideous creatures.\n\n(Source: Nihon Review)","img":"https://cdn.myanimelist.net/images/anime/4/23767.webp","source":"-","numberOfEpisode":"13","studio":"Brain's Base","type":"OVA","score":7.68,"genres":["Action","Psychological","Adventure","Mecha","Sci-Fi","Horror","Shounen"]},{"title":"Litchi DE Hikari Club","synopsis":"A short, comical anime adaptation of the psychological-horror manga, Litchi☆Hikari Club. \n\nThe story is about nine boys who are members of the Hikari Club and their self-made AI robot, Litchi. They are led by their leader Zera and keep a kidnapped girl named Kanon. ","img":"https://cdn.myanimelist.net/images/anime/11/40867.webp","source":"Manga","numberOfEpisode":"8","studio":"Kachidoki Studio","type":"TV","score":5.25,"genres":["Comedy","Drama","Horror","Psychological","Romance"]},{"title":"Yuugo: Koushounin","synopsis":"\"Negotiation means, you turn words into weapons\"\n\nThis is the realization of the popular comic Yu-go that was published in Kondasha Afternoon Magazine over a period of 10 years.\n\nBeppu Yuugo is the world's most successfull negotiator. His only weapons are \"words.\" Yuugo doesn't kill people. Neither does he threaten them with brute violence. With rich knowledge and a calm judgement, he believes in the humans inside them. Doing only that he has managed many dangerous negotiations successfully until now. Now two of the many episodes have been chosen very carefully, one taking place in Russia, the other one in Pakistan. In the burning desert and the freezing Siberia Yuugo begins his negotiations.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/13/55523.webp","source":"Manga","numberOfEpisode":"13","studio":"Artland","type":"TV","score":7.16,"genres":["Action","Military","Mystery","Psychological","Drama","Seinen"]},{"title":"Mobile Suit Gundam Wing: Operation Meteor","synopsis":"Two video releases recapping events from the Gundam Wing TV series. Each Operation Meteor video contains an 'Odd' episode and an 'Even' episode. The 'Odd' episodes feature Heero, Trowa and Wufei, while the 'Even' episodes feature Duo and Quatre. The episodes also featured brief new footages of the characters after the final episode of the TV series. \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/2/42885.webp","source":"Original","numberOfEpisode":"4","studio":"Sunrise","type":"OVA","score":7.5,"genres":["Action","Military","Sci-Fi","Adventure","Space","Psychological","Drama","Mecha"]},{"title":"Mutafukaz","synopsis":"After a scooter accident provoked by a mysterious woman's vision, Angelino, a deadbeat like thousands of others in Dark Meat City, starts getting violent migraines that are accompanied by strange hallucinations. Along with his good buddy Vinz, he tries to figure out what's happening to him while threatening men in black seem determined to catch him.\n\n(Source: Annecy)","img":"https://cdn.myanimelist.net/images/anime/1718/95259.webp","source":"Manga","numberOfEpisode":"1","studio":"Ankama Animations","type":"Movie","score":7.14,"genres":["Action","Psychological","Sci-Fi","Super Power"]},{"title":"Sword Art Online Fatal Bullet: The Third Episode","synopsis":"The short follows a boy looking for a girl he met in the Gun Gale Online game. The boy believes they have a connection, but to the girl their connection is part of a fantasy. The time to test whether their bond is real or fantasy will come. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1210/91229.webp","source":"Game","numberOfEpisode":"1","studio":null,"type":"Special","score":6.11,"genres":["Action","Game","Military","Sci-Fi","Psychological","Fantasy"]},{"title":"Hitori no Shita: The Outcast 3rd Season","synopsis":"Third season of Hitori no Shita: The Outcast.","img":"https://cdn.myanimelist.net/images/anime/1197/106650.webp","source":"Manga","numberOfEpisode":"8","studio":null,"type":"ONA","score":null,"genres":["Action","Mystery","Super Power","Psychological","Supernatural","Drama","Martial Arts"]},{"title":"Koroshiya 1 The Animation: Episode 0","synopsis":"A masochistic mobster meets his match in the dark streets of Tokyo. His nemesis, Ichi, is a psychopathic killer with an unrelenting thirst for bloodshed. A horrifying secret burns in his mind, and his hands deal death without mercy. At last, the shrouds of mystery are parted to reveal the origin of the monster. The city will know its greatest fear at the unveiling of Ichi the Killer. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/34131.webp","source":"Manga","numberOfEpisode":"1","studio":"AIC","type":"OVA","score":5.75,"genres":["Action","Dementia","Drama","Horror","Martial Arts","Psychological","Seinen"]},{"title":"Eikyuu Kazoku","synopsis":"It started as a sociological experiment. Six different people were brainwashed to think that they were a family and then put in arbitrary situations to see how they would react; however, when a taping of the families conducts is sold in a desperate attempt to make a little capital, it instantly becomes a success. Now the family is a first rated show and their every move is broadcasted around the world without them knowing it. But when a clogged toilet sets off a chain of events that ultimately frees the family from the room they are confined in the broadcasters, not willing to lose their source of income, set out to hunt down and recapture every member of the Eternal family.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/10210.webp","source":"-","numberOfEpisode":"1","studio":"Studio 4°C","type":"Movie","score":5.99,"genres":["Psychological","Comedy"]},{"title":"Darkside Blues","synopsis":"The Persona Century Corporation has purchased nearly every parcel of land on earth. Dissension is not tolerated within the corporation's borders and those who oppose Persona are dealt with swiftly. Of those few places not yet under Persona's control is the free town of Kabuki-cho, also known as \"The Dark Side of Tokyo\". Within the town, under the leadership of a woman named Mai, is a small resistance group called Messiah. Into this world steps a man who takes the sobriquet of Kabuki-cho: Darkside. Sealed up in another dimension eighteen years ago by Persona Century, Darkside now returns to aid Messiah using his unique mystic power of renewal. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/3766.webp","source":"Manga","numberOfEpisode":"1","studio":"J.C.Staff","type":"Movie","score":6.13,"genres":["Horror","Mystery","Psychological","Sci-Fi"]},{"title":"Bondage Game: Shinsou no Reijoutachi","synopsis":"Yuu is a girl who has lost her memories. She is mailed into a sadistic house of bondage where she and others are forced (or not) to serve their master, Renji, but there are serious consequences for those who fail.","img":"https://cdn.myanimelist.net/images/anime/4/41505.webp","source":"-","numberOfEpisode":"2","studio":null,"type":"OVA","score":5.25,"genres":["Hentai","Psychological"]},{"title":"Kikumana","synopsis":"This work \"Kikumana\" is an animation of a girl called Kikumana who acts like in a stage performance, the role defeated by such an ill circumstance though she tries to find herself. The primal aim is to get the audience feeling a strange atmosphere spread from this work. The image has a pictorial atmosphere and a documentary touch at the same time. Unrealistic phenomena take place there.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/7/79930.webp","source":"Original","numberOfEpisode":"1","studio":"Studio Rikka","type":"ONA","score":5.83,"genres":["Dementia","Psychological"]},{"title":"Mekakucity Days","synopsis":"Mekakucity Days is a series of music videos that tell the stories of some of the members of the \"Mekakushi-dan.\"\n\nKagerou Daze\nIn the scorching heat haze of summer, Hibiya Amamiya feels every day is monotonous. On a swing in a park, he meets up with Hiyori Asahina, who gently strokes the cat in her arms. However, when the cat leaps away, Hiyori runs headlong into a never-ending tragedy—and Hibiya will do whatever it takes to see her safe.\n\nHeadphone Actor\n\"The end of the world is nigh,\" the news broadcast proclaims. Amidst the chaos, Takane Enomoto hears a voice in her headphones, asking if she wants to live. Following its directions, she races onward, but what awaits her may not be the salvation that she desires.\n\nSouzou Forest\nDue to her red eyes and white hair, everybody sees Mari Kozakura as a monster. Although she lacks the courage to do so, she dreams of escaping her house in the forest where she lives alone, imagining the world outside. Fortunately, her lonesome life begins to change with a simple knock on the door.\n\nKonoha no Sekai Jijou\nThe android-like being Konoha lacks many memories. What he recalls are feelings of longing, but by who and for who, he cannot place. What he does know, however, is that in the heat haze of summer, a young boy and girl face a tragedy. But fate is unchangeable, and his desperate attempts to save them can never seem to rewrite the future.\n\nToumei Answer\nShintarou Kisaragi knows how every day will go. Blessed with a photographic memory, he knows he will score full marks on his next exam, and he knows that Ayano Tateyama, the girl who sits next to him, will do poorly. But with his genius also comes unrelenting boredom; not even Ayano's bright smile and optimistic outlook can make him waver. His apathy may finally be broken, however, when Ayano does something that shakes Shintarou to his very core.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/88108.webp","source":"Music","numberOfEpisode":"5","studio":null,"type":"Music","score":7.52,"genres":["Music","Psychological","Sci-Fi"]},{"title":"Ningen Shikkaku: Director's Cut-ban","synopsis":"A theatrical film version of Madhouse's Aoi Bungaku Series anime. The film will re-edit the four episodes based on Osamu Dazai's No Longer Human (Ningen Shikkaku) novel, which have character designs inspired by manga artist and novel illustrator Takeshi Obata. This \"director's cut\" will include new \"navigation\" footage which is being created specifically for the film with narrator Masato Sakai.","img":"https://cdn.myanimelist.net/images/anime/6/24794.webp","source":"Novel","numberOfEpisode":"1","studio":"Madhouse","type":"Movie","score":7.5,"genres":["Drama","Historical","Psychological","Seinen"]},{"title":"Fujimi 2-choume Koukyougakudan","synopsis":"High school music teacher, Morimura Yuuki, is the concert master and first violinist of the amateur orchestra, Fujimi Orchestra. Surprisingly, a young conductor named Tonoin Kei (known as a musical genius) joins this small orchestra to conduct. Even though Tonoin is a strict conductor, all the members adore him for the notable improvements in their performances and soon Yuuki feels his efforts for the orchestra have been fruitless. Yuuki soon comes to the conclusion that his crush of 3 years likes Tonoin, and he decides to give up on her and leave the orchestra. Tonoin refuses to let him quit, confessing that he loves Yuuki, which reveals that he's gay. Tonoin's love confession confuses Yuuki and it leads to a very horrible misunderstanding.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/2411.webp","source":"Light novel","numberOfEpisode":"1","studio":null,"type":"OVA","score":5.59,"genres":["Drama","Music","Psychological","Romance","Slice of Life","Yaoi"]},{"title":"Atama Yama","synopsis":"After a stingy man eats some cherry seeds, a cherry tree grows on his head and he gets into a lot of trouble. \n","img":"https://cdn.myanimelist.net/images/anime/8/18494.webp","source":"Other","numberOfEpisode":"1","studio":"Studio Deen","type":"Movie","score":6.47,"genres":["Comedy","Dementia","Psychological","Fantasy"]},{"title":"RahXephon: Kansoukyoku/Kanojo to Kanojo Jishin to - Thatness and Thereness","synopsis":"Quon Kisaragi was surprised when she saw an illusion of herself floating in midair. This other \"self\" of her claimed that she is a fragment of Quon. Thus an existentialistic dialogue began between the two.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/7/75739.webp","source":"Original","numberOfEpisode":"1","studio":"Bones","type":"OVA","score":6.38,"genres":["Sci-Fi","Psychological","Drama"]},{"title":"Tamala 2010: A Punk Cat in Space","synopsis":"It's the year 2010 on the planet of cats, where lies Meguro City, a megalopolis entirely controlled by the super-corporation Catty &amp; Co. The nefarious influence of this corporate empire extends malignantly across the feline galaxy. Tamala, a carefree, one-year-old kitten, decides to flee this cruel reality and boards her spaceship in search of her planet of origin. \n\n(Source: IMDb)","img":"https://cdn.myanimelist.net/images/anime/11/15876.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":6.34,"genres":["Psychological","Comedy","Dementia","Sci-Fi"]},{"title":"Buddha Saitan","synopsis":"17-year-old Sayako Amanokawa aspires to become a journalist, just like Kanemoto, an elite newspaper writer she looks up to. But Kanemoto, shamed from an erroneous report about a corruption scandal, jumps in front of a train and commits suicide. Since that incident, Sayako suddenly becomes able to see spirits and almost loses her life. However, from that near-fatal incident she experiences something extraordinary. The journalist inside her stirred, she embarks to find out about the truth. But the forces that stand in her way turn out to be much more formidable than she ever imagined. \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/6/16302.webp","source":"-","numberOfEpisode":"1","studio":"Group TAC","type":"Movie","score":5.99,"genres":["Psychological","Supernatural","Romance"]},{"title":"Mekakucity Records","synopsis":"Mekakucity Records follows Mekakucity Days, and continues to tell the stories of the \"Mekakushi-dan\" members.\n\nYobanashi Deceive\nTonight, again, Shuuya Kano will tell a story. This is the story of a natural born liar, whose red-eye ability grants him the power to deceive, changing his appearance on a whim. But this poor boy no longer remembers his true self. Behind the mask is Kano himself, but this story is surely another lie... right?\n\nLost Time Memory\nIn one's life, there are many choices. Shintarou Kisaragi, haunted by the decisions of his past, locks himself in his room to cope. But still, he has choices. To persevere, he may finally be able to move on. Or will he remain in the past, only to drown in his regrets? No matter his choice, he will be forced to remember.\n\nAyano no Koufuku Riron\nAyano Tateyama's family expands when her parents adopt three red-eyed orphans. Sadness clings to these children, but Ayano wants to be the best big sister for them. Donning a red scarf, she shows the beauty of their red eyes and starts a secret club called the Mekakushi-dan. Ayano's family is her bliss, and she will do whatever it takes to protect their happiness.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/3/88119.webp","source":"Music","numberOfEpisode":"3","studio":null,"type":"Music","score":7.52,"genres":["Music","Psychological","Sci-Fi"]},{"title":"Twilight Q","synopsis":"{Part 1: Reflection} Mayumi is diving in the ocean, when she makes a strange find: a camera. Stranger still, the film in the camera holds a picture of herself on the arm of a man whom she's never before seen. When she discovers that the camera is of a model that has yet to be released, she begins to see the vague outlines of a very strange truth. {Part 2: File 538} As airplanes mysteriously disappear in the sky, a private investigator spying upon a strange father-daughter pair finds himself caught up in their mystery.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/5908.webp","source":"Original","numberOfEpisode":"2","studio":"Ajia-Do","type":"OVA","score":6.36,"genres":["Mystery","Psychological","Sci-Fi"]},{"title":"Digital Juice","synopsis":"A series of short animations that show different worlds and different characters. These episodes are designed to take the viewer into a psychological world of fantasy and mystery.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/17437.webp","source":"-","numberOfEpisode":"6","studio":"Studio 4°C","type":"OVA","score":5.51,"genres":["Comedy","Psychological"]},{"title":"Digital Devil Story: Megami Tensei","synopsis":"Akemi Nakajima, is a high school student with a genius talent for computer programming. \nOne day, Yumiko Shirasagi is transferred to the same class as him. She feels she knows Nakajima from somewhere, but doesn't try to deal with it. After school, Nakajima and a couple of classmates held a ceremony to summon the devil. Nakajima summons the devil Loki on the computer display while presenting a female offering. What will happen to Yumiko, who witnessed the scene?\n\n(Source: Official site, edited)","img":"https://cdn.myanimelist.net/images/anime/1015/90699.webp","source":"Light novel","numberOfEpisode":"1","studio":"animate Film","type":"OVA","score":5.26,"genres":["Adventure","Mystery","Horror","Demons","Psychological","Supernatural","Drama","Fantasy","School"]},{"title":"Gosenzo-sama Banbanzai!","synopsis":"The Yomota family is small and typical: father Kinekuni (42), mother Tamiko (38), and son Inumaru (17). One day, a beautiful girl appears at their front door, calling herself \"Maroko Yomota,\" granddaughter of Inumaru who travels back in time with a time machine to visit her ancestors. Even with Tamiko's strong objection, Kinekuni and Inumaru welcome her to stay with them, and the structure of a happy family has begun to collapse. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/19785.webp","source":"Original","numberOfEpisode":"6","studio":"Studio Pierrot","type":"OVA","score":7.29,"genres":["Sci-Fi","Comedy","Psychological","Drama"]},{"title":"Dwaeji-ui Wang","synopsis":"After his business goes bankrupt, 30-something Kyung-Min (Oh Jung-Se) kills his wife impulsively. Hiding his anger, he seeks out his former middle school classmate Jong-Suk (Yang Ik-June). Jong-Suk now works as a ghostwriter for an autobiography, but he dreams of writing his own novel. For the first time in 15 years, they meet. Kyung-Min and Jong-Suk both hide their own current situations and begin to talk about their middle school days.\n\nAt their middle school, they were classified by their wealth and grades. Kyung-Min and Jong-Suk were at the bottom. They were called pigs. They were bullied by a ruling class called dogs. When they were called pigs, they got angry but couldn't do anything against the dogs. Then a king of pigs appears—Chul (Kim Hye-Na). Kyung-Min and Jong-Suk became to rely on Chul-Yi.\n\nNow, leading Jong-Suk to their middle school grounds, Kyung-Min discloses the shocking truth to Jong-Suk of what happened 15 years ago.\n\n(Source: Asian Media Wiki)","img":"https://cdn.myanimelist.net/images/anime/13/33977.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"Movie","score":6.83,"genres":["Psychological","Drama","Thriller","Seinen"]},{"title":"Koukai Benjo The Animation","synopsis":"Every month, one random girl becomes a comfort station as students and staff from around the school use the comfort station for pleasure.","img":"https://cdn.myanimelist.net/images/anime/1907/104160.webp","source":"Manga","numberOfEpisode":"2","studio":"Office Takeout","type":"OVA","score":6.16,"genres":["Hentai","Psychological","Drama","School"]},{"title":"Meiou Project Zeorymer","synopsis":"A young man named Akitsu Masato is captured by a secret govt. project known as \"Last Guardian\". He is told that his life as a normal student was all a lie, and that his real destiny is to be the pilot of a great robot called \"Zeorymer of the Heavens\". The truth of this is hammered in when Masato sees his parents accept payment for raising him. The Last Guardian is preparing for the resurrection of \"Hau Dragon\", an organization bent on world conquest. 15 years ago, Hau Dragon built 8 great robots. Each of the mecha represents a force of nature. However, before any of the robots could be used, their creater Kihara Masaki destroyed the robots except for the leader: Zeorymer. He took Zeorymer and an embryo to the government. The embryo became the boy Masato. Now, Hau Dragon has rebuilt the other 7 mecha and wants the 8th. It will be up to Masato and Himuro to pilot Zeorymer and fight against the Hau Dragon, but neither Masato or Himuro are all that they seem. \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/7/62033.webp","source":"Manga","numberOfEpisode":"4","studio":"AIC","type":"OVA","score":6.21,"genres":["Action","Sci-Fi","Psychological","Drama","Mecha"]},{"title":"Taneyamagahara no Yoru","synopsis":"Four workers wait out the night around a campfire. Three of them are talking about different things when they start hearing strange noises. Their discussion wakes up a sleeping companion who promptly goes back to sleep only to start having dreams...","img":"https://cdn.myanimelist.net/images/anime/8/3739.webp","source":"Other","numberOfEpisode":"1","studio":"Studio Ghibli","type":"Movie","score":5.63,"genres":["Fantasy","Kids","Psychological","Slice of Life"]},{"title":"Lostorage Conflated WIXOSS: Missing Link","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/10/87210.webp","source":"Card game","numberOfEpisode":"1","studio":"J.C.Staff","type":"OVA","score":6.61,"genres":["Game","Psychological"]},{"title":"Wata no Kuni Hoshi","synopsis":"After two-month-old kitten Chibi-neko is abandoned by her former owners, she is found by 18-year-old Tokio. Although his mother is allergic to cats and has a great fear of them, she agrees to let him keep the kitten because she fears he is becoming too withdrawn after failing his university entrance exams. Chibi-neko soon falls in love with Tokio.\n\nIn her own mind, Chibi-neko is a small human who speaks in human words, although people only ever seem to hear her meow, and she believes that all humans were once kittens like her. A stray cat tells Chibi-neko of a paradise called Cottonland, where dreams can come true.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/11/13204.webp","source":"Manga","numberOfEpisode":"1","studio":"Mushi Production","type":"Movie","score":6.94,"genres":["Drama","Fantasy","Psychological","Romance","Shoujo"]},{"title":"Pluto","synopsis":"Based off of a story arc from Osamu Tezuka's Tetsuwan Atom, Pluto follows the Europol detective Gesicht as he tries to uncover the mystery behind a string of robot and human deaths. The case becomes much more puzzling when evidence leans toward the murders being the work of a robot, which is something that hasn't happened for 8 years.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1046/91058.webp","source":"Manga","numberOfEpisode":"?","studio":"Studio M2","type":"","score":null,"genres":["Action","Sci-Fi","Mystery","Psychological","Mecha","Seinen"]},{"title":"Psycho Diver: Mashou Bosatsu","synopsis":"Yuki Kano has it all: fame, wealth, the world at her feet. There's also something very wrong with her... from time to time, she's totally unable to sing (which, for a pop star, is not good). Enter Bosujima, a \"psycho diver\" with the capability to enter people's heads and straighten out what's wrong with them. Well, most of the time, anyway.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/1767.webp","source":"-","numberOfEpisode":"1","studio":"Madhouse","type":"OVA","score":5.74,"genres":["Horror","Psychological","Sci-Fi"]},{"title":"Rang Wo Men Shao Ba","synopsis":"Lovelorn Xiao Yong entered high school in despair. In order to get out of the haze of lovelorn, he joined a school club, FFF. Later he learned that the FFF Club was a heresy inquisition organized by a group of magicians. In the group test, Xiao Yong awakened his own destruction fire magic. From then on, he began his brilliant high school life.\n\n(Source: Guodong Subs)","img":"https://cdn.myanimelist.net/images/anime/1068/91895.webp","source":"Original","numberOfEpisode":"2","studio":null,"type":"ONA","score":6.03,"genres":["Comedy","Psychological","Magic","School"]},{"title":"Warau Salesman","synopsis":"Each episode follows Fukuzou Moguro, a traveling salesman, and his current customer. Moguro deals in things that give his customers their heart's desire, and once his deals are made and their unhealthy desires are satisfied, Moguro's customers are often left with terrible repercussions, especially if they break the rules of his deals...","img":"https://cdn.myanimelist.net/images/anime/5/61389.webp","source":"Manga","numberOfEpisode":"103","studio":"Shin-Ei Animation","type":"TV","score":6.68,"genres":["Comedy","Psychological","Supernatural","Drama","Seinen"]},{"title":"Deimos no Hanayome: Ran no Kumikyoku","synopsis":"Two siblings were happy on Mt. Olympus, until they fell in love. Deimo's sister Venus got imprisoned in the Swamp of Death. To save Venus's life, he must find a human reincarnation so that they can continue their love.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/35349.webp","source":"Manga","numberOfEpisode":"1","studio":"Madhouse","type":"OVA","score":5.77,"genres":["Mystery","Horror","Demons","Psychological","Supernatural","Drama","Magic","Fantasy","Shoujo"]},{"title":"Saibi","synopsis":"Who is good and who is evil? What is the boundary between them? An animated thriller about the tension between a good-hearted person speaking falsely and an evil-natured person speaking truthfully, and of those that surround them.\n\n(Source: Hancinema)","img":"https://cdn.myanimelist.net/images/anime/5/55499.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":6.78,"genres":["Drama","Psychological","Thriller"]},{"title":"Otsukimi Recital","synopsis":"Hibiya Amamiya has experienced the worst loss possible: the life of a friend. For him, the world no longer holds a glimmer, but high school idol Momo Kisaragi has taken it upon herself to show him that there is a reason to go on. Although sadness clings to Hibiya like the full moon which shines through the night, perhaps Momo will be able to brighten his eyes once again.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/5/86306.webp","source":"Music","numberOfEpisode":"1","studio":null,"type":"Music","score":7.14,"genres":["Music","Psychological"]},{"title":"Ryokunohara Meikyuu","synopsis":"Hiroki and Kanata have been together since they were children. One day Hiroki is caught up in an accident while trying to save a little girl. The next thing he knows, he is looking down on his own body. Seperated from his body, Kanata, and everything else, he tries to figure out just what is going on.\n\nWhy is he outside his body which is living on as if nothing has changed, how can he convince Kanata that he is there, and who is the strange girl, Fhalei, who keeps appearing for him?\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/9/73807.webp","source":"Manga","numberOfEpisode":"1","studio":"AIC","type":"OVA","score":5.17,"genres":["Dementia","Psychological","Drama","Romance","Shoujo","Shounen Ai"]},{"title":"Evil or Live Recap","synopsis":"Recap episode aired between episodes 9 and 10. ","img":"https://cdn.myanimelist.net/images/anime/5/89413.webp","source":"Web manga","numberOfEpisode":"1","studio":null,"type":"Special","score":5.2,"genres":["Psychological","School"]},{"title":"Survival","synopsis":"Music video by Glay, created by Studio 4°C","img":"https://cdn.myanimelist.net/images/anime/7/5857.webp","source":"-","numberOfEpisode":"1","studio":"Studio 4°C","type":"Music","score":6.2,"genres":["Dementia","Drama","Music","Psychological","School","Supernatural"]},{"title":"Ai","synopsis":"A short experimental anime about a woman desperately in love. Made by Yoji Kuri, a well-known Japanese indie animator.","img":"https://cdn.myanimelist.net/images/anime/13/64699.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":4.34,"genres":["Dementia","Psychological","Romance"]},{"title":"Malice@Doll","synopsis":"Malice, a sex robot living in an abandoned human city, is assaulted and violated by a mysterious creature. Upon awakening, Malice finds out that she has become human and can pass on her humanity to her fellow machines. However, her gift soon becomes a curse when her fellow robots rage out of control after being exposed to the pleasures of life.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1277/106345.webp","source":"Original","numberOfEpisode":"3","studio":null,"type":"OVA","score":5.82,"genres":["Horror","Psychological","Sci-Fi"]},{"title":"Mahou Shoujo Site Recaps","synopsis":"Recaps of the Mahou Shoujo Site created by Avex Entertainment. Narrated by AI Kizuna and Nobuhiko Okamoto.","img":"https://cdn.myanimelist.net/images/anime/1255/93332.webp","source":"Manga","numberOfEpisode":"2","studio":"Avex Pictures","type":"Special","score":6.24,"genres":["Horror","Psychological","Supernatural","Drama"]},{"title":"Mo Ri Shu Guang","synopsis":"In the year of 2013, the tide of zombies outbreak exploded in everyone's homeland, humanity launches a large-scale battle in the endless nights awaiting for the arrival of the dawn.\n\nThe end is approaching, is there going to be a way out for them? \nTheir faiths were shattered into pieces and buried in ashes in the raging fire. But within the blazing fire, a newborn hope arise once again.\n\n(Source: polarbearadise)","img":"https://cdn.myanimelist.net/images/anime/1939/90507.webp","source":"Novel","numberOfEpisode":"20","studio":null,"type":"ONA","score":6.31,"genres":["Action","Horror","Psychological","Supernatural","Thriller","Shounen Ai"]},{"title":"Yuukoku no Moriarty","synopsis":"Everyone is familiar with the story of Sherlock Holmes, but what about his long-standing rival Moriarty? Yuukoku no Moriarty tells an equally compelling story with Moriarty as the protagonist in London, during the Golden Age of Britain. Rather than solving mysteries, Moriarty uses his sharp intellect to formulate a plan to improve the state of London. \n\n(Source: Tokyo Otaku Mode, edited)","img":"https://cdn.myanimelist.net/images/anime/1541/106294.webp","source":"Manga","numberOfEpisode":"?","studio":"Production I.G","type":"TV","score":null,"genres":["Mystery","Historical","Psychological","Shounen"]},{"title":"Galerians: Rion","synopsis":"Six years have passed since Rion discovered his own identity as an artificial being, yet succeeded in destroying the genocidal Mother Computer, Dorothy, before perishing himself. Now reactivated by Lilia, Rion awakens to find that Dorothy managed to execute one final catastrophic program, rendering a new evil crew to finish her goal of human annihilation. It is a fully 3D CGI animated OVA based on the hit PlayStation game, called Galerians, released in August, 1999.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/11/38577.webp","source":"-","numberOfEpisode":"3","studio":null,"type":"OVA","score":5.54,"genres":["Adventure","Drama","Horror","Military","Mystery","Psychological","Sci-Fi","Shounen","Supernatural"]},{"title":"Haitoku no Shoujo","synopsis":"The girls of the Saegusa family are always on the lookout for a new pet to train, and they have plenty of time as their father is usually gone. At the same time they are hiding their own dark family secret.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/5565.webp","source":"-","numberOfEpisode":"2","studio":null,"type":"OVA","score":5.83,"genres":["Hentai","Psychological"]},{"title":"Bokura no: Tsuisou","synopsis":"A Bokurano recap episode of first 15 episodes. Aired on the 24 July 2007 on channel tvk instead of episode 16, while other stations cancelled the broadcast altogether for the same week. ","img":"https://cdn.myanimelist.net/images/anime/8/36163.webp","source":"Manga","numberOfEpisode":"1","studio":"Gonzo","type":"Special","score":6.13,"genres":["Sci-Fi","Psychological","Drama","Mecha"]},{"title":"Koushoku Ichidai Otoko","synopsis":"The OVA is based on incidents in the novel Koshoku Ichidai Otoko (The Life of an Amorous Man) by Saikaku Ihara (1642-1693).\n\nThe libertine Yonosuke has spent his life in quest of sexual pleasure. Disowned by his father when he is 18, 16 years full of changes and errantry begin for him. At the age of 34 he inherits great wealth after his father dies and forgives his son.\n\nWhen Yunosuke is 57, one of his tailors named Juzo comes to see him before setting out for Edo. Juzo has unwisely made a bet with a rich merchant that he will sleep with Komurasaki, the most renowned courtesan in Edo, at the first meeting. If he succeeds he will win a villa, but if he loses he will lose his manhood. Yunosuke is astounded as he knows how hard the high rank courtesans are to get. The best courtesans, tayu, as well as being beautiful, were highly cultured, being educated in poetry, calligraphy, painting, tea ceremony and other arts. They would sleep with a client only on the third night, the other two nights being taken up with greetings and other social niceties. Humble men, to whom they were 'untouchable' looked up to them with adoration and respect.\n\nIndignant, Yunosuke takes Juzo to Edo and enables him to meet Komurasaki. Juzo is a laughing-stock at the tea-house because of his nervousness, and soon becomes drunk. He clumsily spills wine over the courtesan's kimono. Unperturbed, she goes out and returns wearing a fresh, identical garment.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/6/23790.webp","source":"-","numberOfEpisode":"1","studio":"Animation Staff Room","type":"OVA","score":6.11,"genres":["Drama","Hentai","Historical","Psychological"]},{"title":"Red","synopsis":"Red is the opening theme for Kagerou Daze: In a Day's performed by GOUACHE. The music video was released on November 3, 2016 on IA Project's official YouTube channel and advertises the film's release at the end. It was also included on the DVD/BD release of Kagerou Daze: In a Day's but lacks the advertisement. The body of the music video is a mash up of the whole franchise, ideally giving the viewer a refresher before the film's release the next day.","img":"https://cdn.myanimelist.net/images/anime/1502/91154.webp","source":"Music","numberOfEpisode":"1","studio":null,"type":"Music","score":6.56,"genres":["Sci-Fi","Music","Psychological"]},{"title":"Saint Luminous Jogakuin","synopsis":"Kaihei is a rather normal high school student but soon discovers that his deceased grandfather has left him the chairman position of his all-girls high school, St. Luminous Mission High School. Besides being the only male student on campus, he is also now the young chairman in charge of campus rules, happenings and punishments. When Kaihei arrives however, it seems a student has gone missing. Kaihei, along with his closest friends, are now determined to solve this mystery (without getting the local police involved) before graduation. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/29942.webp","source":"Original","numberOfEpisode":"13","studio":"Triangle Staff","type":"TV","score":6.14,"genres":["Mystery","Psychological","Supernatural"]},{"title":"Bloody Night","synopsis":"A little girl is wandering the streets late at night, but something is eerily amiss. Suddenly, a vicious red monster appears and begins chasing her. As she desperately tries to get away, she encounters a homeless old man in an alleyway and later an armed policeman who both try to save her. Can either of these brave men save the girl from the monster that pursues her so relentlessly?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/33341.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"ONA","score":3.98,"genres":["Horror","Psychological","Supernatural","Thriller"]},{"title":"The Chocolate Panic Picture Show","synopsis":"Gainax's first professional production, The Chocolate Panic Picture Show is a wacky musical OVA based on a manga by Fujiwara Kamui, serialised in Monthly Super Action and partly inspired by Jamie Uys's The Gods Must Be Crazy (1980).\n\nFollow Manbo, Chinbo and Chonbo as they are flung into a strange, psychedelic world of madness they don't understand. See them cause chaos through their zany, unpredictable antics in this comical take on cultural imperialism.","img":"https://cdn.myanimelist.net/images/anime/6/81052.webp","source":"Manga","numberOfEpisode":"1","studio":"Gainax","type":"OVA","score":4.57,"genres":["Dementia","Psychological"]},{"title":"Hello Harinezumi: Satsui no Ryoubun","synopsis":"One stormy night, a young woman is shot to death on a cliff; her body is found floating in the waters below the next morning. She was last seen with a man who is now being sought not only for her death. Meanwhile, an estranged wife hires Goro, a private investigator, to find her husband. Alongside another member of law enforcement with his own motives for finding the man, Goro sets forth on a trail of tragedy and intrigue to find the reason and connection behind the murders and missing husband.\n\n(Source: Anime-Planet; edited)","img":"https://cdn.myanimelist.net/images/anime/6/43659.webp","source":"Manga","numberOfEpisode":"1","studio":"Studio Deen","type":"OVA","score":6.46,"genres":["Drama","Mystery","Psychological","Seinen"]},{"title":"Bondage Game: Shinsou no Reijoutachi - Shinsou no Doreitachi","synopsis":"Bonus episode for the hentai anime Bondage Game: Shinsou no Reijoutachi.","img":"https://cdn.myanimelist.net/images/anime/4/14290.webp","source":"Visual novel","numberOfEpisode":"1","studio":null,"type":"Special","score":5.32,"genres":["Hentai","Psychological"]},{"title":"Mikagura Gakuen Kumikyoku","synopsis":"As a new student, Eruna Ichinomiya meets various strangers, learns about their clubs, and helps them with their problems.\n\nHoukago Stride\nEruna was hardly prepared to go to her new school, but that's no matter. Leading it off with an enormous stride, she will hop, step, and jump her way through, showing her unparalleled motivation and optimistic outlook. One, two, three—she'll shout out her excitement with the fire of a toy gun! \n\nMukiryoku Coup d'Etat\nAs an actor, Yuuto Akama is accustomed to playing different roles, and real life is just another one of these. He wears a practiced smile and a carefree attitude, but inside, a war is waging. A personality squashed and imprisoned... Yuuto puts down the coup d'état of his former self, all to maintain his perfect facade. But no matter how much time passes, the memories don't disappear, and he can never stop the flames of rebellion of his heart.\n\nUchouten Vivace\nWith a cheerful hop and skip, Himi Yasaka shows Eruna all the fun and excitement of the Calligraphy Club. It's a rhythmic and all-encompassing art; although calligraphy may take a bit of practice, anyone can do it. All you need is an ecstatic vivace!\n\nGarakuta Innocence\nNo matter what saturation, contrast, or hue, painter Kyouma Kuzuryuu cannot create a work that is good enough. Everything, including himself, always falls short. He lies to himself that this is what he always wanted, but in the end, he is still another piece of trash. Is there any salvation for the lonesome and self-deprecating Kyouma?\n\nIzayoi Seeing\nAsuhi Imizu has lived his life secluded from others. Gazing at the night sky through his telescope, he draws new constellations in his mind. However, like the sun after a rainstorm, Eruna brightens his life, helping him open up to others. Together, they view a 16-day-old moon; all the while, Asuhi is guided by her light.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/74422.webp","source":"Music","numberOfEpisode":"5","studio":null,"type":"Music","score":6.69,"genres":["Music","Psychological","School"]},{"title":"Prison Lab","synopsis":"A victim of endless bullying, Aito Eyama is plagued by his classmates' constant taunts and beatings. However, through a fortuitous turn of events, he receives a strange invitations for the \"Captivity Game,\" where victory promises unbelievable wealth. To participate, he must accept the role of captor and choose one victim to imprison for a month. For Eyama, the only choice is Aya Kirishima, the ringleader of his bullies and the source of all his suffering. The rules of the game are simple: the jailer may do whatever they please with their inmate barring murder; but in order to win the game, the captor's identity must remain hidden. Exemption from the law, an isolated cell, and the funds to purchase supplies—all the necessary tools are provided.\n\nAs Eyama administers his sadistic revenge and \"divine\" retribution, he encounters other captors, each with their own hidden agendas. Meanwhile, Aya refuses to be a compliant prisoner and will go to any length to escape captivity. However, her endeavors threaten to awaken a darkness buried inside Eyama that craves to be unleashed.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1192/97875.webp","source":"Manga","numberOfEpisode":"?","studio":null,"type":"ONA","score":null,"genres":["Horror","Psychological"]},{"title":"De:vadasy","synopsis":"For young men like Kei, life is still plagued by nothing but homework and girl trouble. When an unknown force besieges Earth with robotic war machines, however, it is Kei who is chosen to defend the human race.","img":"https://cdn.myanimelist.net/images/anime/1378/91079.webp","source":"Game","numberOfEpisode":"3","studio":null,"type":"OVA","score":4.81,"genres":["Action","Ecchi","Psychological","Mecha"]},{"title":"Oshie to Tabi Suru Otoko","synopsis":"The story begins in the early Showa era of the 20th century. A mysterious old man on a train relates the disappearance of his older brother three decades ago, near the 12-story Ryounkaku tower that once stood in the seaside town of Uozu, Japan. The mystery revolves around telescopes, peep shows, and the blurred boundary between reality and dreams. \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/1755/90710.webp","source":"Novel","numberOfEpisode":"1","studio":null,"type":"Movie","score":null,"genres":["Mystery","Psychological"]},{"title":"Ankoku Shinwa","synopsis":"Long ago there were fierce gods of legends who shook the earth to its foundation with their power. There are now prehistoric rivals from the primitive times in Japan, that fought to protect their secrets in the present day. The God of Darkness Susanoah-oh is now sleeping in the shadows of the underworld waiting for his rebirth. However his coming hasn't gone unoticed. There are agents from the Kikuchi Clan (descendants of Japans first inhabitants) who have seen the warning signs of the spreading of darkness's bringing. These investigators are armed with ancient knowledge and artifacts who are willingly prepared to face the God of Darkness. Now they must fight the assembled spirits of hell to find the one young boy who is chosen by fate to grasp the chaotic might of the deadly Gods.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/57439.webp","source":"-","numberOfEpisode":"2","studio":"Ajia-Do","type":"OVA","score":4.31,"genres":["Demons","Fantasy","Horror","Mystery","Psychological","Supernatural"]},{"title":"Born by Myself","synopsis":" A dark surreal film of several creatures metamorphorphing inside a room. A stop motion animation film from the minds of Kobayashi Masahide and Keita Funamoto of The Village of Marchen","img":"https://cdn.myanimelist.net/images/anime/11/23961.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"ONA","score":3.41,"genres":["Dementia","Psychological"]},{"title":"Down Load: Namu Amida Butsu wa Ai no Uta","synopsis":"An exciting cyberpunk romp directed by Rintaro with veteran animator Kanada Yoshinori about a genius hacker and a gang of hot-rodders.","img":"https://cdn.myanimelist.net/images/anime/11/27128.webp","source":"Original","numberOfEpisode":"1","studio":"Madhouse","type":"OVA","score":5.76,"genres":["Action","Adventure","Psychological","Sci-Fi"]},{"title":"Si Ling Bianma: Zhi Shijie Caozong Zhe","synopsis":"“Ghost” is an online mobile game that Ye Yinyi always dreamed of completing, and to that end, has poured his blood and tears into it, even missing a date with his girlfriend. However, he learns about an alarming monster attack on a young woman near his house, a photograph of which shows the monster to bear a resemblance to the monster he designed. Why is the world of his mobile game appearing in real life? ","img":"https://cdn.myanimelist.net/images/anime/11/81331.webp","source":"Original","numberOfEpisode":"12","studio":"Shanghai Foch Film Culture Investment","type":"ONA","score":5.49,"genres":["Game","Mystery","Parody","Horror","Psychological","Fantasy"]},{"title":"Usogui","synopsis":"There are gamblers out there who even bet their lives as ante. But to secure the integrity of these life-threatening gambles, a violent and powerful organization by the name of \"Kagerou\" referees these games as a neutral party. Follow Bak Madarame a.k.a. Usogui (The Lie Eater) as he gambles against maniacal opponents at games—such as Escape the Abandoned Building, Old Maid, and Hangman—to ultimately \"out-gamble\" and control the neutral organization of Kagerou itself. \n\n(Source: MU) ","img":"https://cdn.myanimelist.net/images/anime/9/39507.webp","source":"Manga","numberOfEpisode":"1","studio":"Shueisha","type":"OVA","score":null,"genres":["Game","Psychological","Seinen"]},{"title":"DušaN","synopsis":"An independent animated music video for the song \"DušaN\" by the Slovakian band Saténové ruky. Kousuke Sugimoto created it for a friend who is in the band.  The video is about the protagonist's soul that just won't stop \"talking\" when he's coked.","img":"https://cdn.myanimelist.net/images/anime/5/79270.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Music","score":5.88,"genres":["Music","Dementia","Psychological"]},{"title":"Yami no Purple Eye","synopsis":"Based on a shoujo manga written and illustrated by Shinohara Chie serialised in Shoujo Comic.\n\nThe original story follows the struggles of a teenage girl after she finds herself turning into a lycanthropy-leopard and having to battle her newly found predatory instincts.\n\nIn 1987 an animated music video of 30 minutes length was made based on the award winning manga. \n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/8/26389.webp","source":"Manga","numberOfEpisode":"1","studio":"Toei Animation","type":"Music","score":4.81,"genres":["Psychological","Supernatural","Music","Horror","Mystery","Shoujo"]},{"title":"Tekkon Kinkreet Pilot","synopsis":"Softimage's Michael Arias started the project as a short CG exercise, which then came to the attention of Morimoto, who then agreed to work on the project on the Softimage 3D software. A few months later, Visual Director Wilson Tang and Animation Supervisor Lee Fulton introduced a pilot to the Softimage staff, made entirely on computer with a staff of only 12. The pilot won the Excellence Award at the 3rd Japan Media Arts Festival in the Digital Art Division.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/77423.webp","source":"Manga","numberOfEpisode":"1","studio":null,"type":"Special","score":4.92,"genres":["Action","Adventure","Psychological","Supernatural"]},{"title":"Shijin no Shougai","synopsis":"A worker is fired from a factory for demanding a wage increase. His mother, worn thin by poverty, is caught in her own spinning wheel. Then a strange storm buries the town in snow, freezing rich and poor alike. Another short film by Kihachiro Kawamoto","img":"https://cdn.myanimelist.net/images/anime/6/17201.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.71,"genres":["Drama","Fantasy","Psychological"]},{"title":"Yonimo Osoroshii Grimm Douwa","synopsis":"The truth behind the well-known Grimm's Tales is cruel and full of blood and lust!\n\nEpisode 1: \"Hansel &amp; Gretel\": Two brothers lost in the woods were actually criminals...\n\nEpisode 2: \"The Blue Beard\": The true character of the Blue Beard was a cannibal who was unable to tolerate his wife's adultery. \n\nEpisode 3: \"Cinderella\": Actually Cinderella had abnormal affections toward the prince.","img":"https://cdn.myanimelist.net/images/anime/4/27232.webp","source":"Other","numberOfEpisode":"3","studio":"Group TAC","type":"OVA","score":6.05,"genres":["Dementia","Horror","Psychological"]},{"title":"Yoru no Hi","synopsis":"The rooftops of a darkened city, a couple walking by a lone streetlight on an otherwise darkened street, an old man rocking in a creaky chair in the corner of a room lit only by the moon or the streetlight entering through the window.\n\n(Source: Nishikata Film Review)","img":"https://cdn.myanimelist.net/images/anime/11/36271.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"Movie","score":4.93,"genres":["Psychological"]},{"title":"Yonimo Osoroshii Nihon Mukashibanashi","synopsis":"The horrible truths behind Japanese Fairy Tales from the ancient times are finally revealed! This title includes three episodes: \"The Monkey and the Crab\", \"Click-Crack Mountain\" and \"Urashima and the Kingdom beneath the Sea\".\n\n(Source: Official Website)","img":"https://cdn.myanimelist.net/images/anime/6/27233.webp","source":"-","numberOfEpisode":"3","studio":null,"type":"OVA","score":5.87,"genres":["Dementia","Horror","Psychological"]},{"title":"Esoragoto Spiral","synopsis":"Esoragoto Spiral focuses on Seisa, the representative of the Going Home Club, who is lost in her thoughts and tries to fabricate herself by gathering some aspects of bitterness and sweetness. The music video itself was published online and has not been released on any DVD yet.\n\n(Source: Mikagura School Suite Wikia)","img":"https://cdn.myanimelist.net/images/anime/13/88118.webp","source":"Music","numberOfEpisode":"1","studio":null,"type":"Music","score":6.22,"genres":["Music","Psychological","School"]},{"title":"Tabi","synopsis":"Surreal cutout (kiri-gami) animation following a young girl's physical journey, which is also an inner voyage through which she will learn all the pain and joy of life. She travels to an anonymous Western city, a bizarre dreamscape cluttered with elements from works by Dali, Magritte, de Chirico and Escher. The journey will change her completely but when she returns she will be the only one who knows how she has changed.\n(The poem in the film is by Su Tong-Po, a famous Chinese poet) \n\n-AniDB","img":"https://cdn.myanimelist.net/images/anime/2/81224.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.43,"genres":["Fantasy","Psychological"]},{"title":"Sekaikei Sekai Ron","synopsis":"Regarding the destruction of the world, the light relation between the world and me.","img":"https://cdn.myanimelist.net/images/anime/9/34245.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"OVA","score":5.82,"genres":["Sci-Fi","Psychological"]},{"title":"Maroko","synopsis":"Summary for the Gosenzosama Banbanzai! OVA.","img":"https://cdn.myanimelist.net/images/anime/4/67705.webp","source":"Original","numberOfEpisode":"1","studio":"Studio Pierrot","type":"Movie","score":6.33,"genres":["Sci-Fi","Comedy","Psychological","Drama"]},{"title":"Kenju Giga","synopsis":"A dog race is interrupted by a ringmaster, who attaches fish to the dog’s collars and makes them run in circles. The crowd is incensed, but the ringmaster insists that the audience is no better off than the dogs. In the end the ringmaster is assassinated and the race continues, but a single red rose sprouts from the ringmaster’s blood; a symbol of truth in a crazy world? \n\n-AniDB\n","img":"https://cdn.myanimelist.net/images/anime/6/17203.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.04,"genres":["Parody","Psychological"]},{"title":"Ra/Radio Noise*Planet","synopsis":"A planet with 6 inhabitants only. In order to match the tuning of the radio, the main character walks around and meets the 5 other inhabitants. A strange SF short animation.","img":"https://cdn.myanimelist.net/images/anime/12/34247.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"OVA","score":5.87,"genres":["Adventure","Psychological","Sci-Fi"]},{"title":"Red Colored Bridge","synopsis":"Experimental animation by Keiichi Tanaami.","img":"https://cdn.myanimelist.net/images/anime/11/69171.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":4.29,"genres":["Dementia","Psychological"]},{"title":"Yumemakura Baku Twilight Gekijou","synopsis":"Originally released as a feature part of Studio Pierrot's video magazine show Anime V Comic Rentaman (アニメ・V・コミック レンタマン) along with Abashiri Ikka, Eguchi Hisashi no Kotobuki Gorou Show and Akai Hayate. \n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/6/35855.webp","source":"Novel","numberOfEpisode":"4","studio":"D.A.S.T.","type":"OVA","score":5.68,"genres":["Horror","Psychological"]},{"title":"Timing","synopsis":"The Japanese-Korean horror movie should have been released in 2012, but the project got canceled after Korean investors could not be determined. A six-minute promotional video is what's left of it of this attempted co-production.\n\nTiming holds the story of four characters with abilities related with time, fighting to stop the tragedies occurring in a high school.\n\n(Source: Hancinema)\n","img":"https://cdn.myanimelist.net/images/anime/7/26766.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"ONA","score":5.41,"genres":["Psychological","Horror"]},{"title":"Great Rabbit","synopsis":"Once we called the noble, profound and mysterious existence The Great. We have moved with the time, our thought and consciousness has changed. And yet what makes us still keep calling it The Great?\n\n(Source: kankaku.jp)","img":"https://cdn.myanimelist.net/images/anime/6/69487.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"Movie","score":4.56,"genres":["Psychological"]},{"title":"Children","synopsis":"A short film by Takuya Okada set in a conformist society.\n\n(Source: IMDB)","img":"https://cdn.myanimelist.net/images/anime/1772/99106.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"ONA","score":6.07,"genres":["Dementia","Psychological","Drama"]},{"title":"Yokoo's 3 Animation Films","synopsis":"Three short films by the Japanese avant-garde illustrator and animator. Regarded (unfairly) as the Japanese equivalent of Andy Warhol, these films showcase a distinctively commercial illustration look reminiscent of the current pop art movement of that decade (1960s).\n","img":"https://cdn.myanimelist.net/images/anime/11/23848.webp","source":"Original","numberOfEpisode":"3","studio":null,"type":"OVA","score":4.79,"genres":["Psychological","Romance"]},{"title":"Munou na Nana","synopsis":"It is the year 20XX. Earth was assaulted by monsters that would come to be known as \"the Enemy of Humanity.\" In order to deal with this threat, special schools composed of teenagers with extraordinary abilities were formed. These people, who came to be known as \"the Talented,\" had abilities that could defy the rules of reality.\n\nAmong these people with supernatural powers was an outlier, an individual who was sent to one of these schools despite having no innate special abilities whatsoever. This is the story of our protagonist, who attempts to defeat the Enemies of Humanity through the use of intelligence and manipulation alone. \n\n(Source: MU)","img":"https://cdn.myanimelist.net/images/anime/1811/106886.webp","source":"Manga","numberOfEpisode":"?","studio":null,"type":"TV","score":null,"genres":["Psychological","Supernatural","Thriller","Shounen"]},{"title":"Warau Salesman Tokubetsu Bangumi","synopsis":"A special program of Warau Salesman, these episodes were released in a blast format on 3 days in a nearly 2 hour long timeslot each. The individual episodes have their own OPs. The first blast release differed from the main series by having live-action footage of real locations in Japan before delving into the story for each episode. The 2nd had Moguro with the Master interacting with the viewer as if behind the scenes for a studio before delving into each episode. And the 3rd had Moguro and the Master playing outside in the snow as if reporting on an on-location event to the viewer before delving into each episode.","img":"https://cdn.myanimelist.net/images/anime/13/84768.webp","source":"Manga","numberOfEpisode":"14","studio":"Shin-Ei Animation","type":"Special","score":null,"genres":["Psychological","Supernatural","Seinen"]},{"title":"Hand Soap","synopsis":"An atmospheric and dark vision of adolescence and family life.","img":"https://cdn.myanimelist.net/images/anime/6/69841.webp","source":"-","numberOfEpisode":"1","studio":null,"type":"Movie","score":5.28,"genres":["Dementia","Psychological"]},{"title":"xxxHOLiC Kei","synopsis":"Kimihiro Watanuki's life was never really normal. But in addition to his ability to see spirits, this sequel to xxxHOLiC finds him still slaving away for Yuuko, the bizarre owner of a strange shop, who promised to rid him of this ability. However, this otherworldly woman can only do so when he has worked enough to earn his wish. Such is the way for anyone who finds their way into the shop to have their request granted: a compensation equal to their wish must be paid. \n\nIn this odd shop that straddles the world of the living and the dead, Watanuki finds himself doing household chores for the seemingly lazy Yuuko and her companions, while also helping out clients. Along with his classmates, supposed romantic rival Shizuka Doumeki and his crush Himawari Kunogi, Watanuki deals with the many misfortunes surrounding Yuuko's customers, as well as those that closely follow him and his friends.\n\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/8626.webp","source":"Manga","numberOfEpisode":"13","studio":"Production I.G","type":"TV","score":8.27,"genres":["Mystery","Comedy","Psychological","Supernatural","Drama"]},{"title":"Danganronpa 3: The End of Kibougamine Gakuen - Kibou-hen","synopsis":"The Future Foundation is in shambles after the Final Killing Game and the revelation of the true culprit. As a desperate plot arises from one of the survivors to rid the world of despair once and for all, the remaining Future Foundation members must band together to stop this atrocity from taking place. Fortunately, they find themselves with help from a group of unlikely allies as they race against the clock to stop their world from being changed.\n\nIn this finale to the Hope's Peak storyline of the Danganronpa series, the players in this neverending death game begin to understand the true meaning behind despair, hope, and atonement.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1295/91106.webp","source":"Game","numberOfEpisode":"1","studio":"Lerche","type":"Special","score":7.65,"genres":["Action","Psychological","Horror","Mystery"]},{"title":"ChäoS;Child","synopsis":"A series of gruesome murders dubbed \"New Generation Madness\" once induced mass hysteria in Shibuya. At its peak during a frenzied riot, a sudden earthquake reduced the district into nothing but rubble, while leaving surrounding wards strangely intact.\n\nSix years later, in a newly rebuilt Shibuya, mysterious deaths begin to crop up again. It is not long before third-year student Takuru Miyashiro realizes a connection: the dates of the recent murders match those of the New Generation Madness incidents. He, along with several members of his school's newspaper club, decide to delve deeper into the mystery, only to find themselves stranded in the middle of a new crime scene themselves...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1310/90137.webp","source":"Visual novel","numberOfEpisode":"12","studio":"Silver Link.","type":"TV","score":6.45,"genres":["Sci-Fi","Mystery","Psychological","Supernatural"]},{"title":"RahXephon","synopsis":"In the year 2012 Japan was invaded by the Mu. Human-like beings from another dimension with blue blood.\n\nIn the year 2015 Tokyo is attacked by invaders, who are repelled by a humanoid weapon called a Dolem. During the chaos, Ayato Kamina meets Reika Mishima, a classmate.\n\nDuring that same day, he is attacked by government officials but a woman named Haruka comes to his rescue, informing him that she was sent to get him by the Organization TERRA, and that Tokyo had been sealed in a time rift where time flows one third as fast as the outside world.\n\nHe flees from Haruka onto a train where he sees Reika once more. Arriving at the Room of Rah, he follows her to a tremendous egg where the Dolem RahXephon is hatched from, and upon her singing his mother appears atop the Dolem that had stopped the TERRA Invasion. In the battle Ayato's mother is injured, and Ayato flees Tokyo Jupiter with Haruka.","img":"https://cdn.myanimelist.net/images/anime/13/75168.webp","source":"Original","numberOfEpisode":"26","studio":"Bones","type":"TV","score":7.45,"genres":["Action","Drama","Mecha","Music","Mystery","Psychological","Romance","Sci-Fi"]},{"title":"Trickster: Edogawa Ranpo \"Shounen Tanteidan\" yori","synopsis":"Kogorou Akechi is the founder of a private investigation firm known as the Boy Detectives' Club. Together, this group takes on cases both great and small. One of their junior members, Kensuke Hanasaki, is out solving a case one day when he happens upon Yoshio Kobayashi, a mysterious amnesiac boy with an inability to die. After seeing his abilities in action, Kensuke offers Yoshio a deal: join the Boy Detectives' Club and help them solve cases, and in exchange he will find a way to help Yoshio die.\n\nThe apathetic Yoshio accepts this deal begrudgingly, unaware of how different his life will become. Although he does not have much use for people, he gradually begins to acknowledge the group as he spends more time with them while solving cases.\n\nTrickster: Edogawa Ranpo \"Shounen Tanteidan\" yori follows Akechi and the rest of the Boy Detectives' Club as they solve the various cases they are given, all while combating a hidden threat from the shadows—\"The Fiend with Twenty Faces.\"\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/81133.webp","source":"Original","numberOfEpisode":"24","studio":"Shin-Ei Animation","type":"TV","score":6.24,"genres":["Sci-Fi","Mystery","Psychological","Drama"]},{"title":"Babylon","synopsis":"In the newly formed Shiniki district of Tokyo, Zen Seizaki is a diligent public prosecutor at the Tokyo District Public Prosecutors Office. Assigned to a case involving false advertisement, Zen—along with his assistant officer, Atsuhiko Fumio—investigate Japan Supiri, a pharmaceutical company that had provided fabricated clinical research on the company's new drug. While investigating the file of Shin Inaba, an anesthesiologist connected to the crime, the case takes a dark turn when Zen finds a page stained with a mixture of blood, hair and skin, along with the letter \"F\" scribbled all across the sheet. As he investigates further, the case goes beyond Zen's imagination and becomes vastly complex, challenging his sense of justice and his knowledge of the truth. \n\nDigging deeper into the investigation, Zen begins to uncover a concealed plot behind the ongoing mayoral election and ties to many people of interest involved in the election and those closer than he thinks. The case grows more severe and propels Zen into an unforeseen hurricane of corruption and deceit behind the election, the establishment of the Shiniki district, and the mysterious woman associated with it all. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1942/102707.webp","source":"Novel","numberOfEpisode":"12","studio":"Revoroot","type":"TV","score":6.99,"genres":["Mystery","Psychological","Thriller"]},{"title":"Magia Record: Mahou Shoujo Madoka☆Magica Gaiden (TV)","synopsis":"Rumor has it that if a young girl strikes a bargain with a white fairy, it will grant any wish her heart desires. However, in exchange, she will become a magical girl and must put her life on the line to slay fearsome and ferocious witches.\n\nIroha Tamaki, a kind-hearted middle schooler from Takarazaki City, is living proof that these rumors are true. Armed with a magical crossbow and the ability to heal injuries, Iroha seeks out the labyrinths where witches hide and defeats them before they can prey on humans. Yet Iroha has no memory of her wish, and even Kyuubey, the white fairy himself, seems to have no idea what Iroha requested of him.\n\nOne day, Iroha hears rumors of a city where \"magical girls can be saved,\" and finds herself on a sunset train to Kamihama City. Unfortunately, she discovers that the witches in Kamihama are far more powerful than usual. After veteran magical girl Yachiyo Nanami is forced to save her, Iroha vows to never return. But when a chance encounter with a tiny Kyuubey seems to trigger distant memories, Iroha is compelled to investigate the mysterious city despite the danger.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1786/104783.webp","source":"Game","numberOfEpisode":"13","studio":"Shaft","type":"TV","score":6.72,"genres":["Psychological","Drama","Magic","Thriller"]},{"title":"Shigurui","synopsis":"At the beginning of the Edo Era, when people enjoyed a time of peace, Lord Tokugawa Tadanaga holds a fighting tournament. In the past, matches were fought with wooden swords. This time, real swords will be used.\n\nOne-armed Fujiki Gennosuke and blind Irako Seigen will fight each other in this match. Both are disciples of Iwamoto Kogan, who is known as Japan's greatest swordsman. Each of them are determined to prove himself the successor of Iwamoto's school. However, there can only be one champion.\n\nSo begins a story of intertwining fates, conflict, and strange destinies.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/10282.webp","source":"Manga","numberOfEpisode":"12","studio":"Madhouse","type":"TV","score":7.43,"genres":["Action","Historical","Psychological","Drama","Martial Arts","Samurai","Seinen"]},{"title":"Jigoku Shoujo Mitsuganae","synopsis":"Following the events of Jigoku Shoujo Futakomori, Ai Enma, the Hell Girl, has disappeared. Her former companions decide to lead normal lives, until their absent mistress returns to them with a new companion, and in a way that none of them anticipated.\n\nYuzuki Mikage is a normal schoolgirl who soon comes to understand the Hell Girl on an intimate level. During a dream-like trance in the bathtub, Ai kisses Yuzuki and possesses her. So when Yuzuki's friend decides to type in the name of their teacher in the Hell Correspondence website, Ai makes use of Yuzuki's body to accomplish her own task of ferrying the teacher's soul to hell. Yuzuki is disturbed by her new circumstances and wonders why she was chosen to continue Ai's work. Unfortunately for her, the Hell Girl and her assistants resume operation of Hell Correspondence, and she is dragged along for the ride towards hell itself.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/86976.webp","source":"Original","numberOfEpisode":"26","studio":"Studio Deen","type":"TV","score":7.67,"genres":["Mystery","Psychological","Supernatural"]},{"title":"Kanojo to Kanojo no Neko: Everything Flows","synopsis":"For the longest time, it's just been the two of them. \"Kanojo\" and her cat Daru are inseparable, having grown up together. Now a junior in college, Tomoka—her roommate of a year and a half—moves out of their shared apartment, and in order to keep her living space, Kanojo must find a job. Day by day, Daru watches her continued efforts from a cat's-eye view, eagerly awaiting his owner's return. When she gets back, once again, it's just she and her cat.\n\nKanojo to Kanojo no Neko: Everything Flows is a charming short series about the bond between a pet and his owner.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/79716.webp","source":"Original","numberOfEpisode":"4","studio":"LIDENFILMS","type":"TV","score":7.73,"genres":["Slice of Life","Psychological","Romance"]},{"title":"Boogiepop wa Warawanai","synopsis":"Five years ago, a string of grisly murders shook the city to its core and now the rumors have begun once more. Boogiepop... Everyone knows about Boogiepop: meet her one dark night and you are taken. People tell each other the stories and laugh: no one believes that she can possibly exist in this day and age. Still, strange things appear to be going on and the darkness is taking on many forms. Something is out there. Are you safe?\n\n(Source: RightStuf)","img":"https://cdn.myanimelist.net/images/anime/1327/95777.webp","source":"Light novel","numberOfEpisode":"12","studio":"Madhouse","type":"TV","score":7.18,"genres":["Psychological","Supernatural","Dementia","Mystery","Drama","Horror"]},{"title":"Yuri Kuma Arashi","synopsis":"In the past, humanoid bears coexisted with humans. However, a meteor shower that fell onto Earth had a strange effect on bears throughout the world: they suddenly became violent and hungry for human flesh, spurring an endless cycle of bloodshed in which bear ate man and man shot bear, forgetting the lively relationship they once had. The \"Wall of Severance\" was thus built, separating the two civilizations and keeping peace.\n\nKureha Tsubaki and Sumika Izumino are two lovers attending Arashigaoka Academy, who, upon the arrival of two bears that have sneaked through the Wall of Severance and infiltrated the academy, find their relationship under a grave threat. The hungering yet affectionate bears, Ginko Yurishiro and Lulu Yurigasaki, seem to see the bear-hating Kureha as more than just another meal, and in getting closer to her, trigger an unraveling of secrets that Kureha may not be able to bear.\n\nWhen their relationships provoke the Invisible Storm, a group that keeps order within the ideological school, the girls must stand on trial with their love, embarking on a journey of self-discovery en route to attaining true love's \"promised kiss.\"\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/69203.webp","source":"Original","numberOfEpisode":"12","studio":"Silver Link.","type":"TV","score":7.11,"genres":["Psychological","Drama","Fantasy","School","Seinen","Shoujo Ai"]},{"title":"Tekkon Kinkreet","synopsis":"The streets of Treasure Town are said to belong to \"The Cats.\" They know everything that goes on in the city, and no one can stir up trouble without going through them first. In reality, The Cats are a pair of orphan boys called Black and White, who aren’t afraid of anything or anyone. \n\nBut their rule of the streets is challenged when the Yakuza come to town and start making changes. The wild Black and the carefree White have no one to rely on but themselves to get their Treasure Town back to the way it was. But their bond is tested as they quickly realize going back to how things were may no longer be an option.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/12/8520.webp","source":"Manga","numberOfEpisode":"1","studio":"Studio 4°C","type":"Movie","score":8,"genres":["Action","Adventure","Psychological","Supernatural"]},{"title":"Kanojo to Kanojo no Neko","synopsis":"It was on a rainy spring day that Chobi became a young woman's pet cat. Though he immediately fell in love with the beautiful and kind person who took him in, he can never hope to fully understand the complex world of humans. Over the course of their first year living in the same apartment, Chobi and his new owner live in their own separate worlds⁠—standing alone yet close together.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/73498.webp","source":"Original","numberOfEpisode":"1","studio":null,"type":"OVA","score":7.37,"genres":["Drama","Psychological","Romance","Slice of Life"]},{"title":"Re:Zero kara Hajimeru Isekai Seikatsu - Hyouketsu no Kizuna","synopsis":"Covered in ice and snow, Elior Forest is the home to dangerous magical beasts and 50 elves frozen in ice. One day, the great spirit Pack helps a young girl break out of her ice prison. Her name is Emilia, a half-elf born with silver hair, long ears, and amethyst eyes—features that resemble the evil Witch who destroyed half the world long ago. \n\nShunned by society because of her appearance, Emilia dwells in the forest with Pack as her sole companion and family. Burdened with a sin of destruction she does not remember committing, she spends her days trying to find a way to help her frozen kin. But when the great spirit Melakuera, the Arbitrator of the world, finds Emilia, her right to stay alive is brought into question. Will the bonds of ice she formed with Pack prove to be the warm thread that defies fate?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1238/104023.webp","source":"Light novel","numberOfEpisode":"1","studio":"White Fox","type":"Movie","score":7.76,"genres":["Drama","Fantasy","Psychological","Thriller"]},{"title":"Itou Junji: Collection","synopsis":"In the light of day and in the dead of night, mysterious horrors await in the darkest shadows of every corner. They are unexplainable, inescapable, and undefeatable. Be prepared, or you may become their next victim.\n\nSit back in terror as traumatizing tales of unparalleled terror unfold. Tales, such as that of a cursed jade carving that opens holes all over its victims' bodies; deep nightmares that span decades; an attractive spirit at a misty crossroad that grants cursed advice; and a slug that grows inside a girl's mouth. Tread carefully, for the horrifying supernatural tales of the Itou Junji: Collection are not for the faint of heart.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/88366.webp","source":"Manga","numberOfEpisode":"12","studio":"Studio Deen","type":"TV","score":6.15,"genres":["Mystery","Comedy","Horror","Demons","Psychological","Supernatural","Drama","Thriller","School"]},{"title":"Touhai Densetsu Akagi: Yami ni Maiorita Tensai","synopsis":"While mahjong is a game that is often played with family and friends, it is also a game that is played in the darkest corners of society. Nangou is a compulsive gambler who has accumulated debt over three million yen. In a last ditch attempt to clear his record, he decides to wager his life on a game of mahjong with the mafia. Unfortunately, as the game progresses, Nangou only moves further from the prize and closer to death.\n\nWhen all hope seems lost, the game parlor is suddenly intruded upon by Shigeru Akagi, a young boy on the run from the police. Desperate to turn the game around, Nangou hands the game over to Akagi after teaching him a few of the rules. The mafia can only smirk as Akagi sits down to play. However, they soon come to learn that Akagi is a natural-born gambler. An imposing figure who does not fear death. One who is destined to become a legend.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/53587.webp","source":"Manga","numberOfEpisode":"26","studio":"Madhouse","type":"TV","score":7.96,"genres":["Game","Psychological","Thriller","Seinen"]},{"title":"Koukaku Kidoutai 2.0","synopsis":"Mamoru Oshii's first Ghost in the Shell cyberspace film will return to five Japanese theaters in an enhanced Ghost in the Shell 2.0 edition on July 12. The new edition will include new computer graphics and digital effects for some scenes and a reunion of most of the cast members for a new 6.1 surround sound recording. Academy-Award-winning sound mixer/editor Randy Thom (Ghost in the Shell 2: Innocence, The Incredibles, The Right Stuff) has overseen the new soundtrack with Kenji Kawai's original music and a final mix that has been produced at Thom and Lucas Digital's Skywalker Sound studio in California.\n\nIn the new edition, the enigmatic Puppet Master character will be played by Yoshiko Sakakibara (Ghost in the Shell 2: Innocence's Harraway, Ghost in the Shell: Stand Alone Complex's Prime Minister Yoko Kayabuki). Iemasa Kayumi (Giant Robo's Chief Chuujou Shizuo, RahXephon's Ernst Von Bähbem) played the role in the original edition.\n\nThe film will screen in Tokyo, Osaka, Nagoya, Fukuoka, and Sapporo. Not coincidentally, Oshii's latest film, The Sky Crawlers, will open one month after Ghost in the Shell 2.0 on August 2. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/75608.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":8.03,"genres":["Action","Sci-Fi","Police","Psychological","Mecha","Seinen"]},{"title":"Shigofumi","synopsis":"There are some things that people are unable to say while they are alive; for these, there are \"shigofumi,\" letters carried from the world of the dead to the world of the living. When a person with strong emotions dies, they are able to create a shigofumi, whether their feelings are of love, longing, or resentment. It is the quiet and mysterious Fumika's job to deliver these messages from the departed. Along with her talking magic staff Kanaka, she ensures that each shigofumi reaches its intended recipient, even if that person does not want to face its contents.\n\nFumika witnesses the tragedies of people, both dead and alive, and sees their deepest secrets revealed. What is unclear, however, are the details of Fumika's past. Who was she before she came to be a carrier of shigofumi?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/50787.webp","source":"Original","numberOfEpisode":"12","studio":"J.C.Staff","type":"TV","score":7.51,"genres":["Drama","Fantasy","Psychological","Supernatural","Thriller"]},{"title":"Blame! Movie","synopsis":"In the distant technological future, civilization has reached its ultimate Net-based form. An \"infection\" in the past caused the automated systems to spiral out of order, resulting in a multi-leveled city structure that replicates itself infinitely in all directions. Now humanity has lost access to the city's controls, and is hunted down and purged by the defense system known as the Safeguard. In a tiny corner of the city, a little enclave known as the Electro-Fishers is facing eventual extinction, trapped between the threat of the Safeguard and dwindling food supplies. A girl named Zuru goes on a journey to find food for her village, only to inadvertently cause doom when an observation tower senses her and summons a Safeguard pack to eliminate the threat. With her companions dead and all escape routes blocked, the only thing that can save her now is the sudden arrival of Killy the Wanderer, on his quest for the Net Terminal Genes, the key to restoring order to the world.\n\n(Source: Official site)","img":"https://cdn.myanimelist.net/images/anime/1976/93666.webp","source":"Manga","numberOfEpisode":"1","studio":"Polygon Pictures","type":"Movie","score":7.22,"genres":["Action","Drama","Mecha","Psychological","Sci-Fi","Seinen"]},{"title":"The Big O","synopsis":"Paradigm City, a city of amnesia and a place of belonging. It remains populated by forgotten pasts and the ruins of their labors due to a calamity 40 years ago. Shrouded in a fog-like mystery, it is up to people like Roger Smith to shine a light through the mist. Acting as a professional negotiator and suave agent, Roger is a self-tailored ladies man whose only love is for funeral black. However, as he gets deeply involved with his clients, what often starts as a simple negotiation evolves into Roger saving Paradigm from crime and peril.\n\nIn the process, Roger stumbles even deeper into the untold folds of the city. As a rule, things are hardly ever as they appear. Serving as gray knight in a gray world, Roger is not without allies. By his side are Norman, a loyal and widely skilled butler, and Dorothy, a human-like android with deadpan snark. Together with the relic Big O, a jet-black mecha of gargantuan size and weight, they help Roger serve iron justice to Paradigm's lurking villains as he discovers the truth about 40 years ago.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1/567.webp","source":"Original","numberOfEpisode":"26","studio":"Sunrise","type":"TV","score":7.54,"genres":["Action","Sci-Fi","Mystery","Psychological","Mecha"]},{"title":"Memories","synopsis":"Memories is a compilation of three standalone short films encompassing different genres.\n \nMagnetic Rose\nIn the far reaches of space, after tracing a distress signal to a large abandoned space station, a pair of engineers—Heintz Beckner and Miguel Costrela—find a derelict mansion and decide to explore on foot. Their investigation reveals a dark secret surrounding the fate of Eva Friedel, a renowned opera singer with a tragic history. Hallucinations soon begin to plague them, and they must fight to retain their sanity in order to escape the station alive.\n \nStink Bomb\nHapless lab technician Nobuo Tanaka consumes some pills at his laboratory to cure a cold. Unknown to him, however, the pills are actually experimental drugs that enhance his flatulence to a lethal degree. As the toxic gas escaping him kills everyone in his vicinity, he is ordered by his superiors to retreat to the company headquarters in Tokyo. The journey to the city is made all the more arduous as Nobuo struggles with his deadly odor while the police, military, and foreign adversaries are hot on his trail.\n \nCannon Fodder\nIn a fortress city filled to the brim with cannons, a young boy wishes to surpass his father by becoming a revered artillery officer. Despite no proof of an enemy nation, he cannot resist the urge to partake in the daily bombardment routines organized by the city. Whether at school or just before bedtime, he only dreams of someday firing a cannon for the sake of his homeland.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/9/74781.webp","source":"Manga","numberOfEpisode":"3","studio":"Madhouse","type":"Movie","score":7.74,"genres":["Drama","Horror","Psychological","Sci-Fi"]},{"title":"Kuuchuu Buranko","synopsis":"Many patients with different problems visit the psychiatric ward of Irabu General Hospital; a trapeze artist suffering from insomnia after suddenly failing his jumps, a gangster afraid of knives and sharp objects and a business man who has an erection 24 hours a day. They undergo counseling by Dr. Ichiro Irabu, who is the child-like son of the hospital director. His assistant is the sullen faced sexy nurse Mayumi. With his mysterious injections, and advice that does not make sense, Dr. Irabu confuses his patients. But at the end of his unique treatments, the patients are led to digging further into their souls to find peace of mind.\n\n(Source: fujicreative.co.jp)","img":"https://cdn.myanimelist.net/images/anime/3/18386.webp","source":"Novel","numberOfEpisode":"11","studio":"Toei Animation","type":"TV","score":7.99,"genres":["Comedy","Psychological","Drama","Seinen"]},{"title":"Koi Kaze","synopsis":"Saeki Koushirou works as a wedding planner, but his own love life is in shambles. His background makes it difficult for him to commit himself wholeheartedly to love. The child of a divorced couple, he lives with his father. He has a mother and a sister, but he has not seen them in years. After being dumped by his girlfriend, a chance encounter with a female high school student shakes Koushirou's calm and awakens new feelings in him—but he learns that the girl is in fact his sister, who will now be staying with his father and him. Yet, the feelings in Koushirou's heart...\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/61441.webp","source":"Manga","numberOfEpisode":"13","studio":"A.C.G.T.","type":"TV","score":7.18,"genres":["Drama","Psychological","Romance","Seinen","Slice of Life"]},{"title":"Selector Spread WIXOSS","synopsis":"Get ready for the thrilling second season of the WIXOSS series! Immerse yourself in a game where special cards called LRIGs—cards that possess personalities and wills of their own—can change your life forever. Teenager Ruko holds one of these rare cards, and if she wins, her wish will be granted. But what happens if she loses?\n\n(Source: FUNimation)","img":"https://cdn.myanimelist.net/images/anime/5/75495.webp","source":"Card game","numberOfEpisode":"12","studio":"J.C.Staff","type":"TV","score":7.42,"genres":["Game","Psychological"]},{"title":"Dead Leaves","synopsis":"Pandy and Retro awaken naked on Earth with no recollection of their past. They embark on a devastating crime spree in search of food, clothing and transportation, but are captured by authorities and sent to the infamous lunar penitentiary named Dead Leaves. While incarcerated, they quickly discover that Dead Leaves is also a top-secret cloning facility, occupied by villainous guards and deformed genetic experiments. Ultra-manic chaos and hyper-violent bedlam ensue as they organize a prison break with the aid of their fellow mutant inmates. ","img":"https://cdn.myanimelist.net/images/anime/8/8621.webp","source":"Original","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.23,"genres":["Adventure","Psychological","Comedy","Sci-Fi"]},{"title":"Pet","synopsis":"Despite endless research, the human mind remains a mystery to this day. Unknown to the public, there exist special individuals who are able to dive deep into the minds of people and even manipulate their memories.\n\nGifted with this ability, Hiroki, Tsukasa, and Satoru are among those who use their power to commit crime under the orders of their leader, Katsuragi. The three step into the dangerous territory of the human mind in order to destroy their assigned targets while striving to keep their own minds and memories safe.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1399/94794.webp","source":"Manga","numberOfEpisode":"13","studio":"Geno Studio","type":"TV","score":6.55,"genres":["Mystery","Psychological","Supernatural","Seinen"]},{"title":"Mardock Scramble: The First Compression","synopsis":"Rune Balot is a down-and-out teen prostitute in Mardock City. One day, she's picked up by an ambitious casino manager named Shell who gives her everything she could want. Renewed by a false innocence, a false past, and now the false life Shell has given her, Balot feels grateful. However, she can't help but be curious about why he's done so much for her, so she does some research about his past on a computer. This turns out to be a mistake which will change her life greatly. When Shell finds out what she's done, he attempts to burn her to death by blowing up her car.\n\nDue to the high crime rate in Mardock, a new law called \"Scramble 09\" has given police carte blanche to take extreme and otherwise illegal measures to revive crime witnesses. With this in mind, they allow a professor to bring Balot back from the brink of death by reassembling her entire body with reinforced synthetic fiber. When she finally wakes up, her confused mental state eventually turns toward revenge as Shell is revealed as her killer.\n\n(Source: Nippon Cinema)","img":"https://cdn.myanimelist.net/images/anime/3/26215.webp","source":"Novel","numberOfEpisode":"1","studio":"GoHands","type":"Movie","score":7.51,"genres":["Action","Sci-Fi","Psychological"]},{"title":"Shisha no Teikoku","synopsis":"By the 19th century, humanity has cultivated technology enabling the reanimation of corpses. Unable to experience individual thoughts or emotions, the corpses are programmed by humans to act as laborers in various occupations.\n\nThis newfound technology, however, comes with a catch. Science may be able to restore the corpses' ability to move, yet it cannot return what every corpse loses at death: the soul. But Doctor Victor Frankenstein, who vanished shortly after his revolutionary work on corpse reanimation, is said to have revived the only corpse in possession of a soul.\n\nIn pursuit of this scientific knowledge, London medical student John Watson hopes to fulfill his promise to his late partner, Friday. After being scouted by a government agency, Watson is on a hunt to obtain Frankenstein's notes, which he believes hold the key to the secrets of the soul. During his search, Watson uncovers the harsh realities of the developing corpse technology and the price he must pay to advance his research.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/75468.webp","source":"Novel","numberOfEpisode":"1","studio":"Wit Studio","type":"Movie","score":6.96,"genres":["Sci-Fi","Historical","Psychological"]},{"title":"Gantz:O","synopsis":"Death does not have to be the end; one can live again, but only through beating the game posed by the black ball called Gantz.\n \nOn his way home to celebrate his younger brother's birthday, brave and kind-hearted student named Masaru Katou is stabbed to death. He awakes in a small room with a cityscape view in the heart of Tokyo—and he is not alone. To his surprise, it is not the afterlife, but the waiting room for a high stakes game with their lives on the line. Before he has the chance to process the situation, Masaru is handed a gun and teleported into the center of Osaka to carry out one simple task: eliminate any alien on sight.\n \nAccompanied by the aged Yoshikazu Suzuki, the stunning idol Reika Shimohira, and the cold but experienced Jouichirou Nishi, Masaru must overcome his fears in order to survive the game and return home to his waiting brother.\n \n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/81255.webp","source":"Manga","numberOfEpisode":"1","studio":"Digital Frontier","type":"Movie","score":7.51,"genres":["Action","Sci-Fi","Horror","Psychological","Supernatural","Drama","Ecchi","Seinen"]},{"title":"Cossette no Shouzou","synopsis":"The anime is about art student Eiri Kurahashi, who works in an antique shop. One day, he sees the image of a girl in an antique glass. To his shock, she appears to be moving and living out her life before his eyes. He becomes infatuated with the girl, and one night at midnight, somehow makes contact with her. He learns her name is Cossette, and that she was an aristocrat's daughter during the 18th century.\n\nShe reveals to him that her spirit has been entrapped within the glass by her murder, which was perpetrated by her betrothed, the artist Marcelo Orlando. To set her free, she tells Eiri, a man must be willing to take upon himself punishment for the sins Marcelo committed.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/11/77004.webp","source":"Original","numberOfEpisode":"3","studio":"Daume","type":"OVA","score":6.88,"genres":["Drama","Horror","Magic","Psychological","Romance","Supernatural"]},{"title":"xxxHOLiC Shunmuki","synopsis":"For the appropriate price, your dearest wish can be granted at the shop of the peculiar Yuuko. Kimihiro Watanuki wishes to be rid of his ability to see spirits, and so as payment, he works for Yuuko doing whatever she needs him to do, from cleaning to errands to even helping out Yuuko's other clients. In xxxHOLiC Shunmuki, Watanuki and his friend and rival Shizuka Doumeki enjoy a meal with their friend Kohane Tsuyuri and her grandmother, reminiscing about how they have changed since meeting each other.\n\nLater on, Watanuki has a dream in which he is visited by Doumeki's grandfather Haruka, who needs him to find some things in the family temple storeroom. Accompanied by Doumeki, he finds that this task is more akin to a treasure hunt, with each item leading them to another, and another, guiding them to an unexpected yet inevitable ending.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/25079.webp","source":"Manga","numberOfEpisode":"2","studio":"Production I.G","type":"OVA","score":8.1,"genres":["Mystery","Comedy","Psychological","Supernatural","Drama"]},{"title":"Nekojiru-sou","synopsis":"The main character, a cat named Nyatto, embarks upon a journey to save his sister's soul, which was ripped in two when Nyatto tried to save her from Death. She trails after him, brain-dead. They encounter many brilliant, mind-bending situations, beginning with a disturbing magic show.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/84241.webp","source":"Manga","numberOfEpisode":"1","studio":"J.C.Staff","type":"OVA","score":7.35,"genres":["Comedy","Dementia","Psychological"]},{"title":"Mind Game","synopsis":"After seeing her jump onto a subway at the last second and getting her ankle crushed between the doors, Nishi reconnects with his high school sweetheart, Myon. Nishi is still very much in love with Myon, but is shocked to learn that she is engaged to another man. Nishi agrees to meet Myon's fiancé at her family's Yakitori restaurant, but members of the Yakuza storm the joint and murder Nishi when he tries to stop them from raping Myon.\n\nNishi, now dead, wakes up and meets a constantly shapeshifting god, who mocks him for dying. The god tells Nishi to walk into a portal and disappear from existence, which Nishi rejects, choosing instead to sprint past the god and reanimate. With a new outlook on life and knowledge of how the Yakuza are going to attack him, Nishi kills one of the Yakuza with his own gun, fleeing in a stolen car with Myon and her sister.\n\nAcclaimed director Masaaki Yuasa's debut film, Mind Game's constantly shifting visuals tell a story about living one's life without regrets that is unlike any other.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1722/96276.webp","source":"Manga","numberOfEpisode":"1","studio":"Studio 4°C","type":"Movie","score":7.8,"genres":["Adventure","Comedy","Dementia","Psychological","Romance"]},{"title":"Evil or Live","synopsis":"Severe internet addiction has become an epidemic infecting the nation's youth, ultimately resulting in their extreme dependence on the world wide web. Those who are too far gone are enrolled at Elite Reeducation Academy in order to help them grow into successful adults. Hibiki is one such teenager who awakens in the facility unaware of how he came to be there. He learns from the head instructor that he was knocked out and brought to the school at his mother's behest, concerned with how belligerent her son was becoming as a result of his internet addiction. \n\nStuck in a place more akin to a prison than an academy, and with no escape from the abuses of the instructors, Hibiki decides to end his life by jumping from the roof. But as fate would have it, he meets a mysterious man named Shin who promises to give his life meaning... \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1333/90138.webp","source":"Web manga","numberOfEpisode":"12","studio":"Haoliners Animation League","type":"TV","score":5.89,"genres":["Psychological","School"]},{"title":"xxxHOLiC Movie: Manatsu no Yoru no Yume","synopsis":"Summer break has arrived, but while his other classmates are out having fun, Kimihiro Watanuki continues to work as compensation for the eccentric Yuuko in her shop. With the spirits and supernatural phenomena that bother him lessening, he pays his dues by cleaning, cooking, and doing whatever else the apparently lazy Yuuko needs.\n\nWatanuki, however, gets involved in a new predicament when Yuuko receives a mysterious invitation to a mansion whose owner seeks Yuuko's wish-granting ability. When he, Yuuko, and his classmate Shizuka Doumeki make their way to the peculiar residence, they meet others who were summoned by the same strange invitation. All of them are collectors of various unique items, drawn there by the chance to expand their collections. But as the collectors begin to disappear one by one, Watanuki and his companions must solve the mystery and put the case to rest, or find themselves in risk of danger.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/25078.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.98,"genres":["Mystery","Comedy","Psychological","Supernatural","Drama"]},{"title":"Super Danganronpa 2.5: Komaeda Nagito to Sekai no Hakaimono","synopsis":"At Hope's Peak Academy, a school full of extraordinarily talented individuals, Nagito Komaeda is an ordinary boy with no special traits or interesting skills to speak of—except for his incredible unluckiness. Just walking to school in the morning leads to a number of unfortunate accidents, which only escalate as the day goes on. Despite this, Komaeda leads a relatively normal life and is satisfied with his modest slice of happiness.\n\nBut everything changes when a mysterious boy who declares himself the \"Destroyer of the World\" arrives to shatter this hopeless paradise.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/83150.webp","source":"Original","numberOfEpisode":"1","studio":"Lerche","type":"OVA","score":7.25,"genres":["Action","Mystery","Horror","Psychological"]},{"title":"Psycho-Pass: Sinners of the System Case.1 - Tsumi to Bachi","synopsis":"A runaway vehicle driven by Izumi Yasaka, en route to the Public Safety Bureau building, is reported shortly before it crashes into the building. Izumi is a counselor who recently ran away while working at a latent criminal isolation and rehabilitation facility known as Sanctuary.\n\nBefore Inspectors Mika Shimotsuki and Akane Tsunemori get to interrogate the suspect, a sudden request is issued from the facility to promptly bring Izumi back. Interpreted as a direct order from the Chief and the board at Sanctuary, the Inspectors obey, but insist that Izumi be escorted back personally. Tsunemori intends to investigate further with the rest of the team at the Bureau. \n\nNow Inspector Shimotsuki has finally been given the opportunity she had been waiting for—to be the primary investigator on an important case. This case follows Shimotsuki and her team of Enforcers as they uncover the secrets of Sanctuary.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1623/96878.webp","source":"Original","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.12,"genres":["Action","Police","Psychological","Sci-Fi"]},{"title":"Wolf's Rain OVA","synopsis":"As the world accelerates toward its own destruction, Kiba and Cheza—with the help of Tsume, Hige, Toboe, and Blue—race to reach true paradise before the entire world is rendered uninhabitable. Now reunited, Cher and Hubb decide to accompany the wolves in hopes of seeing the journey through to its end, while a distraught and confused Quent wanders aimlessly into the wasteland with his mind fixated on revenge.\n\nMeanwhile, Lord Darcia the Third has finally put his plot into motion and pursues Cheza, pitting him against the pack. As everything falls apart yet simultaneously falls into place, the wolves struggle to survive in an increasingly dangerous environment. Though the end draws near, paradise seems further away than ever before.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/22397.webp","source":"Original","numberOfEpisode":"4","studio":"Bones","type":"OVA","score":8.05,"genres":["Sci-Fi","Adventure","Psychological","Supernatural","Drama"]},{"title":"M3: Sono Kuroki Hagane","synopsis":"A distorted, endlessly black darkness.\n\nThe location where the dark swallowed everything and took everything from us has become known as the Lightless Realm.\nBorn there, as if they were mirror images of the despair and chaos humans felt, were aberrations.\n\nThey were called Admonitions.\n\nAn investigation of the Lightless Realm that eats away at the human psyche. Can a group of eight boys and girls gathered in an effort to combat the Admonitions see the light of the future beyond the Lightless Realm, while their past destinies and dangerous present intertwine in a complicated web?\n\n(Source: Daisuki)","img":"https://cdn.myanimelist.net/images/anime/4/60273.webp","source":"Original","numberOfEpisode":"24","studio":"C2C","type":"TV","score":6.64,"genres":["Action","Sci-Fi","Mystery","Psychological","Drama","Mecha"]},{"title":"Higurashi no Naku Koro ni Kaku: Outbreak","synopsis":"The story is set in the same Hinamizawa village of the previous stories. The village has been completely sealed off due to a mysterious virus in 1983, and Maebara Keiichi and Ryuuguu Rena deal with the outbreak.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/51063.webp","source":"Light novel","numberOfEpisode":"1","studio":"Studio Deen","type":"OVA","score":7.28,"genres":["Horror","Mystery","Psychological","Thriller"]},{"title":"Ayashi no Ceres","synopsis":"Ceres was a tennyo (Celestial maiden) who came down from the heavens to bathe in a stream. She hung her hagoromo (robe) on a tree nearby, which was her key to returning to the heavens. But the robe was stolen and the man who had stolen it forced her to become his wife, thus producing a family full of human and tennyo blood mixed.\n\nNow, in modern day time, Aya Mikage is a descendent of Ceres, and has quite an amount of tennyo blood. On her 16th birthday, she and her twin brother, Aki, are thrown a party. At the \"party,\" Aya's grandpa plans to kill her, for she has tennyo powers unlike the rest of the family, and can actually become Ceres herself and destroy the Mikage family. Aya, however, can switch back, so this transformation happens quite frequently.\n\nWith protector Yuuhi by her side, it is up to Aya to control Ceres and keep her from coming back, but her relationship with an ex-worker for her evil grandpa may be a distraction.","img":"https://cdn.myanimelist.net/images/anime/8/23580.webp","source":"Manga","numberOfEpisode":"24","studio":"Studio Pierrot","type":"TV","score":7.26,"genres":["Adventure","Comedy","Horror","Psychological","Supernatural","Drama","Romance","Shoujo"]},{"title":"Mouryou no Hako","synopsis":"The story follows a series of bizarre murders of schoolgirls who have been dismembered and stuffed into boxes. The private investigator hired by a missing daughter's mother joins forces with an antique book seller and others to unravel the murder spree.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/75492.webp","source":"Novel","numberOfEpisode":"13","studio":"Madhouse","type":"TV","score":7.23,"genres":["Mystery","Psychological","Supernatural","Thriller","Seinen"]},{"title":"Koukaku Kidoutai Arise: Ghost in the Shell - Border:1 Ghost Pain","synopsis":"The anime's story is set in 2027, one year after the end of the fourth non-nuclear war. New Port City is still reeling from the war's aftermath when it suffers a bombing caused by a self-propelled mine. Then, a military member implicated in arms-dealing bribes is gunned down.\n\nDuring the investigation, Public Security Section's Daisuke Aramaki encounters Motoko Kusanagi, the cyborg wizard-level hacker assigned to the military's 501st Secret Unit. Batou, a man with the \"eye that does not sleep,\" suspects that Kusanagi is the one behind the bombing. The Niihama Prefectural Police detective Togusa is pursuing his own dual cases of the shooting death and a prostitute's murder. Motoko herself is being watched by the 501st Secret Unit's head Kurutsu and cyborg agents.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/46673.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.5,"genres":["Sci-Fi","Police","Psychological","Mecha"]},{"title":"Harmony","synopsis":"In the future, Utopia has finally been achieved thanks to medical nanotechnology and a powerful ethic of social welfare and mutual consideration. This perfect world isn't that perfect though, and three young girls stand up to totalitarian kindness and super-medicine by attempting suicide via starvation. It doesn't work, but one of the girls—Tuan Kirie—grows up to be a member of the World Health Organization. As a crisis threatens the harmony of the new world, Tuan rediscovers another member of her suicide pact, and together they must help save the planet...from itself.\n\n(Source: Viz Media)","img":"https://cdn.myanimelist.net/images/anime/2/76993.webp","source":"Novel","numberOfEpisode":"1","studio":"Studio 4°C","type":"Movie","score":7,"genres":["Sci-Fi","Psychological"]},{"title":"Dorei-ku The Animation","synopsis":"Eager to know why her best friend’s boyfriend dumped her for a man, the headstrong Eiya Arakawa suggests a meeting with them. Gathered together at a café, Yuuga Oota agrees to answer Eiya’s questions only if she can correctly ascertain the relationship of a couple sitting across from them, which she does on her first attempt. Amazed by her astounding intellect and intuition, he invites her to a private meeting where he introduces her to the concept of Slave Control Method, or SCM, a retainer-like device that has the ability to turn people into slaves.\n\nWhen two SCM users enter a duel, the devices exert a powerful influence on their brains. Once the duel is over, the SCM amplifies the loser’s sense of obligation and forces them to bend to the will of the winner. Wanting desperately to test his own abilities, Yuuga asks Eiya to act as his insurance in the event that he himself becomes a slave. Granted access to 10 million yen, Eiya’s job is to convince Yuuga’s would-be master to free him from his servitude. Though hesitant at first, Yuuga’s words resonate with her personal yearning for something more from her life, and she agrees to his request. However, when a mysterious organization begins rapidly accruing slaves, Eiya becomes entangled in a game far more dangerous than she ever could have imagined.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1801/90264.webp","source":"Manga","numberOfEpisode":"12","studio":"TNK","type":"TV","score":6.04,"genres":["Drama","Psychological"]},{"title":"Lostorage Incited WIXOSS","synopsis":"High school student Homura Suzuko has returned to Ikebukuro, the town where she grew up.\n\n\"We're friends forever!\" She treasures her memories of her old friend from when she was little, Morikawa Chinatsu, and she's excited at the prospect of meeting her again.\n\nBut when she gets to school, she finds she has trouble fitting in with the rest of the class.\n\nOne day, she decides that if she learns to play the card game WIXOSS, she might be able to make some friends. She stops at a card shop on her way home and buys a deck set. When she takes the set home and opens it, the girl on one of the cards begins to move, and speak.\n\n\"Welcome, Selector.\"\n\nHumans chosen as Selectors must battle for control of the five coins that hold all their memories.\n\nIf they can retake all the coins, they win, and can leave the game. But if they lose, as a penalty—\n\n\"Lostorage\"—What will become of Suzuko as she's caught up in this insane game?\n\nAnd just like Suzuko, Chinatsu finds herself drawn into the game as well...\n\n(Source: Crunchyroll)","img":"https://cdn.myanimelist.net/images/anime/3/82289.webp","source":"Card game","numberOfEpisode":"12","studio":"J.C.Staff","type":"TV","score":6.73,"genres":["Game","Psychological"]},{"title":"Harmonie","synopsis":"Every person has his or her own little world. Among the 34 bustling students of classroom 2-1, there are many such worlds.\n\nHonjou Akio's world—my world—is filled with passionate talk about last night's anime with Yoshida, Watanabe, and other friends. It's a fun, comfortable place... But, I always wonder. Wonder about the world of Makina Juri, smiling and surrounded by gorgeous friends on the other side of the classroom.\n\nOne day, I enter her world. But it's not as simple as it sounds.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/55197.webp","source":"Original","numberOfEpisode":"1","studio":"Studio Rikka","type":"Movie","score":7.35,"genres":["Slice of Life","Psychological","Drama","School"]},{"title":"7 Seeds","synopsis":"In the immediate future, a giant meteorite has collided with earth. All living organisms, including mankind, have been wiped off the face of the planet. The government, who had foreseen this outcome, took measures to counter the worst-case scenario. In particular was Project \"7SEEDS,\" in which five sets of seven young men and women were carefully selected and placed into teams (Spring, Summer A, Summer B, Autumn and Winter). Each participant was then put under cryogenic sleep in hopes of preserving the continued existence of mankind.\n\nWhen those men and women awoke, they found themselves suddenly thrust into a cruel world. While bereft and grieved over forever losing their loved ones, they sought to find ways to survive.\n\n(Source: MU)","img":"https://cdn.myanimelist.net/images/anime/1305/96703.webp","source":"Manga","numberOfEpisode":"12","studio":"Gonzo","type":"ONA","score":6.51,"genres":["Sci-Fi","Adventure","Mystery","Psychological","Drama","Romance","Shoujo"]},{"title":"Shinigami no Ballad.","synopsis":"A girl wrapped in white, her name is Momo...in her hand lies a blunt yet shiny scythe. By her side is a winged black cat by the name of Daniel. Carrying the souls of humans, the girl's existence parallels to that of a \"Death God\" or \"Shinigami\". At the instant when this white Death God touches the hearts of humans, the world is filled with kindness and grief... \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/5/16086.webp","source":"Light novel","numberOfEpisode":"6","studio":"Ginga Ya","type":"TV","score":6.95,"genres":["Drama","Fantasy","Psychological","Supernatural"]},{"title":"Jigoku Shoujo: Yoi no Togi","synopsis":"If you have a grudge against someone, you can access the Hell Correspondence website at the stroke of midnight, type in your grudge's name, and the Hell Girl, Ai Enma, will appear to grant your wish. However, the price for ridding yourself of such a burden is a steep one: in return for condemning the soul of your tormentor to Hell, your soul will also face eternal damnation. In her long vigil as the Hell Girl, Ai has met many willing to pay such a cost.\n\nIn Jigoku Shoujo: Yoi no Togi, Ai and her enigmatic companions continue to carry out their work, ferrying soul after suffering soul into the depths of Hell. However, as of late, a mysterious girl has been following them. This strange child, unable to even remember her own identity, questions Ai about her duty as the Hell Girl. Who is this girl, and what connection does she have to Ai?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1110/92117.webp","source":"Original","numberOfEpisode":"6","studio":"Studio Deen","type":"TV","score":6.52,"genres":["Horror","Mystery","Psychological","Supernatural"]},{"title":"Psycho-Pass: Sinners of the System Case.3 - Onshuu no Kanata ni＿＿","synopsis":"\"Could you become my teacher?\" \n\nFollowing the incident in the Southeast Asia Union (SEAUn) in 2116, Shinya Kogami resumes his vagrant journey. In a small South Asian nation, Kogami rescues a bus of refugees under attack by armed guerrilla forces. Among the refugees is a young lady by the name of Tenzin, who begs Kogami to teach her how to retaliate against the enemy. Just what do the girl who wishes for revenge and the man who has exacted revenge see as they gaze upon the edge of a world from which there is no escape? \n\n(Source: Official Website, translated by Edo)","img":"https://cdn.myanimelist.net/images/anime/1819/97220.webp","source":"Original","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.79,"genres":["Action","Sci-Fi","Police","Psychological"]},{"title":"Koukaku Kidoutai Arise: Ghost in the Shell - Border:2 Ghost Whispers","synopsis":"Second movie of Ghost in the Shell: Arise.\n\nFreed of her responsibilities with the 501 Organization, Motoko Kusanagi must now learn how to take orders from Aramaki. Someone hacks the Logicomas, and Batou enlists the help of former army intelligence officer Ishikawa and former air artillery expert Borma. Kusanagi also seeks to enlist ace sniper Saito and undercover cop Paz into the new Public Security Section 9. The two groups rival each other in a case involving a man who receives false memories of a refugee transport operation.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/8/52135.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.55,"genres":["Sci-Fi","Police","Psychological","Mecha"]},{"title":"Psycho-Pass: Sinners of the System Case.2 - First Guardian","synopsis":"Enforcer Teppei Sugou, former ace pilot of the National Defence Army's 15th Integrated Task Force, is visited by a scout from the Ministry of Foreign Affairs and invited to rejoin the military. While considering the offer, he recalls his last months of service.\n\nHis last mission, Operation Foot Stamp, had been a highly classified military strike against the Southeast Asian Union. The operation quickly went south for the ground forces, and Sugou's First Guardian drone was ordered in as air support to drop emergency supplies for the ground units and then return to base. Following orders against his own judgement, Sugou abandoned his comrades on the field.\n\nMany lives were lost during the operation, including Itsuki Otomo, Sugou's commanding officer. However, three months later, following a massacre at the Ministry of Defence, Otomo was spotted at the scene on camera. Now a suspect in an act of terrorism, Sugou cooperates with Enforcer Tomomi Masaoka and CID Division One as they hunt his former mentor down.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1357/96879.webp","source":"Original","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.53,"genres":["Action","Police","Psychological","Sci-Fi"]},{"title":"Beastars 2nd Season","synopsis":"Second season of Beastars","img":"https://cdn.myanimelist.net/images/anime/1266/105286.webp","source":"Manga","numberOfEpisode":"?","studio":"Orange","type":"TV","score":null,"genres":["Slice of Life","Psychological","Drama","Shounen"]},{"title":"Koukaku Kidoutai: Shin Movie","synopsis":"In the year 2027, a year following the end of the non-nuclear World War IV, a bomb has gone off in Newport City, killing a major arms dealer who may have ties with the mysterious 501 Organization. Public Security official Daisuke Aramaki hires full-body cyber prosthesis user and hacker extraordinaire, Motoko Kusanagi, to investigate.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/2/72690.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.52,"genres":["Action","Sci-Fi","Police","Psychological","Mecha"]},{"title":"Koukaku Kidoutai Arise: Alternative Architecture","synopsis":"A TV anime version of Ghost in the Shell: Arise. The first eight episodes are an edited version of the four movies while the last two features a new arc called \"Pyrophoric Cult.\"\n\nThe plot involves the \"Fire Starter\" virus explored previously, and introduces the new character Pyromania. The episode will have ties to the upcoming film.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/5/72037.webp","source":"Manga","numberOfEpisode":"10","studio":"Production I.G","type":"TV","score":7.28,"genres":["Sci-Fi","Police","Psychological","Mecha"]},{"title":"Koukaku Kidoutai Arise: Ghost in the Shell - Border:3 Ghost Tears","synopsis":"Third movie of Ghost in the Shell: Arise.\n\nMotoko and Batou work to try to stop a terrorist organization whose symbol is the Scylla. Meanwhile, Togusa investigates a murder of a man who possessed a prosthetic leg manufactured by the Mermaid's Leg corporation.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/9/56607.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.4,"genres":["Sci-Fi","Police","Psychological","Mecha"]},{"title":"Mugen no Ryvius","synopsis":" The year is AD 2225. Kouji Aiba and Aoi Housen are serving as astronauts in-training in Liebe Delta which is located on the edge of the Geduld Sea. When saboteurs with unknown intents suddenly strike during a routine dive procedure, the space station plummets into the Geduld, a plasma field that links all the planets like a nervous system and crushes any ship that strays too far into it. With all the adults onboard killed, the young astronauts will have to survive this long journey home in midst of the growing tension amongst each other. Meanwhile the organizers of the sabotage look on and prepare to attack once more. \n","img":"https://cdn.myanimelist.net/images/anime/3/16734.webp","source":"Original","numberOfEpisode":"26","studio":"Sunrise","type":"TV","score":7.5,"genres":["Drama","Mecha","Military","Psychological","Sci-Fi","Space"]},{"title":"Mardock Scramble: The Second Combustion","synopsis":"Rune Balot is weeping and trying to save both herself and a severely injured Oeufcoque from Shell's assassin Boiled. Luckily for her, Doctor Easter finally shows up in the Humpty Dumpty – a special militarized vehicle made for protecting those in Welfare cases if their lives are threatened. From there they go to Paradise, where the Scramble 09 technology (and Boiled's rebirth) was developed. All of the secrets of the past of Mardock City (and possibly its future) are revealed in this riveting second part of the Mardock Scramble series, upping the stakes and making Balot choose between justice for herself or peace within Paradise instead.\n\n(Source: the witch of theatregoing)","img":"https://cdn.myanimelist.net/images/anime/11/29197.webp","source":"Novel","numberOfEpisode":"1","studio":"GoHands","type":"Movie","score":7.4,"genres":["Action","Psychological","Sci-Fi"]},{"title":"Gyakusatsu Kikan","synopsis":"The war on terror exploded, literally, the day Sarajevo was destroyed by a homemade nuclear device. The leading democracies transformed into total surveillance states, and the developing world has drowned under a wave of genocides. The mysterious American John Paul seems to be behind the collapse of the world system, and it's up to intelligence agent Clavis Shepherd to track John Paul across the wreckage of civilizations and to find the true heart of darkness—a genocidal organ.\n\n(Source: Viz Media)","img":"https://cdn.myanimelist.net/images/anime/12/83309.webp","source":"Novel","numberOfEpisode":"1","studio":"Geno Studio","type":"Movie","score":7.2,"genres":["Military","Sci-Fi","Psychological"]},{"title":"Madlax","synopsis":"In the country of Gazth-Sonika, civil war rages. There, a mercenary called Madlax plies her trade, with almost supernatural skill. In the seemingly peaceful country of Nafrece, Margaret Burton lives a tranquil life. As separate as their lives may seem, the two are connected by ties of mystery, and by a holy book that is also sought by the shadowy organisation, Enfant. As Margaret and Madlax follow the path of their destiny, they come ever closer to uncovering the truth - with no guarantee that it is a truth they can bear to learn.\n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/12/57237.webp","source":"Original","numberOfEpisode":"26","studio":"Bee Train","type":"TV","score":7.09,"genres":["Military","Mystery","Psychological","Supernatural","Drama","Magic","Shounen"]},{"title":"B: The Beginning 2","synopsis":"Second season of B: The Beginning.","img":"https://cdn.myanimelist.net/images/anime/1594/93194.webp","source":"Original","numberOfEpisode":"12","studio":"Production I.G","type":"ONA","score":null,"genres":["Action","Mystery","Police","Psychological","Supernatural","Thriller"]},{"title":"Koukaku Kidoutai: Stand Alone Complex - The Laughing Man","synopsis":"In 2024, the terrorist incident known as \"The Laughing Man Incident\" occurred in which Ernest Serano, president of the groundbreaking micromachine company, Serano Genomics, was kidnapped and ransomed. One day, the case having remained unsolved for six years, Detective Yamaguchi, who has been investigating \"The Laughing Man Incident,\" sends word that he wants to meet with Togusa from Public Safety Section 9. However, soon after sending this message, Yamaguchi, crucial to the success of the case, dies in an accident. Many days pass and in the midst of a police interview relay concerning suspicions behind interceptors, a forewarning is received from \"The Laughing Man\" of his next crime. The incorporeal hacker begins to move once again.\n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/3/21835.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"Special","score":8.11,"genres":["Action","Sci-Fi","Mystery","Police","Psychological","Mecha","Seinen"]},{"title":"Koukaku Kidoutai Arise: Ghost in the Shell - Border:4 Ghost Stands Alone","synopsis":"The story of this fourth installment takes place amidst signs of postwar reconstruction in the winter of 2028. Tensions are rising in New Port City as demonstrations are held concerning the interests of foreign cartels. This leads to a shooting incident involving riot police. It all started with a cyberbrain infection released by the terrorist \"Fire Starter.\" An independent offensive unit led by Motoko Kusanagi entrusts the suppression of the situation to their ghosts and aims for their own justice. Below the surface of the incident, lies the \"tin girl\" Emma and the \"scarecrow man\" Burinda Junior. As Kusanagi deals with the incident, she draws near to what those two ghosts were seeking.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/63993.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.48,"genres":["Sci-Fi","Police","Psychological","Mecha"]},{"title":"Kakurenbo","synopsis":"Among the high rises of steel pipes, meshed power lines, and faded neon lights, exists a game that children dare to play within the ruins of the old city.\n\n\"Otokoyo,\" a secret game of hide-and-seek, one where all who play wear fox masks and only begins when seven have gathered. But it is no normal game, as all who have played it have gone missing. Many whisper it is the work of demons, but that is just a rumor... or is it?\n\nKakurenbo follows the story of seven children as they play Otokoyo for the first time and discover why if you play, you never return.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/18917.webp","source":"Original","numberOfEpisode":"1","studio":"Yamato Works","type":"Movie","score":6.81,"genres":["Horror","Psychological","Supernatural"]},{"title":"Kino no Tabi: The Beautiful World - Tou no Kuni - Free Lance","synopsis":"Waking up from a nap, Kino is relieved to see that a certain tower from afar is still proudly standing. Located in the heart of the Tower Country, the immensely tall tower stretches high into the sky, reaching seemingly infinite heights. The tower looks like something out of a dream, but the breathtaking construction is unmistakably real. Intrigued, the traveling partners Kino and Hermes—the talking motorcycle—journey to the tower to get a closer look at the building.\n\nDespite already being unbelievably tall, the tower is still being built by the townspeople to this day. Puzzled by the origins of the tower, Kino and Hermes ask around the town for information, but they fail to obtain any definitive answer. They continue to observe both the tower and the townspeople during their stay, hoping to understand the reasoning behind building a tower that requires so much effort. After all, there is always something to learn... even from the strangest of countries.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/62873.webp","source":"Light novel","numberOfEpisode":"1","studio":"A.C.G.T.","type":"Special","score":7.62,"genres":["Adventure","Psychological","Fantasy"]},{"title":"Mardock Scramble: The Third Exhaust","synopsis":"The final plans to finish Shell off in court have been made by Easter, Balot, and Oeufcoque. But in order to execute those plans, they must set foot into Shell's domain: the BlueEgg Casino in the center of Mardock City, and find the chip where his memories lie. If they can't find the chip, their case will be dismissed in court, and their \"usefulness\" will be gone – resulting in all of their deaths. Will Balot find the chip in time, while still dodging Boiled and his now mad search for her and Oeufcoque?\n\n(Source: the witch of theatregoing)","img":"https://cdn.myanimelist.net/images/anime/12/39309.webp","source":"Novel","numberOfEpisode":"1","studio":"GoHands","type":"Movie","score":7.48,"genres":["Action","Psychological","Sci-Fi"]},{"title":"Imawa no Kuni no Alice (OVA)","synopsis":"Ryouhei Arisu is a high school student with no ambitions and just wants to escape from what he feels is a meaningless reality. One night when he is with his two friends Daikichi Karube and Chouta Segawa, they see an abnormally large firework shoot into the sky, an event which signals a permanent change in their lives.\n\nBlinded by the incredibly bright explosion, the three find themselves transported to what is known as the Borderland. The only inhabitants of this world are participants of a deadly game where specific tasks must be accomplished if they wish to survive. As the three begin playing to determine how they can get back home, Ryouhei finds himself feeling alive for the very first time in his life.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1004/96669.webp","source":"Manga","numberOfEpisode":"3","studio":"Connect","type":"OVA","score":7.55,"genres":["Action","Psychological","Supernatural","Thriller","Shounen"]},{"title":"Towa no Quon 3: Mugen no Renza","synopsis":"The story follows a boy named Quon and others who suddenly wake up with supernatural powers.","img":"https://cdn.myanimelist.net/images/anime/7/32945.webp","source":"Original","numberOfEpisode":"1","studio":"Bones","type":"Movie","score":7.53,"genres":["Action","Sci-Fi","Super Power","Psychological","Supernatural"]},{"title":"Kyougoku Natsuhiko: Kousetsu Hyaku Monogatari","synopsis":"Tired of writing riddles for children, Yamaoka Momosuke plans on gathering spooky and gruesome stories and publishing them in an anthology called Hyakumonogatari (\"One Hundred Tales\"). While researching these old myths and legends he comes across a mysterious trio who call themselves the Ongyou. They are detectives who are investigating the legends to reveal their truths...and bring those in the wrong to justice. Each time Momosuke meets the Ongyou he must face horrible truths and battle with his morals, but he's seeing things he shouldn't be seeing... \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/30681.webp","source":"Novel","numberOfEpisode":"13","studio":"TMS Entertainment","type":"TV","score":7.17,"genres":["Fantasy","Historical","Horror","Mystery","Psychological","Supernatural"]},{"title":"Genius Party","synopsis":"A collection of seven individual and unique shorts which range from touching to downright bizarre. With each story different from the last, we encounter monsters going to school, a man who has a hard time dealing with himself, and a child who learns the hard way about the circle of life, as well as many other unique characters and experiences.\n\nA journey through the minds of the most prolific artists in Japan, this compilation truly is the setting of a Genius Party.\n \n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/20882.webp","source":"Original","numberOfEpisode":"7","studio":"Studio 4°C","type":"Movie","score":7.24,"genres":["Action","Sci-Fi","Music","Dementia","Psychological","Romance","Fantasy","Mecha"]},{"title":"Urahara","synopsis":"Three high school girls are putting together a limited-time shop called \"PARK\" in Japan's Harajuku. One day, aliens come to Earth with the intent to steal the famed district's culture. At the same time, a mysterious girl appears. The three girls band together to defeat the alien threat and protect their beloved Harajuku.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/88432.webp","source":"Web manga","numberOfEpisode":"12","studio":"EMT Squared","type":"TV","score":5.82,"genres":["Comedy","Fantasy","Psychological","Sci-Fi"]},{"title":"Psycho-Pass 3: First Inspector","synopsis":"The film will conclude the story of season 3 on the case of the \"Foxes\" being pursued by Unit 1, the Bifrost mystery, and Arata and Kei's battle.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1834/106107.webp","source":"Original","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.94,"genres":["Action","Sci-Fi","Police","Psychological"]},{"title":"Chuukan Kanriroku Tonegawa","synopsis":"Chuukan Kanriroku Tonegawa is a spin-off of the Kaiji series, which follows Tonegawa, the right hand man of Kazutaka Hyoudou, the president of the Teiai Corporation and owner of numerous gambling tournaments. After Hyoudou is getting bored with his life, he orders Tonegawa to organize a so called \"game of death\" as it is his and his subordinate's job to keep the president in a good mood. Tonegawa must cooperate with his subordinates in order to make the president happy and what follows is a humorous story of his interactions with his subordinates and other characters of the Kaiji series.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1072/93145.webp","source":"Manga","numberOfEpisode":"24","studio":"Madhouse","type":"TV","score":7.14,"genres":["Comedy","Parody","Psychological","Drama","Seinen"]},{"title":"Black Jack","synopsis":"Kuroo Hazama, also known as \"Black Jack,\" is a legend in the medical world. Famous for being one of the best, as well as not having a license, Hazama and his assistant Pinoko save countless lives that other doctors cannot... for a price; an exorbitant price, in fact, which causes many to view the genius as greedy and heartless. Despite these claims, however, none can deny his skill and the lengths that he will go to treat his patients. This dark medical drama tells the story of the ominous and mysterious world of underground medicine as Black Jack risks his life to cure some of the most bizarre diseases imaginable, even if it means breaking every law in the process.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/12978.webp","source":"Manga","numberOfEpisode":"12","studio":"Tezuka Productions","type":"OVA","score":7.77,"genres":["Drama","Mystery","Psychological","Thriller"]},{"title":"Night Head Genesis","synopsis":"It is said that 70% of the human brain capacity is unused. If humans possess incredible power, it is strongly believed to be lying dormant within this region. This unused 70% brain capacity is known as \"Night Head\".\n\nThe famous work 'NIGHT HEAD' is going to break the silence. They were abandoned by their parents because of the psychic power they possessed. They are the Kirihara brothers, who lived in a laboratory within a barrier-protected forest. They have escaped from the laboratory, and a new wave of 'Revolution' is about to arise.\n\nA new \"Night Head\" is about to be awakened.","img":"https://cdn.myanimelist.net/images/anime/9/23626.webp","source":"Manga","numberOfEpisode":"24","studio":"Bee Media","type":"TV","score":6.79,"genres":["Sci-Fi","Mystery","Psychological","Supernatural","Drama"]},{"title":"Alien 9","synopsis":"Soon after entering middle school, Yuri Otani is coerced into joining the \"Alien Party,\" a single-minded group with one goal: capture any alien attempting to enter school grounds. Terrified of aliens her entire life, Otani is anything but thrilled, and to make matters worse, her kit includes a \"Borg\"—an alien-like creature tasked with ensuring her safety. Despite this, she finds solace in her two partners: the independent and reliable Kumi Kawamura, and the smart and energetic Kasumi Tomine.\n\nAs the Alien Party works to fend off extraterrestrial threats, will their roller blades and lacrosse sticks be enough to overcome the dire challenges ahead, or will they succumb to fear and suffer the grim consequences of defeat?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/2607.webp","source":"Manga","numberOfEpisode":"4","studio":"J.C.Staff","type":"OVA","score":6.67,"genres":["Sci-Fi","Horror","Psychological","School"]},{"title":"Higurashi no Naku Koro ni (2020)","synopsis":"New Higurashi no Naku Koro ni anime project.","img":"https://cdn.myanimelist.net/images/anime/1808/105271.webp","source":"Visual novel","numberOfEpisode":"?","studio":"Passione","type":"TV","score":null,"genres":["Mystery","Dementia","Horror","Psychological","Supernatural","Thriller"]},{"title":"Oniisama e...","synopsis":"When 16-year-old Nanako Misonoo enters the prestigious all-girls Seiran Academy, she believes a bright future awaits her. Instead, the unlucky girl finds herself dragged into a web of deceit, misery, and jealousy. On top of that, she is chosen as the newest inductee of the Sorority, an elite group whose members are the envy of the entire school. Having none of the grace, wealth, or talent of the other members, Nanako quickly draws the ire of her jealous classmates—especially the fierce Aya Misaki.\n\nTo cope with her increasingly difficult school life, Nanako recalls her days through letters to her former teacher, Takehiko Henmi, whom she affectionately calls \"onii-sama\" (big brother). She also finds comfort with her four closest friends: her childhood friend Tomoko Arikura, the sociable but erratic Mariko Shinobu, the troubled musician Rei Asaka, and the athletic tomboy Kaoru Orihara.\n\nAn impassioned drama about the hardships of bullying, Oniisama e... chronicles a young girl's harsh life at her new school, as she endures cruel rumours, heartless classmates, and countless social trials.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/18531.webp","source":"Manga","numberOfEpisode":"39","studio":"Tezuka Productions","type":"TV","score":7.79,"genres":["Psychological","Drama","School","Shoujo","Shoujo Ai"]},{"title":"Genocyber","synopsis":"As the nations of the world begin to merge, world peace is threatened by the private armies of individual corporations. The Kuryu Group has just discovered a weapon that will tip world power in their favor. The Genocyber: a nightmarish combination of cybernetics and psychic potential. Many desire to control this monstrosity, but can its hatred be contained... Battle erupts, and the cyberpunk world of the future is about to explode with violence.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/3751.webp","source":"Manga","numberOfEpisode":"5","studio":"Artmic","type":"OVA","score":5.88,"genres":["Action","Sci-Fi","Horror","Psychological","Mecha"]},{"title":"Lostorage Conflated WIXOSS","synopsis":"The peaceful days turn out to be short-lived as the shadow of another Selector Battle looms large. Kiyoi Mizushima is the first to notice that things are amiss, and she makes her move to put an end to the cycle of darkness.The Battle this time includes a new card, \"Key,\" and has been set up with rules different than before. With both the mastermind and their motive shrouded in mystery, the darkness grows ever deeper and more menacing. Suzuko Homura, Chinatsu Morishita, Hanna Mikage, Ruuko Kominato, Yuzuki Kurebayashi, Hitoe Uemura, and Akira Aoi, the Selectors gather once again.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1558/90899.webp","source":"Card game","numberOfEpisode":"12","studio":"J.C.Staff","type":"TV","score":7.13,"genres":["Game","Psychological"]},{"title":"DRAMAtical Murder: Data_xx_Transitory","synopsis":"Data xx Transitory is the thirteenth and bonus episode of the DRAMAtical Murder animation. It features all of the bad endings from the original game.\n\n(Source: DRAMAtical Murder Wiki)","img":"https://cdn.myanimelist.net/images/anime/12/65081.webp","source":"Visual novel","numberOfEpisode":"1","studio":"NAZ","type":"Special","score":6.12,"genres":["Sci-Fi","Psychological","Drama","Shounen Ai"]},{"title":"Uta∽Kata","synopsis":"It's the last day of the school term in Kamakura Girl's School, and summer is about to begin. Serious but polite 14-year-old Ichika Tachibana is excited to make her summer vacation with her friends a special break to remember! But little does Ichika know that this summer will be more special than she could have ever imagined.\n\nWhile cleaning in an unused school building, Ichika notices an image of an unfamiliar girl in place of her own reflection in a large mirror. Convinced by her friends that she was just seeing things, she is surprised to see the girl in the mirror later that day, holding her lost cell phone. Introducing herself as Manatsu Kuroki, she comes out of the mirror and hands Ichika's phone back—and to Ichika's surprise, the stones on her cell phone charm have changed colors and now allow her to borrow the power of the 12 Djinn that watch over the world.\n\nUta Kata is a tale of a young girl who will realize new things through her interactions with these spirits. As the Djinn show her overwhelming sights, they will soon also bring to her overwhelming thoughts...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/25392.webp","source":"Original","numberOfEpisode":"12","studio":"Hal Film Maker","type":"TV","score":6.76,"genres":["Psychological","Drama","Magic"]},{"title":"Mizu no Kotoba","synopsis":"Several people are spending their evening in a cafe. Two gossiping girls, two debating men, a bookworm and a boy, who just broke up with his girlfriend. The cafe's waitress starts a chat with him, persuading him to take a look at certain easel, while other customers begin to notice unusual things.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/13/76137.webp","source":"Original","numberOfEpisode":"1","studio":"Studio Rikka","type":"Special","score":6.85,"genres":["Drama","Psychological","Sci-Fi"]},{"title":"ChäoS;Child Episode 0","synopsis":"A recap of ChäoS;HEAd that aired along with episode 1 of ChäoS;Child as part of a one-hour special. A separate volume will be release on March 26, 2017.","img":"https://cdn.myanimelist.net/images/anime/9/83904.webp","source":"Visual novel","numberOfEpisode":"1","studio":"Silver Link.","type":"Special","score":6.3,"genres":["Sci-Fi","Mystery","Psychological","Supernatural"]},{"title":"Mahou Shoujo Madoka★Magica: Concept Movie","synopsis":"A short four-minute concept film that served as a surprise unveil at Studio SHAFT's 40th anniversary event in Winter 2015, Madogatari. The concept movie is the core of a new Madoka Magica project, and serves as its trailer. The second short was later screened in Osaka, with the difference being a replacement of several imageboard segments.","img":"https://cdn.myanimelist.net/images/anime/12/77732.webp","source":"Original","numberOfEpisode":"1","studio":"Shaft","type":"Movie","score":7.13,"genres":["Drama","Magic","Psychological","Thriller"]},{"title":"Tytania","synopsis":"One Man vs. an Empire!  Through fear and conquest, the Empire of Valdana holds the future of most of human space within its iron hands, and for generations, those hands have belonged to the Landless Lords of the ruling Tytania dynasty.  \n\nBut now the foundation of the empire is crumbling, pockets of rebellion are forming and when a mission sent to punish the city-state of Euriya is shockingly defeated, the man responsible becomes the target of a galaxy-wide manhunt!  \n\nFor Fan Hyurlick, architect of Tytania's first defeat, glory becomes desperation as his own side betrays him.  Now Fan must not only save his own life, but somehow turn the tables on opponents who have whole worlds to command!\n\n(Source: Sentai Filmworks)","img":"https://cdn.myanimelist.net/images/anime/7/10435.webp","source":"Light novel","numberOfEpisode":"26","studio":"Artland","type":"TV","score":6.84,"genres":["Adventure","Military","Psychological","Romance","Sci-Fi","Space"]},{"title":"Boku dake ga Inai Machi Recap","synopsis":"A recap episode of Boku dake ga Inai Machi covering episodes 1 to 6. Also known as episode 6.5.","img":"https://cdn.myanimelist.net/images/anime/2/86477.webp","source":"Manga","numberOfEpisode":"1","studio":"A-1 Pictures","type":"ONA","score":7.2,"genres":["Mystery","Psychological","Supernatural","Seinen"]},{"title":"Gasaraki","synopsis":"The flames of war explode in the Middle East as two shadow forces unleash monstrous new weapons of mass destruction! But in a world in which giant robots are real, the most dangerous weapon of all lies buried within a human mind. Yuushirou, the fourth son of the mysterious and powerful Gouwa family, finds himself at the center of events that will change the future of mankind forever! Nothing can prepare the human race for what is about to be unleashed in Gasaraki!\n\n(Source: Sunrise)","img":"https://cdn.myanimelist.net/images/anime/1790/91070.webp","source":"Original","numberOfEpisode":"25","studio":"Sunrise","type":"TV","score":6.66,"genres":["Psychological","Mecha","Military","Supernatural","Drama"]},{"title":"Kuro no Sumika: Chronus","synopsis":"Makoto Nakazono is a high school student with a small dark secret. Since he was little, he has had the mysterious power to see \"black entities\" that steal souls.\n\nOne day, he is suddenly interrogated by one of the \"black entities,\" Akira Seno: \"Will you get in our way?\"\n\nBut Makoto replies with an air of resignation, \"There's nothing I can do anyway, so I won't.\"\n\nAt that moment, Makoto didn't notice the threatening shadow approaching his childhood friend Hazuki...\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/55167.webp","source":"Original","numberOfEpisode":"1","studio":"Studio 4°C","type":"Movie","score":6.87,"genres":["Psychological"]},{"title":"Boukyaku no Senritsu","synopsis":"A great war occurred in the 20th century between humans and monsters. Since that time, the monsters rule the world in fear but keep relatively hidden from public view. A boy named Bokka ponders the past and wonders what became of the Meros Warriors who defended the world so bravely against the demons. He soon meets Kurofune and learns of the power of the Meros and the I-bar machines they ride in battle. Warriors are the only ones who can see and hear the Melody of Oblivion, a phantom girl hidden away waiting to be rescued and be the savior of mankind. During a battle between Kurofune and a demon, Bokka discovers something only his wildest dreams could possibly imagine...he too can hear that melody. Throughout his journeys, Bokka meets many monsters and their agents, friends, and companions as he discovers the true extent of his new powers. He must continue to battle evil in the hope of releasing Boukyaku no Senritsu and free a world that has forgotten its once beautiful melody.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/52679.webp","source":"Manga","numberOfEpisode":"24","studio":"Gainax","type":"TV","score":6.36,"genres":["Adventure","Fantasy","Horror","Mecha","Psychological","Sci-Fi","Shounen","Space","Supernatural"]},{"title":"Top Secret: The Revelation","synopsis":"A newly developed method allows to display the memories of dead people. It is used to solve difficult murder cases. But at what cost? What of the dead's privacy as strangers poke about in their most private memories? What about the effects the imageries may have on the persons whose jobs require going through psychotic murderers' minds and experience whatever emotions and feelings these murderers felt as they skin and disembowel their victims?\n\n(Source: Adapted from manga description)","img":"https://cdn.myanimelist.net/images/anime/6/21702.webp","source":"Manga","numberOfEpisode":"26","studio":"Madhouse","type":"TV","score":7.34,"genres":["Sci-Fi","Mystery","Police","Psychological","Shoujo"]},{"title":"Devilman Lady","synopsis":"Fudo Jun is a beautiful supermodel who is idolized by many. She also has a dark secret that not even she knows about at first, for within her veins run the genes that hold the next step in the evolution of mankind. The same blood as the beastlike superhumans that terrorize the city. Unlike the rest of them, though, Jun has managed to hold a tenuous grip onto her humanity, and she is recruited by the mysterious Asuka Ran, member of a secret organization within the government, aimed at controlling, if not eliminating, these berserk destroyers of mankind. Jun, as Devilman Lady, must now exterminate her own kind, but how much longer can she keep her sanity in a situation she never chose in the first place?\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/2/18370.webp","source":"Manga","numberOfEpisode":"26","studio":"TMS Entertainment","type":"TV","score":6.7,"genres":["Action","Psychological","Drama","Horror"]},{"title":"Inaka Isha","synopsis":"A hapless country doctor describes with breathless urgency a night-time summons to attend a young patient. Events soon take on a surreal aspect as \"unearthly horses\" transport him instantaneously to the bedside. The doctor, preoccupied with personal distractions and grievances against those he is employed to care for, fails to find what is revealed to be a vile, fatal wound. He is humiliated by the villagers, who are \"always expecting the impossible from the doctor,\" and doomed to an endless return trip, losing everything. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/5344.webp","source":"Other","numberOfEpisode":"1","studio":"Studio Deen","type":"Movie","score":6.74,"genres":["Dementia","Drama","Historical","Psychological"]},{"title":"Amon: Devilman Mokushiroku","synopsis":"Fear runs rampant throughout Tokyo with the revelation that demons in fact exist amongst us. Paranoia and the darker side of humanity boils onto the streets as people turn on one another, suspecting that anyone could in fact be a demon hiding in human clothing. Amidst the growing tensions, tragedy strikes Akira causing his mind to snap, retreating into his subconscious, allowing his Devilish alter-ego Amon to break free from Akira's cage of flesh and wreak havoc on both human and demons alike. ","img":"https://cdn.myanimelist.net/images/anime/1311/91101.webp","source":"Manga","numberOfEpisode":"1","studio":"Studio Live","type":"OVA","score":6.49,"genres":["Demons","Horror","Psychological","Supernatural"]},{"title":"Selector Destructed WIXOSS Movie","synopsis":"This movie is a retelling/summary of Selector Infected and Spread, with extra scenes interspersed such as the characters in childhood. Despite mostly being previously used scenes, they were cut and altered to make a high intensity and fast paced story, highlighting the moments of slow silence and reflection. Some changes were made such as the true origin of Tama's name, the significance of Sachi and Rumi, and the relationship between your name and being alone.\n\n(Source: Asenshi)","img":"https://cdn.myanimelist.net/images/anime/3/83118.webp","source":"Card game","numberOfEpisode":"1","studio":"J.C.Staff","type":"Movie","score":7.24,"genres":["Game","Psychological"]},{"title":"Shigofumi: Sore kara","synopsis":"The 13th episode of Shigofumi.","img":"https://cdn.myanimelist.net/images/anime/11/9064.webp","source":"Original","numberOfEpisode":"1","studio":"J.C.Staff","type":"Special","score":7.37,"genres":["Drama","Fantasy","Psychological","Thriller"]},{"title":"ChäoS;Child: Silent Sky","synopsis":"Silent Sky is a combination of the additional episodes 13 and 14. It consists of the story in the future, three months after the incident that was similar to \"New Generation Madness\" and the disease Chaos Child Syndrome that brought by the past earthquake in Shibuya.","img":"https://cdn.myanimelist.net/images/anime/9/88031.webp","source":"Visual novel","numberOfEpisode":"1","studio":"Silver Link.","type":"Movie","score":6.64,"genres":["Sci-Fi","Mystery","Psychological","Supernatural"]},{"title":"Sentou Yousei Yukikaze","synopsis":"This full 3DCG digital animation has story takes place in the far future after a pillar of huge fog appeared suddenly in the South Pole. This pillar, known as Jam, is actually a passage for an earth invasion.\n\nIn order to oppose the threat, the United Nations established an earth defense mechanism. Fukai Zero is a hero registered to the main force of earth defense and the special 5th flight squadron. His reconnaissance plane, Yukikaze (windblown snow) is the best tactical reconnaissance plane. His job is to collect battle information return safely to the base with the information. But one day when he about to finish his duty, an unidentified machine attacked him...\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/7/32707.webp","source":"Novel","numberOfEpisode":"5","studio":"Gonzo","type":"OVA","score":7.21,"genres":["Action","Drama","Military","Psychological","Sci-Fi","Space"]},{"title":"Death Note","synopsis":"A shinigami, as a god of death, can kill any person—provided they see their victim's face and write their victim's name in a notebook called a Death Note. One day, Ryuk, bored by the shinigami lifestyle and interested in seeing how a human would use a Death Note, drops one into the human realm.\n\nHigh school student and prodigy Light Yagami stumbles upon the Death Note and—since he deplores the state of the world—tests the deadly notebook by writing a criminal's name in it. When the criminal dies immediately following his experiment with the Death Note, Light is greatly surprised and quickly recognizes how devastating the power that has fallen into his hands could be.            \n\nWith this divine capability, Light decides to extinguish all criminals in order to build a new world where crime does not exist and people worship him as a god. Police, however, quickly discover that a serial killer is targeting criminals and, consequently, try to apprehend the culprit. To do this, the Japanese investigators count on the assistance of the best detective in the world: a young and eccentric man known only by the name of L.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/9453.webp","source":"Manga","numberOfEpisode":"37","studio":"Madhouse","type":"TV","score":8.63,"genres":["Mystery","Police","Psychological","Supernatural","Thriller","Shounen"]},{"title":"Tokyo Ghoul","synopsis":"Tokyo has become a cruel and merciless city—a place where vicious creatures called “ghouls” exist alongside humans. The citizens of this once great metropolis live in constant fear of these bloodthirsty savages and their thirst for human flesh. However, the greatest threat these ghouls pose is their dangerous ability to masquerade as humans and blend in with society.\n\nBased on the best-selling supernatural horror manga by Sui Ishida, Tokyo Ghoul follows Ken Kaneki, a shy, bookish college student, who is instantly drawn to Rize Kamishiro, an avid reader like himself. However, Rize is not exactly who she seems, and this unfortunate meeting pushes Kaneki into the dark depths of the ghouls' inhuman world. In a twist of fate, Kaneki is saved by the enigmatic waitress Touka Kirishima, and thus begins his new, secret life as a half-ghoul/half-human who must find a way to integrate into both societies.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/64449.webp","source":"Manga","numberOfEpisode":"12","studio":"Studio Pierrot","type":"TV","score":7.86,"genres":["Action","Mystery","Horror","Psychological","Supernatural","Drama","Seinen"]},{"title":"Mirai Nikki","synopsis":"Lonely high school student, Yukiteru Amano, spends his days writing a diary on his cellphone, while conversing with his two seemingly imaginary friends Deus Ex Machina, who is the god of time and space, and Murmur, the god's servant. Revealing himself to be an actual entity, Deus grants Yukiteru a \"Random Diary,\" which shows highly descriptive entries based on the future and forces him into a bloody battle royale with 11 other holders of similarly powerful future diaries.\n\nWith the last person standing designated as the new god of time and space, Yukiteru must find and kill the other 11 in order to survive. He reluctantly teams up with his obsessive stalker Yuno Gasai (who also possesses such a diary), and she takes it upon herself to ensure his safety. But there's more to the girl than meets the eye, as she might have other plans for her unrequited love...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/33465.webp","source":"Manga","numberOfEpisode":"26","studio":"Asread","type":"TV","score":7.67,"genres":["Action","Mystery","Psychological","Shounen","Supernatural","Thriller"]},{"title":"Re:Zero kara Hajimeru Isekai Seikatsu","synopsis":"When Subaru Natsuki leaves the convenience store, the last thing he expects is to be wrenched from his everyday life and dropped into a fantasy world. Things aren't looking good for the bewildered teenager; however, not long after his arrival, he is attacked by some thugs. Armed with only a bag of groceries and a now useless cell phone, he is quickly beaten to a pulp. Fortunately, a mysterious beauty named Satella, in hot pursuit after the one who stole her insignia, happens upon Subaru and saves him. In order to thank the honest and kindhearted girl, Subaru offers to help in her search, and later that night, he even finds the whereabouts of that which she seeks. But unbeknownst to them, a much darker force stalks the pair from the shadows, and just minutes after locating the insignia, Subaru and Satella are brutally murdered.\n\nHowever, Subaru immediately reawakens to a familiar scene—confronted by the same group of thugs, meeting Satella all over again—the enigma deepens as history inexplicably repeats itself.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/79410.webp","source":"Light novel","numberOfEpisode":"25","studio":"White Fox","type":"TV","score":8.32,"genres":["Psychological","Drama","Thriller","Fantasy"]},{"title":"Boku dake ga Inai Machi","synopsis":"When tragedy is about to strike, Satoru Fujinuma finds himself sent back several minutes before the accident occurs. The detached, 29-year-old manga artist has taken advantage of this powerful yet mysterious phenomenon, which he calls \"Revival,\" to save many lives.\n \nHowever, when he is wrongfully accused of murdering someone close to him, Satoru is sent back to the past once again, but this time to 1988, 18 years in the past. Soon, he realizes that the murder may be connected to the abduction and killing of one of his classmates, the solitary and mysterious Kayo Hinazuki, that took place when he was a child. This is his chance to make things right.\n \nBoku dake ga Inai Machi follows Satoru in his mission to uncover what truly transpired 18 years ago and prevent the death of his classmate while protecting those he cares about in the present.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/77957.webp","source":"Manga","numberOfEpisode":"12","studio":"A-1 Pictures","type":"TV","score":8.45,"genres":["Mystery","Psychological","Supernatural","Seinen"]},{"title":"Elfen Lied","synopsis":"Lucy is a special breed of human referred to as \"Diclonius,\" born with a short pair of horns and invisible telekinetic hands that lands her as a victim of inhumane scientific experimentation by the government. However, once circumstances present her an opportunity to escape, Lucy, corrupted by the confinement and torture, unleashes a torrent of bloodshed as she escapes her captors.\n\nDuring her breakout, she receives a crippling head injury that leaves her with a split personality: someone with the mentality of a harmless child possessing limited speech capacity. In this state of instability, she stumbles upon two college students, Kouta and his cousin Yuka, who unknowingly take an injured fugitive into their care, unaware of her murderous tendencies. This act of kindness will change their lives, as they soon find themselves dragged into the shadowy world of government secrecy and conspiracy.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/6883.webp","source":"Manga","numberOfEpisode":"13","studio":"Arms","type":"TV","score":7.63,"genres":["Action","Horror","Psychological","Supernatural","Drama","Romance","Seinen"]},{"title":"Psycho-Pass","synopsis":"Justice, and the enforcement of it, has changed. In the 22nd century, Japan enforces the Sibyl System, an objective means of determining the threat level of each citizen by examining their mental state for signs of criminal intent, known as their Psycho-Pass. Inspectors uphold the law by subjugating, often with lethal force, anyone harboring the slightest ill-will; alongside them are Enforcers, jaded Inspectors that have become latent criminals, granted relative freedom in exchange for carrying out the Inspectors' dirty work.\n\nInto this world steps Akane Tsunemori, a young woman with an honest desire to uphold justice. However, as she works alongside veteran Enforcer Shinya Kougami, she soon learns that the Sibyl System's judgments are not as perfect as her fellow Inspectors assume. With everything she has known turned on its head, Akane wrestles with the question of what justice truly is, and whether it can be upheld through the use of a system that may already be corrupt.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/43399.webp","source":"Original","numberOfEpisode":"22","studio":"Production I.G","type":"TV","score":8.41,"genres":["Action","Sci-Fi","Police","Psychological"]},{"title":"Tokyo Ghoul √A","synopsis":"Ken Kaneki has finally come to accept the monstrous, flesh-craving part of himself that he has feared and despised for so long. After escaping captivity and torture, Kaneki joins Aogiri Tree—the very militant ghoul organization that had abducted him, leading his friends to question his true motive and loyalty.\n\nAs tension between the government and the ghouls continues to rise, the Commission of Counter Ghoul, the government's specialized anti-ghoul agency, has intensified their efforts to completely purge Tokyo of ghouls. This threatens the transient peace of Kaneki's friends and former comrades—the ghouls at the Anteiku coffee shop. Aware of the dangerous situation, Kaneki faces several battles that puts his precious fleeting humanity on the line.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/71777.webp","source":"Manga","numberOfEpisode":"12","studio":"Studio Pierrot","type":"TV","score":7.18,"genres":["Action","Mystery","Horror","Psychological","Supernatural","Drama","Seinen"]},{"title":"Kiseijuu: Sei no Kakuritsu","synopsis":"All of a sudden, they arrived: parasitic aliens that descended upon Earth and quickly infiltrated humanity by burrowing into the brains of vulnerable targets. These insatiable beings acquire full control of their host and are able to morph into a variety of forms in order to feed on unsuspecting prey.\n \nSixteen-year-old high school student Shinichi Izumi falls victim to one of these parasites, but it fails to take over his brain, ending up in his right hand instead. Unable to relocate, the parasite, now named Migi, has no choice but to rely on Shinichi in order to stay alive. Thus, the pair is forced into an uneasy coexistence and must defend themselves from hostile parasites that hope to eradicate this new threat to their species.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/73178.webp","source":"Manga","numberOfEpisode":"24","studio":"Madhouse","type":"TV","score":8.46,"genres":["Action","Sci-Fi","Horror","Psychological","Drama","Seinen"]},{"title":"Death Parade","synopsis":"After death, there is no heaven or hell, only a bar that stands between reincarnation and oblivion. There the attendant will, one after another, challenge pairs of the recently deceased to a random game in which their fate of either ascending into reincarnation or falling into the void will be wagered. Whether it's bowling, darts, air hockey, or anything in between, each person's true nature will be revealed in a ghastly parade of death and memories, dancing to the whims of the bar's master. Welcome to Quindecim, where Decim, arbiter of the afterlife, awaits!\n\nDeath Parade expands upon the original one-shot intended to train young animators. It follows yet more people receiving judgment—until a strange, black-haired guest causes Decim to begin questioning his own rulings.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/71553.webp","source":"Original","numberOfEpisode":"12","studio":"Madhouse","type":"TV","score":8.21,"genres":["Game","Mystery","Psychological","Drama","Thriller"]},{"title":"Neon Genesis Evangelion","synopsis":"In the year 2015, the world stands on the brink of destruction. Humanity's last hope lies in the hands of Nerv, a special agency under the United Nations, and their Evangelions, giant machines capable of defeating the Angels who herald Earth's ruin. Gendou Ikari, head of the organization, seeks compatible pilots who can synchronize with the Evangelions and realize their true potential. Aiding in this defensive endeavor are talented personnel Misato Katsuragi, Head of Tactical Operations, and Ritsuko Akagi, Chief Scientist.\n\nFace to face with his father for the first time in years, 14-year-old Shinji Ikari's average life is irreversibly changed when he is whisked away into the depths of Nerv, and into a harrowing new destiny—he must become the pilot of Evangelion Unit-01 with the fate of mankind on his shoulders.\n\nWritten by Hideaki Anno, Neon Genesis Evangelion is a heroic tale of a young boy who will become a legend. But as this psychological drama unfolds, ancient secrets beneath the big picture begin to bubble to the surface...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/21418.webp","source":"Original","numberOfEpisode":"26","studio":"Gainax","type":"TV","score":8.31,"genres":["Action","Dementia","Drama","Mecha","Psychological","Sci-Fi"]},{"title":"Mahou Shoujo Madoka★Magica","synopsis":"Madoka Kaname and Sayaka Miki are regular middle school girls with regular lives, but all that changes when they encounter Kyuubey, a cat-like magical familiar, and Homura Akemi, the new transfer student.\n\nKyuubey offers them a proposition: he will grant any one of their wishes and in exchange, they will each become a magical girl, gaining enough power to fulfill their dreams. However, Homura Akemi, a magical girl herself, urges them not to accept the offer, stating that everything is not what it seems.\n\nA story of hope, despair, and friendship, Mahou Shoujo Madoka★Magica deals with the difficulties of being a magical girl and the price one has to pay to make a dream come true.\n\n[Written by MAL Rewrite] ","img":"https://cdn.myanimelist.net/images/anime/11/55225.webp","source":"Original","numberOfEpisode":"12","studio":"Shaft","type":"TV","score":8.4,"genres":["Psychological","Drama","Magic","Thriller"]},{"title":"Zankyou no Terror","synopsis":"Painted in red, the word \"VON\" is all that is left behind after a terrorist attack on a nuclear facility in Japan. The government is shattered by their inability to act, and the police are left frantically searching for ways to crack down the perpetrators. The public are clueless—until, six months later, a strange video makes its way onto the internet. In it, two teenage boys who identify themselves only as \"Sphinx\" directly challenge the police, threatening to cause destruction and mayhem across Tokyo. Unable to stop the mass panic quickly spreading through the city and desperate for any leads in their investigation, the police struggle to act effectively against these terrorists, with Detective Kenjirou Shibazaki caught in the middle of it all.\n\nZankyou no Terror tells the story of Nine and Twelve, the two boys behind the masked figures of Sphinx. They should not exist, yet they stand strong in a world of deception and secrets while they make the city fall around them, all in the hopes of burying their own tragic truth.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/64447.webp","source":"Original","numberOfEpisode":"11","studio":"MAPPA","type":"TV","score":8.15,"genres":["Mystery","Psychological","Thriller"]},{"title":"Yakusoku no Neverland","synopsis":"Surrounded by a forest and a gated entrance, the Grace Field House is inhabited by orphans happily living together as one big family, looked after by their \"Mama,\" Isabella. Although they are required to take tests daily, the children are free to spend their time as they see fit, usually playing outside, as long as they do not venture too far from the orphanage—a rule they are expected to follow no matter what. However, all good times must come to an end, as every few months, a child is adopted and sent to live with their new family... never to be heard from again.\n\nHowever, the three oldest siblings have their suspicions about what is actually happening at the orphanage, and they are about to discover the cruel fate that awaits the children living at Grace Field, including the twisted nature of their beloved Mama.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1125/96929.webp","source":"Manga","numberOfEpisode":"12","studio":"CloverWorks","type":"TV","score":8.68,"genres":["Sci-Fi","Mystery","Horror","Psychological","Thriller","Shounen"]},{"title":"Btooom!","synopsis":"Ryouta Sakamoto is unemployed and lives with his mother, his only real achievement being that he is Japan's top player of the popular online video game Btooom! However, his peaceful life is about to change when he finds himself stranded on an island in the middle of nowhere, with a small green crystal embedded in his left hand and no memory of how he got there. To his shock, someone has decided to recreate the game he is so fond of in real life, with the stakes being life or death.\n\nArmed with a bag full of unique bombs known as \"BIM,\" the players are tasked with killing seven of their fellow participants and taking their green crystals in order to return home. Initially condemning any form of violence, Ryouta is forced to fight when he realizes that many of the other players are not as welcoming as they may seem. Teaming up with Himiko, a fellow Btooom! player, they attempt to get off of the island together, coming closer and closer to the truth behind this contest of death.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/40977.webp","source":"Manga","numberOfEpisode":"12","studio":"Madhouse","type":"TV","score":7.46,"genres":["Action","Sci-Fi","Psychological","Seinen"]},{"title":"Danganronpa: Kibou no Gakuen to Zetsubou no Koukousei The Animation","synopsis":"Hope's Peak Academy is an elite high school that accepts only the most talented students. Individuals who successfully enroll receive their own unique titles, suitably reflective of their skills and traits. Of the fifteen candidates admitted to the peculiar school that year, Makoto Naegi is a completely ordinary individual who has been accepted by sheer chance, with the title of \"Super High School-Level Luck.\"\n\nNaegi and his fellow classmates are initially ecstatic to be chosen to study at this prestigious institution, but these feelings of happiness are short-lived. They are soon confronted by Monokuma, the principal and resident bear, who traps them inside the school. The pupils' hopes of escape and graduation hinge on one of them successfully murdering one of their peers without being discovered. However, if the killer is caught, he or she will be executed, and the remaining survivors will be left to continue the deathmatch until only a single victor remains.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/51463.webp","source":"Game","numberOfEpisode":"13","studio":"Lerche","type":"TV","score":7.36,"genres":["Mystery","Psychological","School"]},{"title":"Higurashi no Naku Koro ni","synopsis":"Keiichi Maebara has just moved to the quiet little village of Hinamizawa in the summer of 1983, and quickly becomes inseparable friends with schoolmates Rena Ryuuguu, Mion Sonozaki, Satoko Houjou, and Rika Furude. However, darkness lurks underneath the seemingly idyllic life they lead. \n\nAs the village prepares for its annual festival, Keiichi learns about the local legends surrounding it. To his horror, he discovers that there have been several murders and disappearances in the village in the recent years, and that they all seem to be connected to the festival and the village's patron god, Oyashiro. Keiichi tries to ask his new friends about these incidents, but they are suspiciously silent and refuse to give him the answers he needs. As more and more bizarre events occur, he wonders just what else his friends might be keeping from him, and if he can even trust them at all.\n\nWhen madness and paranoia begin taking root in Keiichi's heart, he will stumble straight into the mysteries at work in Higurashi no Naku Koro ni, a story that is told across multiple arcs.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/19634.webp","source":"Visual novel","numberOfEpisode":"26","studio":"Studio Deen","type":"TV","score":8.01,"genres":["Mystery","Dementia","Horror","Psychological","Supernatural","Thriller"]},{"title":"Shinsekai yori","synopsis":"Following a sudden outbreak of psychokinesis in 0.1% of the population, a rapid transformation swept the world. The godlike ability to manipulate matter remotely turned many power wielders to violence, inciting a long period of upheaval. Finally, after a chaotic era shaped by the rise and fall of oppressive regimes, the psychic humans were able to achieve a fragile peace by isolating their society, creating a new world bound by complex rules.\n\nIn the town of Kamisu 66, 12-year-old Saki Watanabe has just awakened to her powers and is relieved to rejoin her friends—the mischievous Satoru Asahina, the shy Mamoru Itou, the cheerful Maria Akizuki, and Shun Aonuma, a mysterious boy whom Saki admires—at Sage Academy, a special school for psychics. However, unease looms as Saki begins to question the fate of those unable to awaken to their powers, and the children begin to get involved with secretive matters such as the rumored Tainted Cats said to abduct children.\n\nShinsekai yori tells the unique coming-of-age story of Saki and her friends as they journey to grow into their roles in the supposed utopia. Accepting these roles, however, might not come easy when faced with the dark and shocking truths of society, and the impending havoc born from the new world.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/36775.webp","source":"Novel","numberOfEpisode":"25","studio":"A-1 Pictures","type":"TV","score":8.4,"genres":["Sci-Fi","Mystery","Horror","Psychological","Supernatural","Drama"]},{"title":"Kakegurui","synopsis":"Unlike many schools, attending Hyakkaou Private Academy prepares students for their time in the real world. Since many of the students are the children of the richest people in the world, the academy has its quirks that separate it from all the others. By day, it is a normal school, educating its pupils in history, languages, and the like. But at night, it turns into a gambling den, educating them in the art of dealing with money and manipulating people. Money is power; those who come out on top in the games stand at the top of the school.\n\nYumeko Jabami, a seemingly naive and beautiful transfer student, is ready to try her hand at Hyakkaou's special curriculum. Unlike the rest, she doesn't play to win, but for the thrill of the gamble, and her borderline insane way of gambling might just bring too many new cards to the table.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/86578.webp","source":"Manga","numberOfEpisode":"12","studio":"MAPPA","type":"TV","score":7.5,"genres":["Game","Mystery","Psychological","Drama","School","Shounen"]},{"title":"Kaguya-sama wa Kokurasetai: Tensai-tachi no Renai Zunousen","synopsis":"At the renowned Shuchiin Academy, Miyuki Shirogane and Kaguya Shinomiya are the student body's top representatives. Ranked the top student in the nation and respected by peers and mentors alike, Miyuki serves as the student council president. Alongside him, the vice president Kaguya—eldest daughter of the wealthy Shinomiya family—excels in every field imaginable. They are the envy of the entire student body, regarded as the perfect couple.\n\nHowever, despite both having already developed feelings for the other, neither are willing to admit them. The first to confess loses, will be looked down upon, and will be considered the lesser. With their honor and pride at stake, Miyuki and Kaguya are both equally determined to be the one to emerge victorious on the battlefield of love!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1295/106551.webp","source":"Manga","numberOfEpisode":"12","studio":"A-1 Pictures","type":"TV","score":8.42,"genres":["Comedy","Psychological","Romance","School","Seinen"]},{"title":"FLCL","synopsis":"Naota Nandaba is an ordinary sixth grader living in a city where nothing amazing ever seems to happen. After his brother Tasuku leaves town to play baseball in America, Naota takes it upon himself to look after everything Tasuku left behind—from his top bunk bed to his ex-girlfriend Mamimi Samejima, who hasn't stopped clinging to Naota since Tasuku left. \n\nLittle does Naota know, however, that his mundane existence is on the verge of being changed forever: enter Haruko Haruhara, a Vespa-riding, bass guitar-wielding, pink-haired psychopath whose first encounter with Naota leaves him with tire tracks on his back and a giant horn on his head. Though all he wants is some peace and quiet, when Haruko takes up residence at his parents' home, Naota finds himself dragged into the heart of the greatest battle for supremacy that Earth—and quite possibly the entire universe—has ever seen.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/77356.webp","source":"Original","numberOfEpisode":"6","studio":"Gainax","type":"OVA","score":8.03,"genres":["Action","Sci-Fi","Comedy","Parody","Dementia","Psychological","Mecha"]},{"title":"Monster","synopsis":"Dr. Kenzou Tenma, an elite neurosurgeon recently engaged to his hospital director's daughter, is well on his way to ascending the hospital hierarchy. That is until one night, a seemingly small event changes Dr. Tenma's life forever. While preparing to perform surgery on someone, he gets a call from the hospital director telling him to switch patients and instead perform life-saving brain surgery on a famous performer. His fellow doctors, fiancée, and the hospital director applaud his accomplishment; but because of the switch, a poor immigrant worker is dead, causing Dr. Tenma to have a crisis of conscience.\n\nSo when a similar situation arises, Dr. Tenma stands his ground and chooses to perform surgery on the young boy Johan Liebert instead of the town's mayor. Unfortunately, this choice leads to serious ramifications for Dr. Tenma—losing his social standing being one of them. However, with the mysterious death of the director and two other doctors, Dr. Tenma's position is restored. With no evidence to convict him, he is released and goes on to attain the position of hospital director. \n\nNine years later when Dr. Tenma saves the life of a criminal, his past comes back to haunt him—once again, he comes face to face with the monster he operated on. He must now embark on a quest of pursuit to make amends for the havoc spread by the one he saved.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/18793.webp","source":"Manga","numberOfEpisode":"74","studio":"Madhouse","type":"TV","score":8.72,"genres":["Drama","Horror","Mystery","Police","Psychological","Seinen","Thriller"]},{"title":"Tokyo Ghoul:re","synopsis":"Two years have passed since the CCG's raid on Anteiku. Although the atmosphere in Tokyo has changed drastically due to the increased influence of the CCG, ghouls continue to pose a problem as they have begun taking caution, especially the terrorist organization Aogiri Tree, who acknowledge the CCG's growing threat to their existence.\n\nThe creation of a special team, known as the Quinx Squad, may provide the CCG with the push they need to exterminate Tokyo's unwanted residents. As humans who have undergone surgery in order to make use of the special abilities of ghouls, they participate in operations to eradicate the dangerous creatures. The leader of this group, Haise Sasaki, is a half-ghoul, half-human who has been trained by famed special class investigator, Kishou Arima. However, there's more to this young man than meets the eye, as unknown memories claw at his mind, slowly reminding him of the person he used to be.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1063/95086.webp","source":"Manga","numberOfEpisode":"12","studio":"Pierrot Plus","type":"TV","score":6.8,"genres":["Action","Psychological","Supernatural","Mystery","Drama","Horror","Seinen"]},{"title":"NHK ni Youkoso!","synopsis":"Twenty-two-year-old college dropout Tatsuhiro Satou has been a hikikomori for almost four years now. In his isolation, he has come to believe in many obscure conspiracy theories, but there is one in particular which he holds unshakable faith in: the theory that the evil conspirator behind his shut-in NEET (Not in Employment, Education or Training) status is the Nihon Hikikomori Kyokai (NHK)—an evil and secret organization dedicated to fostering the spread of hikikomori culture.\n\nNHK ni Youkoso! is a psychological dramedy that follows Tatsuhiro as he strives to escape from the NHK's wicked machinations and the disease of self-wrought isolation, while struggling to even just leave his apartment and find a job. His unexpected encounter with the mysterious Misaki Nakahara might signal a reversal of fortune for Tatsuhiro, but with this meeting comes the inevitable cost of having to face his greatest fear—society.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/52675.webp","source":"Novel","numberOfEpisode":"24","studio":"Gonzo","type":"TV","score":8.35,"genres":["Comedy","Psychological","Drama","Romance"]},{"title":"Kotonoha no Niwa","synopsis":"On a rainy morning in Tokyo, Takao Akizuki, an aspiring shoemaker, decides to skip class to sketch designs in a beautiful garden. This is where he meets Yukari Yukino, a beautiful yet mysterious woman, for the very first time. Offering to make her new shoes, Takao continues to meet with Yukari throughout the rainy season, and without even realizing it, the two are able to alleviate the worries hidden in their hearts just by being with each other. However, their personal struggles have not disappeared completely, and as the end of the rainy season approaches, their relationship will be put to the test.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/79676.webp","source":"Original","numberOfEpisode":"1","studio":"CoMix Wave Films","type":"Movie","score":8.16,"genres":["Slice of Life","Psychological","Drama","Romance"]},{"title":"Neon Genesis Evangelion: The End of Evangelion","synopsis":"With the final Angel vanquished, Nerv has one last enemy left to face—the humans under Seele's command.\n\nLeft in a deep depression nearing the end of the original series, an indecisive Shinji Ikari struggles with the ultimatum presented to him: to completely accept mankind's existence, or renounce humanity's individuality. Meanwhile, at the core of a compromised Nerv, Gendou Ikari and Rei Ayanami approach Lilith in an attempt to realize their own ideals concerning the future of the world.\n\nThe End of Evangelion serves as an alternate ending to the polarizing final episodes of Neon Genesis Evangelion. With the fate of the universe hanging in the balance, the climactic final battle draws near.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/39305.webp","source":"Original","numberOfEpisode":"1","studio":"Gainax","type":"Movie","score":8.51,"genres":["Sci-Fi","Dementia","Psychological","Drama","Mecha"]},{"title":"Psycho-Pass 2","synopsis":"A year and a half after the events of the original sci-fi psychological thriller, Akane Tsunemori continues her work as an inspector—enforcing the Sibyl System's judgments. Joining her are new enforcers and junior inspector Mika Shimotsuki, a young woman blindly and inflexibly loyal to Sibyl. As Akane ponders both the nature of her job and the legitimacy of Sibyl's verdicts, a disturbing new menace emerges.\n\nA mysterious figure has discovered a way to control the Crime Coefficient—a number compiled from mental scans that allows Sibyl to gauge psychological health and identify potential criminals. Through these means, he is able to murder an enforcer, leaving behind a cryptic clue: \"WC?\" scrawled in blood on a wall.\n\nAkane and the rest of Division 1 soon find themselves playing a deadly game against their new foe, coming face-to-face with a conspiracy threatening not only the authority of the Sibyl System, but the very foundation of Akane's own convictions.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1197/100616.webp","source":"Original","numberOfEpisode":"11","studio":"Tatsunoko Production","type":"TV","score":7.46,"genres":["Action","Sci-Fi","Police","Psychological"]},{"title":"Zetsuen no Tempest","synopsis":"Yoshino Takigawa, an ordinary teenager, is secretly dating his best friend Mahiro's younger sister. But when his girlfriend Aika mysteriously dies, Mahiro disappears, vowing to find the one responsible and make them pay for murdering his beloved sister. Yoshino continues his life as usual and has not heard from Mahiro in a month—until he is confronted by a strange girl who holds him at gunpoint, and his best friend arrives in the nick of time to save him.\n\nYoshino learns that Mahiro has enlisted the help of a witch named Hakaze Kusaribe to find Aika's killer and of the existence of an entity known as the \"Tree of Exodus.\" The witch's brother selfishly desires to make use of its power, in spite of the impending peril to the world. However, Hakaze is banished to a deserted island, and it is now up to Yoshino and Mahiro to help her save the world, while inching ever closer to the truth behind Aika's death.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/42453.webp","source":"Manga","numberOfEpisode":"24","studio":"Bones","type":"TV","score":8.04,"genres":["Action","Mystery","Psychological","Drama","Magic","Fantasy","Shounen"]},{"title":"Ergo Proxy","synopsis":"Within the domed city of Romdo lies one of the last human civilizations on Earth. Thousands of years ago, a global ecological catastrophe doomed the planet; now, life outside these domes is virtually impossible. To expedite mankind's recovery, \"AutoReivs,\" humanoid-like robots, have been created to assist people in their day-to-day lives. However, AutoReivs have begun contracting an enigmatic disease called the \"Cogito Virus\" which grants them self-awareness. Re-l Mayer, granddaughter of Romdo's ruler, is assigned to investigate this phenomenon alongside her AutoReiv partner Iggy. But what begins as a routine investigation quickly spirals into a conspiracy as Re-l is confronted by humanity's darkest sins.\n\nElsewhere in Romdo, an AutoReiv specialist by the name of Vincent Law must also face his demons when surreal events begin occurring around him. Re-l, Iggy, Vincent, and the child AutoReiv named Pino, will form an unlikely faction as they struggle to uncover Romdo's mysteries and ultimately, discover the true purpose of the mythical beings called \"Proxies.\"\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/6259.webp","source":"Original","numberOfEpisode":"23","studio":"Manglobe","type":"TV","score":7.94,"genres":["Psychological","Mystery","Sci-Fi"]},{"title":"Koukaku Kidoutai","synopsis":"In the year 2029, Niihama City has become a technologically advanced metropolis. Due to great improvements in cybernetics, its citizens are able to replace their limbs with robotic parts. The world is now more interconnected than ever before, and the city's Public Security Section 9 is responsible for combating corruption, terrorism, and other dangerous threats following this shift towards globalization.\n\nThe strong-willed Major Motoko Kusanagi of Section 9 spearheads a case involving a mysterious hacker known only as the \"Puppet Master,\" who leaves a trail of victims stripped of their memories. Like many in this futuristic world, the Puppet Master's body is almost entirely robotic, giving them incredible power. \n\nAs Motoko and her subordinates follow the enigmatic criminal's trail, other parties—including Section 6—start to get involved, forcing her to confront the extremely complicated nature of the case. Pondering about various philosophical questions, such as her own life's meaning, Motoko soon realizes that the one who will provide these answers is none other than the Puppet Master themself.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/82594.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":8.31,"genres":["Action","Mecha","Police","Psychological","Sci-Fi","Seinen"]},{"title":"Serial Experiments Lain","synopsis":"Lain Iwakura, an awkward and introverted fourteen-year-old, is one of the many girls from her school to receive a disturbing email from her classmate Chisa Yomoda—the very same Chisa who recently committed suicide. Lain has neither the desire nor the experience to handle even basic technology; yet, when the technophobe opens the email, it leads her straight into the Wired, a virtual world of communication networks similar to what we know as the internet. Lain's life is turned upside down as she begins to encounter cryptic mysteries one after another. Strange men called the Men in Black begin to appear wherever she goes, asking her questions and somehow knowing more about her than even she herself knows. With the boundaries between reality and cyberspace rapidly blurring, Lain is plunged into more surreal and bizarre events where identity, consciousness, and perception are concepts that take on new meanings.\n\nWritten by Chiaki J. Konaka, whose other works include Texhnolyze, Serial Experiments Lain is a psychological avant-garde mystery series that follows Lain as she makes crucial choices that will affect both the real world and the Wired. In closing one world and opening another, only Lain will realize the significance of their presence.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1718/91550.webp","source":"Original","numberOfEpisode":"13","studio":"Triangle Staff","type":"TV","score":8.02,"genres":["Dementia","Drama","Mystery","Psychological","Sci-Fi","Supernatural"]},{"title":"Youkoso Jitsuryoku Shijou Shugi no Kyoushitsu e (TV)","synopsis":"On the surface, Koudo Ikusei Senior High School is a utopia. The students enjoy an unparalleled amount of freedom, and it is ranked highly in Japan. However, the reality is less than ideal. Four classes, A through D, are ranked in order of merit, and only the top classes receive favorable treatment.\n\nKiyotaka Ayanokouji is a student of Class D, where the school dumps its worst. There he meets the unsociable Suzune Horikita, who believes she was placed in Class D by mistake and desires to climb all the way to Class A, and the seemingly amicable class idol Kikyou Kushida, whose aim is to make as many friends as possible.\n\nWhile class membership is permanent, class rankings are not; students in lower ranked classes can rise in rankings if they score better than those in the top ones. Additionally, in Class D, there are no bars on what methods can be used to get ahead. In this cutthroat school, can they prevail against the odds and reach the top?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/86830.webp","source":"Light novel","numberOfEpisode":"12","studio":"Lerche","type":"TV","score":7.88,"genres":["Slice of Life","Psychological","Drama","School"]},{"title":"Grisaia no Kajitsu","synopsis":"Yuuji Kazami is a transfer student who has just been admitted into Mihama Academy. He wants to live an ordinary high school life, but this dream of his may not come true any time soon as Mihama Academy is quite the opposite. Consisting of only the principal and five other students, all of whom are girls, Yuuji becomes acquainted with each of them, discovering more about their personalities as socialization is inevitable. Slowly, he begins to learn about the truth behind the small group of students occupying the academy—they each have their own share of traumatic experiences which are tucked away from the world.\n\nMihama Academy acts as a home for these girls, they are the \"fruit\" which fell from their trees and have begun to decay. It is up to Yuuji to become the catalyst to save them from themselves, but how can he save another when he cannot even save himself?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/73591.webp","source":"Visual novel","numberOfEpisode":"13","studio":"8bit","type":"TV","score":7.61,"genres":["Drama","Harem","Psychological","Romance","School"]},{"title":"Higurashi no Naku Koro ni Kai","synopsis":"In the small village of Hinamizawa, Rika Furude and her friends live together in relative harmony. Beneath this mask of peace, however, lies a hidden darkness, one that Rika understands all too well. In this eternal summer, she has been witness to unspeakable horrors. Every time the clock resets, Rika must try to find the villain behind these senseless deaths before tragedy strikes again. However, trying to decipher a mystery when only half the clues are present proves time and again to be disastrous, and each time she believes that things will change, she inevitably fails. As the annual festival approaches, Rika begins her descent from hope to despair in her struggle to break the chains of fate entangling them all.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/14114.webp","source":"Visual novel","numberOfEpisode":"24","studio":"Studio Deen","type":"TV","score":8.27,"genres":["Mystery","Psychological","Supernatural","Thriller"]},{"title":"Inuyashiki","synopsis":"Ichirou Inuyashiki is a 58-year-old family man who is going through a difficult time in his life. Though his frequent back problems are painful, nothing hurts quite as much as the indifference and distaste that his wife and children have for him. Despite this, Ichirou still manages to find solace in Hanako, an abandoned Shiba Inu that he adopts into his home. However, his life takes a turn for the worse when a follow-up physical examination reveals that Ichirou has stomach cancer and only three months to live; though he tries to be strong, his family's disinterest causes an emotional breakdown. Running off into a nearby field, Ichirou embraces his dog and weeps—until he notices a strange figure standing before him.\n\nSuddenly, a bright light appears and Ichirou is enveloped by smoke and dust. When he comes to, he discovers something is amiss—he has been reborn as a mechanized weapon wearing the skin of his former self. Though initially shocked, the compassionate Ichirou immediately uses his newfound powers to save a life, an act of kindness that fills him with happiness and newfound hope.\n\nHowever, the origins of these strange powers remain unclear. Who was the mysterious figure at the site of the explosion, and are they as kind as Ichirou when it comes to using this dangerous gift?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/88471.webp","source":"Manga","numberOfEpisode":"11","studio":"MAPPA","type":"TV","score":7.76,"genres":["Action","Drama","Psychological","Sci-Fi","Seinen"]},{"title":"Paprika","synopsis":"The world of dreams can be an incredible window into the psyche, showing one's deepest desires, aspirations, and repressed memories. One hopeful tech lab has been developing the \"DC Mini,\" a device with the power to delve into the dreams of others. Atsuko Chiba and Kosaku Tokita have been tirelessly working to develop this technology with the hopes of using it to deeply explore patients' minds and help cure them of their psychological disorders.\n\nHowever, having access to the deepest corners of a person's mind comes with a tremendous responsibility. In the wrong hands, the DC Mini could be used as a form of psychological terrorism and cause mental breakdowns in the minds of targets. When this technology is stolen and people around them start acting strangely, Atsuko and Kosaku know they have a serious problem on their hands. Enlisting the help of Officer Konakawa, who has been receiving this experimental therapy, they search both the real and dream worlds for their mental terrorist.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1929/93629.webp","source":"Novel","numberOfEpisode":"1","studio":"Madhouse","type":"Movie","score":8.08,"genres":["Dementia","Fantasy","Horror","Mystery","Psychological","Sci-Fi","Thriller"]},{"title":"Tokyo Ghoul:re 2nd Season","synopsis":"After the conclusion of the Tsukiyama Family Extermination Operation, the members of the Commission of Counter Ghouls (CCG) have grown exponentially in power and continue to pursue their goal of exterminating every ghoul in Japan. Having resigned from Quinx Squad, the now seemingly emotionless Haise Sasaki begins taking on more and more tasks from the CCG with no regard to the difficulty. Despite his vacant expressions, Ken Kaneki's memories are resurfacing in Haise, leaving him in a state of internal conflict. Meanwhile, his new coldhearted behavior is affecting the people around him. Quinx Squad are left in shambles, having to cope with the death of one of their members without the support of their former mentor.\n\nAmidst this turmoil, both Quinx Squad and Haise must continue to fulfill their duties to the CCG, whether willingly or not. However, the presence of a mysterious group behind the CCG has been made known to Haise, and certain whispers of corruption have not gone unheard by the Quinx Squad as well.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1271/95623.webp","source":"Manga","numberOfEpisode":"12","studio":"Pierrot Plus","type":"TV","score":6.36,"genres":["Action","Drama","Horror","Mystery","Psychological","Seinen","Supernatural"]},{"title":"Gakkougurashi!","synopsis":"Yuki Takeya loves her school so much that she does not want to ever leave! Megurigaoka High School is a unique and lively place where Yuki enjoys her carefree life as a third-year high school student and member of the School Living Club. The club, consisting of the president Yuuri Wakasa, the athletic Kurumi Ebisuzawa, the mature junior Miki Naoki, the supervising teacher Megumi Sakura, and the club dog Taroumaru, prides itself on making the most of life at school. However, this illusion of endless bliss is just a bubble waiting to be burst because Yuki is unable to perceive what is truly happening around her. In reality, all is not as it seems—the real purpose of the School Living Club is to escape from the shocking and disturbing truth: the girls are in the middle of a zombie apocalypse and have barricaded themselves inside the school as the sole survivors.\n\nBased on the manga by Kaihou Norimitsu, Gakkougurashi! follows a group of girls who are forced to adapt to a post-apocalyptic life all by themselves. They have no means of contact with the outside world and are surrounded by hostile undead waiting to devour them. The girls must not only contend with the challenge of survival; they must also strive to maintain a false appearance of normality in Yuki's presence.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1798/91548.webp","source":"Manga","numberOfEpisode":"12","studio":"Lerche","type":"TV","score":7.65,"genres":["Slice of Life","Psychological","School","Horror","Mystery"]},{"title":"Perfect Blue","synopsis":"J-pop idol group CHAM! has spent the last two years entertaining its fans. Sadly, all good things must come to an end, and CHAM! must see one of its members, Mima Kirigoe, leave the group to pursue her acting career. While Mima's choice is met with a mixed response, she hopes her fans will continue to support her.\n\nHowever, Mima's life begins to change drastically after her departure from the group. Wanting to shed her pop-idol image, she takes on a role in a crime drama series, and her career as an actress gradually becomes more demanding and taxing for both Mima and her manager, Rumi Hidaka. To add to Mima's growing unease, an obsessed fan who is incapable of accepting that Mima has quit being an innocent idol, begins stalking her; a new anonymous website begins to impersonate her life with intricate detail; and CHAM! also appears to be doing better without her. One by one, each disturbing development drives Mima to become increasingly unhinged and unable to distinguish reality from fantasy.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/79127.webp","source":"Novel","numberOfEpisode":"1","studio":"Madhouse","type":"Movie","score":8.41,"genres":["Dementia","Drama","Horror","Psychological"]},{"title":"Satsuriku no Tenshi","synopsis":"With dead and lifeless eyes, Rachel Gardner wishes only to die. Waking up in the basement of a building, she has no idea how or why she's there. She stumbles across a bandaged murderer named Zack, who is trying to escape. After promising to kill her as soon as he is free, Rachel and Zack set out to ascend through the building floor by floor until they escape.\n\nHowever, as they progress upward, they meet more twisted people, and all of them seem familiar with Rachel. What is her connection to the building, and why was she placed in it? Facing a new boss on each floor, can Rachel and Zack both achieve their wishes?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1862/95624.webp","source":"Game","numberOfEpisode":"16","studio":"J.C.Staff","type":"TV","score":6.86,"genres":["Adventure","Horror","Psychological","Thriller"]},{"title":"Jigoku Shoujo","synopsis":"Have you heard of Hell Correspondence? Those with a powerful grudge may only access this mysterious website at midnight, allowing them to enter anyone's name and have that person be ferried straight to hell. Ai Enma, the Hell Girl, will not judge whether or not the chosen target deserves punishment; she will merely exact revenge on them for you. Not much is known about this young girl other than that she swiftly carries out her tasks with the help of three straw dolls. There is just one catch, however—as payment for carrying out such a request, the user must condemn themselves to an afterlife in hell.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/71958.webp","source":"Original","numberOfEpisode":"26","studio":"Studio Deen","type":"TV","score":7.67,"genres":["Mystery","Horror","Psychological","Supernatural"]},{"title":"Gantz","synopsis":"Thought your life was bad? Sometimes, death is worse. There is no salvation, peace, nor god waiting to receive you into their care. But wait, a god? Maybe you are talking about that big black ball stuck in the room with you. Now you are thrown into a game, fighting green aliens and robot monsters for the chance to survive.\n\nWhen Kei Kurono is killed, he thus finds himself caught in such a game—a test of his skills, morals, and will to survive. His life is not his own; his death is spat and trampled upon over and over again. What happens if he does not listen? God knows.\n\nA word of warning: Gantz is not for the faint-hearted, but neither is it as simple as it looks. Gore, rape, and violence is rampant, as are portrayals of greed, violence, and all the ugliness that one sees in society today.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/5998.webp","source":"Manga","numberOfEpisode":"13","studio":"Gonzo","type":"TV","score":7.09,"genres":["Action","Sci-Fi","Horror","Psychological","Supernatural","Drama","Ecchi"]},{"title":"Grisaia no Rakuen","synopsis":"Grisaia no Rakuen begins right at the end of the previous installment, Grisaia no Meikyuu. Kazami Yuuji is arrested under suspicion for terrorism. A video showing apparently concrete proof that Yuuji committed these acts, and he is held in custody by Ichigaya.\n\nIchigaya knows full well that Yuuji didn't commit the crimes he has been accused of. But he did fail to assassinate Heath Oslo, who is the leader of the terrorist organization with an extremely devastating weapon in their possession. In fact, Ichigaya have their own plans for Yuuji... \n\nBut all may not be lost for Yuuji. The girls of the Mihama Academy are not about to let Yuuji be used for political gain, and neither may the mysterious new figure which appears before them.","img":"https://cdn.myanimelist.net/images/anime/8/72855.webp","source":"Visual novel","numberOfEpisode":"10","studio":"8bit","type":"TV","score":7.95,"genres":["Drama","Harem","Psychological","Romance"]},{"title":"Yojouhan Shinwa Taikei","synopsis":"One autumn evening at a mysterious ramen stand behind the Shimogamo Shrine, a lonely third-year college student bumps into a man with an eggplant-shaped head who calls himself a god of matrimony. Meeting this man causes the student to reflect upon his past two years at college—two years bitterly spent trying to break up couples on campus with his only friend Ozu, a ghoulish-looking man seemingly set on making his life as miserable as possible. Resolving to make the most out of the rest of his college life, the student attempts to ask out the unsociable but kind-hearted underclassman Akashi, yet fails to follow through, prompting him to regret not living out his college life differently. As soon as this thought passes through his head, however, he is hurtled through time and space to the beginning of his years at college and given another chance to live his life.\n\nSurreal, artistic, and mind-bending, Yojouhan Shinwa Taikei chronicles the misadventures of a young man on a journey to make friends, find love, and experience the rose-colored campus life he always dreamed of.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/50457.webp","source":"Novel","numberOfEpisode":"11","studio":"Madhouse","type":"TV","score":8.62,"genres":["Mystery","Comedy","Psychological","Romance"]},{"title":"Mahou Shoujo Madoka★Magica Movie 3: Hangyaku no Monogatari","synopsis":"The young girls of Mitakihara happily live their lives, occasionally fighting off evil, but otherwise going about their peaceful, everyday routines. However, Homura Akemi feels that something is wrong with this unusually pleasant atmosphere—though the others remain oblivious, she can't help but suspect that there is more to what is going on than meets the eye: someone who should not exist is currently present to join in on their activities.\n\nMahou Shoujo Madoka★Magica Movie 3: Hangyaku no Monogatari follows Homura in her struggle to uncover the painful truth behind the mysterious circumstances, as she selfishly and desperately fights for the sake of her undying love in this despair-ridden conclusion to the story of five magical girls.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/54231.webp","source":"Original","numberOfEpisode":"1","studio":"Shaft","type":"Movie","score":8.44,"genres":["Mystery","Psychological","Drama","Magic","Thriller"]},{"title":"Kakegurui××","synopsis":"As Yumeko Jabami's fame grows and the reputation of the student council dwindles, Kirari Momobami decides to revolutionize the group. To this end, she announces an election for its next president. The rules are simple: each student in the school receives one chip. Whoever has the most chips by the end of thirty days becomes both the new president and the head of the Momobami clan.\n\nUpon receiving news of this development, the Momobami branch families spring into action. Eleven transfer students arrive at Hyakkao Private Academy, each aiming to lead both the school and the Momobami clan. Equipped with unique talents, they will compete to get as many chips as possible—but their chips are not the only things on the line.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/1496/96519.webp","source":"Manga","numberOfEpisode":"12","studio":"MAPPA","type":"TV","score":7.41,"genres":["Drama","Game","Mystery","Psychological","School","Shounen"]},{"title":"Mirai Nikki: Redial","synopsis":"Yuno Gasai lives a normal life as a first-year in high school. She gets along well with her parents and even has a small circle of friends. However, she cannot help but feel as if someone is missing from her life, someone so important to her that it was as if she had lived another life trying desperately to stay with them.\n\nAfter a class trip to the beach, Yuno returns home; but in the middle of the night, she receives strange messages from a voice only she can hear. The voice informs her of the person she is desperate to meet and that she must find him. Soon, she finds herself in a mysterious realm, her only goal being reunited with the person she cannot remember. Though obstacles stand in her way, Yuno will stop at nothing to meet her beloved once again.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/53247.webp","source":"Manga","numberOfEpisode":"1","studio":"Asread","type":"OVA","score":7.47,"genres":["Action","Psychological","Supernatural","Shounen"]},{"title":"ChäoS;HEAd","synopsis":"Throughout Shibuya, a series of murders dubbed the \"New Generation Madness\" gained widespread attention As these crimes gained infamy, they became a hot topic of discussion among the people of the area. Nonetheless, these \"New Gen\" murders do not capture the interest of Takumi Nishijou, a high school otaku who frequently experiences delusions and feels that he is constantly being watched. \n\nHaving no concern for the real world, Takumi spends his time playing online games and watching anime. However, his ordinary life is disrupted when he receives a horrifying image of a man staked to a wall from a user named Shogun. After calming himself at an internet cafe, Takumi sees the exact same murder scene as the image portrayed happen right before his eyes, along with a pink-haired girl covered in blood calling out his name.\n\nConflicted with the nature of reality, Takumi finds it difficult to judge where to place his trust as he gets caught up in the \"New Gen\" murders, believing that the murderer is out to get him.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/15443.webp","source":"Visual novel","numberOfEpisode":"12","studio":"Madhouse","type":"TV","score":6.42,"genres":["Sci-Fi","Harem","Mystery","Psychological","Supernatural"]},{"title":"Mousou Dairinin","synopsis":"The infamous Shounen Bat (Lil' Slugger) is terrorizing the residents of Musashino City. Flying around on his rollerblades and beating people down with a golden baseball bat, the assailant seems impossible to catch—much less understand. His first victim, the well-known yet timid character designer Tsukiko Sagi, is suspected of orchestrating the attacks. Believed only by her anthropomorphic pink stuffed animal, Maromi, Tsukiko is just one of Shounen Bat's many victims.\n\nAs Shounen Bat continues his relentless assault on the town, detectives Keiichi Ikari and Mitsuhiro Maniwa begin to investigate the identity of the attacker. However, more and more people fall victim to the notorious golden bat, and news of the assailant begins circulating around the town. Paranoia starts to set in as chilling rumors spread amongst adults and children alike.\n\nWill the two detectives be able to unravel the truth behind Shounen Bat, or will the paranoia get to them first?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/10240.webp","source":"Original","numberOfEpisode":"13","studio":"Madhouse","type":"TV","score":7.7,"genres":["Mystery","Dementia","Police","Psychological","Supernatural","Drama","Thriller"]},{"title":"Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen","synopsis":"Second season of Kaguya-sama wa Kokurasetai: Tensai-tachi no Renai Zunousen.","img":"https://cdn.myanimelist.net/images/anime/1764/106659.webp","source":"Manga","numberOfEpisode":"12","studio":"A-1 Pictures","type":"TV","score":8.82,"genres":["Comedy","Psychological","Romance","School","Seinen"]},{"title":"Beastars","synopsis":"In a civilized society of anthropomorphic animals, an uneasy tension exists between carnivores and herbivores. At Cherryton Academy, this mutual distrust peaks after a predation incident results in the death of Tem, an alpaca in the school's drama club. Tem's friend Legoshi, a grey wolf in the stage crew, has been an object of fear and suspicion for his whole life. In the immediate aftermath of the tragedy, he continues to lay low and hide his menacing traits, much to the disapproval of Louis, a red deer and the domineering star actor of the drama club.\n\nWhen Louis sneaks into the auditorium to train Tem's replacement for an upcoming play, he assigns Legoshi to lookout duty. That very night, Legoshi has a fateful encounter with Haru, a white dwarf rabbit scorned by her peers. His growing feelings for Haru, complicated by his predatory instincts, force him to confront his own true nature, the circumstances surrounding the death of his friend, and the undercurrent of violence plaguing the world around him.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1234/102008.webp","source":"Manga","numberOfEpisode":"12","studio":"Orange","type":"TV","score":8.3,"genres":["Slice of Life","Psychological","Drama","Shounen"]},{"title":"Mawaru Penguindrum","synopsis":"For the Takakura family, destiny is an ever-spinning wheel, pointing passionately in their direction with equal tides of joy and sorrow before ticking on to the next wishmaker. With their parents gone, twin brothers Kanba and Shouma live alone with their beloved little sister Himari, whose poor health cannot decline any further.\n\nOn the day Himari is given permission to temporarily leave the hospital, her brothers take her out to the aquarium to celebrate, where the family's supposed fate is brought forth with her sudden collapse. However, when Himari is inexplicably revived by a penguin hat from the aquarium's souvenir shop, the hand of fate continues to tick faithfully forward.\n\nWith her miraculous recovery, though, comes a cost: there is a new entity within her body, whose condition for keeping her fate at bay sends the boys on a wild goose chase for the mysterious \"Penguin Drum.\" In their search, the boys will have to follow the threads of fate leading from their own shocking past and into the lives of other wishmakers vying for the Penguin Drum, all hoping to land upon their chosen destiny.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/30238.webp","source":"Original","numberOfEpisode":"24","studio":"Brain's Base","type":"TV","score":8,"genres":["Mystery","Comedy","Dementia","Psychological","Drama"]},{"title":"xxxHOLiC","synopsis":"Kimihiro Watanuki can see spirits and other assorted supernatural creatures, which is quite a bothersome ability he strongly dislikes. On the way home one day, while plagued by some spirits, he is inexplicably compelled to enter a strange house. There, he encounters Yuuko, a mysterious woman who claims to be able to rid him of the ability to see and attract the troublesome creatures—for a price. She demands that he work at her \"store\" that grants wishes to people, and thus begins Watanuki's adventures through weird and wonderful events.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/21858.webp","source":"Manga","numberOfEpisode":"24","studio":"Production I.G","type":"TV","score":8.03,"genres":["Comedy","Drama","Mystery","Psychological","Supernatural"]},{"title":"Ping Pong the Animation","synopsis":"\"The hero comes. The hero comes. The hero comes. Chant these words in your mind, and I'll surely come to you...\" This mantra is what Makoto Tsukimoto repeats as a source of motivation when he fights through the stress of not only grueling ping pong matches, but also in situations of his life. Makoto doesn't fight alone; he and his friend, Yutaka Hoshino, nicknamed Smile and Peco respectively, are two boys who have grown up playing ping pong together nearly every day. Peco, brimming with confidence, aims to be the best table tennis player in the world; Smile, on the other hand, shows little ambition. Nevertheless, the two have always stuck together, with a bond built upon their mutual love for this sport.\n\nEvery year, students from all across Japan gather for the inter-high table tennis competition to achieve national and international stardom. Through intense training and competition, only the very best persevere.\n\nFrom the avant-garde director of Tatami Galaxy, Masaaki Yuasa, Ping Pong the Animation serves a tale of ambition with its fair share of bumps along the way. Whatever the odds, Peco and Smile will face them together.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/58041.webp","source":"Manga","numberOfEpisode":"11","studio":"Tatsunoko Production","type":"TV","score":8.63,"genres":["Drama","Psychological","Seinen","Sports"]},{"title":"Gyakkyou Burai Kaiji: Ultimate Survivor","synopsis":"Kaiji Itou is a good-for-nothing loiterer who spends his days drinking beer and stealing hubcaps—that is, until he ends up being tricked by his former co-worker. Unable to suddenly repay his friend's huge debt all by himself, Kaiji is offered a shady deal to participate in an illegal underground gamble on a cruise ship. This turns out to be nothing more than the beginning of his new life of hell—thrown headlong into a life-threatening roller coaster of mind games, cheating, and deceit.\n\nBased on the first entry of the famous gambling manga series by Nobuyuki Fukumoto, Gyakkyou Burai Kaiji: Ultimate Survivor follows our unlucky protagonist as he is forced to fight not only other people, but also the mysteries of their psyches. Kaiji finds out the hard way that the worst sides of human nature surface when people's backs are against the wall, and that the most fearsome dangers of all are greed, paranoia, and the human survival instinct itself.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/80032.webp","source":"Manga","numberOfEpisode":"26","studio":"Madhouse","type":"TV","score":8.29,"genres":["Game","Psychological","Thriller","Seinen"]},{"title":"Danganronpa 3: The End of Kibougamine Gakuen - Mirai-hen","synopsis":"After Makoto Naegi and his fellow survivors escaped Hope's Peak Academy to the world beyond, they soon join the Future Foundation, an organization dedicated to combating despair. Just when all seems to be looking up, Naegi is arrested and tried for betrayal due to defending a malicious group of Remnants of Despair. Standing before all of the Future Foundation executives, he finds himself, along with Kyouko Kirigiri and Aoi Asahina, facing an unknown fate.\n\nThe matter at hand only escalates when the organization's supposedly impenetrable security is hacked into by a\nfamiliar face: Monokuma. Much to Naegi's horror, the mechanical bear immediately announces the beginning of a new killing game, as moments later, the first victim appears as a signal for despair to resume its brutal conquest.\n\nIn the conclusion to Danganronpa's gripping tale of hope and despair, Naegi, the Super High School-Level Lucky Student, must once again unravel the mystery as his colleagues and friends begin falling around him. However, there are no more class trials; among the 16 desperate participants, there is only one killer—and their death means the end of this infernal game.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/80931.webp","source":"Game","numberOfEpisode":"12","studio":"Lerche","type":"TV","score":7.47,"genres":["Action","Mystery","Horror","Psychological"]},{"title":"Re:Zero kara Hajimeru Isekai Seikatsu 2nd Season","synopsis":"Second season of Re:Zero kara Hajimeru Isekai Seikatsu.","img":"https://cdn.myanimelist.net/images/anime/1010/100084.webp","source":"Light novel","numberOfEpisode":"?","studio":"White Fox","type":"TV","score":null,"genres":["Drama","Fantasy","Psychological","Thriller"]},{"title":"Kino no Tabi: The Beautiful World","synopsis":"Kino, a 15-year-old traveler, forms a bond with Hermes, a talking motorcycle. Together, they wander the lands and venture through various countries and places, despite having no clear idea of what to expect. After all, life is a journey filled with the unknown. \n\nThroughout their journeys, they encounter different kinds of customs, from the morally gray to tragic and fascinating. They also meet many people: some who live to work, some who live to make others happy, and some who live to chase their dreams. Thus, in every country they visit, there is always something to learn from the way people carry out their lives. \n\nIt is not up to Kino or Hermes to decide whether these asserted values are wrong or right, as they merely assume the roles of observers within this small world. They do not attempt to change or influence the places they visit, despite how absurd these values would appear. That's because in one way or another, they believe things are fine as they are, and that \"the world is not beautiful; therefore, it is.\"\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1763/95397.webp","source":"Light novel","numberOfEpisode":"13","studio":"A.C.G.T.","type":"TV","score":8.37,"genres":["Action","Adventure","Psychological","Slice of Life"]},{"title":"Haibane Renmei","synopsis":"Born from a cocoon in the village of Old Home, a young Haibane—a being with a halo and small gray wings—awakens to a world she does not understand without memories of her past. Named Rakka for the dream of falling she had while inside the cocoon, she soon becomes accustomed to life in the strange town. However, there are strict rules for the Haibane, such as being forbidden to leave the village or go near the walls surrounding it. These, along with mysterious disappearances of their kind on their \"Day of Flight,\" begin to unsettle Rakka and the others since they know almost nothing about their own kind.\n \nHaibane Renmei tells not only Rakka's story but also of those around her, as they live their lives with no memories of the past while trying to break free from their former pain and ultimately find salvation.\n \n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/13134.webp","source":"Other","numberOfEpisode":"13","studio":"Radix","type":"TV","score":8.01,"genres":["Slice of Life","Mystery","Psychological","Drama","Fantasy"]},{"title":"Danganronpa 3: The End of Kibougamine Gakuen - Zetsubou-hen","synopsis":"Hope's Peak Academy's unconventional class 77-B is about to have an even more eccentric addition: Chisa Yukizome, an alumna with the title of Super High School-Level Housekeeper—and their new homeroom teacher. Cheerful, passionate, and capable, Chisa immediately sets about correcting the students' problematic behavior and strengthening their relationships. It may not be easy dealing with diverse pupils ranging from princesses and nurses to yakuza and impossibly lucky students, but anything is possible with the power of hope.\n\nMeanwhile, Hajime Hinata, an unremarkable boy from the school's Reserve Course, longs for a talent. One day, he has an unexpected meeting with class 77-B's Super High School-Level Gamer Chiaki Nanami, who presents to him a new, hope-filled outlook on life. However, unbeknownst to him, the school's upper echelon is about to execute a sinister project centered around Hajime that will bring Hope's Peak—and the rest of the world—to its knees.\n\nZetsubou-hen chronicles the daily lives carried out at the talent-cultivating academy, and the darkness that lurks beneath. As despair slowly infects hope, plans are put into motion to start the Biggest, Most Awful, Most Tragic Event in Human History, and the end begins.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/80932.webp","source":"Game","numberOfEpisode":"11","studio":"Lerche","type":"TV","score":7.59,"genres":["Action","Mystery","Horror","Psychological","School"]},{"title":"Mayoiga","synopsis":"A bus full of eccentric individuals is headed towards the urban legend known as Nanaki Village, a place where one can supposedly start over and live a perfect life. While many have different ideas of why the village cannot be found on any map, or why even the police cannot pinpoint its location, they each look forward to their new lives and just what awaits them once they reach their destination.\n\nAfter a few mishaps, they successfully arrive at Nanaki Village only to find it completely abandoned. Judging from the state of disrepair, it has been vacant for at least a year. However, secrets are soon revealed as some of the group begin to go missing while exploring the village and amidst the confusion, they find bloody claw marks in a forest. As mistrust and in-fighting break out, will they ever be able to figure out the truth behind this lost village?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/79413.webp","source":"Original","numberOfEpisode":"12","studio":"Diomedea","type":"TV","score":5.57,"genres":["Mystery","Comedy","Horror","Psychological","Drama"]},{"title":"Mononoke","synopsis":"The \"Medicine Seller\" is a deadly and mysterious master of the occult who travels across feudal Japan in search of malevolent spirits called \"mononoke\" to slay. When he locates one of these spirits, he cannot simply kill it; he must first learn its Form, its Truth, and its Reason in order to wield the mighty Exorcism Sword and fight against it. He must begin  his strange exorcisms with intense psychological analysis and careful investigative work—an extremely dangerous step, as he must first confront and learn about the mononoke before he even has the means to defeat it.\n\nThe Medicine Seller's journey leads him to an old-fashioned inn where Shino, a pregnant woman, has finally found a place to rest. The owner has reluctantly placed her in the last vacant room; however, as she settles in, it quickly becomes clear that the room is infested by a lethal band of mononoke, the Zashiki Warashi. With his hunter's intuition, the Medicine Seller begins his investigation to discover the Form, the Truth, and the Reason before the Zashiki Warashi can kill again.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/20713.webp","source":"Original","numberOfEpisode":"12","studio":"Toei Animation","type":"TV","score":8.42,"genres":["Mystery","Historical","Horror","Demons","Psychological","Supernatural","Fantasy","Seinen"]},{"title":"Umineko no Naku Koro ni","synopsis":"Considered as the third installment in the highly popular When They Cry series by 07th Expansion, Umineko no Naku Koro ni takes place on the island of Rokkenjima, owned by the immensely wealthy Ushiromiya family. As customary per year, the entire family is gathering on the island for a conference that discusses the current financial situations of each respective person. Because of the family head's poor health, this year involves the topic of the head of the family's inheritance and how it will be distributed.\n\nHowever, the family is unaware that the distribution of his wealth is the least of Ushiromiya Kinzou's (family head) concerns for this year's family conference. After being told that his end was approaching by his longtime friend and physician, Kinzou is desperate to meet his life's true love one last time: the Golden Witch, Beatrice. Having immersed himself in black magic for many of the later years in his life, Kinzou instigates a ceremony to revive his beloved upon his family's arrival on Rokkenjima. Soon after, a violent typhoon traps the family on the island and a string of mysterious murders commence, forcing the eighteen people on the island to fight for their lives in a deadly struggle between fantasy and reality.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/17709.webp","source":"Visual novel","numberOfEpisode":"26","studio":"Studio Deen","type":"TV","score":7.17,"genres":["Mystery","Horror","Psychological","Supernatural"]},{"title":"B: The Beginning","synopsis":"On the islands of Cremona, a vigilante runs amok. Celebrated by some and hunted by others, the notorious \"Killer B\" takes justice into his own hands, armed with a sharp blade and superhuman abilities. Unable to apprehend this renegade, the Royal Investigation Service (RIS) calls upon the expertise of Keith Flick, a seasoned, yet eccentric detective who was relegated to the Archives Department following a personal loss. As crimes in Cremona begin to escalate, from stealthy executions of wrongdoers to sophisticated strikes on public figures, it soon becomes clear that there is more than one person responsible.\n\nWith the help of his impulsive sidekick Lily Hoshina, and unexpected aid from the elusive Killer B himself, Keith begins to unravel plots involving secret organizations, domestic terrorism, and human experiments. When the involvement of the RIS extends beyond the scope of justice, the extent of the government's corruption—as well as the trustworthiness of close allies—are thrown into question. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1564/90469.webp","source":"Original","numberOfEpisode":"12","studio":"Production I.G","type":"ONA","score":7.47,"genres":["Action","Mystery","Police","Psychological","Supernatural","Thriller"]},{"title":"Death Billiards","synopsis":"Two men have just arrived at a location known as Quindecim and are unable to remember how they got there. They are immediately greeted by a young woman who escorts them to a small bar, where a bartender awaits them. They are told that they will have to participate in a game, randomly chosen by roulette, and will be unable to leave until its completion; if they refuse, the consequences will be dire. In addition to the rules of the game, the two men are told to play as if their lives are at stake.\n \nThe game that has been chosen is billiards. But there's more to it than just pocketing pool balls, as the two are about to find out the outcome could mean life or death.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/48721.webp","source":"Original","numberOfEpisode":"1","studio":"Madhouse","type":"Movie","score":7.96,"genres":["Game","Mystery","Psychological","Drama","Thriller"]},{"title":"Texhnolyze","synopsis":"Texhnolyze takes place in the city of Lux, a man-made underground city that has crumbled after years of neglect and lack of repairs. Citizens of Lux have come to refer to their home as simply \"The City\" and treat it as though it has a mind and will of its own. Three major factions battle to control Lux: Organo, a group of \"professionals\" who collaborate with the criminal underworld that controls Texhnolyze (prosthetics), the Salvation Union, a populist group that seeks to disrupt Organo's business, and Racan, a collection of young individuals with Texhnolyzes that use their abilities for personal gain.\n\nIchise was once an orphan who has made a place for himself in Lux as a prize fighter. One day, a fight promoter grows angry with him and the altercation that follows results in Ichise losing an arm and a leg. Before death can take him, Ichise is found by the scientist Eriko Kamata, who uses him as a test subject for her newly designed Texhnolyze. With these powerful new limbs at his disposal, Ichise begins to work for Oonishi, the leader of Organo. He soon meets a mysterious young girl, Ran, who has the power to see possible futures. Together, they soon realize that Lux is on the brink of war and collapse, and that they may be the only ones who can save The City.","img":"https://cdn.myanimelist.net/images/anime/3/18165.webp","source":"Original","numberOfEpisode":"22","studio":"Madhouse","type":"TV","score":7.76,"genres":["Action","Sci-Fi","Psychological","Drama"]},{"title":"One Outs","synopsis":"Toua Tokuchi is an athlete by profession, but a reckless gambler at heart. On the streets of Okinawa, he uses nothing but his wits and a \"fastball\" peaking at a mere 134 kmph to somehow achieve 499 wins in the game of \"One Outs,\" a simplified version of baseball between the pitcher and one batter. Amazed by Toua's unique prowess on the mound, veteran slugger Hiromichi Kojima artfully scouts the pitcher for his long unsuccessful team, the Saikyou Saitama Lycaons. Kojima desperately hopes Toua will lead them to the championship; however, Tsuneo Saikawa, the mercenary owner of the Lycaons, sees the vastly talented pitcher as a threat to the income generated by the team. Rising to the challenge of swaying the owner, Toua suggests a one-of-a-kind \"One Outs\" contract: every out Toua pitches will earn him five million yen, but with every run he gives up, he will lose fifty million yen.\n\nAdapted from the manga by Shinobu Kaitani of Liar Game fame, One Outs documents the intense psychological battles between Toua and those around him. With millions of yen at stake, can a pitcher who has done nothing but gamble in a head-to-head imitation of baseball finally lead a real baseball team to victory?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/22669.webp","source":"Manga","numberOfEpisode":"25","studio":"Madhouse","type":"TV","score":8.37,"genres":["Sports","Psychological","Seinen"]},{"title":"Elfen Lied: Tooriame nite Arui wa, Shoujo wa Ikani Shite Sono Shinjou ni Itatta ka? - Regenschauer","synopsis":"Having been accepted into the Kaede Inn, Nana struggles to find some way to contribute, though she inadvertently brings more trouble than assistance. However, Nana's worries are directed more towards fellow resident Nyu, whom she had only known as Lucy, the violent Diclonius. Fearful that Nyu will unleash the same horrific savagery—violence that scars Nana to this day—upon those close to her, Nana faces a dilemma: attempt to live peacefully alongside Lucy with all the uncertainty that that entails or dispose of the source of her worries, shattering the relationships she has formed at the inn. As Nana struggles to come to a decision, Nyu recalls a painful memory of one of her dearest friends and one of her greatest rivals.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/80498.webp","source":"Manga","numberOfEpisode":"1","studio":"Arms","type":"Special","score":7.23,"genres":["Horror","Psychological","Supernatural","Drama","Ecchi","Seinen"]},{"title":"Neon Genesis Evangelion: Death &amp; Rebirth","synopsis":"In the year 2015, more than a decade has passed since the catastrophic event known as Second Impact befell mankind. During this time of recovery, a select few learned of beings known as the Angels—colossal malevolent entities with the intention of triggering the Third Impact and wiping out the rest of humanity.\n\nCalled into the city of Tokyo-3 by his father Gendou Ikari, teenager Shinji is thrust headlong into humanity's struggle. Separated from Gendou since the death of his mother, Shinji presumes that his father wishes to repair their shattered familial bonds; instead, he discovers that he was brought to pilot a giant machine capable of fighting the Angels, Evangelion Unit-01. Forced to battle against wave after wave of mankind's greatest threat, the young boy finds himself caught in the middle of a plan that could affect the future of humanity forever.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/75963.webp","source":"Original","numberOfEpisode":"1","studio":"Gainax","type":"Movie","score":7.45,"genres":["Drama","Mecha","Psychological","Sci-Fi"]},{"title":"Gunslinger Girl","synopsis":"In the heart of Italy, the Social Welfare Agency rescues young girls from hospital beds and gives them a second chance at life using the latest in cybernetic advancements. With their artificially enhanced bodies, the girls are brainwashed and trained as assassins to carry out the dirty work of the Italian Government. Despite all the modifications, they are still just children at heart, struggling for recognition from those they love, even knowing the love they feel is manufactured. This tragic tale unfolds as these girls grapple with their emotions in an agency that treats them as nothing but ruthless killers.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/3088.webp","source":"Manga","numberOfEpisode":"13","studio":"Madhouse","type":"TV","score":7.45,"genres":["Action","Psychological","Military","Drama","Sci-Fi"]},{"title":"Aoi Bungaku Series","synopsis":"Ningen Shikkaku\nA high school student seeks solace in narcotics to escape the dispiritedness that has come over his life. As he goes through the different stages of his life, it culminates in the questioning of his existence in the world.\n\nSakura no Mori no Mankai no Shita\nThe adaptation of Ango Sakaguchi's literary work deals with the love story of a woman abducted by a mountain bandit.\n\nKokoro\nWhile trying to fill the void in his life, a university student in Tokyo encounters a charismatic older man, whom he addresses as \"Sensei,\" who offers him advice on life. However, the man is apprehensive to share his life experience, deepening the student's curiosity. Through this peculiar relationship, the student comes to ponder about the distance between him and his family and the growing desolation in his heart filled with ego and guilt. \n\nHashire, Melos!\nThe story portrays the unbreakable bond between two friends, Melos and Selinuntius, and their faith in protecting each other, all while dangling on a thread which hovers over death and misery. \n\nKumo no Ito\nKandata is a coldhearted criminal who, while being punished in Hell for his misdeeds, is noticed by the Buddha Shakyamuni. Despite maintaining a record of committing ruthless atrocities, Kandata had once shown mercy to a spider he encountered in the forest by letting it live. Moved by this, Shakyamuni offers him redemption by dropping a spider's thread into the searing pits of Hell, and it is up to Kandata to seize the opportunity.\n\nJigokuhen\nYoshihide is a great painter in the land ruled by Horikawa, a tyrant. Offered a commission to paint the \"Buddhist Hell\" by the lord, Yoshihide declines, as he cannot paint anything he has not witnessed himself. In an attempt to make Yoshihide understand the magnitude of his request, the lord tortures his subjects to provide inspiration for the artist, descending his domain into utter despair and darkness.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/17471.webp","source":"Novel","numberOfEpisode":"12","studio":"Madhouse","type":"TV","score":7.78,"genres":["Drama","Historical","Psychological","Seinen","Thriller"]},{"title":"Mahou Shoujo Madoka★Magica Movie 2: Eien no Monogatari","synopsis":"Though Sayaka Miki's wish was fulfilled, the unforeseen consequences that came with it overwhelm her, causing her soul gem to become tainted as she succumbs to despair and eventually loses her humanity. Homura Akemi reveals to Kyouko Sakura and Madoka Kaname the ultimate fate of magical girls: once their soul gem becomes tainted, it transforms into a Grief Seed, and they are reborn as witches—a truth Homura learned only through repeating history countless times in a bid to prevent Madoka's tragedy.\n\nKyuubey only compounds their despair when he confesses his true intentions: to harness the energy created from magical girls and use it to prolong the life of the universe. As the threat of Walpurgisnacht, a powerful witch, looms overhead, Homura once again vows to protect Madoka and the world from a grim fate.  \n\nCaught between honoring Homura's wish and saving the world, which one will Madoka choose in the end?\nMahou Shoujo Madoka★Magica Movie 2: Eien no Monogatari is a story of inescapable destiny, and an unlikely hero who could change it all.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/42265.webp","source":"Original","numberOfEpisode":"1","studio":"Shaft","type":"Movie","score":8.39,"genres":["Drama","Magic","Psychological","Thriller"]},{"title":"Omoide no Marnie","synopsis":"Suffering from frequent asthma attacks, young Anna Sasaki is quiet, unsociable, and isolated from her peers, causing her foster parent endless worry. Upon recommendation by the doctor, Anna is sent to the countryside, in hope that the cleaner air and more relaxing lifestyle will improve her health and help clear her mind. Engaging in her passion for sketching, Anna spends her summer days living with her aunt and uncle in a small town near the sea.\n\nOne day while wandering outside, Anna discovers an abandoned mansion known as the Marsh House. However, she soon finds that the residence isn't as vacant as it appears to be, running into a mysterious girl named Marnie. Marnie's bubbly demeanor slowly begins to draw Anna out of her shell as she returns night after night to meet with her new friend. But it seems there is more to the strange girl than meets the eye—as her time in the town nears its end, Anna begins to discover the truth behind the walls of the Marsh House.\n\nOmoide no Marnie tells the touching story of a young girl's journey through self-discovery and friendship, and the summer that she will remember for the rest of her life.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/64293.webp","source":"Novel","numberOfEpisode":"1","studio":"Studio Ghibli","type":"Movie","score":8.17,"genres":["Mystery","Psychological","Drama"]},{"title":"Mahou Shoujo Madoka★Magica Movie 1: Hajimari no Monogatari","synopsis":"Madoka Kaname and her best friend Sayaka Miki are ordinary middle school students in the city of Mitakihara. But one day, they encounter a strange cat-like creature named Kyuubey, who claims he can grant them one wish. In exchange, they would become magical girls and fight against evil perpetrated by witches. A veteran magical girl in the area, Mami Tomoe, decides to show them how to hunt witches, while the mysterious transfer student Homura Akemi warns them to not take Kyuubey's deal, though she refuses to say why.\n\nHowever, after witnessing the brutal reality of fighting witches, the girls decide it may be safer to decline Kyuubey's offer. But when another magical girl arrives in the city and Sayaka decides to make a wish to help the one she loves, things quickly escalate as they are confronted with the harsh truth behind their powers and the ultimate price of their wishes.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/42331.webp","source":"Original","numberOfEpisode":"1","studio":"Shaft","type":"Movie","score":8.22,"genres":["Psychological","Drama","Magic","Thriller"]},{"title":"Aku no Hana","synopsis":"Kasuga Takao is a boy who loves reading books, particularly Baudelaire's Les Fleurs du Mal. A girl at his school, Saeki Nanako, is his muse and his Venus, and he admires her from a distance. One day, he forgets his copy of Les Fleurs du Mal in the classroom and runs back alone to pick it up. In the classroom, he finds not only his book, but Saeki's gym uniform. On a mad impulse, he steals it.\n\nNow everyone knows \"some pervert\" stole Saeki's uniform, and Kasuga is dying with shame and guilt. Furthermore, the weird, creepy, and friendless girl of the class, Nakamura, saw him take the uniform. Instead of revealing it was him, she recognizes his kindred deviant spirit and uses her knowledge to take control of his life. Will it be possible for Kasuga to get closer to Saeki, despite Nakamura's meddling and his dark secret? What exactly does Nakamura intend to do with him?\n\n(Source: MangaHelpers)","img":"https://cdn.myanimelist.net/images/anime/8/50559.webp","source":"Manga","numberOfEpisode":"13","studio":"Zexcs","type":"TV","score":7.16,"genres":["Psychological","Drama","Romance","School","Shounen"]},{"title":"Boogiepop wa Warawanai (2019)","synopsis":"Hushed exchanges among the female student populace of Shinyo Academy center around an enigmatic supernatural entity. This entity is Boogiepop, a Shinigami who is rumored to murder people at the height of their beauty before their allure wanes. Few know of his true nature: a guardian who, between periods of dormancy, manifests as the alter ego of a high school girl named Touka Miyashita to fend off \"the enemies of the world.\" Now, a string of mysterious disappearances—presumed by the school to be merely runaways—has caused Boogiepop to awaken. But somewhere in the academy, a menacing creature hides, waiting for its opportune moment to strike.\n\nBoogiepop wa Warawanai subtly explores the intrinsic associations between human beings and their perception of time, while delving into its characters' complex relationships, emotions, memories, and pasts.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1135/95454.webp","source":"Light novel","numberOfEpisode":"18","studio":"Madhouse","type":"TV","score":7.13,"genres":["Psychological","Mystery","Horror"]},{"title":"Higurashi no Naku Koro ni Rei","synopsis":"The infamous series of unexplainable murders in Hinamizawa have been solved and the chains of fate have broken due to the efforts of Rika Furude and her friends. Rika believes she has finally obtained the normal and peaceful life she desired with her friends; however, she is proven wrong when the wheels of fate begin turning once again after an unfortunate accident.\n \nRika suddenly finds herself in a \"perfect\" world, the constant cycle of brutal killings having never taken place, where all of her friends are content and satisfied. Not wanting to abandon the world that she fought so hard for, she learns she must destroy an essential \"key\" to get back. But can Rika abandon the faultless world she is given the chance to live in, after all of her battles have brought her this far?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/14113.webp","source":"Visual novel","numberOfEpisode":"5","studio":"Studio Deen","type":"OVA","score":7.48,"genres":["Mystery","Comedy","Psychological","Supernatural","Thriller"]},{"title":"Shoujo Kakumei Utena","synopsis":"After meeting a traveling prince who consoled her after the deaths of her parents, Utena Tenjou vowed to become a prince herself. The prince left Utena only with a ring bearing a strange rose crest and a promise that she would meet him again some day.\n\nA few years later, Utena attends Ootori Academy, where she is drawn into a dangerous game. Duelists with rings matching Utena's own compete for a unique prize: the Rose Bride, Anthy Himemiya, and her mysterious powers. When Utena wins Anthy in a duel, she realizes that if she is to free Anthy and discover the secrets behind Ootori Academy, she has only one option: to revolutionize the world.\n\nShoujo Kakumei Utena blends surrealist imagery and ideas with complex allegories and metaphors to create a unique coming-of-age story with themes including idealism, illusions, adulthood, and identity. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1078/95285.webp","source":"Original","numberOfEpisode":"39","studio":"J.C.Staff","type":"TV","score":8.19,"genres":["Comedy","Drama","Fantasy","Mystery","Psychological","Shoujo"]},{"title":"Happy Sugar Life","synopsis":"Satou Matsuzaka is a beautiful high schooler who has a reputation for being permissive with men. However, a chance encounter with a young girl named Shio Koube makes Satou realize that this is her first and only true feeling of love.\nTelling others that she lives with her aunt, Satou secretly shares an apartment with Shio. Despite her innocent appearance, Satou is willing to do anything to protect her beloved, resorting to desperate measures to ensure that their \"happy sugar life\" remains intact.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1386/103920.webp","source":"Manga","numberOfEpisode":"12","studio":"Ezόla","type":"TV","score":6.98,"genres":["Drama","Horror","Psychological","Shounen"]},{"title":"Death Note: Rewrite","synopsis":"1. Genshisuru Kami (Visions of a God)\nA two hour episode of Death Note, mainly a compilation of the confrontations between Light and L, re-edited from Ryuk's perspective with new dialogue and soundtrack along with additional animation that could not be included in the original series.  An Unnamed Shinigami comes to Ryuk to question him about his new story in the human world.\n\n2. L o Tsugu Mono (L's Successors)\nThis story continues where the previous left off, continuing the story of Light. As the previous special told Light and L's battles, this story does the same with the conflicts between Light, Mello, and Near.  \n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/13/8518.webp","source":"Manga","numberOfEpisode":"2","studio":"Madhouse","type":"Special","score":7.74,"genres":["Mystery","Police","Psychological","Supernatural","Thriller"]},{"title":"Pupa","synopsis":"Abandoned by their abusive parents and with only each other to depend on, siblings Utsutsu and Yume Hasegawa find themselves led astray by beautiful red butterflies that have appeared in their world. Unbeknownst to them, these crimson winged heralds trumpet the beginning of a cannibalistic nightmare—a mysterious virus known as Pupa is about to hatch.\n \nAfter succumbing to the full effects of Pupa, Yume undergoes a grotesque metamorphosis into a monstrous creature with an insatiable desire for flesh; Utsutsu, on the other hand, is only partially affected, gaining remarkable regenerative powers instead. Reaffirming the resolve to keep the promise he made to himself years ago, Utsutsu is willing to sacrifice everything in order to always be there for his precious little sister.\n\nPupa tells the story of a loving brother's desperate struggles to save his sister while protecting the world from her uncontrollable hunger.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/54395.webp","source":"Manga","numberOfEpisode":"12","studio":"Studio Deen","type":"TV","score":3.54,"genres":["Fantasy","Horror","Psychological"]},{"title":"Id:Invaded","synopsis":"The Mizuhanome System is a highly-advanced development that allows humans to enter one of the most intriguing places in existence—the mind of a criminal. Appearing as a bizarre mess of thoughts, an id well is the manifestation of a murderer's unconscious mind. Kura, a specialized police squad, is tasked with analyzing these complex psychological planes to track down the culprits. Brilliant detective Sakaido assists the police by investigating the id wells and piecing together the countless clues scattered within.\n\nHowever, there is a rule regarding those who enter the id wells: you are only permitted to dive into one if you have killed someone yourself. Such is the case for former detective Akihito Narihisago, Sakaido's real-world counterpart. Two years ago, his daughter was brutally murdered by a serial killer, driving Narihisago to seek his revenge.\n\nDespite finding himself on the other side of the law, Narihisago nevertheless continues to assist the police. While his detective skills continue to prove useful toward the investigations, Narihisago discovers he may not have everything figured out—especially regarding those he despises most, serial killers.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1889/105337.webp","source":"Original","numberOfEpisode":"13","studio":"NAZ","type":"TV","score":8,"genres":["Sci-Fi","Mystery","Police","Psychological"]},{"title":"Yakusoku no Neverland 2nd Season","synopsis":"Second season of Yakusoku no Neverland.","img":"https://cdn.myanimelist.net/images/anime/1708/104922.webp","source":"Manga","numberOfEpisode":"?","studio":null,"type":"TV","score":null,"genres":["Sci-Fi","Mystery","Psychological","Thriller","Shounen"]},{"title":"Psycho-Pass 3","synopsis":"Thanks to the Sibyl System, the mental states of society can now be measured on a numerical scale. Using these \"crime coefficients,\" a culprit can be apprehended before they ever commit a crime. But is it a perfect system? For Inspectors Kei Mikhail Ignatov and Arata Shindou, that remains to be seen, as their career with the Public Safety Bureau's Crime Investigation Department has only just begun. \n\nShindou and Ignatov are assigned to investigate the crash of a ship carrying immigrants, but they begin to suspect that it was no mere accident. Meanwhile, a mysterious group called Bifrost is observing them from the shadows, but they aren't the only ones who have taken an interest in the two new Inspectors...\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/1406/104344.webp","source":"Original","numberOfEpisode":"8","studio":"Production I.G","type":"TV","score":7.63,"genres":["Action","Sci-Fi","Police","Psychological"]},{"title":"Subete ga F ni Naru","synopsis":"In a research facility hidden away on a remote island, genius programmer Shiki Magata has lived as a recluse for years. She rarely sees guests, but associate professor Souhei Saikawa and university student Moe Nishinosono still seek her out. However, their meeting is cut short when they are caught up in a locked-room murder mystery. \n\nEverything is not as it seems, and many secrets are hidden. Within an isolated facility, a seemingly impossible and gruesome crime takes place, and Saikawa and Moe must unravel the truth behind the murder and Magata's shrouded past.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/9/76071.webp","source":"Novel","numberOfEpisode":"11","studio":"A-1 Pictures","type":"TV","score":7.29,"genres":["Sci-Fi","Mystery","Psychological"]},{"title":"Kokkoku","synopsis":"Having failed 19 job interviews in one day, Juri Yukawa's dreams of moving out of her parents' home are utterly dashed. Stuck living with her working mother Nobuko, NEET brother Tsubasa, laid-off father Takafumi, and single-parent sister Sanae, the only hope for this family to raise a decent adult is her little nephew Makoto. However, this struggling family's life takes a turn for the worse when Makoto and Tsubasa are violently kidnapped by a mysterious organization and held for ransom. With only 30 minutes to deliver five million yen to the criminals, Juri's grandfather reveals a dangerously powerful secret to her and Takafumi.\n\nBy offering blood to her grandfather's mystical stone, the three enter the world of \"Stasis,\" a version of their world where time stops for everyone but the users. Having arrived at their destination, their rescue efforts go awry when they are assailed by a surprising group of people who are somehow able to move around within Stasis. While all hope seems lost, a monstrous giant known only as the Herald appears amidst the chaos, its intent and motivations as cryptic as the very nature of this timeless world.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/89987.webp","source":"Manga","numberOfEpisode":"12","studio":"Geno Studio","type":"TV","score":7.09,"genres":["Psychological","Supernatural","Drama","Mystery","Seinen"]},{"title":"Gantz 2nd Stage","synopsis":"Kurono Kei and his ex-elementary school classmate, Kato Masaru have survived the first two ordeals that the unknown black sphere Gantz has sent them through. Exploding body parts, struggling to stay alive till the last seconds and seeing your fellow comrades fall in a pile of blood and gore are norm to them now. They are aware now that Gantz can call them up along with any new deeds, at any time for another confrontation with aliens.\n\nWill Kato's experiences in the Gantz world give him the same courage in the real world? With fellow veteran Gantzer Kei Kishimoto currently staying at Kurono's home as his \"adopted pet\", can Kurono stave off his growing lust for her mammaries?\n\nWhat the heck is Gantz?\n\n(Source: anime-source.com)","img":"https://cdn.myanimelist.net/images/anime/10/23247.webp","source":"Manga","numberOfEpisode":"13","studio":"Gonzo","type":"TV","score":7.13,"genres":["Action","Sci-Fi","Horror","Psychological","Supernatural","Drama","Ecchi"]},{"title":"Tokyo Ghoul: \"Pinto\"","synopsis":"The OVA adapts the third story in the Tokyo Ghoul: Hibi novel when Shuu Tsukiyama and Chie Hori met.","img":"https://cdn.myanimelist.net/images/anime/3/78666.webp","source":"Light novel","numberOfEpisode":"1","studio":"Studio Pierrot","type":"OVA","score":7.37,"genres":["Action","Mystery","Horror","Psychological","Supernatural","Drama"]},{"title":"Innocence","synopsis":"With Major Motoko Kusanagi missing, Section 9's Batou is assigned to investigate a string of gruesome murders—seemingly at the hands of faulty gynoids, or sex robots. But when a faulty gynoid leaves Batou a cryptic message, he begins to question the cause of their malfunctions. Suspicions of politically motivated murder and an illegal \"ghost\" quickly crop up, drawing Batou and his partner Togusa into a perilous web of conspiracy.\n\nAs their investigation goes on, the line between man and machine continues to blur, and reality and perception become indistinguishable. Confronting strange and dangerous foes, Batou and Togusa explore a futuristic world filled with machines and living dolls but utterly devoid of humanity.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/75628.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.84,"genres":["Military","Sci-Fi","Police","Psychological","Mecha"]},{"title":"DRAMAtical Murder","synopsis":"Some time ago, the influential and powerful Toue Inc. bought the island of Midorijima, Japan, with the plans of building Platinum Jail—a luxurious utopian facility. Those who are lucky enough to call it home are the wealthiest citizens in the world. The original residents of the island, however, were forced to relocate to the Old Residential District; and after the completion of Platinum Jail, they were completely abandoned.\n \n\"Rib\" and \"Rhyme\" are the most common games played on the island. Rib is an old school game in which gangs engage in turf wars against each other, while Rhyme is a technologically advanced game wherein participants fight in a virtual reality. To be able to play Rhyme, you must have an \"All-Mate\" (an AI that typically looks like a pet), and the match must be mediated by an \"Usui.\"\n\nAoba Seragaki has no interest in playing either game; he prefers to live a peaceful life with his grandmother and All-Mate, Ren. However, after getting forcefully dragged into a dangerous Rhyme match and hearing rumors about disappearing Rib players, all of Aoba's hopes of living a normal life are completely abolished.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/75642.webp","source":"Visual novel","numberOfEpisode":"12","studio":"NAZ","type":"TV","score":6.16,"genres":["Action","Sci-Fi","Super Power","Psychological"]},{"title":"Bokura no","synopsis":"15 children, 8 boys and 7 girls, are enjoying their summer camp together when they suddenly discover a grotto by the sea. When they enter the mysterious place they find a room full of computers, as well as a man named Kokopelli, who introduces himself as the owner. He claims to be working on a game which involves a giant robot that has been designed to protect the Earth from 15 different alien invasions. Kokopelli hasn't been able to test the game yet, so he persuades all but one of the children to sign a contract in what he claims will be a fun adventure.\n\nHowever, as soon as the contracts are signed things start to take a much darker turn. In Bokurano, the children must now pilot the giant robot Zearth one at a time in the hopes that they will have what it takes to defeat all of the upcoming enemies. But Kokopelli has left out one very important piece of information: the giant robot Zearth's energy source.","img":"https://cdn.myanimelist.net/images/anime/1690/97048.webp","source":"Manga","numberOfEpisode":"24","studio":"Gonzo","type":"TV","score":7.69,"genres":["Sci-Fi","Psychological","Drama","Mecha","Seinen"]},{"title":"Casshern Sins","synopsis":"In a distant future, Earth has become a wasteland and humanity as we know it has died out. All that remains are sentient robots. They were supposed to be able to live forever—until the one called Luna died and The Ruin started. Their bodies will rust, and there is nothing that can be done to fix it. Now the robots are left only to contemplate their deaths, kept going only by the rumor that if they eat the one called Casshern they will gain immortality.\n\nCasshern knows nothing about his past, why he exists or what he is, but he must find out or he will face the constant torment of being hunted by robots who don't want to die. Casshern leaves death wherever he goes, but he must face it if he is to find out the truth of this world.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/23336.webp","source":"Other","numberOfEpisode":"24","studio":"Madhouse","type":"TV","score":7.55,"genres":["Action","Adventure","Drama","Psychological","Sci-Fi"]},{"title":"Jigoku Shoujo Futakomori","synopsis":"Ai Enma and her companions continue to offer their service of revenge against those who have wronged others, and the price is as steep as ever—for damning the offender to hell, the person exacting vengeance is sent to the abyss as well. As they cast soul after soul into the darkness, a new sinister force is watching them: a little girl named Kikuri.\n\nWhile Ai continues her duties, she meets a boy named Takuma Kurebayashi, known as the \"Devil's Child\" because of the horrific events that occur around him. Unfortunately, Takuma's reputation leads the townspeople to use him as a scapegoat for those who have been ferried off to hell. When things quickly spiral out of control, Ai must find a way to bring an end to this senseless violence, as it poses a threat to her very existence.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/86975.webp","source":"Original","numberOfEpisode":"26","studio":"Studio Deen","type":"TV","score":7.97,"genres":["Mystery","Horror","Psychological","Supernatural"]},{"title":"Selector Infected WIXOSS","synopsis":"Things are not always what they seem. This is especially true for Ruuko Kominato, when she receives a deck of cards for the popular card game WIXOSS, only to find a girl trapped inside her LRIG, or avatar card. Upon meeting others in the same situation, Ruuko discovers that she has now become a \"Selector,\" a player in a special version of WIXOSS where girls can battle each other for a chance to have their deepest desires come true. However, there is a catch. In contrast to the glory that awaits them after their victories, there is a cruel fate: if they lose three times, their lives will be destroyed.\n\nIn an ominous game filled with lies and deceit, Ruuko and her newfound friends must uncover the secrets behind WIXOSS and realize what is truly most important to them before it is too late.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/70147.webp","source":"Card game","numberOfEpisode":"12","studio":"J.C.Staff","type":"TV","score":7.3,"genres":["Game","Psychological"]},{"title":"Tenkuu no Escaflowne","synopsis":"Hitomi Kanzaki is just an ordinary 15-year-old schoolgirl with an interest in tarot cards and fortune telling, but one night, a boy named Van Fanel suddenly appears from the sky along with a vicious dragon. Thanks to a premonition from Hitomi, Van successfully kills the dragon, but a pillar of light appears and envelopes them both. As a result, Hitomi finds herself transported to the world of Gaea, a mysterious land where the Earth hangs in the sky.\n\nIn this new land, Hitomi soon discovers that Van is a prince of the Kingdom of Fanelia, which soon falls under attack by the evil empire of Zaibach. In an attempt to fight them off, Van boards his family's ancient guymelef Escaflowne—a mechanized battle suit—but fails to defeat them, and Fanelia ends up destroyed. Now on the run, Hitomi and Van encounter a handsome Asturian knight named Allen Schezar, whom Hitomi is shocked to find looks exactly like her crush from Earth. With some new allies on their side, Van and Hitomi fight back against the forces of Zaibach as the empire strives to revive an ancient power.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/30689.webp","source":"Original","numberOfEpisode":"26","studio":"Sunrise","type":"TV","score":7.71,"genres":["Adventure","Fantasy","Mecha","Psychological","Romance","Shoujo"]},{"title":"Mahou Shoujo Site","synopsis":"Every day, Aya Asagiri thinks about killing herself. She is bullied relentlessly at school, and at home, her older brother Kaname physically abuses her to relieve the academic stress put on him by their father.\n\nOne night, as she lies awake wishing for death, a mysterious website called Magical Girl Site appears on her laptop, promising to give her magical powers. At first, she dismisses it as a creepy prank, but when she finds a magical gun in her shoe locker the next day, she doesn't know what to believe. Deciding to take it with her, she soon runs into her bullies once again. But this time, desperate for anything to save her, she uses the gun—and her assailants are transported to a nearby railroad crossing, where they are run over. \n\nAya's conscience is unable to handle the fact that she murdered two of her classmates with magic, and she desperately tries to understand the situation. However, when she finds herself in trouble again, she is saved by Tsuyuno Yatsumura, a classmate who can use magic to stop time. This duo has a lot to do: not only do they have to fight alongside and against other magical girls, but they also need to uncover the truth behind the website and the apocalyptic event known as \"The Tempest\" that is soon to occur.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1456/90843.webp","source":"Manga","numberOfEpisode":"12","studio":"production doA","type":"TV","score":6.49,"genres":["Drama","Horror","Psychological","Supernatural"]},{"title":"Gyakkyou Burai Kaiji: Hakairoku-hen","synopsis":"Owing to an increasing debt, Kaiji Itou ends up resuming his old lifestyle. One day, while walking on the street, he stumbles upon Yuuji Endou, who is hunting Kaiji due to the money he owes to the Teiai Group. Unaware of this, Kaiji eagerly follows Endou, hoping for a chance to participate in another gamble, but soon finds out the loan shark's real intentions when he is kidnapped.\n\nGiven that Kaiji is unable to pay off his huge debt, the Teiai Group instead sends him to work in an underground labor camp. He is told that he will have to live in this hell for 15 years, alongside other debtors, until he can earn his freedom. His only hope to put an early end to this nightmare is by saving enough money to be able to go back to the surface for a single day. Once he is there, he plans to obtain the remaining money needed to settle his account by making a high-stakes wager. However, as many temptations threaten his scarce income, Kaiji may have to resort to gambling sooner than he had expected.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/30599.webp","source":"Manga","numberOfEpisode":"26","studio":"Madhouse","type":"TV","score":8.25,"genres":["Game","Psychological","Thriller","Seinen"]},{"title":"Shinreigari","synopsis":"Strange things are happening around the town of Suiten. The daughter of a priest begins to see strange visions, spirits have started to roam the mountains, and Tarou Komori is having unsettling dreams. Due to the trauma of being kidnapped 11 years ago, he has repressed most of the memories that could shed light on what really happened all those years ago. But they return in his sleep, combined with encounters beyond the realm of dreams.\n \nIn Shinreigari: Ghost Hound, the supernatural and psychological collide, as three children struggle to face their demons and repair the breach between the spiritual and corporeal worlds.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/3/22691.webp","source":"Original","numberOfEpisode":"22","studio":"Production I.G","type":"TV","score":7.49,"genres":["Sci-Fi","Mystery","Psychological","Supernatural"]},{"title":"Jin-Rou","synopsis":"After witnessing the suicide bombing of a terrorist girl, Constable Kazuki Fuse becomes haunted by her image, and is forced to undergo retraining for his position in the Capital Police's Special Unit. However, unknown to him, he becomes a key player in a dispute between Capital and Local Police forces, as he finds himself increasingly involved with the sister of the very girl he saw die.","img":"https://cdn.myanimelist.net/images/anime/1323/103343.webp","source":"Manga","numberOfEpisode":"1","studio":"Production I.G","type":"Movie","score":7.79,"genres":["Military","Police","Psychological","Drama","Romance"]},{"title":"Yuuki Yuuna wa Yuusha de Aru","synopsis":"In her everyday life, Yuuna Yuuki is a hero. As proof, she is in her middle school's Hero Club, where she does her best to help others and bring a smile to everyone's face.\n\nBut Yuuna, always up to any task, is about to become an even bigger hero. Mysterious destructive forces called Vertexes begin threatening the world she loves, and the Hero Club is called upon by a strange phone app to save it. Along with her best friend Mimori Tougou, as well as sisters Fuu and Itsuki Inubouzaki, they must transform into magical girls in order to battle the Vertexes.\n\nIn between studying and putting on shows for kids, Yuuna and the Hero Club must fight for the very existence of their world and face the harsh truths behind their own powers, all the while discovering what it truly means to be a hero.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/77057.webp","source":"Original","numberOfEpisode":"12","studio":"Studio Gokumi","type":"TV","score":7.41,"genres":["Slice of Life","Psychological","Drama","Magic","Fantasy"]}]