[{"title":"Citrus","synopsis":"During the summer of her freshman year of high school, Yuzu Aihara's mother remarried, forcing her to transfer to a new school. To a fashionable socialite like Yuzu, this inconvenient event is just another opportunity to make new friends, fall in love, and finally experience a first kiss. Unfortunately, Yuzu's dreams and style do not conform with her new ultrastrict, all-girls school, filled with obedient shut-ins and overachieving grade-skippers. Her gaudy appearance manages to grab the attention of Mei Aihara, the beautiful and imposing student council president, who immediately proceeds to sensually caress Yuzu's body in an effort to confiscate her cellphone.\n\nThoroughly exhausted from her first day, Yuzu arrives home and discovers a shocking truth—Mei is actually her new step-sister! Though Yuzu initially tries to be friendly with her, Mei's cold shoulder routine forces Yuzu to begin teasing her. But before Yuzu can finish her sentence, Mei forces her to the ground and kisses her, with Yuzu desperately trying to break free. Once done, Mei storms out of the room, leaving Yuzu to ponder the true nature of her first kiss, and the secrets behind the tortured expression in the eyes of her new sister.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/89985.webp"},{"title":"Yuru Yuri","synopsis":"After a year in grade school without her childhood friends, first year student Akari Akaza is finally reunited with second years Yui Funami and Kyouko Toshinou at their all-girls' middle school. During the duo's first year, Yui and Kyouko formed the \"Amusement Club\" which occupies the now nonexistent Tea Club's room. Shortly after Akari joins, one of her fellow classmates, Chinatsu Yoshikawa, pays the trio a visit under the impression that they are the Tea Club; it is only once the three girls explain that the Tea Club has been disbanded that they can convince Chinatsu to join the Amusement Club—a group with no purpose other than to provide entertainment for its members.\n\nBased on the slice-of-life manga by Namori, Yuru Yuri is an eccentric comedy about a group of girls who spend their spare time drinking tea and fawning over each other, all while completely failing to even notice the supposed main character Akari amongst them.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/75173.webp"},{"title":"Kämpfer","synopsis":"Waking up transformed into a beautiful girl might be the stuff of some guys' fantasies, but when the suddenly effeminatized Natsuru is informed by a stuffed tiger that he's now a Kampfer, a mystical fighter who has to fight other Kampfers in female form, his life becomes a living nightmare!\n\nPutting aside the obvious \"plumbing\" issues, Natsuru's best childhood friend turns out to swing the other way and SHE has a crush on his new female body. Not complex enough? Natsuru's school has separate sections for boys and girls, so he and she are now double enrolled. The rumor-mill has it that he's dating herself. And there are other Kampfers attending the school who want to take her out, and he's not sure which ones mean \"on a date\" and which ones mean \"permanently.\" Oh, and did we mention that some Kampfers use swords and guns?! Hormones, fists, and other body parts will fly as the daring, new gender-bender defender must become a contender or die!\n\n(Source: Sentai Filmworks)","img":"https://cdn.myanimelist.net/images/anime/5/35423.webp"},{"title":"Akuma no Riddle","synopsis":"Tokaku Azuma has just transferred to the elite Myoujou Academy, a private girls' boarding school. But there's a catch: she, along with 11 of her fellow students in Class Black, is an assassin taking part in the challenge to kill their sweet-natured classmate, Haru Ichinose. Whoever succeeds will be granted their deepest desire, no matter the difficulty or cost. However, each assassin only gets one chance; if they fail to kill her, they will be expelled.\n\nDespite the extraordinary reward, Tokaku decides to take a different course of action. Though Haru is her target, the young assassin soon finds herself drawn to the very girl she is supposed to kill. With the entire class out for Haru, Tokaku refuses to let her friend die, vowing to protect her from a growing bloodlust.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/60479.webp"},{"title":"Sakura Trick","synopsis":"Having been best friends since middle school, Haruka Takayama and Yuu Sonoda plan to attend Misato West High School together. However, despite being assigned to the same class, a cruel twist of fate has them seated on the opposite ends of their classroom! To make matters worse, their school will shut down in three years, making them the final intake of first-year students. Undeterred by this chain of unfortunate events, Haruka is set on sticking with Yuu, striving to create many wonderful memories with her.\n\nMuch to Haruka's jealousy however, Yuu's easygoing demeanor quickly attracts the attention of their female classmates. Sympathizing with her friend's growing insecurity, Yuu ends up sharing a deep, affectionate kiss with her in an empty classroom. The act intensifies their bond as \"special friends,\" gradually revealing a different aspect to their unique friendship while also inviting new conflicts.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/56189.webp"},{"title":"Mnemosyne: Mnemosyne no Musume-tachi","synopsis":"Immortality is something many people would wish for. But would it be such a coveted ability if people knew they would be subject to countless attacks because of it? Such is the case for Rin Asougi, an immortal private investigator, because there is no shortage of people who want her dead. Over the centuries, she has met many grisly ends, but each time, she returns to life as if nothing had happened.\n\nIn 1990, while looking for a lost cat, Rin runs into Kouki Maeno, a man who feels that his memories are wrong. Agreeing to help him, Rin discovers that Kouki is not what he seems, all the while drawing closer to her true enemy. This adversary knows Rin and her kind all too well, and if she dies by his hand, she may stay dead permanently.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/10918.webp"},{"title":"Yagate Kimi ni Naru","synopsis":"Yuu Koito has always been entranced with romantic shoujo manga and the lyrics of love songs. She patiently waits for the wings of love to sprout and send her heart aflutter on the day that she finally receives a confession. Yet, when her classmate from junior high declares his love for her during their graduation, she feels unexpectedly hollow. The realization hits her: she understands romance as a concept, but she is incapable of experiencing the feeling first-hand.\n \nNow, having enrolled in high school, Yuu, disconcerted and dispirited, is still ruminating over how to respond to her suitor. There, she happens upon the seemingly flawless student council president, Touko Nanami, maturely rejecting a confession of her own. Stirred by Touko's elegant manner, Yuu approaches her for advice, only to be bewildered when the president confesses to her! Yuu quickly finds herself in the palm of Touko's hand, and unknowingly sets herself on a path to find the emotion which has long eluded her.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1783/96153.webp"},{"title":"Maria†Holic","synopsis":"In search of true love, Kanako Miyamae transfers to Ame no Kisaki Catholic school, inspired by how her parents fell in love with each other there. There is just one difference, though: because men make Kanako break into hives, she has actually come to the all-girls school to find a partner of the same sex.\n \nWhen she meets the beautiful Mariya Shidou, Kanako believes she has found that special someone; however, there's more to Mariya than meets the eye—it turns out that Kanako's first love is actually a cross-dressing boy. Mariya threatens to expose Kanako's impure intentions unless she keeps his real gender a secret, and to make things worse, he also replaces her original roommate so that he can now keep a close eye on her.\n\nMaria†Holic follows Kanako as she looks for love in all the wrong places and searches for the girl of her dreams—that is, if she can survive being Mariya's roommate!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/12187.webp"},{"title":"Yuru Yuri♪♪","synopsis":"The girls of the Amusement Club return in Yuru Yuri♪♪, finding new ways to make passing time even more enjoyable. Their members consist of the always energetic Kyouko Toshinou; calm and sensible Yui Funami; polite but often overlooked Akari Akaza; and Chinatsu Yoshikawa, who stumbled upon the others while looking for the Tea Ceremony Club. Together they are the Amusement Club, which has the deceptively simple task of keeping its members entertained.\n\nAlong with the Student Council and the odd family member, they strive to enjoy their youth to the fullest. Whether it's a trip to a hot spring or finishing overdue homework, their lives are never dull, and they will always find an excuse to spend time together.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/75174.webp"},{"title":"Strawberry Panic","synopsis":"Aoi Nagisa transfers to one of the three affiliated all-girl Catholic schools on Astraea Hill, St. Miator's Girls' Academy. There, she discovers a community of fellow students entwined in an intricate hierarchy, in which two Etoiles represent the three schools. In order to fit in, Nagisa must go to class, join clubs, and make new friends. Meanwhile, Shizuma Hanazono, the sole Etoile of Astraea Hill, finds herself drawn to this new, exciting transfer student. As Shizuma and Nagisa get to know each other, Shizuma finally decides it is time to face her troubled past.","img":"https://cdn.myanimelist.net/images/anime/3/14070.webp"},{"title":"Mai-HiME","synopsis":"Thirteen girls, each with the ability to materialize \"Elements\" and summon metallic guardians called \"Childs\" have been brought to Fuuka Academy to battle mysterious creatures called Orphans. Each with a different personality and background, they must decide who they truly care about and why they fight. ","img":"https://cdn.myanimelist.net/images/anime/13/7226.webp"},{"title":"Netsuzou TRap","synopsis":"High school students Yuma Okazaki and Hotaru Mizushina are childhood friends. With their respective boyfriends, Takeda and Fujiwara, their lives couldn't be more perfect. From playing in school to going on group dates, it seems nothing can break their bond. \n\nHowever, during one such group date, Hotaru makes an unexpected move. While Takeda and Fujiwara are distracted, she begins stroking Yuma's thighs. Taken aback by this peculiar action, Yuma awkwardly retreats to the toilets, followed shortly by her aggressor. Now in private, Hotaru forces the innocent Yuma into a locked cubicle and whispers into her ear: \"You'll be more nervous with a boy; I'll help you practice.\"\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/86667.webp"},{"title":"Konohana Kitan","synopsis":"In a bustling village of spirits, Yuzu, a cheerful fox girl, starts her first job as an attendant at the traditional hot springs inn Konohanatei. Though Yuzu has no experience working at such a high-class establishment, Kiri, the affable and reliable head attendant, immediately puts her to work learning the basics.\n\nWhile Yuzu's eagerness initially proves to be more of a hindrance than a blessing, her playful nature brings a unique charm to the inn, as both customers and her fellow workers quickly warm up to her clumsy yet well-meaning mistakes. Under the guidance of the other foxes—the rigid Satsuki, the carefree Natsume, the critical Ren, and the quiet Sakura—Yuzu steadily learns the trade of an inn attendant while learning to love the magical world surrounding her.\n\nKonohana Kitan presents the heartwarming tale of a simple fox girl forging bonds with others and finding a home amidst the mysterious, beautiful world of spirits.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/88431.webp"},{"title":"Watashi ni Tenshi ga Maiorita!","synopsis":"College student Miyako Hoshino is quite shy around other people. She mostly spends her time in her room making cosplay outfits. When her fifth-grade sister Hinata brings her classmate Hana Shirosaki home, Miyako instantly becomes captivated with Hana's cuteness. \n\nMiyako tries to do various things, ranging from making Hana wear cosplay dresses to giving her sweets. This gives Hana a bad impression of her at first, but Miyako will do anything to grow closer to the angel who has descended before her.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1778/100470.webp"},{"title":"Valkyrie Drive: Mermaid","synopsis":"Naïve 16-year-old Mamori Tokonome is accustomed to being teased at school for having an unfortunate surname that can also be read as \"virgin.\" However, young Mamori will soon have to get used to being teased in other ways...\n\nKidnapped during gym class, Mamori wakes up only to find herself stranded and under attack on the exotic island of Mermaid. Luckily, enigmatic fellow castaway Mirei Shikishima knows exactly how to take the lead—through a passionate kiss, Mirei unleashes Mamori's Exter transformation abilities, turning the innocent red-head into a battle-ready cutlass through the power of arousal.\n\nThe duo will need to tap into that power as Mermaid Island is full of potential friends and foes: Charlotte, the sadistic Liberator of an Exter harem; the gluttonous and crafty Meifon; the mysterious but charismatic Akira Hiiragi; and the erotic biker duo Lady Lady. Mamori and Mirei's powerful and intimate embrace is the only way for the pair to ensure their survival on this scandalous island.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/75528.webp"},{"title":"Yuru Yuri San☆Hai!","synopsis":"The members of the Amusement Club are back with more of Kyouko Toshinou's antics, Chinatsu Yoshikawa's schemes, Yui Funami's retorts, and Akari Akaza's small social presence as they strive to make each day as fun as the last! Whether the activity is an arm wrestling contest or making pancakes together, the group of entertainment-seekers are sure to give it their all.\n\nThe club members are often joined by their friends in the Student Council, who know how to have a good time as well. While it can get a little chaotic when all eight girls get together, it sure doesn't stop them from meeting up and having fun!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/76667.webp"},{"title":"Yuri Kuma Arashi","synopsis":"In the past, humanoid bears coexisted with humans. However, a meteor shower that fell onto Earth had a strange effect on bears throughout the world: they suddenly became violent and hungry for human flesh, spurring an endless cycle of bloodshed in which bear ate man and man shot bear, forgetting the lively relationship they once had. The \"Wall of Severance\" was thus built, separating the two civilizations and keeping peace.\n\nKureha Tsubaki and Sumika Izumino are two lovers attending Arashigaoka Academy, who, upon the arrival of two bears that have sneaked through the Wall of Severance and infiltrated the academy, find their relationship under a grave threat. The hungering yet affectionate bears, Ginko Yurishiro and Lulu Yurigasaki, seem to see the bear-hating Kureha as more than just another meal, and in getting closer to her, trigger an unraveling of secrets that Kureha may not be able to bear.\n\nWhen their relationships provoke the Invisible Storm, a group that keeps order within the ideological school, the girls must stand on trial with their love, embarking on a journey of self-discovery en route to attaining true love's \"promised kiss.\"\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/69203.webp"},{"title":"Uchi no Maid ga Uzasugiru!","synopsis":"Having lost her mother at a young age, Misha Takanashi, a second grader who is half-Russian and half-Japanese, now lives with her Japanese father. Tsubame Kamoi, formerly a Japan Air Self-Defense Force, JASDF officer, comes to the Takanashi household as a housekeeper. This is a home comedy where Kamoi, a hardcore lolicon, attempts to get near Misha as she tries to fight against her.","img":"https://cdn.myanimelist.net/images/anime/1786/95330.webp"},{"title":"Mikagura Gakuen Kumikyoku (TV)","synopsis":"To be around cute girls wearing cute clothing is all Eruna Ichinomiya desires. Since Mikagura High School happens to have the cutest uniforms around, she decides to enroll in this prestigious high school known for its cultural clubs.\n\nHowever, she does not realize that joining a club is mandatory, and representatives from each club must battle for a ranking. Based on these rankings, club members are awarded housing and food. Chasing after Seisa Mikagura, the most beautiful girl in school, Eruna joins the going-home club but finds herself thrust into fighting the next club battle. With the other club representatives wielding unique powers, the competition is sure to be fierce!\n\nBased on the popular song series, Mikagura Gakuen Kumikyoku follows Eruna as she explores the various clubs in school and assists the members with their troubled lives, all of whom are also vying for the top spot in school.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/73590.webp"},{"title":"Hidan no Aria AA","synopsis":"Akari Mamiya, a first-year student from Tokyo Butei High, idolizes the S-rank Butei Aria Holmes Kanzaki and wishes to follow in her footsteps. Despite only being an inept E-rank Butei, Akari's resolve to improve remains strong. After the idea of having an Amica contract (a senior-student mentorship program) with Aria is brought up, Akari submits a request form attempting to establish said contract. Her classmates and friends do not expect Aria to accept Akari's request, mainly because of the girl's strict selection process, but to everyone's surprise, Aria gives Akari a chance through a test, which Akari miraculously passes! However, Aria will not officially make Akari her Amica until Akari meets her standards.\n\nTraining under Aria will be no easy feat, as she has to concurrently manage her relationships with her friends. Will Akari have what it takes to walk down the same path as her idol?\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/12/76700.webp"},{"title":"Aoi Hana","synopsis":"Shy and soft-spoken Fumi Manjoume and upfront and caring Akira Okudaira were best friends in elementary school, but this changed when Fumi and her family moved away. Years later, Fumi moves back to her hometown after being accepted at Matsuoka Girls’ High School. She finally reunites with Akira, who is going to attend Fujigatani Girls’ Academy. Despite their reunion, their relationship isn't the same as it was years ago.\n\nAs soon as Fumi starts attending school, popular senior Yasuko Sugimoto takes notice of her and flatters her more than any other underclassmen. After running to Akira for help so many times before, Fumi must figure out who she is as a person instead of standing in someone else’s shadow.  However, that doesn’t stop Akira from wanting her friendship with Fumi to be as it once was. Will the girls be able to conquer the high school stage of growing up before it pulls them apart?\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/3/80255.webp"},{"title":"Tonari no Kyuuketsuki-san","synopsis":"Rumors tell about an ageless girl who only comes out at night, living in a mansion in the middle of the forest. Some say that she is a living doll with a soul. Upon hearing these rumors, Akari Amano seeks out this girl, only to find herself lost as she treks through the woods amidst the darkness.\n\nA vampire named Sophie Twilight saves her, turning out to be the rumored girl. However, unlike the vampires told in myths, Sophie does not attack humans and instead orders her blood online. Akari instantly becomes charmed with her doll-like appearance and proceeds to abruptly move in with her, thus starting their life together.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1851/96154.webp"},{"title":"Candy Boy: Nonchalant Talk of the Certain Twin Sisters in Daily Life","synopsis":"Yukino and Kanade Sakurai are twin sisters that live together in a high school dorm. Although they are twins, they tend to act romantic toward each other, holding hands and going on dates. One day, Kanade sees Yukino hanging out with a new girl, Sakuya Kamiyama. Realizing how much time these two spend together, Kanade assumes they are dating, and she begins to distance herself from her sister. Yukino promptly notices and pleads with Kanade not to leave. In reality, Sakuya has only been asking for advice about Kanade, revealing her obsessive love. How will this love triangle play out?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/13663.webp"},{"title":"Inugami-san to Nekoyama-san","synopsis":"Yachiyo Inugami, a cat-loving extrovert, and Suzu Nekoyama, a dog-loving introvert, are unexpectedly cast into a relationship on a day like any other. The pair find themselves drawn together through an inexplicable attraction of their opposite personalities. As they quickly begin to understand one another, Inugami's hardened resolve to gain Nekoyama's favor only leads to frenzied responses. Soon after their momentous union, the two begin to spend more time with one another, growing closer all the while.\n \nTheir combined antics gain the attention of the mousy Mikine Nezu, a classmate of Inugami, and soon they join the \"biology\" club. There, they meet Ushikawa Ukiji, a passive, cow-like upperclassmen. Nezu and Nekoyama soon begin to build upon their relationship and a game of cat and mouse soon begins.\n \nWild, explosive, and vibrant, Inugami-san to Nekoyama-san tells the comedic tale of two high school girls and their less-than-normal relationship.\n \n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/61921.webp"},{"title":"Kannazuki no Miko","synopsis":"Kannazuki no Miko begins in the village of Mahoroba, where time passes slowly for both man and nature. Two students from the village's prestigious Ototachibana Academy might as well be night and day. Himeko is shy and unassertive, while Chikane is bold and elegant. Despite this, they love each other, and nothing can come between them, no matter how hard they try.\n\nOn the two girls' shared birthday, a sinister voice corrupts one of their friends into attacking them, and just when it seemed grimmest, the lunar and solar priestess powers that lay dormant in the two girls awaken, dispelling the evil. That was only the first hurdle, however. The two must now fend off the countless others who would threaten their well-being—even the people closest to them!","img":"https://cdn.myanimelist.net/images/anime/8/73955.webp"},{"title":"Yuru Yuri Nachuyachumi!","synopsis":"Even during summer break, the Amusement Club lives up to its name! When Akari Akaza, Kyouko Toshinou, Chinatsu Yoshikawa, and Yui Funami find a camping tent, they decide to put it to good use by spending the weekend outside in the mountains. When some student council members catch wind of this, they are invited to come along as well.\n\nAfter a very long journey, the group arrives at their destination and is ready to make the most of their trip. They engage in classic camping activities, such as outdoor cooking and tests of courage, and finish it all off with a visit to the hot springs. An extravagant trip like this doesn't happen every day, but the Amusement Club is sure to savor each moment.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/73281.webp"},{"title":"Maria†Holic Alive","synopsis":"When Kanako Miyamae transferred to a new all-girls school, she hoped to find true love. What she found instead was the beautiful Mariya Shidou, a charming classmate Kanako met on her first day. But Mariya has one flaw: she is actually a cross-dressing boy! After discovering Mariya's secret and becoming stuck with him as her roommate, Kanako's life has become a series of misfortunes. All she wants is to find the girl of her dreams, which is hard to do with the meddling of the sadistic Mariya and his sharp-tongued maid Matsurika Shinouji.\n \nMaria†Holic Alive continues the story of Kanako as she deals with being Mariya's roommate and aims to find true love, while enduring high school itself.\n \n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/78775.webp"},{"title":"Sasameki Koto","synopsis":"Murasame Sumika is popular in the high school for her excellence in the marks and sports. However, she has a secret: she is in love with her classmate Kazama Ushio. Ushio also has a liking to the love between girls, but she hasn't noticed Sumika's feelings and has always been refused by other girls.","img":"https://cdn.myanimelist.net/images/anime/9/75225.webp"},{"title":"Kämpfer für die Liebe","synopsis":"A two-episode special. They are designated as Episodes 13 and 14, and the first episode is a direct sequel to the previous series while the second episode is about the trans-sex of Natsuru.","img":"https://cdn.myanimelist.net/images/anime/2/29811.webp"},{"title":"Maria-sama ga Miteru","synopsis":"When Yumi Fukuzawa entered the Lillian Girls' Academy, a prestigious all-girls Catholic school in Tokyo, she never imagined she would catch the eye of beautiful and demure Sachiko Ogasawara, one of the school's most popular students. Now Sachiko has offered to be Yumi's soeur, her \"sister\" and guide for all her years at the academy. The whole idea has Yumi completely flustered—after all, they hardly know each other!\n\nThe entire campus is abuzz with rumors about the two of them, but Yumi is conflicted over accepting Sachiko's offer. While she admires Sachiko, being her soeur would also mean constantly being at the center of the entire school's attention!\n\n(Source: RightStuf)","img":"https://cdn.myanimelist.net/images/anime/7/75207.webp"},{"title":"Tachibanakan Triangle","synopsis":"As Hanabi Natsuno returns home after six years in Tokyo, memories flood into her. As she prepares to start high school, she moves to Tachibanakan, the local dormitory for female students. Upon her arrival, Hanabi stumbles upon a bare naked beauty, and instantly falls head over heels for her. She also reencounters Konomi Fujiwara, her childhood friend who she barely remembers.\n\nHanabi is introduced to the other residence of the dorm and quickly becomes the center of attention. As the girls instantly take to the newcomer and begin shooting for her affection—subtly or obtrusively—Hanabi realizes that it is certainly going to be an interesting school year.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1436/91859.webp"},{"title":"Kashimashi: Girl Meets Girl","synopsis":"Hazumu was a shy boy who enjoyed gardening, collecting herbs, and long walks in the mountains. One day he finally worked up the courage to confess his love to Yasuna, but she rejected him. \n\nDepressed, he wandered up Mt. Kashimayama, the place where they first met, to reconsider his feelings. After getting lost, he wished upon a shooting star and received a bizarre twist of fate. \n\nNow he is a she, and she stumbles headfirst back into social life and relationships only to find that the entire landscape has changed!\n\n(Source: Media Blasters)","img":"https://cdn.myanimelist.net/images/anime/9/19498.webp"},{"title":"Yuru Yuri Nachuyachumi!+","synopsis":"Extra episodes of Yuru Yuri Nachuyachumi!","img":"https://cdn.myanimelist.net/images/anime/2/75992.webp"},{"title":"Asagao to Kase-san.","synopsis":"Yui Yamada, a timid girl who enjoys tending to her school's greenery, falls in love with the boyish and athletic Tomoka Kase. The two eventually begin dating, and the story follows the pair as they face various challenges in their relationship.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/1578/94205.webp"},{"title":"Shoujo Kakumei Utena: Adolescence Mokushiroku","synopsis":"All eyes are on Utena Tenjou, a mysterious transfer student to Ohtori Academy. But Utena's eyes seem to be fixed on one familiar face that stands out among the rest—Touga Kiryuu, Utena's childhood friend. Touga knows of Utena's past and possesses knowledge of the Mark of the Rose, a set of unique rings worn by those who compete for the hand of the Rose Bride. The Rose Bride, Himemiya Anthy, belongs to whomever wins her in a duel, and the one that wins all the duels is said to be given the power to bring revolution to the world. Utena is drawn into the duels, but Touga and their complicated history together may end up unraveling everything. Nothing is as it seems in this retelling of the original anime series.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/22710.webp"},{"title":"Simoun","synopsis":"In the peaceful theocracy of Simulicram, everyone is born female. At age 17, each maiden undergoes a special ceremony where she chooses her sex. However, only Pairs of maiden priestesses can synchronize with the ancient flying ships known as Simoun needed to defend Simulicram. These Pairs refrain from undergoing the ceremony as long as they wish to keep piloting their Simoun.\n\nAer is recruited to be a Simoun pilot after a terrifying attack by an enemy nation decimates the squadron known as Chor Tempest. To earn her wings she needs to find her way into the heart of Neviril, Regina of Chor Tempest. But Neviril's heart still belongs to her previous Pair, lost in the battle when she attempted a forbidden Simoun maneuver.\n\n(Source: Media Blasters) ","img":"https://cdn.myanimelist.net/images/anime/9/29109.webp"},{"title":"Kuttsukiboshi","synopsis":"To Kiiko Kawakami, there was nothing in the world as important to her as Aaya Saitou. Something about her allured Kiiko to the extent that there was no sound sweeter to her ears than Aaya's voice and no sight more beautiful than her hair softly billowing in the wind. It was for that reason she let Aaya in on her secret: last year, she had gained psychic powers from an accident that changed her life.\n\nKuttsukiboshi is a story of infatuation and romance between two girls as their feelings for one another reach the tipping point. Unable to deny their heartfelt desires, the two give into them and make many sweet memories together around the school—testing the bounds of Kiiko's powers and how far they can go without being caught in the midst of their trysts. However, will things remain as they are when Kiiko discovers the love of her life has a dark secret of her own?","img":"https://cdn.myanimelist.net/images/anime/7/25761.webp"},{"title":"Kanamemo","synopsis":"Middle schooler Kana Nakamachi's life drastically changes when her grandmother passes away. Leaving behind an empty house, Kana learns that no one can provide her lodging due to her young age. Eventually, she stumbles upon the Fuhshin Gazette, a local newspaper delivery business who is able to provide her with a place to stay if she works for them in return.\n\nThe small store is staffed by several unique people: the sweets-loving Yume Kitaoka and her girlfriend Yuuki Minami; the frugal Hinata Azuma; the alcoholic Haruka Nishida; and the young but mature Saki Amano. It is not all fun and games at the Fuhshin Gazette, though, as Kana must deal with long working hours, energetic dogs guarding mailboxes, and confusing delivery routes. Add in a small rivalry with Mika Kujiin, a girl from a competing store, and Kana will have more than enough to keep her hands full!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/52677.webp"},{"title":"Akuma no Riddle: Shousha wa Dare? Nukiuchi Test","synopsis":"Unaired episode 13 of Akuma no Riddle released with the seventh Blu-ray/DVD volume.\n\nThe special will be previewed at a screening in Tokyo City on November 22, 2014. The BD/DVD will be released on December 17, 2014. ","img":"https://cdn.myanimelist.net/images/anime/11/63653.webp"},{"title":"Candy☆Boy: Side Story For Archive","synopsis":"The very first Candy☆Boy episode.\n\nTwin sisters, Yukino and Kanade Sakurai, room together in the dorms at their high school, enjoying school life with their friends and one another. One day, Sakuya Kamiyama, an underclassman, seeks out Yukino, while Kanade learns from a friend that Sakuya has admired Yukino for a very long time.  This innocent revelation sets into motion a chain of events that eventually lead to Yukino expressing her feelings for her sister.\n","img":"https://cdn.myanimelist.net/images/anime/3/35473.webp"},{"title":"Blue Drop: Tenshi-tachi no Gikyoku","synopsis":"Five years ago, something horrifying happened on Kamioki Island. Something so nightmarish that it stripped all memory from Mari Wakatake's mind even as it left every other human on the island dead in its wake! Now enrolled against her will at an isolated girl's academy, Mari is unaware that hidden eyes are watching her, waiting for her memory to return. \n\nBuried in her psyche is the most terrifying secret of all: while Mari was the only human who lived, she may not have been the only survivor! As something in a female skin invades Kaihou Academy, Mari's only hope may lie in a strange girl to whom she is inexplicably drawn yet cannot trust. \n\n(Source: Sentai Filmworks) ","img":"https://cdn.myanimelist.net/images/anime/3/50485.webp"},{"title":"Gokujo.: Gokurakuin Joshikou Ryou Monogatari","synopsis":"A story about the humorous misadventures of Akabane Aya, an arrogant high school girl who's constantly trying to outdo her classmates in everything (especially sex appeal), only to make a fool of herself in the process. Since the story takes place in an all-girls school, expect lots of yuri fanservice innuendos without much seriousness.\n","img":"https://cdn.myanimelist.net/images/anime/11/35659.webp"},{"title":"Yami to Boushi to Hon no Tabibito","synopsis":"Hatsuki is a highschool student living with her sister, Hatsumi, who she has a huge crush on. On Hatsumi's 16th birthday, she is suddenly surrounded by a green light and disappears in front of Hatsuki. She manages to follow Hatsumi with the help of a being resembling a fat baby chick (literally), ending up in a place called \"The Great Library\", which is full of different worlds stored in books. Hatsumi wasn't there, though, so the search for Hatsuki's great love begins and involves traveling from book to book.\n\n(Source: AniDB) ","img":"https://cdn.myanimelist.net/images/anime/13/23094.webp"},{"title":"Oniisama e...","synopsis":"When 16-year-old Nanako Misonoo enters the prestigious all-girls Seiran Academy, she believes a bright future awaits her. Instead, the unlucky girl finds herself dragged into a web of deceit, misery, and jealousy. On top of that, she is chosen as the newest inductee of the Sorority, an elite group whose members are the envy of the entire school. Having none of the grace, wealth, or talent of the other members, Nanako quickly draws the ire of her jealous classmates—especially the fierce Aya Misaki.\n\nTo cope with her increasingly difficult school life, Nanako recalls her days through letters to her former teacher, Takehiko Henmi, whom she affectionately calls \"onii-sama\" (big brother). She also finds comfort with her four closest friends: her childhood friend Tomoko Arikura, the sociable but erratic Mariko Shinobu, the troubled musician Rei Asaka, and the athletic tomboy Kaoru Orihara.\n\nAn impassioned drama about the hardships of bullying, Oniisama e... chronicles a young girl's harsh life at her new school, as she endures cruel rumours, heartless classmates, and countless social trials.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/18531.webp"},{"title":"Candy Boy Episode: EX01 - Mirai Yohouzu","synopsis":"A dvd only prequel to the Candy Boy series.  Twin sisters, Yukino and Kanade Sakurai, move to a new school in the big city of Tokyo but not everything is quite like they expected.","img":"https://cdn.myanimelist.net/images/anime/10/35525.webp"},{"title":"Kimi no Hikari: Asagao to Kase-san.","synopsis":"\"Please. I hope Kase-san likes me...\"\n\nYamada is a shy second-year high school girl who is a member of the greenery committee. Kase from the class next to hers is a beautiful girl who is the ace of the school's track team. As a result of the morning glories planted by Yamada, the distance between the two people who have never exchanged words shrinks little by little.\n\n(Source: Pony Canyon)","img":"https://cdn.myanimelist.net/images/anime/13/84882.webp"},{"title":"Maria-sama ga Miteru: Haru","synopsis":"The spring term is beginning for the students at Lillian Girls' Academy. Friends are reunited, but for the Yamayuri Council, it's a bittersweet time. Yoko, Eriko, and Sei are busy preparing to depart Lillian while Sachiko, Rei, and Shimako are doing their best to ensure that their dear sisters receive a memorable commencement.\n\nSei's departure will leave a sizable hole in the White Roses, and filling it won't be easy. But is there anyone who could appeal to Shimako enough to become the next Rosa Gigantea en bouton?\n\n(Source: RightStuf)","img":"https://cdn.myanimelist.net/images/anime/9/75208.webp"},{"title":"Re: Cutey Honey","synopsis":"A mysterious organization known as Panther Claw make their presence known by terrorizing Tokyo and giving the cops a run for their money. Police are further baffled by the appearance of a lone cosplaying vigilante who thwarts all of Panther Claw's evil schemes before disappearing. That cosplayer is Honey Kisaragi, the result of the late Professor Kisaragi's prize experiment. A master of disguise, Honey can magically alter her physical appearance and outfits. But with a push of the heart-shaped button on her choker, she transforms herself into Cutie Honey, the scantily-clad, sword-wielding warrior of love and justice.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/52103.webp"},{"title":"Candy Boy Episode: EX02 - Shiawase Kyouyuu Riron","synopsis":"Final episode (designated as Episode 8) of Candy Boy which came with DVD volume 2.\n\nThe episode centres around a day at the pool.","img":"https://cdn.myanimelist.net/images/anime/4/14762.webp"},{"title":"Maria-sama ga Miteru 3rd","synopsis":"Summer has arrived, and the students of Lillian Girls' Academy are on break! Yumi and Sachiko head out to the Ogasawara family's summer home, but what was supposed to be a relaxing vacation takes a turn for the worse when some of Sachiko's old acquaintances drop by for tea. These rich and snobby debutantes don't think Yumi is worthy of Sachiko's affection and they're out to make this summer one she'll regret.\n\n(Source: RightStuf)","img":"https://cdn.myanimelist.net/images/anime/6/75209.webp"},{"title":"Maria-sama ga Miteru 4th","synopsis":"Yumi and the Yamayuri Council have found two new helpers in Kanako and Toko. Unfortunately, their assistance comes with tension, as neither girl is particularly fond of the other and both seem likely candidates to be Yumi's petite soeur. Will either be a good fit for Yumi? As the school year marches on, the work for the Yamayuri Council piles up, and pressure begins to mount for Yumi to make her final decision.\n\n(Source: RightStuf)","img":"https://cdn.myanimelist.net/images/anime/4/75206.webp"},{"title":"Yuru Yuri,","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1138/99547.webp"},{"title":"Watashi ni Tenshi ga Maiorita! Special","synopsis":"Hinata Hoshino, Hana Shirosaki, and Noa Himesaka are off to the countryside for a camping trip. At Hinata's behest, her elder sister, Miyako, reluctantly tags along. Seeing how gloomy Miyako is, the trio do their best to get her to enjoy herself too.\n\nBesides the camping trip, Watashi ni Tenshi ga Maiorita! Special contains three more short stories of the girls. Although their lives seem normal, one thing is certain: there is definitely no shortage of cuteness here!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1057/98215.webp"},{"title":"Yuri Seijin Naoko-san","synopsis":"Naoko-san is an alien from the planet Yuri, who is plotting to conquer the Earth by yurifying it. Misuzu is a junior high girl and is always troubled by Naoko-san, who lives on the roof of her house. They hear rumors that a molester is wandering around in the area, so they decide to investigate.","img":"https://cdn.myanimelist.net/images/anime/11/75498.webp"},{"title":"Kashimashi: Girl Meets Girl - Shoujo wa Shoujo ni Koi wo Shita","synopsis":"This is an OVA released on October 27th, 2006. It is also classified as the 13th episode (thus a sequel) to Kashimashi ~Girl Meets Girl~.\n\nHazumu confessed his love to Yasuna, but she turned him down him. To ease his heartbreak, he went to Mt. Kashimayama where he had met her first. However he lost his way in the mountain, and it was night time. He saw a big shooting star, and when he began to wish, he found out that something was wrong. It was not a shooting star, but it was a falling space ship. He was involved in the crash, but he managed to survive by the help of an alien. However, he became a girl due to the accident during the reconstruction of his body.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/18416.webp"},{"title":"Valkyrie Drive: Mermaid Specials","synopsis":"Mini OVA episodes bundled with the Blu-ray and DVD releases of Valkyrie Drive: Mermaid.","img":"https://cdn.myanimelist.net/images/anime/8/76450.webp"},{"title":"Inugami-san to Nekoyama-san: Nekoyama-san to Onsen Ryokou","synopsis":"Unaired episode bundled with the Blu-ray/DVD Box-Set.","img":"https://cdn.myanimelist.net/images/anime/12/65499.webp"},{"title":"Fragtime","synopsis":"What would you do if you could stop time? Moritani for one is using her unusual ability to stop time for three minutes a day to observe the people around her. One day, she chooses to \"observe\" class idol Murakami's panties—only to find herself in a very compromising situation when her classmate turns out to be immune to her power.\n \n(Source: Yuri Project)","img":"https://cdn.myanimelist.net/images/anime/1134/102375.webp"},{"title":"Uchi no Maid ga Uzasugiru!: Uchi no Maid wa Yappari Mou Honto Uzainda naa...","synopsis":"Special swimsuit-featured episode included in the fourth DVD/Blu-ray volume.","img":"https://cdn.myanimelist.net/images/anime/1022/100738.webp"},{"title":"Kanamewo","synopsis":"A young, unnamed woman, while biking home from the bank she works at, happens upon a weakened tree goddess whose native shrine is being demolished for construction work. She rescues her and brings the goddess home with her. The two form a relationship, but what will happen to the goddess as the construction progresses?","img":"https://cdn.myanimelist.net/images/anime/7/83455.webp"},{"title":"Yuri Seijin Naoko-san (2012)","synopsis":"Naoko-san is an alien from the planet Yuri, who is plotting to conquer the Earth by yurifying it. Misuzu is a junior high girl and is always troubled by Naoko-san, who lives on the roof of her house.","img":"https://cdn.myanimelist.net/images/anime/12/75497.webp"},{"title":"Koutetsu Tenshi Kurumi 2","synopsis":"Taking place 75 years after the first series, Steel Angel Kurumi 2 brings the Steel Angels in a new mis-adventure. High school student and aspiring cellist Nako Kagura accidentally discovers and kisses Kurumi Mk. II at her home, thus making her Kurumi's master. But things go awry as Nako's best friend Uruka gets jealous and tries anything - including her father's army of top-secret mecha - to destroy Kurumi and win back Nako. Things get more out of control when Saki Mk. II is awakened by Uruka, and Karinka Mk. II joins in to steal Nako away from Kurumi. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/15907.webp"},{"title":"Fushigi no Kuni no Miyuki-chan","synopsis":"Miyuki, a cute girl, is in over her head. When late for school, she is suddenly transported to another world (Alice In Wonderland style), except that all the inhabitants of the other world are female...and they all seem to be in love with Miyuki. And the world behind her mirror is even weirder. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/13045.webp"},{"title":"Sono Hanabira ni Kuchizuke wo: Reo x Mai Diaries","synopsis":"Short picture episodes of Reo and Mai during their daily life as a couple.","img":"https://cdn.myanimelist.net/images/anime/9/28560.webp"},{"title":"Maria-sama ga Miteru Specials","synopsis":"A series of specials included on the Maria-sama ga Miteru DVD releases.","img":"https://cdn.myanimelist.net/images/anime/10/14338.webp"},{"title":"Maria-sama ga Miteru: Haru Specials","synopsis":"Specials of Maria-sama ga Miteru: Haru released on the DVDs only.","img":"https://cdn.myanimelist.net/images/anime/8/5782.webp"},{"title":"Ice","synopsis":"By A.D. 2010, all men have died off quickly due to a dramatic change in the environment and an unknown contaminant. The population decreased to the lowest number ever seen...until only the women were left alive.\n\nThey live huddled in small corners of a world mostly reclaimed by nature.\nThere are those who accept their inevitable extinction and live a carefree life...\nThere are those who try to continue on the race with the help of science...\nIt is a society of constant conflict over their differences of principles and policies.\n\nThe story takes place in the center of Tokyo. It is one of the places left for them. The conflict over the specimen of \"ICE\" and the chance it may provide to save humanity begins. \n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/1/2329.webp"},{"title":"Adachi to Shimamura","synopsis":"The second floor of the gym―this was where we always met. It was class time, but of course, there weren't any classes going on in a place like this.\n\nThis was where Shimamura and I became friends. We hung out here―talking about TV shows and cooking, playing some ping pong... This is where we fostered our friendship.\n\nKeeping my head propped against the wall, I let out a small sigh.\n\nWhat was this feeling? Yesterday, I'd dreamt of me and Shimamura kissing.\n\nNot that I'm like that. I'm sure Shimamura isn’t either. It’s not even something worth repeating myself about, but really, it’s not like that.\n\nIt's just that when she hears the word \"friend,\" I want her to think of me first. That's all.\n\n(Source: Baka-Tsuki)","img":"https://cdn.myanimelist.net/images/anime/1520/105184.webp"},{"title":"Mini Yuri","synopsis":"Mini Yuri will be a four-episode series with a runtime of 5 minutes per episode. The short anime will feature mini characters and debut online at a later time.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1445/103637.webp"},{"title":"Sono Hanabira ni Kuchizuke wo: Risa x Miya Gekijou","synopsis":"Short picture episodes with Risa and Miya from \"Sono Hanabira ni Kuchizuke wo\" visual novel series. ","img":"https://cdn.myanimelist.net/images/anime/13/59237.webp"},{"title":"Gokujo.: Souda Onsen ni Ikou!!","synopsis":"Unaired ep.13 included on BD/DVD.","img":"https://cdn.myanimelist.net/images/anime/4/52095.webp"},{"title":"Hen","synopsis":"Yoshida Chizuru is the sexiest co-ed in her class. Secretly, she's been appearing in TV commercials—despite the fact that students are forbidden from working. But one of her professors has uncovered her secret and hopes to use this information to his advantage. Yoshida's got plans of her own, and has no intention of giving up her acting career...","img":"https://cdn.myanimelist.net/images/anime/11/4818.webp"},{"title":"Docchi mo Maid","synopsis":"Izumi, a 12-year-old schoolgirl, suddenly gets not one but two lovely and rather lewd maids from outer space, who have to defend her city from a monster's invasion.","img":"https://cdn.myanimelist.net/images/anime/9/73854.webp"}]