[{"title":"Zhongguo Jingqi Xiansheng","synopsis":"A lost form of magic is revived from the Eastern Han dynasty, meanwhile, dangerous man eating monsters lurk the streets. What will stop these beasts from their mindless terror? \n\n(Source: Happy Potato Translations)","img":"https://cdn.myanimelist.net/images/anime/6/80096.webp"},{"title":"Ling Long: Incarnation","synopsis":"In the not-too-distant future, the human world has long been overpopulated. Humanity marched to the stars in search of a new home, and just as this was going on, the moon's alignment caused massive earthquakes to ripple across the world, lasting several decades. Humanity was demolished. When the land finally recovered, humanity reemerged to face this strange yet familiar world. Will we, who once lorded over this domain, still remain the masters of this world?\n\n(Source: Yu Alexius Anime Portal)","img":"https://cdn.myanimelist.net/images/anime/1757/100434.webp"},{"title":"Kizuoibito","synopsis":"Yuko Kusaka is a Japanese journalist sent to Brazil to do a report on the gold rush phenomenon that seems to be making many people rich from night to day. Rumors say that among the many \"garimpeiros\" (gold diggers) currently on the Amazon forest, there is a Japanese known as Rio Baraki. Reaching their destination, her crew member is promptly attacked and she is raped as a warning to stop their work and return immediately to their home country. Determined to do her job, she stays and finds out from the attacker that he is none other than Baraki, a white haired muscular man with a large scar on his back. Later she discovers that his real name is Keisuke Ibaraki. Once a promising quarterback, he ended up falsely incriminated by a powerful organization known as GPX.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/53623.webp"},{"title":"Lupin III 3DCG","synopsis":"Pilot for a hypothetical Lupin 3DCG project included with the 40th anniversary Master File BD/DVD.","img":"https://cdn.myanimelist.net/images/anime/11/89649.webp"},{"title":"Collar x Malice","synopsis":"A dangerous shadow organization launches a campaign of fear and violence in the city of Shinjuku, pushing society to the brink of chaos. As a young police officer tasked with restoring order, Ichika Hoshino becomes the target of an attack, and has a poisonous collar attached to her neck. With the situation spiraling out of control and time running out, five mysterious strangers appear to aid her in her quest for the truth. Who can she trust? Will she be able to save herself and the soul of Shinjuku from the clutches of oblivion?\n\n(Source: Aksys Games)","img":"https://cdn.myanimelist.net/images/anime/1072/103260.webp"},{"title":"Chainsaw Bunny","synopsis":"Two bunny girls get in trouble.....\nFrom the creator of CHAINSAW MAID and PUSSYCAT,\nanother gory horror clay animation comes!!\nNever ending splatter carnival has begun!!","img":"https://cdn.myanimelist.net/images/anime/1817/93467.webp"},{"title":"Tomoe ga Yuku!","synopsis":"The title character of Tomoe ga Yuku! (Tomoe Will Go!) is gutsy enough to roller skate down freeways for thrills. After losing a friend in a roller skating accident, Tomoe joins a stunt group called Green Ship. Although still mourning her friend's death, Tomoe has no reservations about embracing a relationship with the group's leader, Kazusa. Soon she discovers Green Ship is a front for an assassin training camp. She must flee her new life and love and rekindle her fiery spirit in order to fight against the organization which wants her dead.\n\n(Source: Animerica Extra December 2001)","img":"https://cdn.myanimelist.net/images/anime/4/87501.webp"},{"title":"Duan Nao 2","synopsis":"College student Chi Xia's girlfriend disappeared, and he was told that she never existed. In his persistent search for her, step-by-step, Chi Xia discovered a scheme that involves the darkest secret in this galaxy. Horrifying conspiracies and galaxy wars, betrayals and sacrifices, the profound feelings of weakness and inferior were never so close to the human race.\n\n(Source: u17)","img":"https://cdn.myanimelist.net/images/anime/7/84840.webp"},{"title":"Munou na Nana","synopsis":"It is the year 20XX. Earth was assaulted by monsters that would come to be known as \"the Enemy of Humanity.\" In order to deal with this threat, special schools composed of teenagers with extraordinary abilities were formed. These people, who came to be known as \"the Talented,\" had abilities that could defy the rules of reality.\n\nAmong these people with supernatural powers was an outlier, an individual who was sent to one of these schools despite having no innate special abilities whatsoever. This is the story of our protagonist, who attempts to defeat the Enemies of Humanity through the use of intelligence and manipulation alone. \n\n(Source: MU)","img":"https://cdn.myanimelist.net/images/anime/1811/106886.webp"},{"title":"Chainsaw Maid Episode 0","synopsis":"A special episode included on the Chainsaw Maid DVD.","img":"https://cdn.myanimelist.net/images/anime/1206/93028.webp"},{"title":"Chang","synopsis":"Sergeant Jeong Cheol-min's squad are staying indoors a corroded stockroom renovated without windows. His squad is well known for their hardworking members until councellor Hong Yeong-soo comes in. Jeong Cheol-min does all he can to make Hong Yeong-soo the right man for his squad and the army requires him to. However, private Hong Yeong-soo doesn't adjust to the surroundings and causes trouble.\n\n(Source: Hancinema)","img":"https://cdn.myanimelist.net/images/anime/12/55497.webp"},{"title":"Da Shi Jie","synopsis":"A hard rain is about to fall on a small town in Southern China. In a desperate attempt to find money to save his fiancée’s failed plastic surgery, Xiao Zhang, a mere driver, steals a bag containing 1 million from his boss. News of the robbery spreads fast within the town and, over the course of one night, everyone starts looking for Xiao Zhang and his money.\n\n(Source: Metacritic)","img":"https://cdn.myanimelist.net/images/anime/1320/90231.webp"},{"title":"Osiris no Tenbin: Season 2","synopsis":"2nd Season to Osiris no Tenbin.","img":"https://cdn.myanimelist.net/images/anime/6/79641.webp"},{"title":"Timing (Movie)","synopsis":"Based on a webtoon of the same name.\n\nThis film unravels the mystery behind a series of suicides at a high school in Seoul. Park Ja-gi, a teacher at this school whose mother is a shaman, keeps rejecting mysticism, but he can foresee a catastrophe in his dreams. Witnessing in his dream many people standing aside to jump off from the top of the school building, the school teacher tries tostop the mass suicide. There are some people around the school who also have special gifts. Kim Yeong-tak is a student who can stop time. Kang Min-hyeok can rewind time 10 seconds back but suffers from a guilty conscience about failing to save his own wife and child. Lastly, Jang Se-yun can foresee 10 minutes ahead of time. These people gather their abilities to prevent catastrophe at the school.\n\n(Source: Hancinema)","img":"https://cdn.myanimelist.net/images/anime/1033/95247.webp"},{"title":"Kataribe Jinkou Chinou ga Tsubuyaku Noroi no Yogen","synopsis":"An animated promotion steamed on Kadokawa's official YouTube channel for Kataribe Jinkou Chinou ga Tsubuyaku Noroi no Yogen, in honor of its first tankoubon volume going on sale the very same day.","img":"https://cdn.myanimelist.net/images/anime/1225/90378.webp"},{"title":"Chainsaw Bunny: Deleted Scene","synopsis":"A \"deleted scene\" from Chainsaw Bunny, where the monster becomes a giant pink faceless looming creature.","img":"https://cdn.myanimelist.net/images/anime/1282/95802.webp"},{"title":"Shin Gakkou no Yuurei","synopsis":"Following the popularity of the original omnibus OVA, this release offers 4 more stories but in animation only. ","img":"https://cdn.myanimelist.net/images/anime/8/84713.webp"},{"title":"Na Bbeun Sang Sa","synopsis":"Bad Boss is a femtai (hentai for women) from South Korean Studio Seo-yeong more, which was filmed by Baek Jong Suk in 2018. The plot takes place in Seoul and tells the story of the vicious life of Son-Kyu, who hides his dark past during the day, and at night turns into a ladies ' man. Soon the hero will meet an innocent girl, Kim Min and fall in love with her. However, his dark side will take over and the Son will come up with an insidious plan of revenge to his old friend, who is also in love with Kim Min.","img":"https://cdn.myanimelist.net/images/anime/1269/100620.webp"},{"title":"Hwasan Golae","synopsis":"In the year 2070, mankind faces a life threatening crisis due to huge earthquakes and volcanic eruptions. Korea is in a state of anarchy and Busan is swarming with refugees. Young street dealer Ha-jin has the ability to communicate with whales – a fact she keeps hidden from everyone. One day, a onearmed woman named Baek Sang-won asks Ha-jin to join her in the gules whale hunt. Painful memories lead Ha-jin to turn down the offer initially, but she eventually ends up joining Baek. As she makes friends on the ship, she grows curious about the gules whale and learns that every crew member has a sad gules story. The madness in the crews’ eyes as they try to kill the gules brings Ha-jin’s trauma to the forefront of her mind – and she experiences her own madness.\n\n(Source: Korean Film Biz Zone)","img":"https://cdn.myanimelist.net/images/anime/10/83639.webp"},{"title":"Uchiko no Mama to Okaasan","synopsis":"Uchiko no Mama to Okaasan is about a girl far from home who has a mama and a mother, one of which is a large monster. Rabbit MACHINE is the creator but abandoned the project so all that remains is the preliminary web release.","img":"https://cdn.myanimelist.net/images/anime/1252/91253.webp"},{"title":"Junk Head","synopsis":"In the distant future, humanity is hurtling down a path of ruin. Global environmental destruction caused by chemical contamination, radioactive fallout, and UV rays coming through the patchy ozone layer has lead to deterioration of the human genome.\n\n(Source: Official Website)","img":"https://cdn.myanimelist.net/images/anime/1414/101049.webp"},{"title":"Death Note","synopsis":"A shinigami, as a god of death, can kill any person—provided they see their victim's face and write their victim's name in a notebook called a Death Note. One day, Ryuk, bored by the shinigami lifestyle and interested in seeing how a human would use a Death Note, drops one into the human realm.\n\nHigh school student and prodigy Light Yagami stumbles upon the Death Note and—since he deplores the state of the world—tests the deadly notebook by writing a criminal's name in it. When the criminal dies immediately following his experiment with the Death Note, Light is greatly surprised and quickly recognizes how devastating the power that has fallen into his hands could be.            \n\nWith this divine capability, Light decides to extinguish all criminals in order to build a new world where crime does not exist and people worship him as a god. Police, however, quickly discover that a serial killer is targeting criminals and, consequently, try to apprehend the culprit. To do this, the Japanese investigators count on the assistance of the best detective in the world: a young and eccentric man known only by the name of L.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/9453.webp"},{"title":"Steins;Gate","synopsis":"The self-proclaimed mad scientist Rintarou Okabe rents out a room in a rickety old building in Akihabara, where he indulges himself in his hobby of inventing prospective \"future gadgets\" with fellow lab members: Mayuri Shiina, his air-headed childhood friend, and Hashida Itaru, a perverted hacker nicknamed \"Daru.\" The three pass the time by tinkering with their most promising contraption yet, a machine dubbed the \"Phone Microwave,\" which performs the strange function of morphing bananas into piles of green gel.\n\nThough miraculous in itself, the phenomenon doesn't provide anything concrete in Okabe's search for a scientific breakthrough; that is, until the lab members are spurred into action by a string of mysterious happenings before stumbling upon an unexpected success—the Phone Microwave can send emails to the past, altering the flow of history.\n\nAdapted from the critically acclaimed visual novel by 5pb. and Nitroplus, Steins;Gate takes Okabe through the depths of scientific theory and practicality. Forced across the diverging threads of past and present, Okabe must shoulder the burdens that come with holding the key to the realm of time.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/73199.webp"},{"title":"Mirai Nikki","synopsis":"Lonely high school student, Yukiteru Amano, spends his days writing a diary on his cellphone, while conversing with his two seemingly imaginary friends Deus Ex Machina, who is the god of time and space, and Murmur, the god's servant. Revealing himself to be an actual entity, Deus grants Yukiteru a \"Random Diary,\" which shows highly descriptive entries based on the future and forces him into a bloody battle royale with 11 other holders of similarly powerful future diaries.\n\nWith the last person standing designated as the new god of time and space, Yukiteru must find and kill the other 11 in order to survive. He reluctantly teams up with his obsessive stalker Yuno Gasai (who also possesses such a diary), and she takes it upon herself to ensure his safety. But there's more to the girl than meets the eye, as she might have other plans for her unrequited love...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/33465.webp"},{"title":"Re:Zero kara Hajimeru Isekai Seikatsu","synopsis":"When Subaru Natsuki leaves the convenience store, the last thing he expects is to be wrenched from his everyday life and dropped into a fantasy world. Things aren't looking good for the bewildered teenager; however, not long after his arrival, he is attacked by some thugs. Armed with only a bag of groceries and a now useless cell phone, he is quickly beaten to a pulp. Fortunately, a mysterious beauty named Satella, in hot pursuit after the one who stole her insignia, happens upon Subaru and saves him. In order to thank the honest and kindhearted girl, Subaru offers to help in her search, and later that night, he even finds the whereabouts of that which she seeks. But unbeknownst to them, a much darker force stalks the pair from the shadows, and just minutes after locating the insignia, Subaru and Satella are brutally murdered.\n\nHowever, Subaru immediately reawakens to a familiar scene—confronted by the same group of thugs, meeting Satella all over again—the enigma deepens as history inexplicably repeats itself.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/79410.webp"},{"title":"Another","synopsis":"In 1972, a popular student in Yomiyama North Middle School's class 3-3 named Misaki passed away during the school year. Since then, the town of Yomiyama has been shrouded by a fearful atmosphere, from the dark secrets hidden deep within.\n\nTwenty-six years later, 15-year-old Kouichi Sakakibara transfers into class 3-3 of Yomiyama North and soon after discovers that a strange, gloomy mood seems to hang over all the students. He also finds himself drawn to the mysterious, eyepatch-wearing student Mei Misaki; however, the rest of the class and the teachers seem to treat her like she doesn't exist. Paying no heed to warnings from everyone including Mei herself, Kouichi begins to get closer not only to her, but also to the truth behind the gruesome phenomenon plaguing class 3-3 of Yomiyama North.\n\nAnother follows Kouichi, Mei, and their classmates as they are pulled into the enigma surrounding a series of inevitable, tragic events—but unraveling the horror of Yomiyama may just cost them the ultimate price.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/75509.webp"},{"title":"Death Parade","synopsis":"After death, there is no heaven or hell, only a bar that stands between reincarnation and oblivion. There the attendant will, one after another, challenge pairs of the recently deceased to a random game in which their fate of either ascending into reincarnation or falling into the void will be wagered. Whether it's bowling, darts, air hockey, or anything in between, each person's true nature will be revealed in a ghastly parade of death and memories, dancing to the whims of the bar's master. Welcome to Quindecim, where Decim, arbiter of the afterlife, awaits!\n\nDeath Parade expands upon the original one-shot intended to train young animators. It follows yet more people receiving judgment—until a strange, black-haired guest causes Decim to begin questioning his own rulings.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/71553.webp"},{"title":"Mahou Shoujo Madoka★Magica","synopsis":"Madoka Kaname and Sayaka Miki are regular middle school girls with regular lives, but all that changes when they encounter Kyuubey, a cat-like magical familiar, and Homura Akemi, the new transfer student.\n\nKyuubey offers them a proposition: he will grant any one of their wishes and in exchange, they will each become a magical girl, gaining enough power to fulfill their dreams. However, Homura Akemi, a magical girl herself, urges them not to accept the offer, stating that everything is not what it seems.\n\nA story of hope, despair, and friendship, Mahou Shoujo Madoka★Magica deals with the difficulties of being a magical girl and the price one has to pay to make a dream come true.\n\n[Written by MAL Rewrite] ","img":"https://cdn.myanimelist.net/images/anime/11/55225.webp"},{"title":"Zankyou no Terror","synopsis":"Painted in red, the word \"VON\" is all that is left behind after a terrorist attack on a nuclear facility in Japan. The government is shattered by their inability to act, and the police are left frantically searching for ways to crack down the perpetrators. The public are clueless—until, six months later, a strange video makes its way onto the internet. In it, two teenage boys who identify themselves only as \"Sphinx\" directly challenge the police, threatening to cause destruction and mayhem across Tokyo. Unable to stop the mass panic quickly spreading through the city and desperate for any leads in their investigation, the police struggle to act effectively against these terrorists, with Detective Kenjirou Shibazaki caught in the middle of it all.\n\nZankyou no Terror tells the story of Nine and Twelve, the two boys behind the masked figures of Sphinx. They should not exist, yet they stand strong in a world of deception and secrets while they make the city fall around them, all in the hopes of burying their own tragic truth.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/64447.webp"},{"title":"Yakusoku no Neverland","synopsis":"Surrounded by a forest and a gated entrance, the Grace Field House is inhabited by orphans happily living together as one big family, looked after by their \"Mama,\" Isabella. Although they are required to take tests daily, the children are free to spend their time as they see fit, usually playing outside, as long as they do not venture too far from the orphanage—a rule they are expected to follow no matter what. However, all good times must come to an end, as every few months, a child is adopted and sent to live with their new family... never to be heard from again.\n\nHowever, the three oldest siblings have their suspicions about what is actually happening at the orphanage, and they are about to discover the cruel fate that awaits the children living at Grace Field, including the twisted nature of their beloved Mama.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1125/96929.webp"},{"title":"Higurashi no Naku Koro ni","synopsis":"Keiichi Maebara has just moved to the quiet little village of Hinamizawa in the summer of 1983, and quickly becomes inseparable friends with schoolmates Rena Ryuuguu, Mion Sonozaki, Satoko Houjou, and Rika Furude. However, darkness lurks underneath the seemingly idyllic life they lead. \n\nAs the village prepares for its annual festival, Keiichi learns about the local legends surrounding it. To his horror, he discovers that there have been several murders and disappearances in the village in the recent years, and that they all seem to be connected to the festival and the village's patron god, Oyashiro. Keiichi tries to ask his new friends about these incidents, but they are suspiciously silent and refuse to give him the answers he needs. As more and more bizarre events occur, he wonders just what else his friends might be keeping from him, and if he can even trust them at all.\n\nWhen madness and paranoia begin taking root in Keiichi's heart, he will stumble straight into the mysteries at work in Higurashi no Naku Koro ni, a story that is told across multiple arcs.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/19634.webp"},{"title":"Monster","synopsis":"Dr. Kenzou Tenma, an elite neurosurgeon recently engaged to his hospital director's daughter, is well on his way to ascending the hospital hierarchy. That is until one night, a seemingly small event changes Dr. Tenma's life forever. While preparing to perform surgery on someone, he gets a call from the hospital director telling him to switch patients and instead perform life-saving brain surgery on a famous performer. His fellow doctors, fiancée, and the hospital director applaud his accomplishment; but because of the switch, a poor immigrant worker is dead, causing Dr. Tenma to have a crisis of conscience.\n\nSo when a similar situation arises, Dr. Tenma stands his ground and chooses to perform surgery on the young boy Johan Liebert instead of the town's mayor. Unfortunately, this choice leads to serious ramifications for Dr. Tenma—losing his social standing being one of them. However, with the mysterious death of the director and two other doctors, Dr. Tenma's position is restored. With no evidence to convict him, he is released and goes on to attain the position of hospital director. \n\nNine years later when Dr. Tenma saves the life of a criminal, his past comes back to haunt him—once again, he comes face to face with the monster he operated on. He must now embark on a quest of pursuit to make amends for the havoc spread by the one he saved.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/18793.webp"},{"title":"Steins;Gate 0","synopsis":"The eccentric, self-proclaimed mad scientist Rintarou Okabe has become a shell of his former self. Depressed and traumatized after failing to rescue his friend Makise Kurisu, he has decided to forsake his mad scientist alter ego and live as an ordinary college student. Surrounded by friends who know little of his time travel experiences, Okabe spends his days trying to forget the horrors of his adventures alone. \n\nWhile working as a receptionist at a college technology forum, Okabe meets the short, spunky Maho Hiyajo, who \nlater turns out to be the interpreter at the forum's presentation, conducted by Professor Alexis Leskinen. In front of a stunned crowd, Alexis and Maho unveil Amadeus—a revolutionary AI capable of storing a person's memories and creating a perfect simulation of that person complete with their personality and quirks. Meeting with Maho and Alexis after the presentation, Okabe learns that the two were Kurisu's colleagues in university, and that they have simulated her in Amadeus. Hired by Alexis to research the simulation's behavior, Okabe is given the chance to interact with the shadow of a long-lost dear friend. Dangerously tangled in the past, Okabe must face the harsh reality and carefully maneuver around the disastrous consequences that come with disturbing the natural flow of time.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/1375/93521.webp"},{"title":"Higashi no Eden","synopsis":"On November 22, 2010, Japan was hit by missile strikes, a terrorist act that fortunately did not harm anyone, becoming known as \"Careless Monday.\" Quickly forgotten, society goes on about their lives as normal.\n \nDuring her graduation trip to America three months later, friendly college student Saki Morimi's life is forever changed when she finds herself saved from unexpected trouble by Akira Takizawa. Takizawa is cheerful, but odd in many ways—he is stark naked and suffers from amnesia, believing himself to be a terrorist. In addition, he possesses a strange cell phone loaded with 8.2 billion yen in digital cash.\n\nDespite Takizawa's suspicious traits, Saki quickly befriends the enigmatic young man. However, unbeknownst to her, this is the beginning of a thrilling death game involving money, cell phones, and the salvation of the world. Higashi no Eden chronicles Saki's struggle to unravel the mysteries behind her savior, while Takizawa himself battles other individuals armed with similar cell phones and returning memories which reveal his possible connection to the event from months ago.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/15033.webp"},{"title":"Shiki","synopsis":"Fifteen-year-old Megumi Shimizu dreamed of a glamorous life in the big city; however, her unexpected death in the quiet village of Sotoba marks the beginning of what appears to be a ferocious epidemic that turns the hot summer into a season of blood and terror. A young doctor named Toshio Ozaki  begins to doubt the nature of the disease and comes to understand that to discover the truth, he must abandon his humanity. Meanwhile, Natsuno Yuuki, an antisocial youth from the city, is haunted by the sudden death of Megumi and must realize the pain of friendship in the face of his own tragedy. Toshio and Natsuno form an unlikely pair as they work together to save Sotoba before it transforms into a ghost town of vampires.\n\nShiki, adapted from the horror novel written by Fuyumi Ono, goes beyond the average vampire story. It tells the tragic tale of survival in a world where one cannot easily distinguish between good and evil. Abandoned by God, the Shiki, as the vampires call themselves, have only their will to live as they clash with the fear of the paranoid/unbelieving villagers. Shiki explores the boundary that separates man from monster.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/21343.webp"},{"title":"Higurashi no Naku Koro ni Kai","synopsis":"In the small village of Hinamizawa, Rika Furude and her friends live together in relative harmony. Beneath this mask of peace, however, lies a hidden darkness, one that Rika understands all too well. In this eternal summer, she has been witness to unspeakable horrors. Every time the clock resets, Rika must try to find the villain behind these senseless deaths before tragedy strikes again. However, trying to decipher a mystery when only half the clues are present proves time and again to be disastrous, and each time she believes that things will change, she inevitably fails. As the annual festival approaches, Rika begins her descent from hope to despair in her struggle to break the chains of fate entangling them all.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/14114.webp"},{"title":"Paprika","synopsis":"The world of dreams can be an incredible window into the psyche, showing one's deepest desires, aspirations, and repressed memories. One hopeful tech lab has been developing the \"DC Mini,\" a device with the power to delve into the dreams of others. Atsuko Chiba and Kosaku Tokita have been tirelessly working to develop this technology with the hopes of using it to deeply explore patients' minds and help cure them of their psychological disorders.\n\nHowever, having access to the deepest corners of a person's mind comes with a tremendous responsibility. In the wrong hands, the DC Mini could be used as a form of psychological terrorism and cause mental breakdowns in the minds of targets. When this technology is stolen and people around them start acting strangely, Atsuko and Kosaku know they have a serious problem on their hands. Enlisting the help of Officer Konakawa, who has been receiving this experimental therapy, they search both the real and dream worlds for their mental terrorist.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1929/93629.webp"},{"title":"Steins;Gate: Oukoubakko no Poriomania","synopsis":"A few months after the events of Steins;Gate, Rintarou Okabe and his group of friends are invited to tag along with their acquaintance Faris NyanNyan, who is participating in a Rai-Net battle event in the United States. There, they meet up with an old colleague: Kurisu Makise, who has been recalling fragmented memories of events that happened in the other world lines in the form of dreams. She confronts Okabe, questioning him as to whether these events—particularly the incidents between the two of them—did indeed happen.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/36531.webp"},{"title":"Kara no Kyoukai 1: Fukan Fuukei","synopsis":"In September 1998, a string of seemingly random suicides leaves Japan baffled and devastated. But a detective agency specializing in paranormal occurrences notices that there are a few glaring, disturbing similarities tying the deceptively unrelated cases together: All the victims are schoolgirls, and all of them have jumped to their deaths from atop the ancient Fujou Building, a skyscraper that is scheduled to be bulldozed soon.\n\nTo investigate the cause of these disturbing events, the head of the agency, magus Touko Aozaki, dispatches Mikiya Kokutou and Shiki Ryougi. The kind and surprisingly normal Mikiya serves as a stark contrast to the cold and mysterious Shiki, who possesses the \"Mystic Eyes of Death Perception\": an abnormal ability which allows her to see, and bring, an end to all things.\n\nDark and philosophical in tone, Fukan Fuukei is the first installment in the seven-part movie series Kara no Kyoukai, adapted from the light novels by Kinoko Nasu.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/21741.webp"},{"title":"Satsuriku no Tenshi","synopsis":"With dead and lifeless eyes, Rachel Gardner wishes only to die. Waking up in the basement of a building, she has no idea how or why she's there. She stumbles across a bandaged murderer named Zack, who is trying to escape. After promising to kill her as soon as he is free, Rachel and Zack set out to ascend through the building floor by floor until they escape.\n\nHowever, as they progress upward, they meet more twisted people, and all of them seem familiar with Rachel. What is her connection to the building, and why was she placed in it? Facing a new boss on each floor, can Rachel and Zack both achieve their wishes?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1862/95624.webp"},{"title":"Rainbow: Nisha Rokubou no Shichinin","synopsis":"Japan, 1955: Mario Minakami has just arrived at Shounan Special Reform School along with five other teenagers who have been arrested on serious criminal charges. All assigned to the same cell, they meet older inmate Rokurouta Sakuragi—a former boxer—with whom they establish a close bond. Under his guidance, and with the promise that they will meet again on the outside after serving their sentences, the delinquents begin to view their hopeless situation in a better light.\n\nRainbow: Nisha Rokubou no Shichinin follows the seven cellmates as they struggle together against the brutal suffering and humiliation inflicted upon them by Ishihara, a sadistic guard with a grudge on Rokurouta, and Gisuke Sasaki, a doctor who takes pleasure in violating boys. Facing such hellish conditions, the seven inmates must scrape together all the strength they have to survive until their sentences are up; but even if they do, just what kind of lives are waiting for them on the other side?\n\n[Written by MAL Rewrite] ","img":"https://cdn.myanimelist.net/images/anime/9/72697.webp"},{"title":"Mahou Shoujo Madoka★Magica Movie 3: Hangyaku no Monogatari","synopsis":"The young girls of Mitakihara happily live their lives, occasionally fighting off evil, but otherwise going about their peaceful, everyday routines. However, Homura Akemi feels that something is wrong with this unusually pleasant atmosphere—though the others remain oblivious, she can't help but suspect that there is more to what is going on than meets the eye: someone who should not exist is currently present to join in on their activities.\n\nMahou Shoujo Madoka★Magica Movie 3: Hangyaku no Monogatari follows Homura in her struggle to uncover the painful truth behind the mysterious circumstances, as she selfishly and desperately fights for the sake of her undying love in this despair-ridden conclusion to the story of five magical girls.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/54231.webp"},{"title":"Phantom: Requiem for the Phantom","synopsis":"Mafia is rife in America where assassinations are a regular occurrence on the streets. Inferno, a mysterious company, is behind most of these dealings through the use of their near-invincible human weapon, \"Phantom.\"\n\nOne day, a Japanese tourist accidentally witnesses Phantom's latest murder. Desperate to escape, the tourist hides in a secluded building. However, Phantom, revealed to be a young woman named Ein, and the leader of Inferno \"Scythe Master\" captures the tourist and brainwashes him.\n\nGiven the name \"Zwei,\" this once peaceful tourist is now a puppet of Inferno with no memories. Drawn into a world of lies, deceit, and violence, Zwei must fight to survive, hopefully to one day regain his memories and escape from this world where he is constantly on the brink of death.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/22470.webp"},{"title":"Mousou Dairinin","synopsis":"The infamous Shounen Bat (Lil' Slugger) is terrorizing the residents of Musashino City. Flying around on his rollerblades and beating people down with a golden baseball bat, the assailant seems impossible to catch—much less understand. His first victim, the well-known yet timid character designer Tsukiko Sagi, is suspected of orchestrating the attacks. Believed only by her anthropomorphic pink stuffed animal, Maromi, Tsukiko is just one of Shounen Bat's many victims.\n\nAs Shounen Bat continues his relentless assault on the town, detectives Keiichi Ikari and Mitsuhiro Maniwa begin to investigate the identity of the attacker. However, more and more people fall victim to the notorious golden bat, and news of the assailant begins circulating around the town. Paranoia starts to set in as chilling rumors spread amongst adults and children alike.\n\nWill the two detectives be able to unravel the truth behind Shounen Bat, or will the paranoia get to them first?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/10240.webp"},{"title":"C: The Money of Soul and Possibility Control","synopsis":"Money is power, and without it, life is meaningless. In a country whose economy is in shambles, second-year Economics university student Kimimaro Yoga understands this fact all too well, as he is surrounded by the relatively luxurious lives of his peers and struggling to make ends meet. However, his world is turned on its head when a stranger in a top hat arrives one late night at his door.\n\nGoing by the name Masakaki, the visitor petitions Yoga to come to the Eastern Financial District, a place where money flows in abundance if one offers their \"future\" as collateral. Although reluctant, greed triumphs reason and Yoga accepts the offer; thus, taking on the mantle of an \"Entre.\" But unbeknownst to him, the land of wealth he has entered is an alternate realm built in the likeness of his own, where Entres are forced to participate in weekly duels called \"Deals,\" with their collateral at stake. Pitted against his countrymen and fate, Yoga must quickly adapt in this new world if he hopes to protect his fortune and future—and discover just how much money is truly worth.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/50551.webp"},{"title":"Gyakkyou Burai Kaiji: Ultimate Survivor","synopsis":"Kaiji Itou is a good-for-nothing loiterer who spends his days drinking beer and stealing hubcaps—that is, until he ends up being tricked by his former co-worker. Unable to suddenly repay his friend's huge debt all by himself, Kaiji is offered a shady deal to participate in an illegal underground gamble on a cruise ship. This turns out to be nothing more than the beginning of his new life of hell—thrown headlong into a life-threatening roller coaster of mind games, cheating, and deceit.\n\nBased on the first entry of the famous gambling manga series by Nobuyuki Fukumoto, Gyakkyou Burai Kaiji: Ultimate Survivor follows our unlucky protagonist as he is forced to fight not only other people, but also the mysteries of their psyches. Kaiji finds out the hard way that the worst sides of human nature surface when people's backs are against the wall, and that the most fearsome dangers of all are greed, paranoia, and the human survival instinct itself.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/80032.webp"},{"title":"Re:Zero kara Hajimeru Isekai Seikatsu 2nd Season","synopsis":"Second season of Re:Zero kara Hajimeru Isekai Seikatsu.","img":"https://cdn.myanimelist.net/images/anime/1010/100084.webp"},{"title":"Ga-Rei: Zero","synopsis":"In Japan, there exists a government agency known as the Supernatural Disaster Countermeasures Division (SDCD), whose duty is to protect the citizens from creatures unseen. They are able to dispatch these monsters swiftly and without alerting the general public. But currently, they face a different challenge: the betrayal of one of their own.\n\nAfter the death of her mother several years ago, Kagura Tsuchimiya has been fostered by the Isayama family and forms a close sister-like bond with their daughter Yomi. The two become inseparable, and together they work for the SDCD as highly skilled exorcists. However, as the stress and consequences of their sacred duty weigh on them both, and family politics come into play, Kagura and Yomi begin to slowly drift apart. One of them grows earnestly into her role as an exorcist, and the other heads down a dark path from which there may be no redemption...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/11355.webp"},{"title":"Kara no Kyoukai 2: Satsujin Kousatsu (Zen)","synopsis":"In the winter of 1995, Mikiya Kokutou passes a young woman during a late night stroll in the snow. Clad in a striking white kimono and bearing an enigmatic gaze, Shiki Ryougi smiles at Mikiya who stares back with curiosity. Later that spring, Mikiya notices Shiki at his high school entrance ceremony, and they become acquaintances through lunchtime conversations. As Shiki begins opening up to him, Mikiya learns about her unique upbringing.\n\nMeanwhile, a series of unprecedented murders takes place across Mifune City. Seemingly related, these murders are particularly brutal and warrant a large scale police investigation. Because of his cousin's work as a police investigator, Mikiya is given insight into the investigation. Concerned for Shiki's safety, Mikiya decides to monitor her actions, but in doing so, he stumbles upon a truly frightening discovery that changes his life forever.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/21737.webp"},{"title":"B: The Beginning","synopsis":"On the islands of Cremona, a vigilante runs amok. Celebrated by some and hunted by others, the notorious \"Killer B\" takes justice into his own hands, armed with a sharp blade and superhuman abilities. Unable to apprehend this renegade, the Royal Investigation Service (RIS) calls upon the expertise of Keith Flick, a seasoned, yet eccentric detective who was relegated to the Archives Department following a personal loss. As crimes in Cremona begin to escalate, from stealthy executions of wrongdoers to sophisticated strikes on public figures, it soon becomes clear that there is more than one person responsible.\n\nWith the help of his impulsive sidekick Lily Hoshina, and unexpected aid from the elusive Killer B himself, Keith begins to unravel plots involving secret organizations, domestic terrorism, and human experiments. When the involvement of the RIS extends beyond the scope of justice, the extent of the government's corruption—as well as the trustworthiness of close allies—are thrown into question. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1564/90469.webp"},{"title":"Gankutsuou","synopsis":"In the year 5053, French aristocrats Viscount Albert de Morcerf and Baron Franz d'Epinay attend the festival of Carnival on the moon city of Luna. While Franz is just looking to have fun, Albert is seeking something more to fill his life—but he finds more than he bargained for in The Count of Monte Cristo, a mysterious and charming self-made nobleman who meets his gaze during an opera performance.\n \nThrough a few twists and turns, Albert befriends the Count and introduces him into French society. The Count, however, has more on his mind than just friendship; he plots to finally unleash his vengeance on those who wronged him years earlier. Gankutsuou follows Albert and the Count's intertwined destinies and the ultimate price paid for enacting revenge.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/2235.webp"},{"title":"Kara no Kyoukai 5: Mujun Rasen","synopsis":"In November 1998, a double homicide occurs at the newly constructed Ogawa apartment complex in the heart of Mifune City. The murderer, Tomoe Enjou, has fled in a panic. To his astonishment, he is not pursued by the police and news of the incident has not been reported through media outlets. After Shiki Ryougi defends Tomoe from a group of thugs, she allows him to use her residence as a hideout. However, a few days later, Tomoe is shaken to discover that his mother is alive, even though he is convinced that he killed her.\n \nCoincidentally, Mikiya Kokutou is investigating a tip that his associate Touko Aozaki receives regarding the murder at the unique apartment complex. As he uncovers more information about the incident, Mikiya takes a particular interest in Tomoe. Deciding to investigate him further, Mikiya soon discovers the disturbing truth of the foreboding Ogawa complex.\n\nThe fifth installment of the Kara no Kyoukai film series, Mujun Rasen combines an intricately constructed mystery with established themes and characters to produce a dark, thought-provoking story.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/9246.webp"},{"title":"Death Billiards","synopsis":"Two men have just arrived at a location known as Quindecim and are unable to remember how they got there. They are immediately greeted by a young woman who escorts them to a small bar, where a bartender awaits them. They are told that they will have to participate in a game, randomly chosen by roulette, and will be unable to leave until its completion; if they refuse, the consequences will be dire. In addition to the rules of the game, the two men are told to play as if their lives are at stake.\n \nThe game that has been chosen is billiards. But there's more to it than just pocketing pool balls, as the two are about to find out the outcome could mean life or death.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/48721.webp"},{"title":"Kara no Kyoukai 3: Tsuukaku Zanryuu","synopsis":"On a solemn night in July 1998, teenager Fujino Asagami is mercilessly raped by a street gang in a dilapidated bar. No matter what physical or sexual abuse they deal, however, the girl regards her captors with the same apathetic expression. The next day, mangled bodies are discovered in that same building, so torn apart that investigators find it infeasible to even consider the culprit human.\n\nElsewhere, a client request reaches Touko Aozaki's detective agency, tasking Shiki Ryougi with either capturing or killing the perpetrator of last night's incident. But soon, word spreads that a single survivor escaped the slaughter, and now the murderer is plowing down everything in their path to locate and exterminate him. A brutal race against time begins, pitting Shiki against a dangerous foe imperceptible even to her legendary eyes. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/21735.webp"},{"title":"Kara no Kyoukai 4: Garan no Dou","synopsis":"Following the events of Satsujin Kousatsu (Zen), Shiki Ryougi has been in a coma for two years due to a traffic accident. When she finally awakens, she has no memories of her past and is plagued by a profound loneliness. Even stranger, she notices dark lines encompassing the things around her, and if she touches them she can disassemble the object—something which completely terrifies her. Her friend, Mikiya Kokutou, enlists the help of Touko Aozaki, a mage who can help Shiki understand what her eyes—the \"Mystic Eyes of Death Perception\"—are truly capable of and how to use them properly.  \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/21736.webp"},{"title":"Kara no Kyoukai 7: Satsujin Kousatsu (Go)","synopsis":"In February 1999, a string of murders has Shiki Ryougi and Mikiya Kokutou on edge. These crimes share a disturbing resemblance to a similar set of homicides from 1995, when Shiki and Mikiya first met, and awaken a dark, murderous desire that has laid dormant within Shiki's soul ever since then.\n\nWith Shiki under suspicion due to her involvement in the past killings and supposed resemblance to the killer, she and Mikiya set out to find the true perpetrator. In the midst of their separate investigations, Mikiya grows increasingly concerned with Shiki's well-being and hurries to find the one responsible in order to protect Shiki from her own impulses. With the lead he receives from his cousin, police investigator Daisuke Akimi, Mikiya is led into the underbelly of Mifune City, as the salvation of Shiki's soul lies in his determination to prove her innocence once and for all.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/56619.webp"},{"title":"Aoi Bungaku Series","synopsis":"Ningen Shikkaku\nA high school student seeks solace in narcotics to escape the dispiritedness that has come over his life. As he goes through the different stages of his life, it culminates in the questioning of his existence in the world.\n\nSakura no Mori no Mankai no Shita\nThe adaptation of Ango Sakaguchi's literary work deals with the love story of a woman abducted by a mountain bandit.\n\nKokoro\nWhile trying to fill the void in his life, a university student in Tokyo encounters a charismatic older man, whom he addresses as \"Sensei,\" who offers him advice on life. However, the man is apprehensive to share his life experience, deepening the student's curiosity. Through this peculiar relationship, the student comes to ponder about the distance between him and his family and the growing desolation in his heart filled with ego and guilt. \n\nHashire, Melos!\nThe story portrays the unbreakable bond between two friends, Melos and Selinuntius, and their faith in protecting each other, all while dangling on a thread which hovers over death and misery. \n\nKumo no Ito\nKandata is a coldhearted criminal who, while being punished in Hell for his misdeeds, is noticed by the Buddha Shakyamuni. Despite maintaining a record of committing ruthless atrocities, Kandata had once shown mercy to a spider he encountered in the forest by letting it live. Moved by this, Shakyamuni offers him redemption by dropping a spider's thread into the searing pits of Hell, and it is up to Kandata to seize the opportunity.\n\nJigokuhen\nYoshihide is a great painter in the land ruled by Horikawa, a tyrant. Offered a commission to paint the \"Buddhist Hell\" by the lord, Yoshihide declines, as he cannot paint anything he has not witnessed himself. In an attempt to make Yoshihide understand the magnitude of his request, the lord tortures his subjects to provide inspiration for the artist, descending his domain into utter despair and darkness.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/17471.webp"},{"title":"Mahou Shoujo Madoka★Magica Movie 2: Eien no Monogatari","synopsis":"Though Sayaka Miki's wish was fulfilled, the unforeseen consequences that came with it overwhelm her, causing her soul gem to become tainted as she succumbs to despair and eventually loses her humanity. Homura Akemi reveals to Kyouko Sakura and Madoka Kaname the ultimate fate of magical girls: once their soul gem becomes tainted, it transforms into a Grief Seed, and they are reborn as witches—a truth Homura learned only through repeating history countless times in a bid to prevent Madoka's tragedy.\n\nKyuubey only compounds their despair when he confesses his true intentions: to harness the energy created from magical girls and use it to prolong the life of the universe. As the threat of Walpurgisnacht, a powerful witch, looms overhead, Homura once again vows to protect Madoka and the world from a grim fate.  \n\nCaught between honoring Homura's wish and saving the world, which one will Madoka choose in the end?\nMahou Shoujo Madoka★Magica Movie 2: Eien no Monogatari is a story of inescapable destiny, and an unlikely hero who could change it all.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/42265.webp"},{"title":"Steins;Gate: Kyoukaimenjou no Missing Link - Divide By Zero","synopsis":"Alternate 23rd episode of Steins;Gate, which leads into the story of Steins;Gate 0. It was included with the Steins;Gate Complete Blu-ray Box. ","img":"https://cdn.myanimelist.net/images/anime/7/77324.webp"},{"title":"Mahou Shoujo Madoka★Magica Movie 1: Hajimari no Monogatari","synopsis":"Madoka Kaname and her best friend Sayaka Miki are ordinary middle school students in the city of Mitakihara. But one day, they encounter a strange cat-like creature named Kyuubey, who claims he can grant them one wish. In exchange, they would become magical girls and fight against evil perpetrated by witches. A veteran magical girl in the area, Mami Tomoe, decides to show them how to hunt witches, while the mysterious transfer student Homura Akemi warns them to not take Kyuubey's deal, though she refuses to say why.\n\nHowever, after witnessing the brutal reality of fighting witches, the girls decide it may be safer to decline Kyuubey's offer. But when another magical girl arrives in the city and Sayaka decides to make a wish to help the one she loves, things quickly escalate as they are confronted with the harsh truth behind their powers and the ultimate price of their wishes.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/42331.webp"},{"title":"Kara no Kyoukai 6: Boukyaku Rokuon","synopsis":"With strange events occurring at Reien Girls' Academy during winter break, Azaka Kokutou, a student and apprentice mage, is sent by her master to investigate. It turns out that another mage has been stealing the students' memories using fairies that, despite her magical talent, are invisible to Azaka. So Shiki Ryougi, an acquaintance with special eyes who can see what Azaka cannot, is also sent to the academy to help with the crisis.  \n\nHowever, the two have trouble getting along, mainly due to the fact that Azaka views Shiki as her romantic rival. But when the fairy situation quickly spirals out of control and more layers of the mystery are revealed, Azaka must learn to work with Shiki in order to save her classmates.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/21739.webp"},{"title":"Higurashi no Naku Koro ni Rei","synopsis":"The infamous series of unexplainable murders in Hinamizawa have been solved and the chains of fate have broken due to the efforts of Rika Furude and her friends. Rika believes she has finally obtained the normal and peaceful life she desired with her friends; however, she is proven wrong when the wheels of fate begin turning once again after an unfortunate accident.\n \nRika suddenly finds herself in a \"perfect\" world, the constant cycle of brutal killings having never taken place, where all of her friends are content and satisfied. Not wanting to abandon the world that she fought so hard for, she learns she must destroy an essential \"key\" to get back. But can Rika abandon the faultless world she is given the chance to live in, after all of her battles have brought her this far?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/14113.webp"},{"title":"Higashi no Eden Movie I: The King of Eden","synopsis":"After preventing Japan's destruction, Akira Takizawa made one final request to become the \"King of Japan,\" before he erased his memories once again and disappeared. Leaving Saki Morimi with his cellphone, the only clue she has in regards to Akira's whereabouts is the message, \"I'll be waiting where our journey started.\"\n\nSix months later, rumors have spread about Akira, and Saki's search leads her to New York City. However, Saki is not the only person who goes to investigate—with several billion yen burning a hole in their pockets and a challenge to \"save Japan,\" the remaining Seleção are not far behind. Some are willing to help Akira achieve his goals, but a few are making dangerous moves in order to eliminate him and achieve their own picture of a better Japan. With rising stakes and new revelations, the game is still on.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/19101.webp"},{"title":"Another: The Other - Inga","synopsis":"Shortly before the start of a new semester, Misaki Fujioka visits her twin sister Mei Misaki in Yomiyama City. The girls make full use of the last days of summer, roaming around a heat-weary town and visiting various places including a shopping center and shooting stall. When they prowl around her basement, Mei expresses uneasiness about her new class, which is said to be cursed.\n\nCraving more entertainment, the twins decide to pay a visit to the local amusement park. But the leisure of a sleepy summer day could soon turn woeful as Mei sees the color of death on her sister—an unmistakable omen that a tragedy is bound to strike.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/42051.webp"},{"title":"Death Note: Rewrite","synopsis":"1. Genshisuru Kami (Visions of a God)\nA two hour episode of Death Note, mainly a compilation of the confrontations between Light and L, re-edited from Ryuk's perspective with new dialogue and soundtrack along with additional animation that could not be included in the original series.  An Unnamed Shinigami comes to Ryuk to question him about his new story in the human world.\n\n2. L o Tsugu Mono (L's Successors)\nThis story continues where the previous left off, continuing the story of Light. As the previous special told Light and L's battles, this story does the same with the conflicts between Light, Mello, and Near.  \n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/13/8518.webp"},{"title":"Yakusoku no Neverland 2nd Season","synopsis":"Second season of Yakusoku no Neverland.","img":"https://cdn.myanimelist.net/images/anime/1708/104922.webp"},{"title":"Denpa-teki na Kanojo","synopsis":"Delinquent Juu Juuzawa is a lone wolf who does not see much use in befriending people. So when a girl named Ame Ochibana claims they are linked together from their previous lives, he is highly skeptical and doesn't want anything to do with her. Even stranger is that her fondest wish is to be his servant. Thinking that Ame must be delusional, he tries to distance himself from her. But when a classmate is murdered, Juu instead decides to keep her close, believing the strange girl to be the culprit. However, her intelligence and skill begin to prove invaluable as the two begin working together to solve the murder.\n\nDenpa-teki na Kanojo weaves together a story of love, loss, and devotion, showing that allies can be found in the most unlikely of places.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/14787.webp"},{"title":"Higashi no Eden Movie II: Paradise Lost","synopsis":"As one of the 12 Seleção that needs to save the country in order to win a game, Akira Takizawa decided to become the \"King of Japan.\" With that in mind, after his return from the U.S.A., the remaining Seleção will also need to follow up on their own plans as they strive to outdo each other.\n\nSaki Morimi and the other members of the \"Eden of the East\" are under suspicion of being terrorists, but they still do everything they can to help Takizawa reach his goal and unravel the secrets of his past, as the last fight between the Seleção begins.\n\n[Written by MAL Rewrite]\n","img":"https://cdn.myanimelist.net/images/anime/5/26126.webp"},{"title":"Gyakkyou Burai Kaiji: Hakairoku-hen","synopsis":"Owing to an increasing debt, Kaiji Itou ends up resuming his old lifestyle. One day, while walking on the street, he stumbles upon Yuuji Endou, who is hunting Kaiji due to the money he owes to the Teiai Group. Unaware of this, Kaiji eagerly follows Endou, hoping for a chance to participate in another gamble, but soon finds out the loan shark's real intentions when he is kidnapped.\n\nGiven that Kaiji is unable to pay off his huge debt, the Teiai Group instead sends him to work in an underground labor camp. He is told that he will have to live in this hell for 15 years, alongside other debtors, until he can earn his freedom. His only hope to put an early end to this nightmare is by saving enough money to be able to go back to the surface for a single day. Once he is there, he plans to obtain the remaining money needed to settle his account by making a high-stakes wager. However, as many temptations threaten his scarce income, Kaiji may have to resort to gambling sooner than he had expected.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/10/30599.webp"},{"title":"Mahou Shoujo Ikusei Keikaku","synopsis":"For many individuals in N-City, playing the popular social role-playing game Magical Girl Raising Project is as close as they could come to being a real magical girl. However, for some rare players, that dream can become a reality. One such girl is Koyuki Himekawa, who receives a notification one night that she has been selected to become a magical girl, her in-game avatar Snow White.\n\nAs Koyuki and other chosen players in the city begin helping those in need, they all receive yet another notification: the admins have decided that they want to reduce the number of magical girls. Whoever collects the least amount of Magical Candies—which are awarded for their magical girl activities—in their competition each week will lose their powers. But when a real-world tragedy happens to the first player that drops out, they are shown the repercussions of losing their abilities. As more participants inevitably lose the competition and more twisted rules are added, the girls soon realize that their \"contest\" is actually a desperate fight for survival.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/81087.webp"},{"title":"Babylon","synopsis":"In the newly formed Shiniki district of Tokyo, Zen Seizaki is a diligent public prosecutor at the Tokyo District Public Prosecutors Office. Assigned to a case involving false advertisement, Zen—along with his assistant officer, Atsuhiko Fumio—investigate Japan Supiri, a pharmaceutical company that had provided fabricated clinical research on the company's new drug. While investigating the file of Shin Inaba, an anesthesiologist connected to the crime, the case takes a dark turn when Zen finds a page stained with a mixture of blood, hair and skin, along with the letter \"F\" scribbled all across the sheet. As he investigates further, the case goes beyond Zen's imagination and becomes vastly complex, challenging his sense of justice and his knowledge of the truth. \n\nDigging deeper into the investigation, Zen begins to uncover a concealed plot behind the ongoing mayoral election and ties to many people of interest involved in the election and those closer than he thinks. The case grows more severe and propels Zen into an unforeseen hurricane of corruption and deceit behind the election, the establishment of the Shiniki district, and the mysterious woman associated with it all. \n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1942/102707.webp"},{"title":"Magia Record: Mahou Shoujo Madoka☆Magica Gaiden (TV)","synopsis":"Rumor has it that if a young girl strikes a bargain with a white fairy, it will grant any wish her heart desires. However, in exchange, she will become a magical girl and must put her life on the line to slay fearsome and ferocious witches.\n\nIroha Tamaki, a kind-hearted middle schooler from Takarazaki City, is living proof that these rumors are true. Armed with a magical crossbow and the ability to heal injuries, Iroha seeks out the labyrinths where witches hide and defeats them before they can prey on humans. Yet Iroha has no memory of her wish, and even Kyuubey, the white fairy himself, seems to have no idea what Iroha requested of him.\n\nOne day, Iroha hears rumors of a city where \"magical girls can be saved,\" and finds herself on a sunset train to Kamihama City. Unfortunately, she discovers that the witches in Kamihama are far more powerful than usual. After veteran magical girl Yachiyo Nanami is forced to save her, Iroha vows to never return. But when a chance encounter with a tiny Kyuubey seems to trigger distant memories, Iroha is compelled to investigate the mysterious city despite the danger.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1786/104783.webp"},{"title":"Re:Zero kara Hajimeru Isekai Seikatsu - Hyouketsu no Kizuna","synopsis":"Covered in ice and snow, Elior Forest is the home to dangerous magical beasts and 50 elves frozen in ice. One day, the great spirit Pack helps a young girl break out of her ice prison. Her name is Emilia, a half-elf born with silver hair, long ears, and amethyst eyes—features that resemble the evil Witch who destroyed half the world long ago. \n\nShunned by society because of her appearance, Emilia dwells in the forest with Pack as her sole companion and family. Burdened with a sin of destruction she does not remember committing, she spends her days trying to find a way to help her frozen kin. But when the great spirit Melakuera, the Arbitrator of the world, finds Emilia, her right to stay alive is brought into question. Will the bonds of ice she formed with Pack prove to be the warm thread that defies fate?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1238/104023.webp"},{"title":"Itou Junji: Collection","synopsis":"In the light of day and in the dead of night, mysterious horrors await in the darkest shadows of every corner. They are unexplainable, inescapable, and undefeatable. Be prepared, or you may become their next victim.\n\nSit back in terror as traumatizing tales of unparalleled terror unfold. Tales, such as that of a cursed jade carving that opens holes all over its victims' bodies; deep nightmares that span decades; an attractive spirit at a misty crossroad that grants cursed advice; and a slug that grows inside a girl's mouth. Tread carefully, for the horrifying supernatural tales of the Itou Junji: Collection are not for the faint of heart.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/7/88366.webp"},{"title":"Touhai Densetsu Akagi: Yami ni Maiorita Tensai","synopsis":"While mahjong is a game that is often played with family and friends, it is also a game that is played in the darkest corners of society. Nangou is a compulsive gambler who has accumulated debt over three million yen. In a last ditch attempt to clear his record, he decides to wager his life on a game of mahjong with the mafia. Unfortunately, as the game progresses, Nangou only moves further from the prize and closer to death.\n\nWhen all hope seems lost, the game parlor is suddenly intruded upon by Shigeru Akagi, a young boy on the run from the police. Desperate to turn the game around, Nangou hands the game over to Akagi after teaching him a few of the rules. The mafia can only smirk as Akagi sits down to play. However, they soon come to learn that Akagi is a natural-born gambler. An imposing figure who does not fear death. One who is destined to become a legend.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/53587.webp"},{"title":"Shigofumi","synopsis":"There are some things that people are unable to say while they are alive; for these, there are \"shigofumi,\" letters carried from the world of the dead to the world of the living. When a person with strong emotions dies, they are able to create a shigofumi, whether their feelings are of love, longing, or resentment. It is the quiet and mysterious Fumika's job to deliver these messages from the departed. Along with her talking magic staff Kanaka, she ensures that each shigofumi reaches its intended recipient, even if that person does not want to face its contents.\n\nFumika witnesses the tragedies of people, both dead and alive, and sees their deepest secrets revealed. What is unclear, however, are the details of Fumika's past. Who was she before she came to be a carrier of shigofumi?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/4/50787.webp"},{"title":"Ibara no Ou","synopsis":"\"Medusa,\" a deadly virus becomes a worldwide epidemic. In order to escape from this deadly virus, a handful of people are chosen to be put into a cold sleep, laying in a capsule hoping for the future cure. Kasumi, a teenage girl is one of the 160 chosen for this procedure, and is guided to a Cold Sleep Capsule Center (CSCC) inside an ancient castle. Understanding that it is hardly possible, Kasumi goes to sleep still anticipating for a reunion with her twin sister Shizuku, who also is infected with the virus. As Kasumi and the others awake, they notice that the CSCC is not as they remembered. Just like the story of \"Sleeping Beauty,\" the castle is covered with thorn, and the awaken are attacked by unknown creatures and monsters! How long were they asleep? Where did the monsters come from? What has happened to the world?\n\nAbandoned in the midst of an enigma, the escapade of the seven survivors begins...\n\n(Source: kingofthorn.net)","img":"https://cdn.myanimelist.net/images/anime/9/87056.webp"},{"title":"Shiki Specials","synopsis":"The official website of the Shiki television anime series confirmed on Saturday that the anime's eighth and ninth Blu-ray Disc/DVD volumes will each include an unaired episode. The eighth volume will ship with Episode 21 and the unaired episode \"Dai Futatō to Han wa\" (a wordplay for \"Episode 20.5\") on May 25, 2011, while the ninth volume will ship with Episode 22 and the unaired episode \"Dai Futatō-ichi to Han wa\" (\"Episode 21.5\") on June 22. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/3/36543.webp"},{"title":"Higurashi no Naku Koro ni Kaku: Outbreak","synopsis":"The story is set in the same Hinamizawa village of the previous stories. The village has been completely sealed off due to a mysterious virus in 1983, and Maebara Keiichi and Ryuuguu Rena deal with the outbreak.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/51063.webp"},{"title":"Mouryou no Hako","synopsis":"The story follows a series of bizarre murders of schoolgirls who have been dismembered and stuffed into boxes. The private investigator hired by a missing daughter's mother joins forces with an antique book seller and others to unravel the murder spree.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/75492.webp"},{"title":"Under the Dog","synopsis":"The year is 2025. Five years have passed since the Tokyo Olympic Games were called off after deadly terrorist attacks. An international school run by the United Nations now stands in the former Olympic site on the edge of Tokyo Bay. Seven teenagers with special abilities, known as \"Flowers,\" are among the students.\n\nTheir student identities are only a cover for their real identities as members of an intelligence organization run by the UN. Their objective is to assassinate other teenagers who have the same abilities. The Flowers have no choice but to complete their missions without fail. Their organization has taken their family members hostage to ensure this. For the Flowers, failure would mean death not only for themselves but also for their loved ones.\n\nThis is the story of their struggle against cruel fate, and of how it is human nature to find hope, however bleak the outlook.\n\n(Source: Official site)","img":"https://cdn.myanimelist.net/images/anime/13/66483.webp"},{"title":"Kara no Kyoukai Remix: Gate of Seventh Heaven","synopsis":"In August of 1995, Mikiya Kokutou meets a young kimono-clad woman named Shiki Ryougi. When he finds out that they go to the same school, he attempts to befriend her. Though her upbringing is unconventional and she herself is strange, Mikiya is not deterred, and Shiki gradually opens up to him. But Mikiya's life will be changed forever by this simple meeting, and in ways that he never imagined, as he begins to see a deadly side to his new friend...\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/11/15175.webp"},{"title":"B: The Beginning 2","synopsis":"Second season of B: The Beginning.","img":"https://cdn.myanimelist.net/images/anime/1594/93194.webp"},{"title":"Golgo 13 (TV)","synopsis":"Golgo 13 is not his real name. Then again, neither is Duke Togo, Tadashi Togo, or any number of the aliases he goes by. A man of mystery, not even the world’s most prominent intelligence agencies can determine who Golgo really is, or just where he came from. But all agree that his skills are nothing short of legendary.\n\nArmed with a custom M16, Golgo is willing to take any job for any agency, from the FBI to the KGB. He has completed every contract he has ever taken and will work for anyone who can meet his price. He is both the greatest weapon and the greatest threat to any nation; no one is safe once they are in Golgo’s sights.","img":"https://cdn.myanimelist.net/images/anime/9/25423.webp"},{"title":"Imawa no Kuni no Alice (OVA)","synopsis":"Ryouhei Arisu is a high school student with no ambitions and just wants to escape from what he feels is a meaningless reality. One night when he is with his two friends Daikichi Karube and Chouta Segawa, they see an abnormally large firework shoot into the sky, an event which signals a permanent change in their lives.\n\nBlinded by the incredibly bright explosion, the three find themselves transported to what is known as the Borderland. The only inhabitants of this world are participants of a deadly game where specific tasks must be accomplished if they wish to survive. As the three begin playing to determine how they can get back home, Ryouhei finds himself feeling alive for the very first time in his life.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1004/96669.webp"},{"title":"Narutaru: Mukuro Naru Hoshi Tama Taru Ko","synopsis":"During her summer holiday at her grandparents house Tamai Shiina, a young and cheerful schoolgirl, meets a strange looking creature. They befriend each other and Shiina names it \"Hoshimaru: The Round Star.\" When Shiina returns home after the summer to go back to school, she starts meeting other kids that also have befriended a strange creature like Hoshimaru. But she soon finds out that not all these creatures and their masters are as friendly as Hoshimaru.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/12023.webp"},{"title":"Shion no Ou","synopsis":"Shion no Ou follows the story of Yasuoka Shion, a 13-year-old Shougi player with a past of tragedy. Shion's parents were brutally murdered in front of her when she was 5 years old. The murderer sat down with her and challenged her to a game of Shougi, after telling her that if she wanted to stay alive she should forget how to speak, and forget what happened that night. \n\nNow Shion has entered the realm of female pro Kishi, mute but strong. As her playing gathers more and more attention, so do the questions about her past and the brutal murder she witnessed. Shion's memories slowly come back, and the mystery begins to unravel, thread by thread. ","img":"https://cdn.myanimelist.net/images/anime/5/74050.webp"},{"title":"Kagewani","synopsis":"A video blogger attempts to fake cryptid sightings to boost his views, but gets more than he bargained for when his crew is slaughtered by a real monster. Elsewhere, students find themselves preyed upon by a sandworm-like beast, initiating a desperate struggle for survival on their own school grounds.\n\nWith more of these attacks from mysterious creatures occurring, researcher Sousuke Banba tasks himself with delving into the mystery. With nothing but the keyword \"Kagewani\" to lead him, he scours the sites of recent attacks in hopes of finding a lead to eradicating the creatures for good. However, Sousuke finds that these threats to humanity are even closer to home when the pharmaceutical company, Sarugaku, starts to encroach on his investigation.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/76060.webp"},{"title":"Black Jack","synopsis":"Kuroo Hazama, also known as \"Black Jack,\" is a legend in the medical world. Famous for being one of the best, as well as not having a license, Hazama and his assistant Pinoko save countless lives that other doctors cannot... for a price; an exorbitant price, in fact, which causes many to view the genius as greedy and heartless. Despite these claims, however, none can deny his skill and the lengths that he will go to treat his patients. This dark medical drama tells the story of the ominous and mysterious world of underground medicine as Black Jack risks his life to cure some of the most bizarre diseases imaginable, even if it means breaking every law in the process.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/5/12978.webp"},{"title":"Fantastic Children","synopsis":"A group of enigmatic white-haired children has been spotted at different times and places in Europe for over 500 years. Always with the appearance of 11-year-olds, they behave far more mature than they should be, never grow old, and seem to have supernatural power. What they have been seeking is a girl, and the only clue they have is a picture with a crescent moon. Now, in the year of 2012, an athletic boy named Tohma is about to be involved in this centuries-long mystery.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/77062.webp"},{"title":"Higurashi no Naku Koro ni (2020)","synopsis":"New Higurashi no Naku Koro ni anime project.","img":"https://cdn.myanimelist.net/images/anime/1808/105271.webp"},{"title":"Arve Rezzle: Kikaijikake no Yousei-tachi","synopsis":"A cyber battle sci-fi. In 2022, the technology of quantum computing has greatly advanced and many people have transferred their mind into cyber space.\n\nRemu's sister, Shiki, skipped grades and entered a high school in the academic city \"Okinotori-island Mega Float City (OMFC)\" when she was 14. One day, Shiki confessed to her brother via Skype that she was talking to him directly from the cyber space and that her real body had been kept in a water tank filled with a culture medium. It's called \"body pool\" and Shiki connected to the network by nanomachines implanted in her brain.\n\nRemu was surprised but he accepted her decision until an accident called \"Early Rupture\" happened. The network server got overloaded and users' minds were lost in cyber space leaving soulless living bodies in the body pools. In order to bring Shiki's mind back, Remu visits her apartment in OMFC and there meets Shiki escaped from the hospital. But the girl tells him that she is not Shiki and she happened to have taken over Shiki's body.\n\nWhen Remu tries to figure out the situation, a violent attack strikes the apartment.","img":"https://cdn.myanimelist.net/images/anime/4/43343.webp"},{"title":"Blade Runner: Black Out 2022","synopsis":"In 2022, an EMP detonation causes a global blackout that has massive, destructive implications all over the world. Directed by Cowboy Bebop and Samurai Champloo's Shinichiro Watanabe, Blade Runner: Black Out 2022 is an animated short which serves as a prologue for the feature film Blade Runner 2049.\n\n(Source: Crunchyroll, edited)","img":"https://cdn.myanimelist.net/images/anime/4/89563.webp"},{"title":"Mahou Shoujo Madoka★Magica: Concept Movie","synopsis":"A short four-minute concept film that served as a surprise unveil at Studio SHAFT's 40th anniversary event in Winter 2015, Madogatari. The concept movie is the core of a new Madoka Magica project, and serves as its trailer. The second short was later screened in Osaka, with the difference being a replacement of several imageboard segments.","img":"https://cdn.myanimelist.net/images/anime/12/77732.webp"},{"title":"Loups=Garous","synopsis":"In a future governed through the lens of a camera, where people eat synthetic food and pursue an online existence in lieu of physical contact, a group of children begin meeting up in the real world. The aloof Ayumi Kono, the genius hacker Mio Tsuzuki, and the socially awkward Hazuki Makino set out to find the fourth member of their group, Yuko Yabe, who has gone missing. With the help of Myao Rei, an unregistered citizen proficient in martial arts, they are able to find Yuko. However, when their situation takes a sudden turn for the worse, the group stumbles headlong into a dark mystery that challenges everything they know about their world.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/13/26343.webp"},{"title":"Kagewani: Shou","synopsis":"After surviving the onslaught at Sarugaku headquarters, Sousuke Banba resumes his investigation of the Kagewani monster hybrids. Armed with the ability to harness the Kagewani's power, the researcher now has a means to eliminate the creatures. But despite the benefits of this skill, it has one major drawback: Sousuke now struggles to maintain his sanity, with the power threatening to consume his body.\n\nSoon, threats old and new begin to rear their heads, as the upper echelons of Sarugaku become active once again and an assassin with a personal vendetta sets her sights on Sousuke. Nevertheless, he resolutely forges ahead on his mission, determined to track down the origins of the Kagewani and eliminate their threat once and for all.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/3/78601.webp"},{"title":"Shigofumi: Sore kara","synopsis":"The 13th episode of Shigofumi.","img":"https://cdn.myanimelist.net/images/anime/11/9064.webp"},{"title":"Magia Record: Mahou Shoujo Madoka☆Magica Gaiden (TV) 2nd Season","synopsis":"2nd Season of Magia Record: Mahou Shoujo Madoka☆Magica Gaiden (TV).","img":"https://cdn.myanimelist.net/images/anime/1097/106793.webp"},{"title":"AD Police","synopsis":"The year is 2027 in MegaTokyo, six years before the Knight Sabers will make their debut. Boomers (artificial humans) are still a relatively new advancement, and the implementation and integration of boomers into society is still a bit buggy -- sometimes fatally so. Whenever a boomer incident occurs, though, there is the Advanced Police, a special force trained to deal with boomer crimes.\n\nLeon McNichol is a rookie in the AD Police, and is just starting to become exposed to the horrors and tragedies one finds every day in MegaTokyo. He and his veteran partner, Gina Marceau, slowly learn about the ever-fading line that separates man from machine. ","img":"https://cdn.myanimelist.net/images/anime/13/2851.webp"},{"title":"Bokura no Nanokakan Sensou","synopsis":"On a hot day right before the summer vacation, all first-year male students of the second class from a junior high school disappear. Was it an accident? A group abduction? In fact, they were hiding in an abandoned factory near the river, and used it as a liberation area to rebel against the adults. The adults are in great confusion by the huge and unexpected operations cooperated by the female students; entangled with real abduction cases, a corrupted mayor election, and even involving parents and television reporters who are thrilled by the liberation broadcast and barricade. The comedy mystery progresses in a light tempo that doesn't give the audience a chance to breathe until the brilliant end that is full of satire.\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1887/103944.webp"},{"title":"Mi Yu Xing Zhe","synopsis":"A magician, a female doctor, a gangster, an archaeology professor, a policewoman, a drug dealer, a businessman... Such a random group of people find themselves trapped on a desolate island when they wake up from sleep one day. They are surrounded by tribes, mutant viruses, and countless life and death situations on this mysterious island. What will they do to survive and escape?","img":"https://cdn.myanimelist.net/images/anime/1869/104422.webp"},{"title":"Karakurizoushi Ayatsuri Sakon","synopsis":"The dark-haired bishounen is Sakon Tachibana, a puppeteer, and the other is Ukon, his favorite puppet, and best friend. Sakon is the (only) grandson of Saemon Tachibana, a national treasure of Japan famous for his manipulation of Bunraku puppets. Ukon is a child doll puppet made in the early Meiji era by the famous female dollmaker Unosuke. Together they run into murders and solve them.\n\n(Source: AnimeNfo)","img":"https://cdn.myanimelist.net/images/anime/10/16022.webp"},{"title":"Blade Runner: Black Lotus","synopsis":"(No synopsis yet.)","img":"https://cdn.myanimelist.net/images/anime/1148/96835.webp"},{"title":"Mouryou no Hako: Chuuzenji Atsuko no Jikenbo - Hako no Yurei no Koto","synopsis":"A side story that reveals the investigative notes that Atsuko, the younger sister of the main character Akihiko Chuzenji, wrote about the brutal dismembering incidents in the main story.\n\n(Source: ANN)\n","img":"https://cdn.myanimelist.net/images/anime/5/23740.webp"},{"title":"Biohazard 4: Incubate","synopsis":"After the Playstation port of Resident Evil 4 hit the stores Capcom released a new 97 minute DVD some time later which intended to summarize the whole story of Resident Evil 4. It's played on English audio with Japanese subtitles. It also included a little book which explains the life on El Pueblo before and the arrival of Osmund Saddler. It also solved some plot holes like the whereabouts of the children. It contains many of the scenes original to Resident Evil 4.\n\n(Source: Resident Evil Wiki)","img":"https://cdn.myanimelist.net/images/anime/3/21456.webp"},{"title":"Koroshiya-san: The Hired Gun","synopsis":"The comedy story follows the title character, who is regarded by himself and others as the best hit man in Japan. He goes by the motto, \"If I have an assignment, I will kill anything.\" However, his \"killing\" assignments have expanded to include everything from summer vacation homework to housekeeping. \"The hit man never fails to kill the target. Though he does not aim to, he also never misses the laughter.\"\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/55531.webp"},{"title":"Duan Nao","synopsis":"The word cerebrum refers to a gigantic system consisting of collision universes, which is called cerebrum universe. The story starts from a series of unknown murders, unravelling the secret hiding beneath the entire universe, ranging from horrifying conspiracies to galaxy wars, from anti-human betrayals to honourable sacrifices. Having realised her weakness and backwardness, mankind takes the last stand.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/3/82664.webp"},{"title":"Dwaeji-ui Wang","synopsis":"After his business goes bankrupt, 30-something Kyung-Min (Oh Jung-Se) kills his wife impulsively. Hiding his anger, he seeks out his former middle school classmate Jong-Suk (Yang Ik-June). Jong-Suk now works as a ghostwriter for an autobiography, but he dreams of writing his own novel. For the first time in 15 years, they meet. Kyung-Min and Jong-Suk both hide their own current situations and begin to talk about their middle school days.\n\nAt their middle school, they were classified by their wealth and grades. Kyung-Min and Jong-Suk were at the bottom. They were called pigs. They were bullied by a ruling class called dogs. When they were called pigs, they got angry but couldn't do anything against the dogs. Then a king of pigs appears—Chul (Kim Hye-Na). Kyung-Min and Jong-Suk became to rely on Chul-Yi.\n\nNow, leading Jong-Suk to their middle school grounds, Kyung-Min discloses the shocking truth to Jong-Suk of what happened 15 years ago.\n\n(Source: Asian Media Wiki)","img":"https://cdn.myanimelist.net/images/anime/13/33977.webp"},{"title":"Seoul-yeok","synopsis":"Several groups of people try to survive a zombie pandemic that unleashes itself in downtown Seoul.","img":"https://cdn.myanimelist.net/images/anime/10/81971.webp"},{"title":"Chainsaw Maid","synopsis":"A family and their maid are going about their daily lives when, unexpectedly, a woman bursts into their home shouting, \"They're coming!\" She then vomits out her organs, turns into a zombie, and attacks the master of the house. The maid saves her employer, but he and his daughter are stunned and have difficulty processing the events. As more and more zombies invade the residence, the maid decides it is her duty to defend the house from unwanted guests—using a chainsaw!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/6/32575.webp"},{"title":"Ninja Ryuukenden","synopsis":"On a dark, late night in New York City, Ryu is chased and attacked by assassins. After disposing of them, he finds an I.D. card for the Friedman Company. The next day, it is announced that Dr. Ned Friedman has discovered a cure for cancer. But after providing no information at his press conference, a reporter named Sarah decides to investigate with the help of her friends Robert and Jeff. When passing by Dr. Friedman's house one day, Ryu hears the voice of a young girl calling for help. When Sarah and her entourage investigate the house as well, they run into their colleague, Ryu. Upon that, they discover Dr. Friedman has been conducting experiments on live humans using biotechnology, and that it may have something to do with the power of the Evil Gods, whom Ryu had defeated in the past. But when Ryu's friend, Irene, is kidnapped, he must dawn his role as a Dragon Ninja once again to defeat this new enemy and save her. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/69415.webp"},{"title":"Saibi","synopsis":"Who is good and who is evil? What is the boundary between them? An animated thriller about the tension between a good-hearted person speaking falsely and an evil-natured person speaking truthfully, and of those that surround them.\n\n(Source: Hancinema)","img":"https://cdn.myanimelist.net/images/anime/5/55499.webp"},{"title":"Shuranosuke Zanmaken: Shikamamon no Otoko","synopsis":"Shurannosuke Sakaki is a masterless samurai with a razor-sharp katana and a cold-hearted personality. Whenever you see the mark of two crossed scythes on his back, death is sure to follow. Because of his exceptional swordsmanship, Shurannosuke is hired by the Nakura Clan to rescue Princess Mayu from the Seki Ninja. In this mission, he must use his full potential to survive the Seki Ninja's notorious henchmen. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/11/44163.webp"},{"title":"Sanctuary","synopsis":"Two Japanese survivors of the Khmer Rouge massacres in Cambodia vow to find a sanctuary, even if they have to build it themselves. Returning to Japan, they take seemingly opposite paths: one becomes a politician, the other a gangster.\n\nAs Asami and Houjou work through the linked worlds of politics and crime in modern Japan, they don't hesitate to do anything necessary to secure their own positions and stay true to their vow. Loyal to no one else, they find their friendship increasingly tested as they rise in their chosen fields.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1795/105898.webp"},{"title":"Mo Ri Shu Guang","synopsis":"In the year of 2013, the tide of zombies outbreak exploded in everyone's homeland, humanity launches a large-scale battle in the endless nights awaiting for the arrival of the dawn.\n\nThe end is approaching, is there going to be a way out for them? \nTheir faiths were shattered into pieces and buried in ashes in the raging fire. But within the blazing fire, a newborn hope arise once again.\n\n(Source: polarbearadise)","img":"https://cdn.myanimelist.net/images/anime/1939/90507.webp"},{"title":"Bloody Night","synopsis":"A little girl is wandering the streets late at night, but something is eerily amiss. Suddenly, a vicious red monster appears and begins chasing her. As she desperately tries to get away, she encounters a homeless old man in an alleyway and later an armed policeman who both try to save her. Can either of these brave men save the girl from the monster that pursues her so relentlessly?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/8/33341.webp"},{"title":"Gamba no Bouken","synopsis":"An adventurous wild mouse called Gamba travels with his friends to see the ocean but he finds an injured mouse and hears about the violence of white ferret Noroi. Gamba decides to help the mice suffering under Noroi's tyranny.","img":"https://cdn.myanimelist.net/images/anime/10/57873.webp"},{"title":"Meisou! Underworld","synopsis":"Seita dies after dozing off behind the wheel and wakes up in the underworld. However, the prize that a demon extracts from him is part of his body.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/10/61637.webp"},{"title":"Osiris no Tenbin","synopsis":"The protagonist is a mysterious assassin. In order to decide whether or not to carry out requests for assassination, he meets his targets to make a final judgment.\n\n(Source: Official website)","img":"https://cdn.myanimelist.net/images/anime/10/75432.webp"},{"title":"Dead Girl Trailer","synopsis":"Once upon a time, a girl was brutally murdered. Stabbed mercilessly and left for dead, she never received justice and her sadistic killer got away. That was until, through supernatural and unknown forces, she was brought back to life—as a zombie! Powerful, relentless, and hungry, Dead Girl is out for revenge!\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/2/44744.webp"},{"title":"Xue Se Cang Qiong","synopsis":"Li Mingyang was originally an ordinary office worker. Because of a strange QR code, he was trapped in a killing city. Here everyone is forced to participate in a survival game that is going to kill or be killed. In the process of finding a way out of the city, the mastermind behind the whole incident surfaced step by step.","img":"https://cdn.myanimelist.net/images/anime/8/88891.webp"}]