[{"title":"Boku no Pico","synopsis":"Upbeat and effeminate Pico is working at his grandfather's coffee shop, Café Bebe, for the summer. Tamotsu is a white-collar worker looking for an escape from the mundanity of his everyday life. When they meet at the café, sparks of love and lust quickly draw the two together. Conventional notions of age, gender, and sexuality are broken down as the pair seeks carnal gratification in one another's company. But do the pleasures of flesh equate to a connection between hearts?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/12/39497.webp"},{"title":"Koisuru Boukun","synopsis":"Tetsuhiro Morinaga is in love with his upperclassman Souichi Tatsumi. He even manages to confess his love. Too bad it turns out that Tatsumi is an aggressive, self-centered, and outspoken homophobe.\n\nYet somehow Tetsuhiro managed to fall in love with Tatsumi, the “walking personality disorder,” who is the kind of man who declares that all gay men should be wiped off the face of the planet. \n\nAn unfortunate accident with an aphrodisiac drug brings the two men physically together against Souichi’s will. The experience has a life-changing effect on both men. But will it ultimately bring them closer, or drive them apart?","img":"https://cdn.myanimelist.net/images/anime/8/26233.webp"},{"title":"Pico to Chico","synopsis":"The crisp rays of summer sun find the effeminate Pico embroiled in yet another heated and lustful fling. While out biking, Pico meets and befriends Chico—a lively boy not much younger than him, but leagues behind in the affairs of the flesh. After the innocent Chico shows his sister in the midst of self-pleasure to Pico, Pico takes it upon himself to educate this confused youth.\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/9/39499.webp"},{"title":"Pico x CoCo x Chico","synopsis":"The young couple Pico and Chico are out for a date in town when a chance encounter has them immediately seduced by the mysterious runaway named CoCo. Pico is instantly drawn in by CoCo's spiritual outlook and feminine charms, but little does he know that the swaying of his heart will fuel the sparks of jealousy, passion, and desperation between the trio, ready to engulf them in an inferno of arousal and anxiety at any moment. \n\nTwo may be company, but is three really a crowd?\n\n[Written by MAL Rewrite]","img":"https://cdn.myanimelist.net/images/anime/1123/103844.webp"},{"title":"Kirepapa.","synopsis":"Chisato is a beautiful 35-year-old writer, who looks like 18, and the father of Riju, a cute 15-year-old boy. Chisato's hobby is to drive away all of Riju's friends because he thinks they want to corrupt his precious child, so he shows his good side to these boys while he poisons the cake he brings them with a smile; however, there is one guy, Shunsuke, who doesn't fall for the tricks. But is Shunsuke really aiming for Riju? Who is that mysterious writer Chisato loves so much? And why is Chisato convinced that Riju's friends want to take advantage of him?\n\n(Source: Evil Empire)","img":"https://cdn.myanimelist.net/images/anime/8/31421.webp"},{"title":"Papa to Kiss in the Dark","synopsis":"Munakata Mira is in love with his father, the famous Hollywood actor Munakata Kyousuke. Unknown to the public, both of them are father and son as well as lovers. When Mira turns 15 and enters high school, he faces trouble with his childhood friend falling in love with him. Also, finding out he is adopted only distresses him further. Then there's the problem of Kyousuke probably marrying a famous actress, whose son seems to have an interest in Mira. \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/5/11100.webp"},{"title":"Okane ga Nai","synopsis":"Yukiya Ayase is a gentle, kind hearted, and innocent university student. The only relative he has left, his cousin Tetsuo, betrays Ayase by selling him to the highest bidder in an auction with hopes of making an enormous profit to be able to pay off his debts. Somuku Kanou, a bad-tempered (though very rich) loan shark, comes to Ayase's rescue and buys Ayase for an impressive 1.2 billion. Kanou apparently knows Ayase from something that happened between them in the past, but Ayase cannot remember who Kanou is nor does he understand why he \"saved\" him. In a desperate effort to keep Ayase close to him, Kanou demands the debt be repaid in full and suggests the perfect way to do it: by selling his body to Kanou for 500,000 each time. Ayase is horrified in the beginning, but something soon begins to grow between them that can't be bought for any price.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/88352.webp"},{"title":"Sensitive Pornograph","synopsis":"For four young men, love and intimacy are in the air, even though they may not be aware of it. Sensitive Pornograph holds within it two tales of sexual romance for two different couples of men. The first is a tale between two manga artists, Seiji Yamada and Sono Hanasaki. Both are familiar with each other's work, though upon meeting each other, Seiji is shocked to find out that Sono is actually a man, ten years his senior. Love quickly blossoms between the two, but will soon be tested when Seiji begins to hear rumors about Sono's past sexual exploits.\n\nIn the second tale, Koji Ueno is a part-time pet sitter, hired to take care of a rabbit named Aki for a new client. To Koji's complete surprise though, not only is there no rabbit in the house, but the only thing in the apartment is a bound and gagged man in the closet who says that he is Aki. More troubling than this is that Aki informs Koji that they are both in danger of upsetting the client, and the only way for Koji to get out safely is for them to make love together.\n\nTwo stories, four men, and the one emotion of love that unites them all in the new twists their lives have taken.","img":"https://cdn.myanimelist.net/images/anime/12/27084.webp"},{"title":"Seitokaichou ni Chuukoku","synopsis":"Even as he tries to keep the student council president out of trouble, Vice President Chiga-kun finds himself being drawn to the president's strength and power. Chiga-kun wonders how he, being such an intelligent individual, can be so unwillingly taken with a boy who is so country and simple...\n\n(Source: Aarinfantasy)","img":"https://cdn.myanimelist.net/images/anime/5/17008.webp"},{"title":"Ikoku Irokoi Romantan","synopsis":"Japanese yakuza clan heir Ranmaru just got married on a lavish cruise ship, but things aren't as they seem. The marriage is just for the appearances, and he ends up getting drunk and spending the night not with his bride but with the sexy ship captain. When the two men meet again in Italy, it is the start of a spectacular love story.\n\n(Source: MU)","img":"https://cdn.myanimelist.net/images/anime/9/27506.webp"},{"title":"Ai no Kusabi","synopsis":"On planet Amoi, a great society has developed, creating a computerized city called Tanagura, ruled by supercomputer Jupiter. The populace is almost entirely male and is based on hair color; silver and/or blonds are the elitist, ending with dark/black haired as the bottom of society, often known as \"mongrels\". Blondies keep \"pets\", young boys kept for a few years, especially made for performing sexual actions for the Blondie's voyeurism entertainment. Blondies aren't suppose to keep pets for long or interact sexually with pets, but one blondie named Iason Mink has kept a pet named Riki, for years and is rumored to sleep with him. Iason refuses to let go of Riki, even with Jupiter's disapproval. Riki fights with his emotions and society problems, unable to decide what to do about his old friend/lover Gai (Guy) and their gang. Iason is obsessed with keeping Riki, and Riki doesn't know what to do; fight against him or surrender to him.","img":"https://cdn.myanimelist.net/images/anime/8/6531.webp"},{"title":"Hyakujitsu no Bara","synopsis":"Two soldiers from warring countries are bound by a pledge as master and servant. Taki Reizen is a Commander of sublime beauty, shouldering the fate of his nation. Called \"Mad Dog\" because of his rough temperament, Klaus has sworn his loyalty to him as a knight. Despite this, those around them are cold and disapproving, full of various misgivings. For all their genuine feelings, what will come of love made cruel by the violence of war? \n","img":"https://cdn.myanimelist.net/images/anime/5/34517.webp"},{"title":"Ai no Kusabi (2012)","synopsis":"The story is set in the future on the planet named Amoi which is controlled by a supercomputer named Jupiter. Among the mostly male human population, the light-haired elite class is allowed to temporarily keep the dark-haired \"mongrels\" as pets. One elite member, Iason, encounters a mongrel named Riki in the slums and decides to take him in. However, Iason keeps Riki longer than it is socially approved, and rumors abound about their possible relationship.","img":"https://cdn.myanimelist.net/images/anime/7/75531.webp"},{"title":"Sex Pistols","synopsis":"An average boy named Norio is suddenly getting a lot of unwanted romantic attention. A fall down the stairs into the arms of a handsome stranger sets off the beginnings of an explanation, and it is one Norio never could have possibly imagined. Soon a whole new world opens up for Norio revealing a secret society of special people evolved from animals other than monkeys. Norio turns out to be a particularly rare breed and his DNA is in high demand. Now that he's suddenly the prey, it'll take much effort to survive in this modern jungle. \n\nThis story revolves around a high school boy who discovers that he is part of a select group of humans who did not evolve from monkeys, but various animals such as leopards and black bears. \n\n(Source: ANN) ","img":"https://cdn.myanimelist.net/images/anime/9/23742.webp"},{"title":"Haru wo Daite Ita","synopsis":"The adorable and attractive main characters of Haru wo Daiteita are Kyousuke Iwaki and Youji Katou who are both in the film industry, having starred in various adult video films and are trying to climb the ladder of success and become greater actors. Iwaki is accepted to star in a popular movie, having beaten Katou in the auditions. During their time together, Katou believes he is in love with Iwaki-San, who on the contrary refuses to believe that he is in love. It is later on that another gay actor comes back to Japan and co-stars with Katou that problems starting arising. And it is from then on that the two realise where their hearts are set.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/3718.webp"},{"title":"Yarichin☆Bitch-bu","synopsis":"An all-boys boarding school deep in the mountains where love unfolds. Despite the brimming sexual desire, the overly awkward love story hooks you in!\n\nFirst-year Toono transfers from Tokyo to the all-boys boarding school deep in the mountains, \"Mori Moori Private School.\" The friendly Yaguchi who calls out to him becomes his only friend, but his dislike of sports makes him join the most laid-back looking photography club instead of Yaguchi's soccer club. However, the photography club is in name only and is actually nicknamed the \"Yarichin Bitch Club,\" filled with colorful seniors. In contrast to the troubled Toono, Kajima, who joined the club at the same time, is completely unphased and even slips a confession to Toono into the confusion. Toono himself thinks Yaguchi is cute, but Yaguchi finds himself blushing around Kajima and stuff happens. Furthermore, complications arise between the seniors…\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1431/91369.webp"},{"title":"Enzai","synopsis":"The protagonist is Guys, a young boy from a poor family, who gets caught for stealing candy from a Paris store. \n\nHowever, after being railroaded by a city detective named Guildias, Guys finds himself accused, convicted, and sentenced to life imprisonment for the murder of a man he never met.\n\nFrom that point on, most Enzai takes place inside a dark, claustrophobic, dirty prison, in there, Guys experiences humiliation and torture of various kinds, much of it involving sexual acts such as rape and forcible sodomy.","img":"https://cdn.myanimelist.net/images/anime/2/24031.webp"},{"title":"Fuyu no Semi","synopsis":"If time did not allow ordinary things to be ordinary. How would you have lived?\n\nIt is the Bakumatsu and early Meiji Period. Akizuki Keiichirou and Kusaka Touma stand of opposite sides of the political scale of the time but still, something as fragile as the shell of a cicada binds these two men together in a tragic and cruel fate. A story of friendship, love and seperation as well as reunion and sacrifice.\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/1/2443.webp"},{"title":"Shounen Maid Kuuro-kun: Tenshi no Uta","synopsis":"Kuuro-kun is made to take over the debts of his father and forced to pay them off by being sold into servitude as a boy maid.","img":"https://cdn.myanimelist.net/images/anime/2/26314.webp"},{"title":"Finder Series","synopsis":"Twenty-three-year old Takaba Akihito is a young freelance photographer who takes pride in his work and seeks to get a major \"scoop.\" After he takes photographs of the business dealings of crime lord Asami Ryuichi, Asami kidnaps and rapes him, beginning a sadomasochistic relationship between them as they find themselves continually drawn to one another. Fei Long, a rival Chinese boss who blames Asami for his father's death, takes an interest in Takaba, as well, seeking a way to get revenge.\n\n(Source: Wikipedia)","img":"https://cdn.myanimelist.net/images/anime/2/36823.webp"},{"title":"Boku no Sexual Harassment","synopsis":"Mochizuki is a young business man who works in an office. While doing his job, his boss, Honma, comes in and starts to fondle him. Honma says that Mochizuki should be expected to do stuff so he can climb the ladder to become a successful business man. Mochizuki then starts to sleep with other men so he can become successful. Some men think Mochizuki is sexy, so they then force themselves onto Mochizuki. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/8/33163.webp"},{"title":"Keiraku no Houteishiki Level-C","synopsis":"Mizuki is a male fashion model with a nice apartment. Kazuomi just had his girlfriend kick him out. Kazuomi sets out to find someone new to live with and sees Mizuki on the street. Kazuomi thinks Mizuki is cute and asks to stay with him in exchange for great sex. Mizuki thinks he is joking until they are at his apartment later that night and Kazuomi makes good on his promise. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1016/90268.webp"},{"title":"Papa datte, Shitai","synopsis":"\"There are Times I Cannot Hold It, Even If I'm a Father\"\n\nUniversity student Asumi came to Naruse household to be a housekeeper for his part-time job. The family consists of a single-father and a son Ichika. Among them, the father Naruse is too sexy for Asumi!! Even if he is not gay, Asumi gets conscious of Keiichi, and when he noticed that Keiichi is sexually unsatisfied by noticing him watching adult video in his room, he would unconsciously get tempted to attack him…! \"Naruse-san, you're too sexy for a father with a child...!\"\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1273/97100.webp"},{"title":"Saigo no Door wo Shimero!","synopsis":"After being best man at his best friend's (Saitou Toshihisa) wedding, Nagai Atsushi realizes that he might have fallen for him. Nagai, drowning in his sorrows and hatred for the new bride then meets Honda Kenzou, another guest at the wedding. Honda takes care of Nagai when he was dead drunk and now Nagai can't stop thinking of both Honda and Saitou.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/9/2720.webp"},{"title":"Kachou no Koi","synopsis":"The story centers on a manager named Odakara Kazuhiko who has spent all 33 years of his life without a girlfriend. An encounter with a new employee named Harada makes Odakara realize that he is gay.","img":"https://cdn.myanimelist.net/images/anime/4/21953.webp"},{"title":"Zetsuai 1989","synopsis":"Koji Nanjo, a young rock star, falls in love with soccer player Takuto Izumi. Koji eventually learns that Izumi's mother killed his father out of severe and intense love. Izumi took all the guilt for his father's murder and refuses to go pro because of fear that his past will be discovered by the media. Izumi detests Koji's company and encouragement and severely dislikes the attention from the press, but Koji cannot stay away for he soon realizes that his love for Izumi is very similar to the love that Izumi's mother felt for his father. \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/12/73226.webp"},{"title":"6 Lovers","synopsis":"The July issue of Dear+ has announced that a series of manga serialized in the magazine will get anime adaptations in celebration of the magazine's 20th anniversary. These anime will be collected into an \"in motion\" animation series titled 6 Lovers.","img":"https://cdn.myanimelist.net/images/anime/9/86278.webp"},{"title":"Saezuru Tori wa Habatakanai: The Clouds Gather","synopsis":"Yashiro is the young leader of Shinseikai and the president of the Shinseikai Enterprise, but like so many powerful men, he leads a double life as a deviant and a masochist. Doumeki Chikara comes to work as a bodyguard for him and, although Yashiro had decided that he would never lay a hand on his own men, he finds there's something about Doumeki that he can't resist. Yashiro makes advances toward Doumeki, but Doumeki has mysterious reasons for denying. Yashiro, who abuses his power just to abuse himself, and Doumeki, who faithfully obeys his every command, begin the tumultuous affair of two men with songs in their hearts and no wings to fly.\n\n(Source: Juné)","img":"https://cdn.myanimelist.net/images/anime/1958/105099.webp"},{"title":"Kizuna","synopsis":"Ranmaru and Kei have a strong and passionate relationship built on years of trust, sacrifice and love. But when the mysterious son of a Yakuza boss begins to pursue Ranmaru's affection, tempers flare, and hidden emotions rise to the surface. Will Ranmaru and Kei's love survive, or will the emotional conflict finally come to a head?\n\n(Source: Be Beautiful)","img":"https://cdn.myanimelist.net/images/anime/10/8172.webp"},{"title":"Pico: My Little Summer Story","synopsis":"An edited version of the first OVA titled pico~ Boku no Chiisana Natsu Monogatari (pico: My Little Summer Story) was released on November 11, 2007. It is a re-edited version of the animation seen in the Boku no Pico OVA set to a new script, featuring content that is more appropriate for viewers under the age of 18. \n\n(Source: nekoshota.com)","img":"https://cdn.myanimelist.net/images/anime/9/14929.webp"},{"title":"Bronze: Zetsuai Since 1989","synopsis":"Famous rockstar Kouji Nanjou has fallen in love with Izumi Takuto, a soccer player with dreams of seeing \"real\" soccer in Italy. In angsty boy-love fashion, the story consists of Kouji stopping at nothing to have Izumi stay with him, Izumi dealing with his feelings until the time comes where he has no choice but to decide, and all the other things the two must face and the problems from Kouji's family.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/5/73227.webp"},{"title":"Natsuyasumi.","synopsis":"Yuu and Natsuki met in the hot sun, during that unforgettable summer vacation... Was it a dream, or...? It was a bittersweet love story?\n\n(Source: AniDB)","img":"https://cdn.myanimelist.net/images/anime/2/46637.webp"},{"title":"Yebisu Celebrities 1st","synopsis":"When Haruka Fujinami starts his job at Yebisu Graphics he takes an immediate dislike to his tyrannical boss, Mr. Daijou. Haruka is given the most menial tasks imaginable and is subjected to Daijou's verbal abuses as well, but oddly enough, he learns that his attraction to his boss grows with each new humiliation. Will Haruka finally stand up to Daijou and assert himself, or will he completely surrender his body and soul to the tall, dark stranger?","img":"https://cdn.myanimelist.net/images/anime/4/83051.webp"},{"title":"Fujimi 2-choume Koukyougakudan","synopsis":"High school music teacher, Morimura Yuuki, is the concert master and first violinist of the amateur orchestra, Fujimi Orchestra. Surprisingly, a young conductor named Tonoin Kei (known as a musical genius) joins this small orchestra to conduct. Even though Tonoin is a strict conductor, all the members adore him for the notable improvements in their performances and soon Yuuki feels his efforts for the orchestra have been fruitless. Yuuki soon comes to the conclusion that his crush of 3 years likes Tonoin, and he decides to give up on her and leave the orchestra. Tonoin refuses to let him quit, confessing that he loves Yuuki, which reveals that he's gay. Tonoin's love confession confuses Yuuki and it leads to a very horrible misunderstanding.\n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/1/2411.webp"},{"title":"Ginga Teikoku no Metsubou Gaiden: Aoki Ookami-tachi no Densetsu","synopsis":" In 2199 A.D. overpopulation has forced the human kind to adapt in other planets. For almost 100 years the human race has thrived and lived happily in their new home. However everything ended the day humans took over Pluto; to the humans unfortunately fate a new race was discovered known as the apocalypse, a creature that uses the human brain as its source of knowledge and energy for their own mechanical bodies. Now the humans must fight in order to survive. As a last resort the humans send off trained soldiers in order to reestablish Pluto and get rid of this new threat to mankind. At the base lieutenant Jonathan Tyberius and Leonard Schteinberg the main characters fall in love after many tragic events, however the two new lovers were forced to go on their own separate ways because of the dreadful war… \n\n(Source: ANN)","img":"https://cdn.myanimelist.net/images/anime/6/26018.webp"},{"title":"Otokonoko ♂ Delivery","synopsis":"Shuuji finds out his classmate takes on a job as a crossdresser and gets interested in joining him.","img":"https://cdn.myanimelist.net/images/anime/10/83613.webp"},{"title":"Hyakujitsu no Bara: Jinginaki Nikukyuu-hen","synopsis":"Specials included in the OVA of Hyakujitsu no Bara.","img":"https://cdn.myanimelist.net/images/anime/9/83180.webp"},{"title":"Kizuna: Koi no kara Sawagi","synopsis":"Enjouji and Ranmaru are a mostly-happy couple, but when Ranmaru finds lipstick on Enjouji, he becomes suspicious and leaves in a huff. Enjouji follows Ranmaru throughout the day. As they do so, the two men think about their past and their uncertain future. \n","img":"https://cdn.myanimelist.net/images/anime/5/72912.webp"},{"title":"Fuyu no Semi Special","synopsis":"Summary of the Fuyu no Semi OVA with revised animation and some extra scenes.","img":"https://cdn.myanimelist.net/images/anime/9/27755.webp"},{"title":"Okane ga Nai Specials","synopsis":"Short specials included with the DVD's of Okane ga Nai series.","img":"https://cdn.myanimelist.net/images/anime/3/72624.webp"},{"title":"Dounika Naru Hibi","synopsis":"A collection of short stories that take a refreshing and humorous look at the sexual relationships between young people in Japan.\n\n(Source: Kotonoha)","img":"https://cdn.myanimelist.net/images/anime/1924/106583.webp"},{"title":"Saezuru Tori wa Habatakanai: The Storm Breaks","synopsis":"Second movie of Saezuru Tori wa Habatakanai.","img":"https://cdn.myanimelist.net/images/anime/1941/106062.webp"},{"title":"Kyojinzoku no Hanayome","synopsis":"\"If you're a giant and a dwarf, you might be pregnant with men?\"\n\nOne day, Kouichi, a boy's school student, is summoned to another world while masturbating. It's a giant's country where a much larger race lives. The first prince of the country, Kaius, who appears in front of him, enthusiastically stared at Kouichi and proposed, \"I want you to be my bride and give birth to my baby\" ...!?\n\n(Source: MAL News)","img":"https://cdn.myanimelist.net/images/anime/1947/106517.webp"},{"title":"Marudase Kintarou","synopsis":"Makoto's grandfather was the principal of the great Onodera Academy, and when he passed away, he left Makoto and his school staff with one very important will - \"The one man who is able to seduce Makoto with his superb sexual techniques will be given the right to take over as Onodera Academy's new principal!\" Because of this ridiculous last request, Makoto is now every faculty member's target for sexual harassment! Desperate to protect his virginity, Makoto seeks help from his childhood friend (and the man who he has always loved), Kintaro.\n\n(Source: DMP)","img":"https://cdn.myanimelist.net/images/anime/1935/104704.webp"}]